{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {7} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Solara Sugarbeet relative to GeoNuts?",
            "A": "Solara Sugarbeet is {below} GeoNuts in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Solara Sugarbeet relative to Terran Spice Mix?",
            "A": "Solara Sugarbeet is {above} Terran Spice Mix in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing AquaBeans relative to Terran Spice Mix?",
            "A": "AquaBeans is {above} Terran Spice Mix in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total fertilizer price?",
            "A": "The series with the largest contribution is {Skyberry Pulp}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total fertilizer price?",
            "A": "The series with the smallest contribution is {Terran Spice Mix}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Lumina Grain's maximum Fertilizer Price in the streamgraph?",
            "A": "Lumina Grain's maximum Fertilizer Price is in {1980}."
        },
        {
            "Q": "Which year is AquaBeans's minimum Fertilizer Price in the streamgraph?",
            "A": "AquaBeans's minimum Fertilizer Price is in {1968}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Was the total Fertilizer Price in 1970 higher or lower than in 1971?",
            "A": "The total fertilizer price in 1970 was {lower} than in 1971."
        },
        {
            "Q": "Between 1968 and 1985, did the total Fertilizer Price experience a larger or smaller change than between 1972 and 1973?",
            "A": "The change in total fertilizer price between 1968 and 1985 was {larger} than between 1972 and 1973."
        },
        {
            "Q": "Between 1968 and 1971, was the average total Fertilizer Price higher or lower than between 1980 and 1985?",
            "A": "The average total fertilizer price between 1968 and 1971 was {lower} than between 1980 and 1985."
        },
        {
            "Q": "Between 1984 and 1985, was the average total Fertilizer Price higher or lower than between 1980 and 1982?",
            "A": "The average total fertilizer price between 1984 and 1985 was {higher} than between 1980 and 1982."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Skyberry Pulp} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Zephyr Cotton and Lumina Grain first exchange dominant positions?",
            "A": "Zephyr Cotton and Lumina Grain first exchanged leading positions in {1967}."
        }
    ],
    "VA": []
}