{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Aegis Corp relative to Apex Systems?",
            "A": "Aegis Corp is {above} Apex Systems in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Aegis Corp relative to Starlight Innovations?",
            "A": "Aegis Corp is {below} Starlight Innovations in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Apex Systems relative to Aegis Corp?",
            "A": "Apex Systems is {below} Aegis Corp in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total market share?",
            "A": "The series with the largest contribution is {Aegis Corp}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total market share?",
            "A": "The series with the smallest contribution is {Apex Systems}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Starlight Innovations's minimum Market Share in the streamgraph?",
            "A": "Starlight Innovations's minimum Market Share is in {1981}."
        },
        {
            "Q": "Which year is Starlight Innovations's maximum Market Share in the streamgraph?",
            "A": "Starlight Innovations's maximum Market Share is in {1966}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1968 and 1972, did the total Market Share experience a larger or smaller change than between 1982 and 1985?",
            "A": "The change in total market share between 1968 and 1972 was {smaller} than between 1982 and 1985."
        },
        {
            "Q": "Between 1967 and 1982, did the total Market Share experience a larger or smaller change than between 1986 and 1987?",
            "A": "The change in total market share between 1967 and 1982 was {larger} than between 1986 and 1987."
        },
        {
            "Q": "Between 1985 and 1986, was the average total Market Share higher or lower than between 1969 and 1970?",
            "A": "The average total market share between 1985 and 1986 was {lower} than between 1969 and 1970."
        },
        {
            "Q": "Between 1976 and 1985, did the total Market Share experience a larger or smaller change than between 1981 and 1984?",
            "A": "The change in total market share between 1976 and 1985 was {larger} than between 1981 and 1984."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Aegis Corp} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Apex Systems and Starlight Innovations first exchange dominant positions?",
            "A": "Apex Systems and Starlight Innovations first exchanged leading positions in {1967}."
        }
    ],
    "VA": []
}