{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {4} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Aura Fine Arts relative to Ironwood Gallery?",
            "A": "Aura Fine Arts is {below} Ironwood Gallery in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Ironwood Gallery relative to The Gilded Frame?",
            "A": "Ironwood Gallery is {below} The Gilded Frame in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Ironwood Gallery relative to Zenith Sculpture Garden?",
            "A": "Ironwood Gallery is {above} Zenith Sculpture Garden in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total art gallery visitors?",
            "A": "The series with the largest contribution is {Ironwood Gallery}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total art gallery visitors?",
            "A": "The series with the smallest contribution is {Zenith Sculpture Garden}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Zenith Sculpture Garden's minimum Art Gallery Visitors in the streamgraph?",
            "A": "Zenith Sculpture Garden's minimum Art Gallery Visitors is in {1983}."
        },
        {
            "Q": "Which year is Ironwood Gallery's maximum Art Gallery Visitors in the streamgraph?",
            "A": "Ironwood Gallery's maximum Art Gallery Visitors is in {1995}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1994 and 1996, did the total Art Gallery Visitors experience a larger or smaller change than between 1972 and 1978?",
            "A": "The change in total art gallery visitors between 1994 and 1996 was {smaller} than between 1972 and 1978."
        },
        {
            "Q": "Between 1971 and 1991, did the total Art Gallery Visitors experience a larger or smaller change than between 1986 and 1990?",
            "A": "The change in total art gallery visitors between 1971 and 1991 was {larger} than between 1986 and 1990."
        },
        {
            "Q": "Was the total Art Gallery Visitors in 1992 higher or lower than in 1995?",
            "A": "The total art gallery visitors in 1992 was {lower} than in 1995."
        },
        {
            "Q": "Between 1982 and 1993, did the total Art Gallery Visitors experience a larger or smaller change than between 1971 and 1986?",
            "A": "The change in total art gallery visitors between 1982 and 1993 was {smaller} than between 1971 and 1986."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Ironwood Gallery} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did The Gilded Frame and Ironwood Gallery first exchange dominant positions?",
            "A": "The Gilded Frame and Ironwood Gallery first exchanged leading positions in {1969}."
        }
    ],
    "VA": []
}