{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {7} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Silverhaven Polytechnic relative to Celestial College?",
            "A": "Silverhaven Polytechnic is {below} Celestial College in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Zenith Institute of Technology relative to Borealis Graduate School?",
            "A": "Zenith Institute of Technology is {below} Borealis Graduate School in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Arcane University relative to Aethelgard School of Arts?",
            "A": "Arcane University is {below} Aethelgard School of Arts in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total student-teacher ratio?",
            "A": "The series with the largest contribution is {Silverhaven Polytechnic}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total student-teacher ratio?",
            "A": "The series with the smallest contribution is {Zenith Institute of Technology}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Borealis Graduate School's maximum Student-Teacher Ratio in the streamgraph?",
            "A": "Borealis Graduate School's maximum Student-Teacher Ratio is in {1950}."
        },
        {
            "Q": "Which year is Silverhaven Polytechnic's maximum Student-Teacher Ratio in the streamgraph?",
            "A": "Silverhaven Polytechnic's maximum Student-Teacher Ratio is in {1969}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Was the total Student-Teacher Ratio in 1957 higher or lower than in 1969?",
            "A": "The total student-teacher ratio in 1957 was {lower} than in 1969."
        },
        {
            "Q": "Between 1952 and 1958, did the total Student-Teacher Ratio experience a larger or smaller change than between 1951 and 1953?",
            "A": "The change in total student-teacher ratio between 1952 and 1958 was {smaller} than between 1951 and 1953."
        },
        {
            "Q": "Was the total Student-Teacher Ratio in 1963 higher or lower than in 1967?",
            "A": "The total student-teacher ratio in 1963 was {lower} than in 1967."
        },
        {
            "Q": "Between 1962 and 1969, did the total Student-Teacher Ratio experience a larger or smaller change than between 1967 and 1968?",
            "A": "The change in total student-teacher ratio between 1962 and 1969 was {larger} than between 1967 and 1968."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Silverhaven Polytechnic} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Aethelgard School of Arts and Silverhaven Polytechnic first exchange dominant positions?",
            "A": "Aethelgard School of Arts and Silverhaven Polytechnic first exchanged leading positions in {1951}."
        }
    ],
    "VA": []
}