{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {4} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Meridian Academy Patrons relative to Silverhaven Polytechnic Fund?",
            "A": "Meridian Academy Patrons is {below} Silverhaven Polytechnic Fund in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Aethelgard Arts Circle relative to Celestial College Graduates?",
            "A": "Aethelgard Arts Circle is {above} Celestial College Graduates in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Celestial College Graduates relative to Silverhaven Polytechnic Fund?",
            "A": "Celestial College Graduates is {above} Silverhaven Polytechnic Fund in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total alumni giving rate?",
            "A": "The series with the largest contribution is {Silverhaven Polytechnic Fund}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total alumni giving rate?",
            "A": "The series with the smallest contribution is {Celestial College Graduates}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Celestial College Graduates's minimum Alumni Giving Rate in the streamgraph?",
            "A": "Celestial College Graduates's minimum Alumni Giving Rate is in {2022}."
        },
        {
            "Q": "Which year is Aethelgard Arts Circle's maximum Alumni Giving Rate in the streamgraph?",
            "A": "Aethelgard Arts Circle's maximum Alumni Giving Rate is in {2022}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 2005 and 2014, did the total Alumni Giving Rate experience a larger or smaller change than between 2005 and 2016?",
            "A": "The change in total alumni giving rate between 2005 and 2014 was {smaller} than between 2005 and 2016."
        },
        {
            "Q": "Between 2010 and 2017, was the average total Alumni Giving Rate higher or lower than between 2012 and 2023?",
            "A": "The average total alumni giving rate between 2010 and 2017 was {lower} than between 2012 and 2023."
        },
        {
            "Q": "Between 2005 and 2014, was the average total Alumni Giving Rate higher or lower than between 2005 and 2018?",
            "A": "The average total alumni giving rate between 2005 and 2014 was {lower} than between 2005 and 2018."
        },
        {
            "Q": "Between 2005 and 2017, did the total Alumni Giving Rate experience a larger or smaller change than between 2010 and 2012?",
            "A": "The change in total alumni giving rate between 2005 and 2017 was {larger} than between 2010 and 2012."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Silverhaven Polytechnic Fund} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Aethelgard Arts Circle and Celestial College Graduates first exchange dominant positions?",
            "A": "Aethelgard Arts Circle and Celestial College Graduates did not exchange leading positions."
        }
    ],
    "VA": []
}