{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {4} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Aethelgard Art Library relative to Zenith Tech Library?",
            "A": "Aethelgard Art Library is {below} Zenith Tech Library in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Zenith Tech Library relative to Borealis Research Hub?",
            "A": "Zenith Tech Library is {below} Borealis Research Hub in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Arcane University Library relative to Aethelgard Art Library?",
            "A": "Arcane University Library is {above} Aethelgard Art Library in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total library visits?",
            "A": "The series with the largest contribution is {Aethelgard Art Library}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total library visits?",
            "A": "The series with the smallest contribution is {Borealis Research Hub}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Aethelgard Art Library's minimum Library Visits in the streamgraph?",
            "A": "Aethelgard Art Library's minimum Library Visits is in {1958}."
        },
        {
            "Q": "Which year is Aethelgard Art Library's maximum Library Visits in the streamgraph?",
            "A": "Aethelgard Art Library's maximum Library Visits is in {1976}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Was the total Library Visits in 1965 higher or lower than in 1970?",
            "A": "The total library visits in 1965 was {lower} than in 1970."
        },
        {
            "Q": "Was the total Library Visits in 1971 higher or lower than in 1975?",
            "A": "The total library visits in 1971 was {higher} than in 1975."
        },
        {
            "Q": "Was the total Library Visits in 1968 higher or lower than in 1976?",
            "A": "The total library visits in 1968 was {lower} than in 1976."
        },
        {
            "Q": "Between 1961 and 1970, did the total Library Visits experience a larger or smaller change than between 1963 and 1973?",
            "A": "The change in total library visits between 1961 and 1970 was {smaller} than between 1963 and 1973."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Aethelgard Art Library} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Aethelgard Art Library and Borealis Research Hub first exchange dominant positions?",
            "A": "Aethelgard Art Library and Borealis Research Hub first exchanged leading positions in {1959}."
        }
    ],
    "VA": []
}