{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {2} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Aethelgard Power Grid relative to Meridian Energy Network?",
            "A": "Aethelgard Power Grid is {below} Meridian Energy Network in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Meridian Energy Network relative to Aethelgard Power Grid?",
            "A": "Meridian Energy Network is {above} Aethelgard Power Grid in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total electricity demand?",
            "A": "The series with the largest contribution is {Meridian Energy Network}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total electricity demand?",
            "A": "The series with the smallest contribution is {Aethelgard Power Grid}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Meridian Energy Network's minimum Electricity Demand in the streamgraph?",
            "A": "Meridian Energy Network's minimum Electricity Demand is in {2009}."
        },
        {
            "Q": "Which year is Aethelgard Power Grid's minimum Electricity Demand in the streamgraph?",
            "A": "Aethelgard Power Grid's minimum Electricity Demand is in {2021}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 2012 and 2016, was the average total Electricity Demand higher or lower than between 2004 and 2014?",
            "A": "The average total electricity demand between 2012 and 2016 was {lower} than between 2004 and 2014."
        },
        {
            "Q": "Between 2012 and 2014, did the total Electricity Demand experience a larger or smaller change than between 2008 and 2018?",
            "A": "The change in total electricity demand between 2012 and 2014 was {smaller} than between 2008 and 2018."
        },
        {
            "Q": "Between 2009 and 2015, was the average total Electricity Demand higher or lower than between 2004 and 2018?",
            "A": "The average total electricity demand between 2009 and 2015 was {lower} than between 2004 and 2018."
        },
        {
            "Q": "Between 2017 and 2021, was the average total Electricity Demand higher or lower than between 2008 and 2016?",
            "A": "The average total electricity demand between 2017 and 2021 was {lower} than between 2008 and 2016."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Meridian Energy Network} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Aethelgard Power Grid and Meridian Energy Network first exchange dominant positions?",
            "A": "Aethelgard Power Grid and Meridian Energy Network did not exchange leading positions."
        }
    ],
    "VA": []
}