{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Emerald Diner relative to The Rusty Kettle?",
            "A": "Emerald Diner is {above} The Rusty Kettle in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Sky High Cafe relative to Emerald Diner?",
            "A": "Sky High Cafe is {above} Emerald Diner in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing The Rusty Kettle relative to Sky High Cafe?",
            "A": "The Rusty Kettle is {below} Sky High Cafe in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total table turnover rate?",
            "A": "The series with the largest contribution is {Emerald Diner}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total table turnover rate?",
            "A": "The series with the smallest contribution is {The Rusty Kettle}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is The Rusty Kettle's minimum Table Turnover Rate in the streamgraph?",
            "A": "The Rusty Kettle's minimum Table Turnover Rate is in {1993}."
        },
        {
            "Q": "Which year is The Rusty Kettle's maximum Table Turnover Rate in the streamgraph?",
            "A": "The Rusty Kettle's maximum Table Turnover Rate is in {2000}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1992 and 1993, did the total Table Turnover Rate experience a larger or smaller change than between 1998 and 2000?",
            "A": "The change in total table turnover rate between 1992 and 1993 was {smaller} than between 1998 and 2000."
        },
        {
            "Q": "Between 1997 and 1998, did the total Table Turnover Rate experience a larger or smaller change than between 1992 and 2000?",
            "A": "The change in total table turnover rate between 1997 and 1998 was {smaller} than between 1992 and 2000."
        },
        {
            "Q": "Between 1994 and 1997, was the average total Table Turnover Rate higher or lower than between 1995 and 1999?",
            "A": "The average total table turnover rate between 1994 and 1997 was {lower} than between 1995 and 1999."
        },
        {
            "Q": "Was the total Table Turnover Rate in 1992 higher or lower than in 2000?",
            "A": "The total table turnover rate in 1992 was {lower} than in 2000."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Emerald Diner} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Emerald Diner and The Rusty Kettle first exchange dominant positions?",
            "A": "Emerald Diner and The Rusty Kettle first exchanged leading positions in {1992}."
        }
    ],
    "VA": []
}