{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {7} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Sector Beta relative to Stellar City Core?",
            "A": "Sector Beta is {above} Stellar City Core in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Sector Beta relative to District Alpha?",
            "A": "Sector Beta is {below} District Alpha in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Azure Enclave relative to Verdant Ward?",
            "A": "Azure Enclave is {above} Verdant Ward in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total vaccination rate?",
            "A": "The series with the largest contribution is {Verdant Ward}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total vaccination rate?",
            "A": "The series with the smallest contribution is {Outer Rim Settlements}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Outer Rim Settlements's minimum Vaccination Rate in the streamgraph?",
            "A": "Outer Rim Settlements's minimum Vaccination Rate is in {1999}."
        },
        {
            "Q": "Which year is Crimson Quarter's minimum Vaccination Rate in the streamgraph?",
            "A": "Crimson Quarter's minimum Vaccination Rate is in {1987}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Was the total Vaccination Rate in 1986 higher or lower than in 1994?",
            "A": "The total vaccination rate in 1986 was {lower} than in 1994."
        },
        {
            "Q": "Was the total Vaccination Rate in 1988 higher or lower than in 1992?",
            "A": "The total vaccination rate in 1988 was {lower} than in 1992."
        },
        {
            "Q": "Between 1990 and 1993, was the average total Vaccination Rate higher or lower than between 1986 and 1998?",
            "A": "The average total vaccination rate between 1990 and 1993 was {higher} than between 1986 and 1998."
        },
        {
            "Q": "Between 1988 and 1995, did the total Vaccination Rate experience a larger or smaller change than between 1990 and 1993?",
            "A": "The change in total vaccination rate between 1988 and 1995 was {larger} than between 1990 and 1993."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Crimson Quarter} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Outer Rim Settlements and Stellar City Core first exchange dominant positions?",
            "A": "Outer Rim Settlements and Stellar City Core first exchanged leading positions in {1989}."
        }
    ],
    "VA": []
}