{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {2} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Sector Beta relative to District Alpha?",
            "A": "Sector Beta is {below} District Alpha in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing District Alpha relative to Sector Beta?",
            "A": "District Alpha is {above} Sector Beta in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total life expectancy?",
            "A": "The series with the largest contribution is {District Alpha}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total life expectancy?",
            "A": "The series with the smallest contribution is {Sector Beta}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is District Alpha's minimum Life Expectancy in the streamgraph?",
            "A": "District Alpha's minimum Life Expectancy is in {2015}."
        },
        {
            "Q": "Which year is Sector Beta's maximum Life Expectancy in the streamgraph?",
            "A": "Sector Beta's maximum Life Expectancy is in {2022}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 2015 and 2016, was the average total Life Expectancy higher or lower than between 2013 and 2019?",
            "A": "The average total life expectancy between 2015 and 2016 was {higher} than between 2013 and 2019."
        },
        {
            "Q": "Between 2018 and 2020, did the total Life Expectancy experience a larger or smaller change than between 2017 and 2022?",
            "A": "The change in total life expectancy between 2018 and 2020 was {larger} than between 2017 and 2022."
        },
        {
            "Q": "Was the total Life Expectancy in 2016 higher or lower than in 2022?",
            "A": "The total life expectancy in 2016 was {lower} than in 2022."
        },
        {
            "Q": "Was the total Life Expectancy in 2013 higher or lower than in 2019?",
            "A": "The total life expectancy in 2013 was {higher} than in 2019."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Sector Beta} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Sector Beta and District Alpha first exchange dominant positions?",
            "A": "Sector Beta and District Alpha first exchanged leading positions in {2019}."
        }
    ],
    "VA": []
}