{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {6} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Aether Market relative to Echo Trade?",
            "A": "Aether Market is {above} Echo Trade in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Crimson Bazaar relative to Starfall Mart?",
            "A": "Crimson Bazaar is {above} Starfall Mart in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Ironwood Market relative to Starfall Mart?",
            "A": "Ironwood Market is {above} Starfall Mart in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total home sales?",
            "A": "The series with the largest contribution is {Echo Trade}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total home sales?",
            "A": "The series with the smallest contribution is {Starfall Mart}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Crimson Bazaar's maximum Home Sales in the streamgraph?",
            "A": "Crimson Bazaar's maximum Home Sales is in {2002}."
        },
        {
            "Q": "Which year is Echo Trade's minimum Home Sales in the streamgraph?",
            "A": "Echo Trade's minimum Home Sales is in {1974}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1984 and 1986, did the total Home Sales experience a larger or smaller change than between 1991 and 2001?",
            "A": "The change in total home sales between 1984 and 1986 was {smaller} than between 1991 and 2001."
        },
        {
            "Q": "Between 1985 and 1987, did the total Home Sales experience a larger or smaller change than between 1974 and 1981?",
            "A": "The change in total home sales between 1985 and 1987 was {smaller} than between 1974 and 1981."
        },
        {
            "Q": "Between 1979 and 1985, did the total Home Sales experience a larger or smaller change than between 1981 and 1983?",
            "A": "The change in total home sales between 1979 and 1985 was {larger} than between 1981 and 1983."
        },
        {
            "Q": "Between 1985 and 2000, was the average total Home Sales higher or lower than between 1981 and 1982?",
            "A": "The average total home sales between 1985 and 2000 was {higher} than between 1981 and 1982."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Echo Trade} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Echo Trade and Starfall Mart first exchange dominant positions?",
            "A": "Echo Trade and Starfall Mart did not exchange leading positions."
        }
    ],
    "VA": []
}