{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {7} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing International Customers relative to Urban Shoppers?",
            "A": "International Customers is {below} Urban Shoppers in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Subscription Members relative to Urban Shoppers?",
            "A": "Subscription Members is {above} Urban Shoppers in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Urban Shoppers relative to Luxury Consumers?",
            "A": "Urban Shoppers is {below} Luxury Consumers in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total online sales volume?",
            "A": "The series with the largest contribution is {International Customers}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total online sales volume?",
            "A": "The series with the smallest contribution is {Urban Shoppers}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Urban Shoppers's maximum Online Sales Volume in the streamgraph?",
            "A": "Urban Shoppers's maximum Online Sales Volume is in {1984}."
        },
        {
            "Q": "Which year is Subscription Members's maximum Online Sales Volume in the streamgraph?",
            "A": "Subscription Members's maximum Online Sales Volume is in {1983}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Was the total Online Sales Volume in 1985 higher or lower than in 1991?",
            "A": "The total online sales volume in 1985 was {higher} than in 1991."
        },
        {
            "Q": "Between 1985 and 1987, was the average total Online Sales Volume higher or lower than between 1987 and 1991?",
            "A": "The average total online sales volume between 1985 and 1987 was {higher} than between 1987 and 1991."
        },
        {
            "Q": "Between 1984 and 1989, was the average total Online Sales Volume higher or lower than between 1986 and 1988?",
            "A": "The average total online sales volume between 1984 and 1989 was {higher} than between 1986 and 1988."
        },
        {
            "Q": "Between 1988 and 1993, was the average total Online Sales Volume higher or lower than between 1987 and 1989?",
            "A": "The average total online sales volume between 1988 and 1993 was {lower} than between 1987 and 1989."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{International Customers} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did International Customers and Urban Shoppers first exchange dominant positions?",
            "A": "International Customers and Urban Shoppers first exchanged leading positions in {1984}."
        }
    ],
    "VA": []
}