{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {5} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Echo Dynamics relative to Crimson Group?",
            "A": "Echo Dynamics is {below} Crimson Group in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Luminara Solutions relative to Oracle Systems?",
            "A": "Luminara Solutions is {above} Oracle Systems in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Echo Dynamics relative to Aether Corp?",
            "A": "Echo Dynamics is {below} Aether Corp in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total patent applications?",
            "A": "The series with the largest contribution is {Aether Corp}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total patent applications?",
            "A": "The series with the smallest contribution is {Crimson Group}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Luminara Solutions's minimum Patent Applications in the streamgraph?",
            "A": "Luminara Solutions's minimum Patent Applications is in {2014}."
        },
        {
            "Q": "Which year is Echo Dynamics's maximum Patent Applications in the streamgraph?",
            "A": "Echo Dynamics's maximum Patent Applications is in {2004}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 2005 and 2009, was the average total Patent Applications higher or lower than between 2004 and 2018?",
            "A": "The average total patent applications between 2005 and 2009 was {lower} than between 2004 and 2018."
        },
        {
            "Q": "Between 2010 and 2013, was the average total Patent Applications higher or lower than between 2004 and 2006?",
            "A": "The average total patent applications between 2010 and 2013 was {lower} than between 2004 and 2006."
        },
        {
            "Q": "Between 2007 and 2015, did the total Patent Applications experience a larger or smaller change than between 2006 and 2007?",
            "A": "The change in total patent applications between 2007 and 2015 was {larger} than between 2006 and 2007."
        },
        {
            "Q": "Between 2004 and 2008, did the total Patent Applications experience a larger or smaller change than between 2009 and 2012?",
            "A": "The change in total patent applications between 2004 and 2008 was {smaller} than between 2009 and 2012."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Aether Corp} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Oracle Systems and Aether Corp first exchange dominant positions?",
            "A": "Oracle Systems and Aether Corp first exchanged leading positions in {2006}."
        }
    ],
    "VA": []
}