{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {2} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Starburst College relative to Luminara Academy?",
            "A": "Starburst College is {below} Luminara Academy in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Luminara Academy relative to Starburst College?",
            "A": "Luminara Academy is {above} Starburst College in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total publication count?",
            "A": "The series with the largest contribution is {Luminara Academy}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total publication count?",
            "A": "The series with the smallest contribution is {Starburst College}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Starburst College's minimum Publication Count in the streamgraph?",
            "A": "Starburst College's minimum Publication Count is in {1990}."
        },
        {
            "Q": "Which year is Starburst College's maximum Publication Count in the streamgraph?",
            "A": "Starburst College's maximum Publication Count is in {1966}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1980 and 1983, was the average total Publication Count higher or lower than between 1976 and 1988?",
            "A": "The average total publication count between 1980 and 1983 was {higher} than between 1976 and 1988."
        },
        {
            "Q": "Between 1989 and 1990, did the total Publication Count experience a larger or smaller change than between 1988 and 1993?",
            "A": "The change in total publication count between 1989 and 1990 was {larger} than between 1988 and 1993."
        },
        {
            "Q": "Between 1975 and 1988, was the average total Publication Count higher or lower than between 1968 and 1971?",
            "A": "The average total publication count between 1975 and 1988 was {lower} than between 1968 and 1971."
        },
        {
            "Q": "Between 1976 and 1985, did the total Publication Count experience a larger or smaller change than between 1973 and 1983?",
            "A": "The change in total publication count between 1976 and 1985 was {larger} than between 1973 and 1983."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Luminara Academy} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Starburst College and Luminara Academy first exchange dominant positions?",
            "A": "Starburst College and Luminara Academy did not exchange leading positions."
        }
    ],
    "VA": []
}