{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {6} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Echo Dynamics relative to Crimson Group?",
            "A": "Echo Dynamics is {above} Crimson Group in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Starburst Enterprises relative to Oracle Systems?",
            "A": "Starburst Enterprises is {below} Oracle Systems in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Echo Dynamics relative to Luminara Solutions?",
            "A": "Echo Dynamics is {below} Luminara Solutions in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total patent applications?",
            "A": "The series with the largest contribution is {Crimson Group}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total patent applications?",
            "A": "The series with the smallest contribution is {Starburst Enterprises}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Luminara Solutions's minimum Patent Applications in the streamgraph?",
            "A": "Luminara Solutions's minimum Patent Applications is in {1974}."
        },
        {
            "Q": "Which year is Echo Dynamics's maximum Patent Applications in the streamgraph?",
            "A": "Echo Dynamics's maximum Patent Applications is in {1972}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1979 and 1982, was the average total Patent Applications higher or lower than between 1985 and 1990?",
            "A": "The average total patent applications between 1979 and 1982 was {lower} than between 1985 and 1990."
        },
        {
            "Q": "Was the total Patent Applications in 1972 higher or lower than in 1977?",
            "A": "The total patent applications in 1972 was {lower} than in 1977."
        },
        {
            "Q": "Between 1975 and 1982, did the total Patent Applications experience a larger or smaller change than between 1979 and 1992?",
            "A": "The change in total patent applications between 1975 and 1982 was {smaller} than between 1979 and 1992."
        },
        {
            "Q": "Between 1982 and 1984, was the average total Patent Applications higher or lower than between 1973 and 1993?",
            "A": "The average total patent applications between 1982 and 1984 was {lower} than between 1973 and 1993."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Crimson Group} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Echo Dynamics and Crimson Group first exchange dominant positions?",
            "A": "Echo Dynamics and Crimson Group first exchanged leading positions in {1973}."
        }
    ],
    "VA": []
}