{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Nova Industries relative to Crimson Group?",
            "A": "Nova Industries is {above} Crimson Group in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Oracle Systems relative to Nova Industries?",
            "A": "Oracle Systems is {below} Nova Industries in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Oracle Systems relative to Crimson Group?",
            "A": "Oracle Systems is {above} Crimson Group in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total patent applications?",
            "A": "The series with the largest contribution is {Nova Industries}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total patent applications?",
            "A": "The series with the smallest contribution is {Oracle Systems}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Oracle Systems's minimum Patent Applications in the streamgraph?",
            "A": "Oracle Systems's minimum Patent Applications is in {2019}."
        },
        {
            "Q": "Which year is Nova Industries's maximum Patent Applications in the streamgraph?",
            "A": "Nova Industries's maximum Patent Applications is in {2021}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Was the total Patent Applications in 2009 higher or lower than in 2014?",
            "A": "The total patent applications in 2009 was {lower} than in 2014."
        },
        {
            "Q": "Between 2013 and 2016, was the average total Patent Applications higher or lower than between 1999 and 2002?",
            "A": "The average total patent applications between 2013 and 2016 was {higher} than between 1999 and 2002."
        },
        {
            "Q": "Was the total Patent Applications in 2008 higher or lower than in 2019?",
            "A": "The total patent applications in 2008 was {lower} than in 2019."
        },
        {
            "Q": "Between 2008 and 2014, was the average total Patent Applications higher or lower than between 1999 and 2005?",
            "A": "The average total patent applications between 2008 and 2014 was {higher} than between 1999 and 2005."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Nova Industries} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Crimson Group and Oracle Systems first exchange dominant positions?",
            "A": "Crimson Group and Oracle Systems first exchanged leading positions in {2000}."
        }
    ],
    "VA": []
}