{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {6} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing NovaStream relative to Luminara?",
            "A": "NovaStream is {below} Luminara in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Starburst Online relative to Luminara?",
            "A": "Starburst Online is {below} Luminara in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing OracleFeed relative to Luminara?",
            "A": "OracleFeed is {below} Luminara in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total ad revenue?",
            "A": "The series with the largest contribution is {Starburst Online}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total ad revenue?",
            "A": "The series with the smallest contribution is {NovaStream}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Starburst Online's maximum Ad Revenue in the streamgraph?",
            "A": "Starburst Online's maximum Ad Revenue is in {2007}."
        },
        {
            "Q": "Which year is EchoWave's maximum Ad Revenue in the streamgraph?",
            "A": "EchoWave's maximum Ad Revenue is in {2007}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1989 and 1995, was the average total Ad Revenue higher or lower than between 1989 and 2003?",
            "A": "The average total ad revenue between 1989 and 1995 was {lower} than between 1989 and 2003."
        },
        {
            "Q": "Was the total Ad Revenue in 1989 higher or lower than in 2007?",
            "A": "The total ad revenue in 1989 was {lower} than in 2007."
        },
        {
            "Q": "Between 1986 and 1993, was the average total Ad Revenue higher or lower than between 2003 and 2005?",
            "A": "The average total ad revenue between 1986 and 1993 was {lower} than between 2003 and 2005."
        },
        {
            "Q": "Between 1988 and 2002, did the total Ad Revenue experience a larger or smaller change than between 1987 and 2006?",
            "A": "The change in total ad revenue between 1988 and 2002 was {larger} than between 1987 and 2006."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Starburst Online} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did AetherNet and OracleFeed first exchange dominant positions?",
            "A": "AetherNet and OracleFeed first exchanged leading positions in {1987}."
        }
    ],
    "VA": []
}