{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {6} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing City Center Hotels relative to Ski Lodges?",
            "A": "City Center Hotels is {below} Ski Lodges in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Treehouse Retreats relative to Ski Lodges?",
            "A": "Treehouse Retreats is {below} Ski Lodges in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Desert Camps relative to Ski Lodges?",
            "A": "Desert Camps is {below} Ski Lodges in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total average room price?",
            "A": "The series with the largest contribution is {Cruise Ships}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total average room price?",
            "A": "The series with the smallest contribution is {Ski Lodges}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Treehouse Retreats's minimum Average Room Price in the streamgraph?",
            "A": "Treehouse Retreats's minimum Average Room Price is in {1997}."
        },
        {
            "Q": "Which year is Glamping Sites's minimum Average Room Price in the streamgraph?",
            "A": "Glamping Sites's minimum Average Room Price is in {1992}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1992 and 1993, was the average total Average Room Price higher or lower than between 1993 and 1996?",
            "A": "The average total average room price between 1992 and 1993 was {lower} than between 1993 and 1996."
        },
        {
            "Q": "Between 1994 and 1996, was the average total Average Room Price higher or lower than between 2000 and 2002?",
            "A": "The average total average room price between 1994 and 1996 was {lower} than between 2000 and 2002."
        },
        {
            "Q": "Was the total Average Room Price in 1994 higher or lower than in 1995?",
            "A": "The total average room price in 1994 was {lower} than in 1995."
        },
        {
            "Q": "Between 1994 and 2001, did the total Average Room Price experience a larger or smaller change than between 1994 and 2000?",
            "A": "The change in total average room price between 1994 and 2001 was {larger} than between 1994 and 2000."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Cruise Ships} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Treehouse Retreats and City Center Hotels first exchange dominant positions?",
            "A": "Treehouse Retreats and City Center Hotels first exchanged leading positions in {1993}."
        }
    ],
    "VA": []
}