{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {4} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing International Terminals relative to Ferry Services?",
            "A": "International Terminals is {above} Ferry Services in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing High-Speed Trains relative to International Terminals?",
            "A": "High-Speed Trains is {below} International Terminals in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Shared Ride relative to High-Speed Trains?",
            "A": "Shared Ride is {below} High-Speed Trains in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total luggage loss rate?",
            "A": "The series with the largest contribution is {Shared Ride}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total luggage loss rate?",
            "A": "The series with the smallest contribution is {Ferry Services}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Ferry Services's maximum Luggage Loss Rate in the streamgraph?",
            "A": "Ferry Services's maximum Luggage Loss Rate is in {1959}."
        },
        {
            "Q": "Which year is High-Speed Trains's maximum Luggage Loss Rate in the streamgraph?",
            "A": "High-Speed Trains's maximum Luggage Loss Rate is in {1985}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1963 and 1979, was the average total Luggage Loss Rate higher or lower than between 1961 and 1969?",
            "A": "The average total luggage loss rate between 1963 and 1979 was {higher} than between 1961 and 1969."
        },
        {
            "Q": "Was the total Luggage Loss Rate in 1960 higher or lower than in 1969?",
            "A": "The total luggage loss rate in 1960 was {lower} than in 1969."
        },
        {
            "Q": "Was the total Luggage Loss Rate in 1964 higher or lower than in 1970?",
            "A": "The total luggage loss rate in 1964 was {lower} than in 1970."
        },
        {
            "Q": "Between 1964 and 1975, was the average total Luggage Loss Rate higher or lower than between 1959 and 1970?",
            "A": "The average total luggage loss rate between 1964 and 1975 was {higher} than between 1959 and 1970."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Shared Ride} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did International Terminals and High-Speed Trains first exchange dominant positions?",
            "A": "International Terminals and High-Speed Trains first exchanged leading positions in {1963}."
        }
    ],
    "VA": []
}