{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stream chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this stream chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Tariff Negotiations relative to Political Disruptions?",
            "A": "Tariff Negotiations is {below} Political Disruptions in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Political Disruptions relative to Tariff Negotiations?",
            "A": "Political Disruptions is {above} Tariff Negotiations in the vertical direction."
        },
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Customs Clearance relative to Tariff Negotiations?",
            "A": "Customs Clearance is {below} Tariff Negotiations in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total cross-border delays?",
            "A": "The series with the largest contribution is {Political Disruptions}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total cross-border delays?",
            "A": "The series with the smallest contribution is {Tariff Negotiations}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which year is Political Disruptions's maximum Cross-Border Delays in the streamgraph?",
            "A": "Political Disruptions's maximum Cross-Border Delays is in {1955}."
        },
        {
            "Q": "Which year is Customs Clearance's maximum Cross-Border Delays in the streamgraph?",
            "A": "Customs Clearance's maximum Cross-Border Delays is in {1962}."
        }
    ],
    "SC": [],
    "NF": [],
    "NC": [
        {
            "Q": "Between 1961 and 1963, did the total Cross-Border Delays experience a larger or smaller change than between 1959 and 1962?",
            "A": "The change in total cross-border delays between 1961 and 1963 was {smaller} than between 1959 and 1962."
        },
        {
            "Q": "Was the total Cross-Border Delays in 1962 higher or lower than in 1964?",
            "A": "The total cross-border delays in 1962 was {higher} than in 1964."
        },
        {
            "Q": "Between 1957 and 1962, was the average total Cross-Border Delays higher or lower than between 1955 and 1956?",
            "A": "The average total cross-border delays between 1957 and 1962 was {lower} than between 1955 and 1956."
        },
        {
            "Q": "Between 1962 and 1963, did the total Cross-Border Delays experience a larger or smaller change than between 1960 and 1962?",
            "A": "The change in total cross-border delays between 1962 and 1963 was {smaller} than between 1960 and 1962."
        }
    ],
    "MSR": [
        {
            "Q": "In this streamgraph, which one held the dominant position for the longest period of time?",
            "A": "{Political Disruptions} held the dominant position for the longest period of time."
        },
        {
            "Q": "In this streamgraph, in which year did Customs Clearance and Tariff Negotiations first exchange dominant positions?",
            "A": "Customs Clearance and Tariff Negotiations first exchanged leading positions in {1956}."
        }
    ],
    "VA": []
}