{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {64} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {uniform} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Literature and Influence in the heatmap?",
            "A": "The heat value is {0.47}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Music and Popularity in the heatmap?",
            "A": "The heat value is {0.46}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.49}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.44}."
        },
        {
            "Q": "What is the maximum heat value of label Travel on the x-axis?",
            "A": "The maximum heat value of Travel on the x-axis is {0.48}."
        },
        {
            "Q": "What is the maximum heat value of label Art on the x-axis?",
            "A": "The maximum heat value of Art on the x-axis is {0.49}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Localization on the y-axis?",
            "A": "The average heat value for Localization on the y-axis is {0.47}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Social Media and Influence or the cell corresponding to Music and Preservation?",
            "A": "The heat values are {equal}."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Movies and Adoption or the cell corresponding to Travel and Popularity?",
            "A": "The heat values are {equal}."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Movies and Commercialization or the cell corresponding to Music and Localization?",
            "A": "The cell corresponding to {Music} and {Localization} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.48 to 0.49?",
            "A": "The cells are: {(Literature, Adoption), (Art, Commercialization), (Cuisine, Commercialization), (Art, Diversity), (Cuisine, Diversity), (Literature, Diversity), (Music, Diversity), (Travel, Diversity), (Art, Influence), (Travel, Innovation), (Cuisine, Popularity), (Social Media, Popularity), (TV Shows, Popularity), (Cuisine, Preservation)}."
        }
    ],
    "VA": []
}