{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {56} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {7} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {vertical gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Travel and Popularity in the heatmap?",
            "A": "The heat value is {0.86}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Art and Localization in the heatmap?",
            "A": "The heat value is {0.82}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Language and Popularity in the heatmap?",
            "A": "The heat value is {0.88}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.92}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.14}."
        },
        {
            "Q": "What is the maximum heat value of label Language on the x-axis?",
            "A": "The maximum heat value of Language on the x-axis is {0.90}."
        },
        {
            "Q": "What is the maximum heat value of label Art on the x-axis?",
            "A": "The maximum heat value of Art on the x-axis is {0.92}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Music on the x-axis?",
            "A": "The average heat value for Music on the x-axis is {0.52}."
        },
        {
            "Q": "What is the average heat value for label Accessibility on the y-axis?",
            "A": "The average heat value for Accessibility on the y-axis is {0.16}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Travel and Critique or the cell corresponding to Language and Localization?",
            "A": "The cell corresponding to {Language} and {Localization} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Travel and Accessibility or the cell corresponding to Art and Adoption?",
            "A": "The cell corresponding to {Art} and {Adoption} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.50 to 0.75?",
            "A": "The cells are: {(Art, Influence), (Cuisine, Influence), (Language, Influence), (Literature, Influence), (Music, Influence), (TV Shows, Influence), (Travel, Influence)}."
        }
    ],
    "VA": []
}