{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {72} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {radial gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Mathematics and Staff in the heatmap?",
            "A": "The heat value is {0.34}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to History and Faculty in the heatmap?",
            "A": "The heat value is {0.73}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.81}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.11}."
        },
        {
            "Q": "What is the maximum heat value of label Engineering on the x-axis?",
            "A": "The maximum heat value of Engineering on the x-axis is {0.61}."
        },
        {
            "Q": "What is the maximum heat value for label Faculty on the y-axis?",
            "A": "The maximum heat value for Faculty on the y-axis is {0.81}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Researcher on the y-axis?",
            "A": "The average heat value for Researcher on the y-axis is {0.32}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Computer Science and Freshman or the cell corresponding to Biology and Senior?",
            "A": "The cell corresponding to {Computer Science} and {Freshman} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Computer Science and Faculty or the cell corresponding to Physics and Researcher?",
            "A": "The cell corresponding to {Computer Science} and {Faculty} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.54 to 0.57?",
            "A": "The cells are: {(Biology, Faculty), (Chemistry, Faculty)}."
        }
    ],
    "VA": []
}