{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {90} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {uniform} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Engineering and Staff in the heatmap?",
            "A": "The heat value is {0.51}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Geography and PhD in the heatmap?",
            "A": "The heat value is {0.52}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Biology and PhD in the heatmap?",
            "A": "The heat value is {0.52}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Mathematics and Graduate in the heatmap?",
            "A": "The heat value is {0.53}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.54}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.49}."
        },
        {
            "Q": "What is the maximum heat value for label Faculty on the y-axis?",
            "A": "The maximum heat value for Faculty on the y-axis is {0.52}."
        },
        {
            "Q": "What is the maximum heat value for label Graduate on the y-axis?",
            "A": "The maximum heat value for Graduate on the y-axis is {0.53}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label History on the x-axis?",
            "A": "The average heat value for History on the x-axis is {0.51}."
        },
        {
            "Q": "What is the average heat value for label Junior on the y-axis?",
            "A": "The average heat value for Junior on the y-axis is {0.51}."
        },
        {
            "Q": "What is the average heat value for label Postdoc on the y-axis?",
            "A": "The average heat value for Postdoc on the y-axis is {0.51}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Biology and Junior or the cell corresponding to History and Staff?",
            "A": "The heat values are {equal}."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Geography and Graduate or the cell corresponding to Engineering and Researcher?",
            "A": "The cell corresponding to {Geography} and {Graduate} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Geography and Faculty or the cell corresponding to Economics and Junior?",
            "A": "The cell corresponding to {Geography} and {Faculty} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Arts and PhD or the cell corresponding to Arts and Researcher?",
            "A": "The cell corresponding to {Arts} and {PhD} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.51 to 0.53?",
            "A": "The cells are: {(Arts, Admin), (Chemistry, Admin), (Economics, Admin), (Engineering, Admin), (Mathematics, Admin), (Arts, Faculty), (Biology, Faculty), (Chemistry, Faculty), (Economics, Faculty), (Geography, Faculty), (History, Faculty), (Mathematics, Faculty), (Arts, Freshman), (Biology, Freshman), (Chemistry, Freshman), (Economics, Freshman), (Engineering, Freshman), (History, Freshman), (Mathematics, Freshman), (Arts, Graduate), (Biology, Graduate), (Chemistry, Graduate), (Computer Science, Graduate), (Economics, Graduate), (Engineering, Graduate), (Geography, Graduate), (History, Graduate), (Mathematics, Graduate), (Arts, Junior), (Chemistry, Junior), (Computer Science, Junior), (Economics, Junior), (Engineering, Junior), (Geography, Junior), (History, Junior), (Arts, PhD), (Biology, PhD), (Chemistry, PhD), (Computer Science, PhD), (Engineering, PhD), (Geography, PhD), (History, PhD), (Arts, Postdoc), (Computer Science, Postdoc), (Geography, Postdoc), (History, Postdoc), (Arts, Researcher), (Biology, Researcher), (Chemistry, Researcher), (Computer Science, Researcher), (Engineering, Researcher), (History, Researcher), (Mathematics, Researcher), (Arts, Senior), (Biology, Senior), (Chemistry, Senior), (Economics, Senior), (Geography, Senior), (History, Senior), (Mathematics, Senior), (Arts, Staff), (Chemistry, Staff), (Economics, Staff), (Engineering, Staff), (Geography, Staff), (Mathematics, Staff)}."
        }
    ],
    "VA": []
}