{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {49} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {7} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {7} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {radial gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Literature and Sophomore in the heatmap?",
            "A": "The heat value is {0.54}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Mathematics and Senior in the heatmap?",
            "A": "The heat value is {0.43}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Literature and Senior in the heatmap?",
            "A": "The heat value is {0.52}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.81}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.13}."
        },
        {
            "Q": "What is the maximum heat value of label Chemistry on the x-axis?",
            "A": "The maximum heat value of Chemistry on the x-axis is {0.72}."
        },
        {
            "Q": "What is the maximum heat value for label Faculty on the y-axis?",
            "A": "The maximum heat value for Faculty on the y-axis is {0.40}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Mathematics on the x-axis?",
            "A": "The average heat value for Mathematics on the x-axis is {0.32}."
        },
        {
            "Q": "What is the average heat value for label Economics on the x-axis?",
            "A": "The average heat value for Economics on the x-axis is {0.58}."
        },
        {
            "Q": "What is the average heat value for label Computer Science on the x-axis?",
            "A": "The average heat value for Computer Science on the x-axis is {0.59}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Arts and Admin or the cell corresponding to Economics and Staff?",
            "A": "The cell corresponding to {Economics} and {Staff} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to History and Faculty or the cell corresponding to History and Staff?",
            "A": "The cell corresponding to {History} and {Staff} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Mathematics and Faculty or the cell corresponding to Economics and Junior?",
            "A": "The cell corresponding to {Economics} and {Junior} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Computer Science and Postdoc or the cell corresponding to History and Postdoc?",
            "A": "The cell corresponding to {Computer Science} and {Postdoc} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.16 to 0.21?",
            "A": "The cells are: {(Arts, Admin)}."
        }
    ],
    "VA": []
}