{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {90} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {central cluster} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Electricity and Efficiency in the heatmap?",
            "A": "The heat value is {0.42}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Waste Management and Technology in the heatmap?",
            "A": "The heat value is {0.13}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Coal and Emissions in the heatmap?",
            "A": "The heat value is {0.58}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Exploration and Emissions in the heatmap?",
            "A": "The heat value is {0.47}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.93}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.10}."
        },
        {
            "Q": "What is the maximum heat value of label Exploration on the x-axis?",
            "A": "The maximum heat value of Exploration on the x-axis is {0.82}."
        },
        {
            "Q": "What is the maximum heat value for label Emissions on the y-axis?",
            "A": "The maximum heat value for Emissions on the y-axis is {0.58}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Electricity on the x-axis?",
            "A": "The average heat value for Electricity on the x-axis is {0.71}."
        },
        {
            "Q": "What is the average heat value for label Gas on the x-axis?",
            "A": "The average heat value for Gas on the x-axis is {0.53}."
        },
        {
            "Q": "What is the average heat value for label Investment on the y-axis?",
            "A": "The average heat value for Investment on the y-axis is {0.53}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Waste Management and Emissions or the cell corresponding to Oil and Infrastructure?",
            "A": "The cell corresponding to {Oil} and {Infrastructure} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Oil and Investment or the cell corresponding to Renewables and Technology?",
            "A": "The cell corresponding to {Oil} and {Investment} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Electricity and Efficiency or the cell corresponding to Electricity and Emissions?",
            "A": "The cell corresponding to {Electricity} and {Emissions} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.40 to 0.55?",
            "A": "The cells are: {(Distribution, Efficiency), (Electricity, Efficiency), (Exploration, Emissions), (Gas, Emissions), (Nuclear, Infrastructure), (Nuclear, Investment), (Nuclear, Policy), (Oil, Policy), (Nuclear, Production), (Nuclear, Reliability), (Gas, Storage), (Nuclear, Storage), (Exploration, Technology), (Gas, Technology)}."
        }
    ],
    "VA": []
}