{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {90} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {horizontal gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Gas and Reliability in the heatmap?",
            "A": "The heat value is {0.54}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Electricity and Consumption in the heatmap?",
            "A": "The heat value is {0.67}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Exploration and Emissions in the heatmap?",
            "A": "The heat value is {0.64}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.80}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.23}."
        },
        {
            "Q": "What is the maximum heat value for label Consumption on the y-axis?",
            "A": "The maximum heat value for Consumption on the y-axis is {0.77}."
        },
        {
            "Q": "What is the maximum heat value of label Transmission on the x-axis?",
            "A": "The maximum heat value of Transmission on the x-axis is {0.42}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Reliability on the y-axis?",
            "A": "The average heat value for Reliability on the y-axis is {0.52}."
        },
        {
            "Q": "What is the average heat value for label Gas on the x-axis?",
            "A": "The average heat value for Gas on the x-axis is {0.55}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Water and Policy or the cell corresponding to Exploration and Production?",
            "A": "The cell corresponding to {Exploration} and {Production} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Water and Policy or the cell corresponding to Nuclear and Production?",
            "A": "The cell corresponding to {Nuclear} and {Production} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Nuclear and Policy or the cell corresponding to Transmission and Reliability?",
            "A": "The cell corresponding to {Nuclear} and {Policy} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Exploration and Policy or the cell corresponding to Renewables and Reliability?",
            "A": "The cell corresponding to {Exploration} and {Policy} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.29 to 0.31?",
            "A": "The cells are: {(Waste Management, Emissions), (Waste Management, Production), (Waste Management, Reliability)}."
        }
    ],
    "VA": []
}