{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {81} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {random} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Nuclear and Policy in the heatmap?",
            "A": "The heat value is {0.16}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Distribution and Policy in the heatmap?",
            "A": "The heat value is {0.61}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {1.00}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.00}."
        },
        {
            "Q": "What is the maximum heat value of label Coal on the x-axis?",
            "A": "The maximum heat value of Coal on the x-axis is {0.92}."
        },
        {
            "Q": "What is the maximum heat value for label Policy on the y-axis?",
            "A": "The maximum heat value for Policy on the y-axis is {1.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Emissions on the y-axis?",
            "A": "The average heat value for Emissions on the y-axis is {0.65}."
        },
        {
            "Q": "What is the average heat value for label Storage on the y-axis?",
            "A": "The average heat value for Storage on the y-axis is {0.58}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Distribution and Emissions or the cell corresponding to Gas and Production?",
            "A": "The cell corresponding to {Distribution} and {Emissions} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Gas and Emissions or the cell corresponding to Coal and Technology?",
            "A": "The cell corresponding to {Gas} and {Emissions} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Transmission and Infrastructure or the cell corresponding to Oil and Investment?",
            "A": "The cell corresponding to {Transmission} and {Infrastructure} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Water and Emissions or the cell corresponding to Distribution and Investment?",
            "A": "The cell corresponding to {Distribution} and {Investment} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.13 to 0.28?",
            "A": "The cells are: {(Nuclear, Efficiency), (Waste Management, Efficiency), (Nuclear, Infrastructure), (Nuclear, Policy), (Renewables, Policy), (Renewables, Reliability), (Renewables, Storage), (Water, Storage), (Oil, Technology)}."
        }
    ],
    "VA": []
}