{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {64} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {radial gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Waste Management and Prices in the heatmap?",
            "A": "The heat value is {0.47}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Distribution and Reliability in the heatmap?",
            "A": "The heat value is {0.88}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Nuclear and Technology in the heatmap?",
            "A": "The heat value is {0.75}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Gas and Technology in the heatmap?",
            "A": "The heat value is {0.81}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.92}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.16}."
        },
        {
            "Q": "What is the maximum heat value of label Waste Management on the x-axis?",
            "A": "The maximum heat value of Waste Management on the x-axis is {0.48}."
        },
        {
            "Q": "What is the maximum heat value of label Gas on the x-axis?",
            "A": "The maximum heat value of Gas on the x-axis is {0.82}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Waste Management on the x-axis?",
            "A": "The average heat value for Waste Management on the x-axis is {0.39}."
        },
        {
            "Q": "What is the average heat value for label Policy on the y-axis?",
            "A": "The average heat value for Policy on the y-axis is {0.70}."
        },
        {
            "Q": "What is the average heat value for label Reliability on the y-axis?",
            "A": "The average heat value for Reliability on the y-axis is {0.75}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Renewables and Consumption or the cell corresponding to Gas and Technology?",
            "A": "The cell corresponding to {Gas} and {Technology} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Exploration and Consumption or the cell corresponding to Waste Management and Technology?",
            "A": "The cell corresponding to {Exploration} and {Consumption} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Waste Management and Prices or the cell corresponding to Transmission and Reliability?",
            "A": "The cell corresponding to {Transmission} and {Reliability} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Renewables and Policy or the cell corresponding to Exploration and Technology?",
            "A": "The cell corresponding to {Exploration} and {Technology} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.38 to 0.59?",
            "A": "The cells are: {(Gas, Consumption), (Nuclear, Consumption), (Renewables, Consumption), (Renewables, Infrastructure), (Transmission, Infrastructure), (Renewables, Investment), (Transmission, Investment), (Transmission, Policy), (Waste Management, Policy), (Transmission, Prices), (Waste Management, Prices), (Transmission, Production), (Waste Management, Production), (Waste Management, Reliability), (Transmission, Technology), (Waste Management, Technology)}."
        }
    ],
    "VA": []
}