{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {72} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {uniform} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Processed Foods and Production in the heatmap?",
            "A": "The heat value is {0.49}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Meat and Innovation in the heatmap?",
            "A": "The heat value is {0.49}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Meat and Production in the heatmap?",
            "A": "The heat value is {0.51}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Meat and Marketing in the heatmap?",
            "A": "The heat value is {0.51}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.53}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.47}."
        },
        {
            "Q": "What is the maximum heat value of label Confectionery on the x-axis?",
            "A": "The maximum heat value of Confectionery on the x-axis is {0.52}."
        },
        {
            "Q": "What is the maximum heat value for label Imports on the y-axis?",
            "A": "The maximum heat value for Imports on the y-axis is {0.51}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Distribution on the y-axis?",
            "A": "The average heat value for Distribution on the y-axis is {0.50}."
        },
        {
            "Q": "What is the average heat value for label Dairy on the x-axis?",
            "A": "The average heat value for Dairy on the x-axis is {0.49}."
        },
        {
            "Q": "What is the average heat value for label Imports on the y-axis?",
            "A": "The average heat value for Imports on the y-axis is {0.49}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Processed Foods and Production or the cell corresponding to Meat and Safety?",
            "A": "The cell corresponding to {Meat} and {Safety} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Seafood and Exports or the cell corresponding to Snacks and Imports?",
            "A": "The cell corresponding to {Seafood} and {Exports} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.48 to 0.53?",
            "A": "The cells are: {(Bakery, Consumption), (Confectionery, Consumption), (Dairy, Consumption), (Ingredients, Consumption), (Processed Foods, Consumption), (Snacks, Consumption), (Confectionery, Distribution), (Dairy, Distribution), (Meat, Distribution), (Processed Foods, Distribution), (Seafood, Distribution), (Snacks, Distribution), (Bakery, Exports), (Confectionery, Exports), (Ingredients, Exports), (Processed Foods, Exports), (Seafood, Exports), (Bakery, Imports), (Confectionery, Imports), (Dairy, Imports), (Ingredients, Imports), (Meat, Imports), (Processed Foods, Imports), (Seafood, Imports), (Snacks, Imports), (Bakery, Innovation), (Confectionery, Innovation), (Ingredients, Innovation), (Meat, Innovation), (Processed Foods, Innovation), (Seafood, Innovation), (Snacks, Innovation), (Bakery, Marketing), (Confectionery, Marketing), (Dairy, Marketing), (Ingredients, Marketing), (Meat, Marketing), (Processed Foods, Marketing), (Seafood, Marketing), (Snacks, Marketing), (Confectionery, Production), (Dairy, Production), (Ingredients, Production), (Meat, Production), (Processed Foods, Production), (Seafood, Production), (Snacks, Production), (Bakery, Safety), (Confectionery, Safety), (Dairy, Safety), (Ingredients, Safety), (Meat, Safety), (Processed Foods, Safety), (Seafood, Safety), (Snacks, Safety), (Bakery, Sustainability), (Confectionery, Sustainability), (Dairy, Sustainability), (Ingredients, Sustainability), (Meat, Sustainability), (Processed Foods, Sustainability), (Seafood, Sustainability), (Snacks, Sustainability)}."
        }
    ],
    "VA": []
}