{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {64} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {horizontal gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Snacks and Safety in the heatmap?",
            "A": "The heat value is {0.17}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Meat and Marketing in the heatmap?",
            "A": "The heat value is {0.55}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.90}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.14}."
        },
        {
            "Q": "What is the maximum heat value for label Prices on the y-axis?",
            "A": "The maximum heat value for Prices on the y-axis is {0.88}."
        },
        {
            "Q": "What is the maximum heat value of label Confectionery on the x-axis?",
            "A": "The maximum heat value of Confectionery on the x-axis is {0.90}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Snacks on the x-axis?",
            "A": "The average heat value for Snacks on the x-axis is {0.17}."
        },
        {
            "Q": "What is the average heat value for label Seafood on the x-axis?",
            "A": "The average heat value for Seafood on the x-axis is {0.26}."
        },
        {
            "Q": "What is the average heat value for label Ingredients on the x-axis?",
            "A": "The average heat value for Ingredients on the x-axis is {0.65}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Produce and Distribution or the cell corresponding to Produce and Production?",
            "A": "The cell corresponding to {Produce} and {Distribution} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Seafood and Distribution or the cell corresponding to Dairy and Marketing?",
            "A": "The cell corresponding to {Dairy} and {Marketing} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Dairy and Exports or the cell corresponding to Produce and Prices?",
            "A": "The cell corresponding to {Dairy} and {Exports} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.26 to 0.47?",
            "A": "The cells are: {(Processed Foods, Consumption), (Produce, Consumption), (Seafood, Consumption), (Produce, Distribution), (Processed Foods, Exports), (Produce, Exports), (Seafood, Exports), (Produce, Marketing), (Processed Foods, Prices), (Produce, Prices), (Seafood, Prices), (Produce, Production), (Processed Foods, Regulations), (Produce, Regulations), (Processed Foods, Safety), (Produce, Safety)}."
        }
    ],
    "VA": []
}