{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {81} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {vertical gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Policy and Prevention in the heatmap?",
            "A": "The heat value is {0.63}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Research and Prevention in the heatmap?",
            "A": "The heat value is {0.63}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Patient Care and Patient Satisfaction in the heatmap?",
            "A": "The heat value is {0.45}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.81}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.11}."
        },
        {
            "Q": "What is the maximum heat value for label Prevention on the y-axis?",
            "A": "The maximum heat value for Prevention on the y-axis is {0.68}."
        },
        {
            "Q": "What is the maximum heat value of label Hospitals on the x-axis?",
            "A": "The maximum heat value of Hospitals on the x-axis is {0.77}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Hospitals on the x-axis?",
            "A": "The average heat value for Hospitals on the x-axis is {0.45}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Pharmaceuticals and Epidemiology or the cell corresponding to Telemedicine and Quality?",
            "A": "The cell corresponding to {Telemedicine} and {Quality} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Clinics and Patient Satisfaction or the cell corresponding to Policy and Prevention?",
            "A": "The cell corresponding to {Policy} and {Prevention} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Research and Prevention or the cell corresponding to Wellness and Prevention?",
            "A": "The heat values are {equal}."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Patient Care and Patient Satisfaction or the cell corresponding to Telemedicine and Patient Satisfaction?",
            "A": "The cell corresponding to {Telemedicine} and {Patient Satisfaction} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.31 to 0.35?",
            "A": "The cells are: {(Wellness, Outcomes)}."
        }
    ],
    "VA": []
}