{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {49} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {7} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {7} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {diagonal} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Pest Control and Export in the heatmap?",
            "A": "The heat value is {0.85}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Crops and Export in the heatmap?",
            "A": "The heat value is {0.66}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Water Usage and Market Price in the heatmap?",
            "A": "The heat value is {0.24}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Farm Management and Cost in the heatmap?",
            "A": "The heat value is {0.46}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.91}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.24}."
        },
        {
            "Q": "What is the maximum heat value of label Dairy on the x-axis?",
            "A": "The maximum heat value of Dairy on the x-axis is {0.84}."
        },
        {
            "Q": "What is the maximum heat value for label Yield on the y-axis?",
            "A": "The maximum heat value for Yield on the y-axis is {0.91}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Export on the y-axis?",
            "A": "The average heat value for Export on the y-axis is {0.68}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Fisheries and Export or the cell corresponding to Dairy and Technology Adoption?",
            "A": "The cell corresponding to {Dairy} and {Technology Adoption} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Fisheries and Export or the cell corresponding to Farm Management and Yield?",
            "A": "The cell corresponding to {Fisheries} and {Export} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.49 to 0.76?",
            "A": "The cells are: {(Dairy, Cost), (Pest Control, Cost), (Crops, Export), (Farm Management, Export), (Forestry, Export), (Water Usage, Export), (Dairy, Labor), (Fisheries, Labor), (Pest Control, Labor), (Farm Management, Market Price), (Forestry, Market Price), (Dairy, Technology Adoption), (Fisheries, Technology Adoption), (Pest Control, Technology Adoption), (Crops, Weather Impact), (Farm Management, Weather Impact), (Forestry, Weather Impact), (Water Usage, Weather Impact), (Dairy, Yield), (Pest Control, Yield)}."
        }
    ],
    "VA": []
}