{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {90} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {central cluster} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Research and Prevention in the heatmap?",
            "A": "The heat value is {0.56}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Medical Devices and Outcomes in the heatmap?",
            "A": "The heat value is {0.53}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Public Health and Staffing in the heatmap?",
            "A": "The heat value is {0.37}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Public Health and Patient Satisfaction in the heatmap?",
            "A": "The heat value is {0.81}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.85}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.23}."
        },
        {
            "Q": "What is the maximum heat value of label Clinics on the x-axis?",
            "A": "The maximum heat value of Clinics on the x-axis is {0.34}."
        },
        {
            "Q": "What is the maximum heat value of label Medical Devices on the x-axis?",
            "A": "The maximum heat value of Medical Devices on the x-axis is {0.56}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Public Health on the x-axis?",
            "A": "The average heat value for Public Health on the x-axis is {0.54}."
        },
        {
            "Q": "What is the average heat value for label Patient Care on the x-axis?",
            "A": "The average heat value for Patient Care on the x-axis is {0.50}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Wellness and Patient Satisfaction or the cell corresponding to Hospitals and Staffing?",
            "A": "The cell corresponding to {Wellness} and {Patient Satisfaction} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Public Health and Quality or the cell corresponding to Wellness and Quality?",
            "A": "The cell corresponding to {Public Health} and {Quality} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Policy and Regulations or the cell corresponding to Public Health and Staffing?",
            "A": "The cell corresponding to {Policy} and {Regulations} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.29 to 0.59?",
            "A": "The cells are: {(Clinics, Access), (Hospitals, Access), (Insurance, Access), (Medical Devices, Access), (Patient Care, Access), (Policy, Access), (Public Health, Access), (Research, Access), (Wellness, Access), (Clinics, Epidemiology), (Hospitals, Epidemiology), (Insurance, Epidemiology), (Medical Devices, Epidemiology), (Patient Care, Epidemiology), (Policy, Epidemiology), (Public Health, Epidemiology), (Research, Epidemiology), (Wellness, Epidemiology), (Clinics, Funding), (Hospitals, Funding), (Insurance, Funding), (Medical Devices, Funding), (Patient Care, Funding), (Research, Funding), (Wellness, Funding), (Clinics, Outcomes), (Hospitals, Outcomes), (Insurance, Outcomes), (Medical Devices, Outcomes), (Wellness, Outcomes), (Clinics, Patient Satisfaction), (Hospitals, Patient Satisfaction), (Insurance, Patient Satisfaction), (Medical Devices, Patient Satisfaction), (Wellness, Patient Satisfaction), (Clinics, Prevention), (Hospitals, Prevention), (Insurance, Prevention), (Medical Devices, Prevention), (Research, Prevention), (Wellness, Prevention), (Clinics, Quality), (Hospitals, Quality), (Insurance, Quality), (Medical Devices, Quality), (Patient Care, Quality), (Policy, Quality), (Public Health, Quality), (Research, Quality), (Wellness, Quality), (Hospitals, Regulations), (Insurance, Regulations), (Medical Devices, Regulations), (Patient Care, Regulations), (Policy, Regulations), (Public Health, Regulations), (Research, Regulations), (Wellness, Regulations), (Clinics, Staffing), (Medical Devices, Staffing), (Patient Care, Staffing), (Policy, Staffing), (Public Health, Staffing), (Research, Staffing), (Wellness, Staffing), (Medical Devices, Technology Adoption), (Patient Care, Technology Adoption), (Public Health, Technology Adoption), (Research, Technology Adoption), (Wellness, Technology Adoption)}."
        }
    ],
    "VA": []
}