{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {81} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {uniform} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Clinics and Staffing in the heatmap?",
            "A": "The heat value is {0.47}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Medical Devices and Access in the heatmap?",
            "A": "The heat value is {0.46}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Telemedicine and Cost in the heatmap?",
            "A": "The heat value is {0.45}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.48}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.44}."
        },
        {
            "Q": "What is the maximum heat value for label Cost on the y-axis?",
            "A": "The maximum heat value for Cost on the y-axis is {0.48}."
        },
        {
            "Q": "What is the maximum heat value for label Staffing on the y-axis?",
            "A": "The maximum heat value for Staffing on the y-axis is {0.48}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Insurance on the x-axis?",
            "A": "The average heat value for Insurance on the x-axis is {0.45}."
        },
        {
            "Q": "What is the average heat value for label Patient Care on the x-axis?",
            "A": "The average heat value for Patient Care on the x-axis is {0.46}."
        },
        {
            "Q": "What is the average heat value for label Public Health on the x-axis?",
            "A": "The average heat value for Public Health on the x-axis is {0.46}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Hospitals and Epidemiology or the cell corresponding to Insurance and Regulations?",
            "A": "The cell corresponding to {Hospitals} and {Epidemiology} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Pharmaceuticals and Cost or the cell corresponding to Public Health and Quality?",
            "A": "The cell corresponding to {Public Health} and {Quality} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Patient Care and Cost or the cell corresponding to Medical Devices and Epidemiology?",
            "A": "The cell corresponding to {Medical Devices} and {Epidemiology} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Clinics and Prevention or the cell corresponding to Public Health and Regulations?",
            "A": "The cell corresponding to {Clinics} and {Prevention} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.44 to 0.45?",
            "A": "The cells are: {(Pharmaceuticals, Cost), (Telemedicine, Cost), (Insurance, Patient Satisfaction), (Insurance, Prevention), (Insurance, Quality), (Patient Care, Quality), (Telemedicine, Quality), (Hospitals, Regulations), (Insurance, Regulations), (Pharmaceuticals, Regulations), (Public Health, Regulations)}."
        }
    ],
    "VA": []
}