{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {72} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {vertical gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Wellness and Prevention in the heatmap?",
            "A": "The heat value is {0.29}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Telemedicine and Technology Adoption in the heatmap?",
            "A": "The heat value is {0.72}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Research and Quality in the heatmap?",
            "A": "The heat value is {0.41}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.76}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.19}."
        },
        {
            "Q": "What is the maximum heat value for label Regulations on the y-axis?",
            "A": "The maximum heat value for Regulations on the y-axis is {0.50}."
        },
        {
            "Q": "What is the maximum heat value for label Cost on the y-axis?",
            "A": "The maximum heat value for Cost on the y-axis is {0.23}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Outcomes on the y-axis?",
            "A": "The average heat value for Outcomes on the y-axis is {0.26}."
        },
        {
            "Q": "What is the average heat value for label Cost on the y-axis?",
            "A": "The average heat value for Cost on the y-axis is {0.22}."
        },
        {
            "Q": "What is the average heat value for label Medical Devices on the x-axis?",
            "A": "The average heat value for Medical Devices on the x-axis is {0.40}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Insurance and Prevention or the cell corresponding to Medical Devices and Technology Adoption?",
            "A": "The cell corresponding to {Medical Devices} and {Technology Adoption} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Wellness and Regulations or the cell corresponding to Research and Technology Adoption?",
            "A": "The cell corresponding to {Research} and {Technology Adoption} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.35 to 0.56?",
            "A": "The cells are: {(Hospitals, Quality), (Insurance, Quality), (Medical Devices, Quality), (Patient Care, Quality), (Policy, Quality), (Public Health, Quality), (Research, Quality), (Wellness, Quality), (Hospitals, Regulations), (Insurance, Regulations), (Medical Devices, Regulations), (Patient Care, Regulations), (Policy, Regulations), (Public Health, Regulations), (Research, Regulations), (Telemedicine, Regulations), (Wellness, Regulations)}."
        }
    ],
    "VA": []
}