{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {49} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {7} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {7} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {diagonal} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Workplace Safety and Productivity in the heatmap?",
            "A": "The heat value is {0.47}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Recruitment and Wellbeing in the heatmap?",
            "A": "The heat value is {0.24}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Performance and Leadership in the heatmap?",
            "A": "The heat value is {0.69}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.92}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.24}."
        },
        {
            "Q": "What is the maximum heat value of label Performance on the x-axis?",
            "A": "The maximum heat value of Performance on the x-axis is {0.86}."
        },
        {
            "Q": "What is the maximum heat value of label Workplace Safety on the x-axis?",
            "A": "The maximum heat value of Workplace Safety on the x-axis is {0.92}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Culture on the y-axis?",
            "A": "The average heat value for Culture on the y-axis is {0.63}."
        },
        {
            "Q": "What is the average heat value for label Satisfaction on the y-axis?",
            "A": "The average heat value for Satisfaction on the y-axis is {0.69}."
        },
        {
            "Q": "What is the average heat value for label Training on the x-axis?",
            "A": "The average heat value for Training on the x-axis is {0.69}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Retention and Engagement or the cell corresponding to Employee Relations and Satisfaction?",
            "A": "The heat values are {equal}."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Training and Diversity or the cell corresponding to Performance and Satisfaction?",
            "A": "The cell corresponding to {Training} and {Diversity} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.37 to 0.52?",
            "A": "The cells are: {(Performance, Culture), (Retention, Culture), (Recruitment, Diversity), (Diversity & Inclusion, Engagement), (Workplace Safety, Engagement), (Employee Relations, Leadership), (Training, Leadership), (Diversity & Inclusion, Productivity), (Workplace Safety, Productivity), (Recruitment, Satisfaction), (Performance, Wellbeing), (Retention, Wellbeing)}."
        }
    ],
    "VA": []
}