{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {64} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {diagonal} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to HR Tech and Leadership in the heatmap?",
            "A": "The heat value is {0.67}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Benefits and Skills Gap in the heatmap?",
            "A": "The heat value is {0.21}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Training and Skills Gap in the heatmap?",
            "A": "The heat value is {0.22}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Compliance and Productivity in the heatmap?",
            "A": "The heat value is {0.67}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.93}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.20}."
        },
        {
            "Q": "What is the maximum heat value of label Performance on the x-axis?",
            "A": "The maximum heat value of Performance on the x-axis is {0.86}."
        },
        {
            "Q": "What is the maximum heat value for label Wellbeing on the y-axis?",
            "A": "The maximum heat value for Wellbeing on the y-axis is {0.92}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Compensation on the x-axis?",
            "A": "The average heat value for Compensation on the x-axis is {0.66}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to HR Tech and Culture or the cell corresponding to Diversity & Inclusion and Wellbeing?",
            "A": "The heat values are {equal}."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Performance and Skills Gap or the cell corresponding to Retention and Turnover?",
            "A": "The cell corresponding to {Retention} and {Turnover} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Compliance and Skills Gap or the cell corresponding to HR Tech and Skills Gap?",
            "A": "The cell corresponding to {HR Tech} and {Skills Gap} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Compliance and Productivity or the cell corresponding to Compliance and Wellbeing?",
            "A": "The cell corresponding to {Compliance} and {Productivity} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.29 to 0.54?",
            "A": "The cells are: {(Compliance, Culture), (Performance, Culture), (Diversity & Inclusion, Engagement), (HR Tech, Engagement), (Benefits, Leadership), (Training, Leadership), (Compensation, Productivity), (Retention, Productivity), (Compensation, Skills Gap), (Retention, Skills Gap), (Benefits, Training Hours), (Training, Training Hours), (Diversity & Inclusion, Turnover), (HR Tech, Turnover), (Compliance, Wellbeing), (Performance, Wellbeing)}."
        }
    ],
    "VA": []
}