{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {90} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {central cluster} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to HR Tech and Productivity in the heatmap?",
            "A": "The heat value is {0.73}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Retention and Leadership in the heatmap?",
            "A": "The heat value is {0.73}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.96}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.13}."
        },
        {
            "Q": "What is the maximum heat value of label Diversity & Inclusion on the x-axis?",
            "A": "The maximum heat value of Diversity & Inclusion on the x-axis is {0.82}."
        },
        {
            "Q": "What is the maximum heat value for label Turnover on the y-axis?",
            "A": "The maximum heat value for Turnover on the y-axis is {0.94}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Compensation on the x-axis?",
            "A": "The average heat value for Compensation on the x-axis is {0.52}."
        },
        {
            "Q": "What is the average heat value for label HR Tech on the x-axis?",
            "A": "The average heat value for HR Tech on the x-axis is {0.73}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Compensation and Leadership or the cell corresponding to Retention and Training Hours?",
            "A": "The cell corresponding to {Retention} and {Training Hours} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Benefits and Productivity or the cell corresponding to Diversity & Inclusion and Training Hours?",
            "A": "The cell corresponding to {Diversity & Inclusion} and {Training Hours} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.68 to 0.79?",
            "A": "The cells are: {(Retention, Leadership), (Training, Leadership), (Workplace Safety, Leadership), (Diversity & Inclusion, Productivity), (Employee Relations, Productivity), (HR Tech, Productivity), (Retention, Productivity), (Workplace Safety, Productivity), (Diversity & Inclusion, Satisfaction), (Employee Relations, Satisfaction), (Diversity & Inclusion, Skills Gap), (Compliance, Training Hours), (Diversity & Inclusion, Training Hours), (Diversity & Inclusion, Turnover), (Compensation, Wellbeing), (Compliance, Wellbeing)}."
        }
    ],
    "VA": []
}