{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {49} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {7} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {7} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {uniform} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Employee Relations and Leadership in the heatmap?",
            "A": "The heat value is {0.46}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Training and Engagement in the heatmap?",
            "A": "The heat value is {0.46}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Compliance and Engagement in the heatmap?",
            "A": "The heat value is {0.47}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Compensation and Satisfaction in the heatmap?",
            "A": "The heat value is {0.47}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.49}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.43}."
        },
        {
            "Q": "What is the maximum heat value of label Compensation on the x-axis?",
            "A": "The maximum heat value of Compensation on the x-axis is {0.49}."
        },
        {
            "Q": "What is the maximum heat value for label Diversity on the y-axis?",
            "A": "The maximum heat value for Diversity on the y-axis is {0.47}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Diversity & Inclusion on the x-axis?",
            "A": "The average heat value for Diversity & Inclusion on the x-axis is {0.46}."
        },
        {
            "Q": "What is the average heat value for label Employee Relations on the x-axis?",
            "A": "The average heat value for Employee Relations on the x-axis is {0.47}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Compensation and Diversity or the cell corresponding to Diversity & Inclusion and Engagement?",
            "A": "The cell corresponding to {Diversity & Inclusion} and {Engagement} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Employee Relations and Diversity or the cell corresponding to Diversity & Inclusion and Leadership?",
            "A": "The cell corresponding to {Employee Relations} and {Diversity} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.44 to 0.47?",
            "A": "The cells are: {(Benefits, Culture), (Compensation, Culture), (Compliance, Culture), (Diversity & Inclusion, Culture), (Employee Relations, Culture), (Training, Culture), (Benefits, Diversity), (Compensation, Diversity), (Compliance, Diversity), (Diversity & Inclusion, Diversity), (Employee Relations, Diversity), (HR Tech, Diversity), (Training, Diversity), (Benefits, Engagement), (Compensation, Engagement), (Compliance, Engagement), (Diversity & Inclusion, Engagement), (Employee Relations, Engagement), (HR Tech, Engagement), (Training, Engagement), (Benefits, Leadership), (Compensation, Leadership), (Compliance, Leadership), (Employee Relations, Leadership), (Training, Leadership), (Benefits, Satisfaction), (Compensation, Satisfaction), (Compliance, Satisfaction), (Diversity & Inclusion, Satisfaction), (Employee Relations, Satisfaction), (HR Tech, Satisfaction), (Training, Satisfaction), (Benefits, Skills Gap), (Compensation, Skills Gap), (Compliance, Skills Gap), (Employee Relations, Skills Gap), (HR Tech, Skills Gap), (Training, Skills Gap), (Benefits, Turnover), (Compliance, Turnover), (Diversity & Inclusion, Turnover), (HR Tech, Turnover), (Training, Turnover)}."
        }
    ],
    "VA": []
}