{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {90} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {random} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Residential and Location in the heatmap?",
            "A": "The heat value is {0.48}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Residential and Age in the heatmap?",
            "A": "The heat value is {0.69}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.99}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.00}."
        },
        {
            "Q": "What is the maximum heat value for label Affordability on the y-axis?",
            "A": "The maximum heat value for Affordability on the y-axis is {0.85}."
        },
        {
            "Q": "What is the maximum heat value of label Appraisal on the x-axis?",
            "A": "The maximum heat value of Appraisal on the x-axis is {0.98}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Inventory on the y-axis?",
            "A": "The average heat value for Inventory on the y-axis is {0.70}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Development and Affordability or the cell corresponding to Construction and Condition?",
            "A": "The cell corresponding to {Construction} and {Condition} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to REITs and Affordability or the cell corresponding to Property Management and Condition?",
            "A": "The cell corresponding to {Property Management} and {Condition} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.34 to 0.47?",
            "A": "The cells are: {(Commercial, Affordability), (Property Management, Age), (Appraisal, Condition), (Residential, Demand), (Mortgages, Interest Rates), (Property Management, Inventory), (Property Management, Location), (Construction, Price), (Development, Price), (Industrial, Price), (Appraisal, Supply), (Development, Supply)}."
        }
    ],
    "VA": []
}