{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {64} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {central cluster} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Appraisal and Price in the heatmap?",
            "A": "The heat value is {0.73}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Land and Age in the heatmap?",
            "A": "The heat value is {0.88}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Land and Size in the heatmap?",
            "A": "The heat value is {0.75}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.96}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.13}."
        },
        {
            "Q": "What is the maximum heat value of label Development on the x-axis?",
            "A": "The maximum heat value of Development on the x-axis is {0.96}."
        },
        {
            "Q": "What is the maximum heat value of label Land on the x-axis?",
            "A": "The maximum heat value of Land on the x-axis is {0.93}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Mortgages on the x-axis?",
            "A": "The average heat value for Mortgages on the x-axis is {0.77}."
        },
        {
            "Q": "What is the average heat value for label Age on the y-axis?",
            "A": "The average heat value for Age on the y-axis is {0.70}."
        },
        {
            "Q": "What is the average heat value for label Rental on the x-axis?",
            "A": "The average heat value for Rental on the x-axis is {0.52}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Development and Affordability or the cell corresponding to Rental and Price?",
            "A": "The cell corresponding to {Development} and {Affordability} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Residential and Affordability or the cell corresponding to REITs and Size?",
            "A": "The cell corresponding to {REITs} and {Size} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Development and Affordability or the cell corresponding to Development and Inventory?",
            "A": "The cell corresponding to {Development} and {Inventory} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to REITs and Inventory or the cell corresponding to Rental and Inventory?",
            "A": "The cell corresponding to {REITs} and {Inventory} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.22 to 0.31?",
            "A": "The cells are: {(Residential, Affordability), (Residential, Size), (Rental, Supply)}."
        }
    ],
    "VA": []
}