{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {64} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {horizontal gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to REITs and Affordability in the heatmap?",
            "A": "The heat value is {0.26}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Construction and Size in the heatmap?",
            "A": "The heat value is {0.87}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.89}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.20}."
        },
        {
            "Q": "What is the maximum heat value for label Demand on the y-axis?",
            "A": "The maximum heat value for Demand on the y-axis is {0.86}."
        },
        {
            "Q": "What is the maximum heat value for label Supply on the y-axis?",
            "A": "The maximum heat value for Supply on the y-axis is {0.84}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label REITs on the x-axis?",
            "A": "The average heat value for REITs on the x-axis is {0.25}."
        },
        {
            "Q": "What is the average heat value for label Supply on the y-axis?",
            "A": "The average heat value for Supply on the y-axis is {0.54}."
        },
        {
            "Q": "What is the average heat value for label Industrial on the x-axis?",
            "A": "The average heat value for Industrial on the x-axis is {0.78}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Land and Demand or the cell corresponding to Property Management and Interest Rates?",
            "A": "The cell corresponding to {Land} and {Demand} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Commercial and Inventory or the cell corresponding to Industrial and Inventory?",
            "A": "The cell corresponding to {Commercial} and {Inventory} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.45 to 0.63?",
            "A": "The cells are: {(Land, Age), (Mortgages, Demand), (Land, Inventory), (Land, Location)}."
        }
    ],
    "VA": []
}