{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {100} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {random} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Construction and Market Trends in the heatmap?",
            "A": "The heat value is {0.17}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to REITs and Affordability in the heatmap?",
            "A": "The heat value is {0.64}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Land and Interest Rates in the heatmap?",
            "A": "The heat value is {0.69}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.98}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.01}."
        },
        {
            "Q": "What is the maximum heat value of label Land on the x-axis?",
            "A": "The maximum heat value of Land on the x-axis is {0.83}."
        },
        {
            "Q": "What is the maximum heat value of label Mortgages on the x-axis?",
            "A": "The maximum heat value of Mortgages on the x-axis is {0.98}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Affordability on the y-axis?",
            "A": "The average heat value for Affordability on the y-axis is {0.45}."
        },
        {
            "Q": "What is the average heat value for label Industrial on the x-axis?",
            "A": "The average heat value for Industrial on the x-axis is {0.38}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Property Management and Condition or the cell corresponding to Property Management and Market Trends?",
            "A": "The cell corresponding to {Property Management} and {Market Trends} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Residential and Age or the cell corresponding to Commercial and Supply?",
            "A": "The cell corresponding to {Commercial} and {Supply} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Property Management and Inventory or the cell corresponding to Residential and Supply?",
            "A": "The cell corresponding to {Residential} and {Supply} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.42 to 0.45?",
            "A": "The cells are: {(Land, Age), (Construction, Interest Rates), (Land, Supply)}."
        }
    ],
    "VA": []
}