{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {72} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {uniform} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Apparel and Brick&Mortar in the heatmap?",
            "A": "The heat value is {0.51}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Home Goods and Omnichannel in the heatmap?",
            "A": "The heat value is {0.49}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Home Goods and Marketplace in the heatmap?",
            "A": "The heat value is {0.50}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.52}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.48}."
        },
        {
            "Q": "What is the maximum heat value for label DTC on the y-axis?",
            "A": "The maximum heat value for DTC on the y-axis is {0.51}."
        },
        {
            "Q": "What is the maximum heat value for label Subscription on the y-axis?",
            "A": "The maximum heat value for Subscription on the y-axis is {0.50}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Subscription on the y-axis?",
            "A": "The average heat value for Subscription on the y-axis is {0.49}."
        },
        {
            "Q": "What is the average heat value for label Omnichannel on the y-axis?",
            "A": "The average heat value for Omnichannel on the y-axis is {0.50}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Beauty and Inventory or the cell corresponding to Books and Marketplace?",
            "A": "The cell corresponding to {Beauty} and {Inventory} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Books and Online or the cell corresponding to Electronics and Subscription?",
            "A": "The cell corresponding to {Electronics} and {Subscription} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Home Goods and Marketplace or the cell corresponding to Toys and Marketplace?",
            "A": "The cell corresponding to {Home Goods} and {Marketplace} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.49 to 0.52?",
            "A": "The cells are: {(Apparel, Brick&Mortar), (Beauty, Brick&Mortar), (Books, Brick&Mortar), (Electronics, Brick&Mortar), (Groceries, Brick&Mortar), (Home Goods, Brick&Mortar), (Jewelry, Brick&Mortar), (Pet Supplies, Brick&Mortar), (Toys, Brick&Mortar), (Apparel, DTC), (Beauty, DTC), (Books, DTC), (Electronics, DTC), (Groceries, DTC), (Jewelry, DTC), (Pet Supplies, DTC), (Toys, DTC), (Apparel, Inventory), (Beauty, Inventory), (Books, Inventory), (Electronics, Inventory), (Home Goods, Inventory), (Jewelry, Inventory), (Pet Supplies, Inventory), (Toys, Inventory), (Books, Logistics), (Electronics, Logistics), (Groceries, Logistics), (Home Goods, Logistics), (Jewelry, Logistics), (Pet Supplies, Logistics), (Toys, Logistics), (Apparel, Marketplace), (Beauty, Marketplace), (Books, Marketplace), (Electronics, Marketplace), (Groceries, Marketplace), (Home Goods, Marketplace), (Pet Supplies, Marketplace), (Toys, Marketplace), (Apparel, Omnichannel), (Beauty, Omnichannel), (Books, Omnichannel), (Groceries, Omnichannel), (Home Goods, Omnichannel), (Jewelry, Omnichannel), (Pet Supplies, Omnichannel), (Toys, Omnichannel), (Beauty, Online), (Books, Online), (Electronics, Online), (Groceries, Online), (Home Goods, Online), (Jewelry, Online), (Pet Supplies, Online), (Apparel, Subscription), (Beauty, Subscription), (Books, Subscription), (Electronics, Subscription), (Groceries, Subscription), (Home Goods, Subscription), (Jewelry, Subscription), (Pet Supplies, Subscription), (Toys, Subscription)}."
        }
    ],
    "VA": []
}