{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {81} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {horizontal gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Beauty and Omnichannel in the heatmap?",
            "A": "The heat value is {0.68}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Toys and Customer Service in the heatmap?",
            "A": "The heat value is {0.23}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Electronics and Omnichannel in the heatmap?",
            "A": "The heat value is {0.54}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Apparel and Subscription in the heatmap?",
            "A": "The heat value is {0.76}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.76}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.22}."
        },
        {
            "Q": "What is the maximum heat value for label Marketing on the y-axis?",
            "A": "The maximum heat value for Marketing on the y-axis is {0.72}."
        },
        {
            "Q": "What is the maximum heat value for label Omnichannel on the y-axis?",
            "A": "The maximum heat value for Omnichannel on the y-axis is {0.72}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Apparel on the x-axis?",
            "A": "The average heat value for Apparel on the x-axis is {0.74}."
        },
        {
            "Q": "What is the average heat value for label Sports on the x-axis?",
            "A": "The average heat value for Sports on the x-axis is {0.31}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Toys and Marketing or the cell corresponding to Books and Sales?",
            "A": "The cell corresponding to {Books} and {Sales} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Sports and Customer Service or the cell corresponding to Groceries and Marketing?",
            "A": "The cell corresponding to {Groceries} and {Marketing} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.46 to 0.64?",
            "A": "The cells are: {(Books, Brick&Mortar), (Electronics, Brick&Mortar), (Groceries, Brick&Mortar), (Books, Customer Service), (Electronics, Customer Service), (Groceries, Customer Service), (Books, DTC), (Electronics, DTC), (Groceries, DTC), (Beauty, Inventory), (Books, Inventory), (Electronics, Inventory), (Groceries, Inventory), (Books, Logistics), (Electronics, Logistics), (Groceries, Logistics), (Books, Marketing), (Electronics, Marketing), (Groceries, Marketing), (Electronics, Omnichannel), (Groceries, Omnichannel), (Books, Sales), (Electronics, Sales), (Groceries, Sales), (Books, Subscription), (Electronics, Subscription), (Groceries, Subscription)}."
        }
    ],
    "VA": []
}