{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {90} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {central cluster} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Computer and Testing in the heatmap?",
            "A": "The heat value is {0.20}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Computer and Maintenance in the heatmap?",
            "A": "The heat value is {0.33}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Data and Publications in the heatmap?",
            "A": "The heat value is {0.37}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.93}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.16}."
        },
        {
            "Q": "What is the maximum heat value for label Research on the y-axis?",
            "A": "The maximum heat value for Research on the y-axis is {0.55}."
        },
        {
            "Q": "What is the maximum heat value for label Commercialization on the y-axis?",
            "A": "The maximum heat value for Commercialization on the y-axis is {0.75}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Testing on the y-axis?",
            "A": "The average heat value for Testing on the y-axis is {0.30}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Environmental and Collaboration or the cell corresponding to Software and Publications?",
            "A": "The cell corresponding to {Software} and {Publications} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Biomedical and Research or the cell corresponding to Civil and Testing?",
            "A": "The cell corresponding to {Civil} and {Testing} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Data and Development or the cell corresponding to Data and Publications?",
            "A": "The heat values are {equal}."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.34 to 0.51?",
            "A": "The cells are: {(Environmental, Collaboration), (Electrical, Commercialization), (Data, Development), (Electrical, Development), (Data, Implementation), (Data, Innovation), (Data, Maintenance), (Electrical, Maintenance), (Electrical, Patents), (Data, Publications), (Electrical, Publications), (Environmental, Publications), (Electrical, Research), (Environmental, Research), (Materials, Research), (Mechanical, Research), (Environmental, Testing), (Materials, Testing), (Mechanical, Testing), (Software, Testing)}."
        }
    ],
    "VA": []
}