{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {64} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {horizontal gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Mechanical and Funding in the heatmap?",
            "A": "The heat value is {0.25}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Data and Research in the heatmap?",
            "A": "The heat value is {0.41}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.79}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.15}."
        },
        {
            "Q": "What is the maximum heat value of label Chemical on the x-axis?",
            "A": "The maximum heat value of Chemical on the x-axis is {0.63}."
        },
        {
            "Q": "What is the maximum heat value for label Innovation on the y-axis?",
            "A": "The maximum heat value for Innovation on the y-axis is {0.78}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Implementation on the y-axis?",
            "A": "The average heat value for Implementation on the y-axis is {0.48}."
        },
        {
            "Q": "What is the average heat value for label Aerospace on the x-axis?",
            "A": "The average heat value for Aerospace on the x-axis is {0.77}."
        },
        {
            "Q": "What is the average heat value for label Publications on the y-axis?",
            "A": "The average heat value for Publications on the y-axis is {0.48}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Biomedical and Commercialization or the cell corresponding to Biomedical and Testing?",
            "A": "The cell corresponding to {Biomedical} and {Testing} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Software and Development or the cell corresponding to Mechanical and Publications?",
            "A": "The cell corresponding to {Mechanical} and {Publications} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.37 to 0.59?",
            "A": "The cells are: {(Civil, Commercialization), (Data, Commercialization), (Civil, Development), (Data, Development), (Chemical, Funding), (Civil, Funding), (Data, Funding), (Chemical, Implementation), (Civil, Implementation), (Data, Implementation), (Materials, Implementation), (Civil, Innovation), (Data, Innovation), (Civil, Publications), (Data, Publications), (Materials, Publications), (Civil, Research), (Data, Research), (Civil, Testing), (Data, Testing)}."
        }
    ],
    "VA": []
}