{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {72} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {diagonal} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Aerospace and Implementation in the heatmap?",
            "A": "The heat value is {0.38}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Biomedical and Publications in the heatmap?",
            "A": "The heat value is {0.72}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Data and Implementation in the heatmap?",
            "A": "The heat value is {0.94}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Aerospace and Funding in the heatmap?",
            "A": "The heat value is {0.37}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.94}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.19}."
        },
        {
            "Q": "What is the maximum heat value for label Funding on the y-axis?",
            "A": "The maximum heat value for Funding on the y-axis is {0.94}."
        },
        {
            "Q": "What is the maximum heat value of label Mechanical on the x-axis?",
            "A": "The maximum heat value of Mechanical on the x-axis is {0.88}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Biomedical on the x-axis?",
            "A": "The average heat value for Biomedical on the x-axis is {0.71}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Civil and Collaboration or the cell corresponding to Computer and Collaboration?",
            "A": "The cell corresponding to {Civil} and {Collaboration} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Software and Commercialization or the cell corresponding to Civil and Funding?",
            "A": "The heat values are {equal}."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Aerospace and Publications or the cell corresponding to Data and Research?",
            "A": "The cell corresponding to {Aerospace} and {Publications} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.42 to 0.44?",
            "A": "There are {no cells} with heat values within the range of 0.42 to 0.44."
        }
    ],
    "VA": []
}