{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {90} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {central cluster} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Mechanical and Testing in the heatmap?",
            "A": "The heat value is {0.89}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Aerospace and Testing in the heatmap?",
            "A": "The heat value is {0.17}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.92}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.08}."
        },
        {
            "Q": "What is the maximum heat value of label Aerospace on the x-axis?",
            "A": "The maximum heat value of Aerospace on the x-axis is {0.17}."
        },
        {
            "Q": "What is the maximum heat value for label Testing on the y-axis?",
            "A": "The maximum heat value for Testing on the y-axis is {0.92}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Biomedical on the x-axis?",
            "A": "The average heat value for Biomedical on the x-axis is {0.17}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Materials and Funding or the cell corresponding to Chemical and Maintenance?",
            "A": "The cell corresponding to {Materials} and {Funding} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Aerospace and Innovation or the cell corresponding to Aerospace and Research?",
            "A": "The cell corresponding to {Aerospace} and {Research} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.37 to 0.51?",
            "A": "The cells are: {(Environmental, Funding), (Materials, Funding), (Mechanical, Funding), (Software, Funding), (Electrical, Innovation), (Environmental, Innovation), (Data, Maintenance), (Electrical, Maintenance), (Data, Publications), (Civil, Research), (Data, Research), (Civil, Testing), (Data, Testing)}."
        }
    ],
    "VA": []
}