{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {81} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {9} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {vertical gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Gaming Platforms and Algorithms in the heatmap?",
            "A": "The heat value is {0.17}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Instagram and Advertising in the heatmap?",
            "A": "The heat value is {0.15}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Blogs and Growth in the heatmap?",
            "A": "The heat value is {0.55}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.76}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.13}."
        },
        {
            "Q": "What is the maximum heat value of label Spotify on the x-axis?",
            "A": "The maximum heat value of Spotify on the x-axis is {0.76}."
        },
        {
            "Q": "What is the maximum heat value for label Creator Economy on the y-axis?",
            "A": "The maximum heat value for Creator Economy on the y-axis is {0.31}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Blogs on the x-axis?",
            "A": "The average heat value for Blogs on the x-axis is {0.44}."
        },
        {
            "Q": "What is the average heat value for label Revenue on the y-axis?",
            "A": "The average heat value for Revenue on the y-axis is {0.72}."
        },
        {
            "Q": "What is the average heat value for label Content on the y-axis?",
            "A": "The average heat value for Content on the y-axis is {0.20}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Blogs and Advertising or the cell corresponding to Blogs and Revenue?",
            "A": "The cell corresponding to {Blogs} and {Revenue} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Instagram and Algorithms or the cell corresponding to Podcasts and Revenue?",
            "A": "The cell corresponding to {Podcasts} and {Revenue} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.48 to 0.66?",
            "A": "The cells are: {(Gaming Platforms, Engagement), (Blogs, Growth), (Gaming Platforms, Growth), (Instagram, Growth), (Netflix, Growth), (Online News, Growth), (Podcasts, Growth), (Spotify, Growth), (Twitter, Growth), (YouTube, Growth), (Blogs, Platform Trends), (Netflix, Platform Trends)}."
        }
    ],
    "VA": []
}