{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {56} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {7} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {radial gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to YouTube and Data Privacy in the heatmap?",
            "A": "The heat value is {0.38}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Blogs and Data Privacy in the heatmap?",
            "A": "The heat value is {0.81}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.89}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.26}."
        },
        {
            "Q": "What is the maximum heat value of label Netflix on the x-axis?",
            "A": "The maximum heat value of Netflix on the x-axis is {0.73}."
        },
        {
            "Q": "What is the maximum heat value for label Monetization on the y-axis?",
            "A": "The maximum heat value for Monetization on the y-axis is {0.89}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Algorithms on the y-axis?",
            "A": "The average heat value for Algorithms on the y-axis is {0.55}."
        },
        {
            "Q": "What is the average heat value for label Gaming Platforms on the x-axis?",
            "A": "The average heat value for Gaming Platforms on the x-axis is {0.76}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to TikTok and Data Privacy or the cell corresponding to Blogs and Monetization?",
            "A": "The cell corresponding to {Blogs} and {Monetization} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Gaming Platforms and Algorithms or the cell corresponding to TikTok and Content?",
            "A": "The cell corresponding to {Gaming Platforms} and {Algorithms} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Online News and Advertising or the cell corresponding to Blogs and Data Privacy?",
            "A": "The cell corresponding to {Blogs} and {Data Privacy} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.49 to 0.58?",
            "A": "The cells are: {(Spotify, Advertising), (Spotify, Algorithms), (Spotify, Content), (Spotify, Creator Economy), (TikTok, Creator Economy), (Spotify, Engagement), (TikTok, Engagement), (TikTok, Monetization), (Twitter, Monetization)}."
        }
    ],
    "VA": []
}