{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {64} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {central cluster} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Banking and Risk in the heatmap?",
            "A": "The heat value is {0.27}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Risk Management and Assets in the heatmap?",
            "A": "The heat value is {0.37}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Financial Tech and Growth in the heatmap?",
            "A": "The heat value is {0.69}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.81}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.17}."
        },
        {
            "Q": "What is the maximum heat value of label Accounting on the x-axis?",
            "A": "The maximum heat value of Accounting on the x-axis is {0.22}."
        },
        {
            "Q": "What is the maximum heat value for label Valuation on the y-axis?",
            "A": "The maximum heat value for Valuation on the y-axis is {0.31}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Market Share on the y-axis?",
            "A": "The average heat value for Market Share on the y-axis is {0.43}."
        },
        {
            "Q": "What is the average heat value for label Risk Management on the x-axis?",
            "A": "The average heat value for Risk Management on the x-axis is {0.51}."
        },
        {
            "Q": "What is the average heat value for label Banking on the x-axis?",
            "A": "The average heat value for Banking on the x-axis is {0.34}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Risk Management and Assets or the cell corresponding to Risk Management and Market Share?",
            "A": "The cell corresponding to {Risk Management} and {Market Share} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Consulting and Growth or the cell corresponding to Accounting and Risk?",
            "A": "The cell corresponding to {Consulting} and {Growth} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.37 to 0.61?",
            "A": "The cells are: {(Financial Tech, Assets), (Insurance, Assets), (Investments, Assets), (Consulting, Expenses), (Financial Tech, Expenses), (Insurance, Expenses), (Investments, Expenses), (Risk Management, Expenses), (Banking, Growth), (Consulting, Growth), (Banking, Liabilities), (Consulting, Liabilities), (Banking, Liquidity), (Consulting, Liquidity), (Consulting, Market Share), (Financial Tech, Market Share), (Insurance, Market Share), (Investments, Market Share), (Risk Management, Market Share), (Insurance, Risk), (Investments, Risk), (Risk Management, Risk)}."
        }
    ],
    "VA": []
}