{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {56} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {8} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {7} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {horizontal gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Spotify and Users in the heatmap?",
            "A": "The heat value is {0.33}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Blogs and Creator Economy in the heatmap?",
            "A": "The heat value is {0.15}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Spotify and Revenue in the heatmap?",
            "A": "The heat value is {0.33}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Facebook and Creator Economy in the heatmap?",
            "A": "The heat value is {0.21}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.75}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.14}."
        },
        {
            "Q": "What is the maximum heat value of label YouTube on the x-axis?",
            "A": "The maximum heat value of YouTube on the x-axis is {0.75}."
        },
        {
            "Q": "What is the maximum heat value of label Facebook on the x-axis?",
            "A": "The maximum heat value of Facebook on the x-axis is {0.22}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Platform Trends on the y-axis?",
            "A": "The average heat value for Platform Trends on the y-axis is {0.38}."
        },
        {
            "Q": "What is the average heat value for label Advertising on the y-axis?",
            "A": "The average heat value for Advertising on the y-axis is {0.38}."
        },
        {
            "Q": "What is the average heat value for label YouTube on the x-axis?",
            "A": "The average heat value for YouTube on the x-axis is {0.73}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Facebook and Content or the cell corresponding to YouTube and Monetization?",
            "A": "The cell corresponding to {YouTube} and {Monetization} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to YouTube and Monetization or the cell corresponding to Facebook and Revenue?",
            "A": "The cell corresponding to {YouTube} and {Monetization} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to YouTube and Monetization or the cell corresponding to YouTube and Revenue?",
            "A": "The cell corresponding to {YouTube} and {Monetization} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to YouTube and Creator Economy or the cell corresponding to Twitter and Revenue?",
            "A": "The cell corresponding to {YouTube} and {Creator Economy} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.28 to 0.36?",
            "A": "The cells are: {(Spotify, Advertising), (Spotify, Content), (Spotify, Creator Economy), (Spotify, Engagement), (Spotify, Monetization), (Spotify, Platform Trends), (Spotify, Revenue), (Spotify, Users)}."
        }
    ],
    "VA": []
}