{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {49} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {7} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {7} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {random} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Blogs and Creator Economy in the heatmap?",
            "A": "The heat value is {0.85}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to YouTube and Engagement in the heatmap?",
            "A": "The heat value is {0.04}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to YouTube and Data Privacy in the heatmap?",
            "A": "The heat value is {0.30}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to YouTube and Content in the heatmap?",
            "A": "The heat value is {0.10}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {1.00}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.00}."
        },
        {
            "Q": "What is the maximum heat value for label Users on the y-axis?",
            "A": "The maximum heat value for Users on the y-axis is {0.92}."
        },
        {
            "Q": "What is the maximum heat value for label Data Privacy on the y-axis?",
            "A": "The maximum heat value for Data Privacy on the y-axis is {0.94}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Creator Economy on the y-axis?",
            "A": "The average heat value for Creator Economy on the y-axis is {0.56}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Facebook and Content or the cell corresponding to YouTube and Creator Economy?",
            "A": "The cell corresponding to {Facebook} and {Content} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Online News and Creator Economy or the cell corresponding to Facebook and Data Privacy?",
            "A": "The cell corresponding to {Online News} and {Creator Economy} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Blogs and Growth or the cell corresponding to YouTube and Platform Trends?",
            "A": "The cell corresponding to {YouTube} and {Platform Trends} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.32 to 0.56?",
            "A": "The cells are: {(Gaming Platforms, Content), (Blogs, Data Privacy), (Instagram, Growth), (Netflix, Growth), (Facebook, Platform Trends), (YouTube, Platform Trends), (Gaming Platforms, Users), (YouTube, Users)}."
        }
    ],
    "VA": []
}