{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {72} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {horizontal gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Banking and Market Share in the heatmap?",
            "A": "The heat value is {0.13}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Tax and Equity in the heatmap?",
            "A": "The heat value is {0.90}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Tax and Growth in the heatmap?",
            "A": "The heat value is {0.88}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Capital Markets and Profit in the heatmap?",
            "A": "The heat value is {0.18}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.92}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.09}."
        },
        {
            "Q": "What is the maximum heat value for label Risk on the y-axis?",
            "A": "The maximum heat value for Risk on the y-axis is {0.88}."
        },
        {
            "Q": "What is the maximum heat value of label Auditing on the x-axis?",
            "A": "The maximum heat value of Auditing on the x-axis is {0.17}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Expenses on the y-axis?",
            "A": "The average heat value for Expenses on the y-axis is {0.40}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Risk Management and Expenses or the cell corresponding to Tax and Market Share?",
            "A": "The cell corresponding to {Tax} and {Market Share} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Investments and Equity or the cell corresponding to Tax and Market Share?",
            "A": "The cell corresponding to {Tax} and {Market Share} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Auditing and Assets or the cell corresponding to Tax and Profit?",
            "A": "The cell corresponding to {Tax} and {Profit} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Risk Management and Market Share or the cell corresponding to Banking and Valuation?",
            "A": "The cell corresponding to {Risk Management} and {Market Share} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.13 to 0.24?",
            "A": "The cells are: {(Auditing, Assets), (Banking, Assets), (Capital Markets, Assets), (Auditing, Equity), (Banking, Equity), (Capital Markets, Equity), (Banking, Expenses), (Capital Markets, Expenses), (Capital Markets, Growth), (Auditing, Liquidity), (Banking, Liquidity), (Capital Markets, Liquidity), (Auditing, Market Share), (Banking, Market Share), (Capital Markets, Market Share), (Financial Tech, Market Share), (Banking, Profit), (Capital Markets, Profit), (Banking, Risk), (Capital Markets, Risk), (Banking, Valuation), (Capital Markets, Valuation)}."
        }
    ],
    "VA": []
}