{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {100} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {horizontal gradient} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Tennis and Streaming Hours in the heatmap?",
            "A": "The heat value is {0.68}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Gaming and Royalties in the heatmap?",
            "A": "The heat value is {0.31}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Media Rights and Social Media in the heatmap?",
            "A": "The heat value is {0.35}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.83}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.25}."
        },
        {
            "Q": "What is the maximum heat value for label Ticket Sales on the y-axis?",
            "A": "The maximum heat value for Ticket Sales on the y-axis is {0.83}."
        },
        {
            "Q": "What is the maximum heat value for label Streaming Hours on the y-axis?",
            "A": "The maximum heat value for Streaming Hours on the y-axis is {0.77}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Theater on the x-axis?",
            "A": "The average heat value for Theater on the x-axis is {0.78}."
        },
        {
            "Q": "What is the average heat value for label Streaming Hours on the y-axis?",
            "A": "The average heat value for Streaming Hours on the y-axis is {0.45}."
        },
        {
            "Q": "What is the average heat value for label Attendance on the y-axis?",
            "A": "The average heat value for Attendance on the y-axis is {0.45}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Tennis and Social Media or the cell corresponding to Theater and Sponsorship?",
            "A": "The cell corresponding to {Theater} and {Sponsorship} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Basketball and Attendance or the cell corresponding to Movies and Viewership?",
            "A": "The cell corresponding to {Movies} and {Viewership} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Tennis and Social Media or the cell corresponding to Publishing and Sponsorship?",
            "A": "The cell corresponding to {Tennis} and {Social Media} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.43 to 0.55?",
            "A": "The cells are: {(Movies, Attendance), (Music, Attendance), (Music, Merchandise), (Music, Ratings), (Music, Revenue), (Music, Royalties), (Movies, Social Media), (Music, Social Media), (Music, Sponsorship), (Music, Streaming Hours), (Music, Ticket Sales), (Movies, Viewership), (Music, Viewership), (Publishing, Viewership)}."
        }
    ],
    "VA": []
}