{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {100} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {diagonal} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Events and Seasonal in the heatmap?",
            "A": "The heat value is {0.55}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Cruises and Wellness in the heatmap?",
            "A": "The heat value is {0.74}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Destinations and Eco-tourism in the heatmap?",
            "A": "The heat value is {0.57}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.94}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.18}."
        },
        {
            "Q": "What is the maximum heat value for label Eco-tourism on the y-axis?",
            "A": "The maximum heat value for Eco-tourism on the y-axis is {0.93}."
        },
        {
            "Q": "What is the maximum heat value for label Business on the y-axis?",
            "A": "The maximum heat value for Business on the y-axis is {0.88}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Luxury on the y-axis?",
            "A": "The average heat value for Luxury on the y-axis is {0.65}."
        },
        {
            "Q": "What is the average heat value for label Service Quality on the x-axis?",
            "A": "The average heat value for Service Quality on the x-axis is {0.69}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Transport and Family or the cell corresponding to Attractions and Rural?",
            "A": "The cell corresponding to {Attractions} and {Rural} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Tour Operators and Eco-tourism or the cell corresponding to Online Booking and Seasonal?",
            "A": "The cell corresponding to {Online Booking} and {Seasonal} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Online Booking and Eco-tourism or the cell corresponding to Hotels and Rural?",
            "A": "The cell corresponding to {Online Booking} and {Eco-tourism} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Marketing and Cultural or the cell corresponding to Events and Seasonal?",
            "A": "The cell corresponding to {Marketing} and {Cultural} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.59 to 0.75?",
            "A": "The cells are: {(Cruises, Adventure), (Tour Operators, Adventure), (Attractions, Budget), (Destinations, Budget), (Service Quality, Budget), (Transport, Budget), (Cruises, Business), (Events, Business), (Online Booking, Business), (Tour Operators, Business), (Destinations, Cultural), (Hotels, Cultural), (Marketing, Cultural), (Service Quality, Cultural), (Events, Eco-tourism), (Online Booking, Eco-tourism), (Events, Family), (Online Booking, Family), (Destinations, Luxury), (Hotels, Luxury), (Marketing, Luxury), (Service Quality, Luxury), (Cruises, Rural), (Events, Rural), (Online Booking, Rural), (Tour Operators, Rural), (Attractions, Seasonal), (Destinations, Seasonal), (Service Quality, Seasonal), (Transport, Seasonal), (Cruises, Wellness), (Tour Operators, Wellness)}."
        }
    ],
    "VA": []
}