{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {72} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {9} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {8} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {diagonal} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Tracking and Sustainability in the heatmap?",
            "A": "The heat value is {0.57}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Planning and Reliability in the heatmap?",
            "A": "The heat value is {0.73}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Rail and Speed in the heatmap?",
            "A": "The heat value is {0.55}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Rail and Compliance in the heatmap?",
            "A": "The heat value is {0.73}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.94}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.19}."
        },
        {
            "Q": "What is the maximum heat value for label Cost on the y-axis?",
            "A": "The maximum heat value for Cost on the y-axis is {0.89}."
        },
        {
            "Q": "What is the maximum heat value of label Air on the x-axis?",
            "A": "The maximum heat value of Air on the x-axis is {0.93}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Safety on the y-axis?",
            "A": "The average heat value for Safety on the y-axis is {0.73}."
        },
        {
            "Q": "What is the average heat value for label Efficiency on the y-axis?",
            "A": "The average heat value for Efficiency on the y-axis is {0.66}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Last Mile and Capacity or the cell corresponding to Warehousing and Compliance?",
            "A": "The cell corresponding to {Warehousing} and {Compliance} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Warehousing and Efficiency or the cell corresponding to Planning and Speed?",
            "A": "The cell corresponding to {Warehousing} and {Efficiency} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Warehousing and Cost or the cell corresponding to Planning and Sustainability?",
            "A": "The cell corresponding to {Warehousing} and {Cost} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Planning and Compliance or the cell corresponding to Rail and Cost?",
            "A": "The cell corresponding to {Rail} and {Cost} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.23 to 0.28?",
            "A": "There are {no cells} with heat values within the range of 0.23 to 0.28."
        }
    ],
    "VA": []
}