{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {100} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {diagonal} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Intermodal and Efficiency in the heatmap?",
            "A": "The heat value is {0.54}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Maritime and Cost in the heatmap?",
            "A": "The heat value is {0.72}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Intermodal and Labor in the heatmap?",
            "A": "The heat value is {0.36}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.93}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.19}."
        },
        {
            "Q": "What is the maximum heat value of label Rail on the x-axis?",
            "A": "The maximum heat value of Rail on the x-axis is {0.87}."
        },
        {
            "Q": "What is the maximum heat value of label Intermodal on the x-axis?",
            "A": "The maximum heat value of Intermodal on the x-axis is {0.87}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Intermodal on the x-axis?",
            "A": "The average heat value for Intermodal on the x-axis is {0.64}."
        },
        {
            "Q": "What is the average heat value for label Maritime on the x-axis?",
            "A": "The average heat value for Maritime on the x-axis is {0.64}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Warehousing and Cost or the cell corresponding to Road and Efficiency?",
            "A": "The cell corresponding to {Road} and {Efficiency} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Warehousing and Reliability or the cell corresponding to Tracking and Speed?",
            "A": "The cell corresponding to {Tracking} and {Speed} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Pipeline and Safety or the cell corresponding to Air and Technology?",
            "A": "The cell corresponding to {Air} and {Technology} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.32 to 0.58?",
            "A": "The cells are: {(Last Mile, Capacity), (Maritime, Capacity), (Rail, Capacity), (Road, Capacity), (Maritime, Compliance), (Pipeline, Compliance), (Planning, Compliance), (Rail, Compliance), (Air, Cost), (Pipeline, Cost), (Planning, Cost), (Warehousing, Cost), (Air, Efficiency), (Intermodal, Efficiency), (Tracking, Efficiency), (Warehousing, Efficiency), (Intermodal, Labor), (Last Mile, Labor), (Road, Labor), (Tracking, Labor), (Intermodal, Reliability), (Last Mile, Reliability), (Road, Reliability), (Tracking, Reliability), (Air, Safety), (Intermodal, Safety), (Tracking, Safety), (Warehousing, Safety), (Air, Speed), (Pipeline, Speed), (Planning, Speed), (Warehousing, Speed), (Maritime, Sustainability), (Pipeline, Sustainability), (Planning, Sustainability), (Rail, Sustainability), (Last Mile, Technology), (Maritime, Technology), (Rail, Technology), (Road, Technology)}."
        }
    ],
    "VA": []
}