{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {heatmap} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many cells are in this heatmap?",
            "A": "There are {100} cells."
        },
        {
            "Q": "How many rows are in this heatmap?",
            "A": "There are {10} rows."
        },
        {
            "Q": "How many columns are in this heatmap?",
            "A": "There are {10} columns."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What is the overall spatial distribution pattern shown in the heatmap?",
            "A": "The heatmap shows a {central cluster} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the heat value of the cell corresponding to Air and Safety in the heatmap?",
            "A": "The heat value is {0.54}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Road and Reliability in the heatmap?",
            "A": "The heat value is {0.77}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Pipeline and Sustainability in the heatmap?",
            "A": "The heat value is {0.60}."
        },
        {
            "Q": "What is the heat value of the cell corresponding to Pipeline and Safety in the heatmap?",
            "A": "The heat value is {0.76}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum heat value in the heatmap?",
            "A": "The global maximum heat value is {0.99}."
        },
        {
            "Q": "What is the global minimum heat value in the heatmap?",
            "A": "The global minimum heat value is {0.12}."
        },
        {
            "Q": "What is the maximum heat value for label Efficiency on the y-axis?",
            "A": "The maximum heat value for Efficiency on the y-axis is {0.99}."
        },
        {
            "Q": "What is the maximum heat value for label Cost on the y-axis?",
            "A": "The maximum heat value for Cost on the y-axis is {0.99}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average heat value for label Planning on the x-axis?",
            "A": "The average heat value for Planning on the x-axis is {0.81}."
        },
        {
            "Q": "What is the average heat value for label Maritime on the x-axis?",
            "A": "The average heat value for Maritime on the x-axis is {0.79}."
        }
    ],
    "NF": [],
    "NC": [
        {
            "Q": "Which has the higher heat value: the cell corresponding to Road and Capacity or the cell corresponding to Last Mile and Cost?",
            "A": "The cell corresponding to {Last Mile} and {Cost} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Tracking and Safety or the cell corresponding to Last Mile and Sustainability?",
            "A": "The cell corresponding to {Tracking} and {Safety} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Pipeline and Efficiency or the cell corresponding to Last Mile and Speed?",
            "A": "The cell corresponding to {Pipeline} and {Efficiency} has a higher heat value."
        },
        {
            "Q": "Which has the higher heat value: the cell corresponding to Last Mile and Labor or the cell corresponding to Pipeline and Reliability?",
            "A": "The cell corresponding to {Pipeline} and {Reliability} has a higher heat value."
        }
    ],
    "MSR": [
        {
            "Q": "In the heatmap, what are the row and column labels for all cells whose heat values fall within the range of 0.81 to 0.87?",
            "A": "The cells are: {(Road, Capacity), (Intermodal, Compliance), (Intermodal, Cost), (Road, Labor), (Last Mile, Reliability), (Maritime, Reliability), (Rail, Reliability)}."
        }
    ],
    "VA": []
}