{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {6} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Like or Comment stage positioned above or below the View Content stage?",
            "A": "The Like or Comment stage is positioned {below} the View Content stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {exponential} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Share Content?",
            "A": "The value of stage Share Content is {192}."
        },
        {
            "Q": "What is the value of stage Join Group or Community?",
            "A": "The value of stage Join Group or Community is {80}."
        },
        {
            "Q": "What is the value of stage View Content?",
            "A": "The value of stage View Content is {481}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is View Content, with a value of {481}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Content Creation or Upload, with a value of {70}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage View Content to stage Like or Comment?",
            "A": "Decreased by {167} Million Users from stage View Content to stage Like or Comment."
        },
        {
            "Q": "How much did it decrease from stage Follow Account to stage Join Group or Community?",
            "A": "Decreased by {61} Million Users from stage Follow Account to stage Join Group or Community."
        },
        {
            "Q": "How much did it decrease from stage Join Group or Community to stage Content Creation or Upload?",
            "A": "Decreased by {10} Million Users from stage Join Group or Community to stage Content Creation or Upload."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 253? Please list the stage labels and corresponding values.",
            "A": "The {View Content} stage has {481}, the {Like or Comment} stage has {314}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 75? Please list the stage labels and corresponding values.",
            "A": "The {Content Creation or Upload} stage has {70}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 110 and 253? Please list the stage labels and corresponding values.",
            "A": "The {Share Content} stage has {192}, the {Follow Account} stage has {141}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Share Content to Follow Account, or from stage Join Group or Community to Content Creation or Upload?",
            "A": "The reduction from stage {Share Content} to {Follow Account} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Follow Account to Join Group or Community, or from stage Like or Comment to Share Content?",
            "A": "The reduction from stage {Like or Comment} to {Share Content} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage View Content to Like or Comment, from stage Join Group or Community to Content Creation or Upload, or from stage Follow Account to Join Group or Community?",
            "A": "The reduction from stage {View Content} to stage {Like or Comment} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {View Content} and {Like or Comment} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Join Group or Community} and {Content Creation or Upload} stages."
        }
    ],
    "VA": []
}