{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {5} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the View Destination Info stage positioned above or below the Book Flight stage?",
            "A": "The View Destination Info stage is positioned {above} the Book Flight stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {logarithmic} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Search Travel Packages?",
            "A": "The value of stage Search Travel Packages is {774}."
        },
        {
            "Q": "What is the value of stage View Destination Info?",
            "A": "The value of stage View Destination Info is {1361}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is View Destination Info, with a value of {1361}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Make Reservation, with a value of {166}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Select Accommodation to stage Book Flight?",
            "A": "Decreased by {243} Thousand Tourists from stage Select Accommodation to stage Book Flight."
        },
        {
            "Q": "How much did it decrease from stage Book Flight to stage Make Reservation?",
            "A": "Decreased by {22} Thousand Tourists from stage Book Flight to stage Make Reservation."
        },
        {
            "Q": "How much did it decrease from stage View Destination Info to stage Search Travel Packages?",
            "A": "Decreased by {587} Thousand Tourists from stage View Destination Info to stage Search Travel Packages."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 309? Please list the stage labels and corresponding values.",
            "A": "The {View Destination Info} stage has {1361}, the {Search Travel Packages} stage has {774}, the {Select Accommodation} stage has {431}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 177? Please list the stage labels and corresponding values.",
            "A": "The {Make Reservation} stage has {166}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 309 and 602? Please list the stage labels and corresponding values.",
            "A": "The {Select Accommodation} stage has {431}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Book Flight to Make Reservation, or from stage View Destination Info to Search Travel Packages?",
            "A": "The reduction from stage {View Destination Info} to {Search Travel Packages} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Search Travel Packages to Select Accommodation, from stage Book Flight to Make Reservation, or from stage View Destination Info to Search Travel Packages?",
            "A": "The reduction from stage {View Destination Info} to stage {Search Travel Packages} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {View Destination Info} and {Search Travel Packages} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Book Flight} and {Make Reservation} stages."
        }
    ],
    "VA": []
}