{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {6} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Make Reservation stage positioned above or below the Book Flight stage?",
            "A": "The Make Reservation stage is positioned {below} the Book Flight stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {linear} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Travel to Destination?",
            "A": "The value of stage Travel to Destination is {1088}."
        },
        {
            "Q": "What is the value of stage Make Reservation?",
            "A": "The value of stage Make Reservation is {1540}."
        },
        {
            "Q": "What is the value of stage Leave Review?",
            "A": "The value of stage Leave Review is {286}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Select Accommodation, with a value of {2410}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Leave Review, with a value of {286}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Make Reservation to stage Travel to Destination?",
            "A": "Decreased by {452} Thousand Tourists from stage Make Reservation to stage Travel to Destination."
        },
        {
            "Q": "How much did it decrease from stage Book Flight to stage Make Reservation?",
            "A": "Decreased by {450} Thousand Tourists from stage Book Flight to stage Make Reservation."
        },
        {
            "Q": "How much did it decrease from stage Travel to Destination to stage Check-in at Hotel?",
            "A": "Decreased by {424} Thousand Tourists from stage Travel to Destination to stage Check-in at Hotel."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 2200? Please list the stage labels and corresponding values.",
            "A": "The {Select Accommodation} stage has {2410}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 876? Please list the stage labels and corresponding values.",
            "A": "The {Check-in at Hotel} stage has {664}, the {Leave Review} stage has {286}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 876 and 1314? Please list the stage labels and corresponding values.",
            "A": "The {Travel to Destination} stage has {1088}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Book Flight to Make Reservation, or from stage Travel to Destination to Check-in at Hotel?",
            "A": "The reduction from stage {Book Flight} to {Make Reservation} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Book Flight to Make Reservation, from stage Travel to Destination to Check-in at Hotel, or from stage Make Reservation to Travel to Destination?",
            "A": "The reduction from stage {Make Reservation} to stage {Travel to Destination} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Make Reservation} and {Travel to Destination} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Check-in at Hotel} and {Leave Review} stages."
        }
    ],
    "VA": []
}