{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {7} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Initial Contact stage positioned above or below the Proposal Sent stage?",
            "A": "The Initial Contact stage is positioned {above} the Proposal Sent stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {logarithmic} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Lead Captured?",
            "A": "The value of stage Lead Captured is {1060}."
        },
        {
            "Q": "What is the value of stage Negotiation?",
            "A": "The value of stage Negotiation is {210}."
        },
        {
            "Q": "What is the value of stage Needs Analysis?",
            "A": "The value of stage Needs Analysis is {461}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Lead Captured, with a value of {1060}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Client Onboarded, with a value of {179}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Negotiation to stage Contract Signed?",
            "A": "Decreased by {0} Clients from stage Negotiation to stage Contract Signed."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 871? Please list the stage labels and corresponding values.",
            "A": "The {Lead Captured} stage has {1060}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 257? Please list the stage labels and corresponding values.",
            "A": "The {Negotiation} stage has {210}, the {Contract Signed} stage has {210}, the {Client Onboarded} stage has {179}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 210 and 571? Please list the stage labels and corresponding values.",
            "A": "The {Needs Analysis} stage has {461}, the {Proposal Sent} stage has {304}, the {Negotiation} stage has {210}, the {Contract Signed} stage has {210}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Contract Signed to Client Onboarded, or from stage Initial Contact to Needs Analysis?",
            "A": "The reduction from stage {Initial Contact} to {Needs Analysis} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Negotiation to Contract Signed, from stage Proposal Sent to Negotiation, or from stage Contract Signed to Client Onboarded?",
            "A": "The reduction from stage {Proposal Sent} to stage {Negotiation} is the greatest."
        },
        {
            "Q": "Which reduction is the greatest: from stage Initial Contact to Needs Analysis, from stage Lead Captured to Initial Contact, or from stage Needs Analysis to Proposal Sent?",
            "A": "The reduction from stage {Lead Captured} to stage {Initial Contact} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Lead Captured} and {Initial Contact} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Negotiation} and {Contract Signed} stages."
        }
    ],
    "VA": []
}