{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {7} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Displayed in Exhibition stage positioned above or below the Approved for Exhibition stage?",
            "A": "The Displayed in Exhibition stage is positioned {below} the Approved for Exhibition stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {exponential} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Approved for Exhibition?",
            "A": "The value of stage Approved for Exhibition is {66%}."
        },
        {
            "Q": "What is the value of stage Eligible for Acquisition?",
            "A": "The value of stage Eligible for Acquisition is {23%}."
        },
        {
            "Q": "What is the value of stage Submitted for Review?",
            "A": "The value of stage Submitted for Review is {74%}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Artworks Created, with a value of {100%}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Institutionally Acquired, with a value of {19%}."
        }
    ],
    "SC": [
        {
            "Q": "What is the percentage reduction from stage Artworks Created to stage Submitted for Review?",
            "A": "The percentage reduction from stage Artworks Created to stage Submitted for Review is {26%}."
        },
        {
            "Q": "What is the percentage reduction from stage Approved for Exhibition to stage Displayed in Exhibition?",
            "A": "The percentage reduction from stage Approved for Exhibition to stage Displayed in Exhibition is {20%}."
        },
        {
            "Q": "What is the percentage reduction from stage Shortlisted for Acquisition to stage Eligible for Acquisition?",
            "A": "The percentage reduction from stage Shortlisted for Acquisition to stage Eligible for Acquisition is {16%}."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 70%? Please list the stage labels and corresponding values.",
            "A": "The {Artworks Created} stage has {100%}, the {Submitted for Review} stage has {74%}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 21%? Please list the stage labels and corresponding values.",
            "A": "The {Institutionally Acquired} stage has {19%}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 31% and 70%? Please list the stage labels and corresponding values.",
            "A": "The {Approved for Exhibition} stage has {66%}, the {Displayed in Exhibition} stage has {46%}, the {Shortlisted for Acquisition} stage has {39%}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Approved for Exhibition to Displayed in Exhibition, or from stage Eligible for Acquisition to Institutionally Acquired?",
            "A": "The reduction from stage {Approved for Exhibition} to {Displayed in Exhibition} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Displayed in Exhibition to Shortlisted for Acquisition, or from stage Artworks Created to Submitted for Review?",
            "A": "The reduction from stage {Artworks Created} to {Submitted for Review} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Approved for Exhibition to Displayed in Exhibition, from stage Displayed in Exhibition to Shortlisted for Acquisition, or from stage Shortlisted for Acquisition to Eligible for Acquisition?",
            "A": "The reduction from stage {Approved for Exhibition} to stage {Displayed in Exhibition} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Artworks Created} and {Submitted for Review} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Eligible for Acquisition} and {Institutionally Acquired} stages."
        }
    ],
    "VA": []
}