{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {6} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Register Courses stage positioned above or below the Earn a certificate stage?",
            "A": "The Register Courses stage is positioned {above} the Earn a certificate stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {logarithmic} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Register Courses?",
            "A": "The value of stage Register Courses is {61%}."
        },
        {
            "Q": "What is the value of stage Pass the final test?",
            "A": "The value of stage Pass the final test is {20%}."
        },
        {
            "Q": "What is the value of stage Register Learning Platform?",
            "A": "The value of stage Register Learning Platform is {100%}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Register Learning Platform, with a value of {100%}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Earn a certificate, with a value of {16%}."
        }
    ],
    "SC": [
        {
            "Q": "What is the percentage reduction from stage Register Learning Platform to stage Register Courses?",
            "A": "The percentage reduction from stage Register Learning Platform to stage Register Courses is {39%}."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 49%? Please list the stage labels and corresponding values.",
            "A": "The {Register Learning Platform} stage has {100%}, the {Register Courses} stage has {61%}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 30%? Please list the stage labels and corresponding values.",
            "A": "The {Complete the assignment} stage has {22%}, the {Pass the final test} stage has {20%}, the {Earn a certificate} stage has {16%}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 18% and 49%? Please list the stage labels and corresponding values.",
            "A": "The {Complete the first lesson} stage has {38%}, the {Complete the assignment} stage has {22%}, the {Pass the final test} stage has {20%}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Register Courses to Complete the first lesson, or from stage Register Learning Platform to Register Courses?",
            "A": "The reduction from stage {Register Learning Platform} to {Register Courses} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Complete the assignment to Pass the final test, from stage Complete the first lesson to Complete the assignment, or from stage Register Courses to Complete the first lesson?",
            "A": "The reduction from stage {Register Courses} to stage {Complete the first lesson} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Register Learning Platform} and {Register Courses} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Complete the assignment} and {Pass the final test} stages."
        }
    ],
    "VA": []
}