{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {6} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Total Energy Generated stage positioned above or below the Post-Generation stage?",
            "A": "The Total Energy Generated stage is positioned {above} the Post-Generation stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {logarithmic} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Post-Generation?",
            "A": "The value of stage Post-Generation is {40583}."
        },
        {
            "Q": "What is the value of stage Post-Distribution?",
            "A": "The value of stage Post-Distribution is {15003}."
        },
        {
            "Q": "What is the value of stage Total Energy Generated?",
            "A": "The value of stage Total Energy Generated is {66189}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Total Energy Generated, with a value of {66189}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Billed Consumption, with a value of {12748}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Delivered to End Users to stage Billed Consumption?",
            "A": "Decreased by {2255} Megawatt Hours from stage Delivered to End Users to stage Billed Consumption."
        },
        {
            "Q": "How much did it decrease from stage Post-Distribution to stage Delivered to End Users?",
            "A": "Decreased by {0} Megawatt Hours from stage Post-Distribution to stage Delivered to End Users."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 53386? Please list the stage labels and corresponding values.",
            "A": "The {Total Energy Generated} stage has {66189}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 13875? Please list the stage labels and corresponding values.",
            "A": "The {Billed Consumption} stage has {12748}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 13875 and 33094? Please list the stage labels and corresponding values.",
            "A": "The {Post-Transmission} stage has {25605}, the {Post-Distribution} stage has {15003}, the {Delivered to End Users} stage has {15003}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Post-Transmission to Post-Distribution, or from stage Post-Generation to Post-Transmission?",
            "A": "The reduction from stage {Post-Generation} to {Post-Transmission} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Post-Transmission to Post-Distribution, or from stage Total Energy Generated to Post-Generation?",
            "A": "The reduction from stage {Total Energy Generated} to {Post-Generation} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Post-Generation to Post-Transmission, from stage Post-Distribution to Delivered to End Users, or from stage Post-Transmission to Post-Distribution?",
            "A": "The reduction from stage {Post-Generation} to stage {Post-Transmission} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Total Energy Generated} and {Post-Generation} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Post-Distribution} and {Delivered to End Users} stages."
        }
    ],
    "VA": []
}