{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {7} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Total Energy Generated stage positioned above or below the Billed Consumption stage?",
            "A": "The Total Energy Generated stage is positioned {above} the Billed Consumption stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {linear} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Post-Generation?",
            "A": "The value of stage Post-Generation is {68096}."
        },
        {
            "Q": "What is the value of stage Billed Consumption?",
            "A": "The value of stage Billed Consumption is {23387}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Total Energy Generated, with a value of {79638}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Paid Consumption, with a value of {14116}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Total Energy Generated to stage Post-Generation?",
            "A": "Decreased by {11542} Megawatt Hours from stage Total Energy Generated to stage Post-Generation."
        },
        {
            "Q": "How much did it decrease from stage Billed Consumption to stage Paid Consumption?",
            "A": "Decreased by {9271} Megawatt Hours from stage Billed Consumption to stage Paid Consumption."
        },
        {
            "Q": "How much did it decrease from stage Delivered to End Users to stage Billed Consumption?",
            "A": "Decreased by {11862} Megawatt Hours from stage Delivered to End Users to stage Billed Consumption."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 62429? Please list the stage labels and corresponding values.",
            "A": "The {Total Energy Generated} stage has {79638}, the {Post-Generation} stage has {68096}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 29318? Please list the stage labels and corresponding values.",
            "A": "The {Billed Consumption} stage has {23387}, the {Paid Consumption} stage has {14116}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 40756 and 51513? Please list the stage labels and corresponding values.",
            "A": "The {Post-Distribution} stage has {46264}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Billed Consumption to Paid Consumption, or from stage Post-Distribution to Delivered to End Users?",
            "A": "The reduction from stage {Post-Distribution} to {Delivered to End Users} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Delivered to End Users to Billed Consumption, from stage Post-Generation to Post-Transmission, or from stage Post-Distribution to Delivered to End Users?",
            "A": "The reduction from stage {Delivered to End Users} to stage {Billed Consumption} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Delivered to End Users} and {Billed Consumption} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Billed Consumption} and {Paid Consumption} stages."
        }
    ],
    "VA": []
}