{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {6} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Paid Consumption stage positioned above or below the Post-Transmission stage?",
            "A": "The Paid Consumption stage is positioned {below} the Post-Transmission stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {logarithmic} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Post-Distribution?",
            "A": "The value of stage Post-Distribution is {37753}."
        },
        {
            "Q": "What is the value of stage Billed Consumption?",
            "A": "The value of stage Billed Consumption is {10771}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Post-Generation, with a value of {97592}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Paid Consumption, with a value of {8944}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Post-Transmission to stage Post-Distribution?",
            "A": "Decreased by {22085} Megawatt Hours from stage Post-Transmission to stage Post-Distribution."
        },
        {
            "Q": "How much did it decrease from stage Post-Generation to stage Post-Transmission?",
            "A": "Decreased by {37754} Megawatt Hours from stage Post-Generation to stage Post-Transmission."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 78715? Please list the stage labels and corresponding values.",
            "A": "The {Post-Generation} stage has {97592}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 16427? Please list the stage labels and corresponding values.",
            "A": "The {Billed Consumption} stage has {10771}, the {Paid Consumption} stage has {8944}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 16427 and 48795? Please list the stage labels and corresponding values.",
            "A": "The {Post-Distribution} stage has {37753}, the {Delivered to End Users} stage has {22084}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Billed Consumption to Paid Consumption, or from stage Post-Distribution to Delivered to End Users?",
            "A": "The reduction from stage {Post-Distribution} to {Delivered to End Users} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Post-Transmission to Post-Distribution, from stage Post-Distribution to Delivered to End Users, or from stage Delivered to End Users to Billed Consumption?",
            "A": "The reduction from stage {Post-Transmission} to stage {Post-Distribution} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Post-Generation} and {Post-Transmission} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Billed Consumption} and {Paid Consumption} stages."
        }
    ],
    "VA": []
}