{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {6} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Repeat Purchase stage positioned above or below the Retail Placement stage?",
            "A": "The Repeat Purchase stage is positioned {below} the Retail Placement stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {exponential} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Customer Purchase?",
            "A": "The value of stage Customer Purchase is {489}."
        },
        {
            "Q": "What is the value of stage Retail Placement?",
            "A": "The value of stage Retail Placement is {706}."
        },
        {
            "Q": "What is the value of stage Launch in Market?",
            "A": "The value of stage Launch in Market is {990}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Taste Testing, with a value of {1486}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Repeat Purchase, with a value of {431}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Customer Purchase to stage Repeat Purchase?",
            "A": "Decreased by {58} Thousand Bottles from stage Customer Purchase to stage Repeat Purchase."
        },
        {
            "Q": "How much did it decrease from stage Retail Placement to stage In-Store Promotion?",
            "A": "Decreased by {70} Thousand Bottles from stage Retail Placement to stage In-Store Promotion."
        },
        {
            "Q": "How much did it decrease from stage In-Store Promotion to stage Customer Purchase?",
            "A": "Decreased by {147} Thousand Bottles from stage In-Store Promotion to stage Customer Purchase."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 671? Please list the stage labels and corresponding values.",
            "A": "The {Taste Testing} stage has {1486}, the {Launch in Market} stage has {990}, the {Retail Placement} stage has {706}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 460? Please list the stage labels and corresponding values.",
            "A": "The {Repeat Purchase} stage has {431}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 562 and 671? Please list the stage labels and corresponding values.",
            "A": "The {In-Store Promotion} stage has {636}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage In-Store Promotion to Customer Purchase, or from stage Taste Testing to Launch in Market?",
            "A": "The reduction from stage {Taste Testing} to {Launch in Market} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage In-Store Promotion to Customer Purchase, or from stage Launch in Market to Retail Placement?",
            "A": "The reduction from stage {Launch in Market} to {Retail Placement} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Retail Placement to In-Store Promotion, from stage Taste Testing to Launch in Market, or from stage Customer Purchase to Repeat Purchase?",
            "A": "The reduction from stage {Taste Testing} to stage {Launch in Market} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Taste Testing} and {Launch in Market} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Customer Purchase} and {Repeat Purchase} stages."
        }
    ],
    "VA": []
}