{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {7} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Post-Harvest stage positioned above or below the Total Harvested Crop stage?",
            "A": "The Post-Harvest stage is positioned {below} the Total Harvested Crop stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {logarithmic} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Delivered to Retail?",
            "A": "The value of stage Delivered to Retail is {2541}."
        },
        {
            "Q": "What is the value of stage Purchased by Consumers?",
            "A": "The value of stage Purchased by Consumers is {2033}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Total Harvested Crop, with a value of {13364}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Purchased by Consumers, with a value of {2033}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Packaged for Distribution to stage Delivered to Retail?",
            "A": "Decreased by {0} Tons from stage Packaged for Distribution to stage Delivered to Retail."
        },
        {
            "Q": "How much did it decrease from stage Filtered by Quality Inspection to stage Packaged for Distribution?",
            "A": "Decreased by {1302} Tons from stage Filtered by Quality Inspection to stage Packaged for Distribution."
        },
        {
            "Q": "How much did it decrease from stage Total Harvested Crop to stage Post-Harvest?",
            "A": "Decreased by {4761} Tons from stage Total Harvested Crop to stage Post-Harvest."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 7211? Please list the stage labels and corresponding values.",
            "A": "The {Total Harvested Crop} stage has {13364}, the {Post-Harvest} stage has {8603}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 3192? Please list the stage labels and corresponding values.",
            "A": "The {Packaged for Distribution} stage has {2541}, the {Delivered to Retail} stage has {2541}, the {Purchased by Consumers} stage has {2033}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 2541 and 4831? Please list the stage labels and corresponding values.",
            "A": "The {Filtered by Quality Inspection} stage has {3843}, the {Packaged for Distribution} stage has {2541}, the {Delivered to Retail} stage has {2541}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Total Harvested Crop to Post-Harvest, or from stage Post-Processing to Filtered by Quality Inspection?",
            "A": "The reduction from stage {Total Harvested Crop} to {Post-Harvest} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Packaged for Distribution to Delivered to Retail, or from stage Post-Processing to Filtered by Quality Inspection?",
            "A": "The reduction from stage {Post-Processing} to {Filtered by Quality Inspection} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Delivered to Retail to Purchased by Consumers, from stage Post-Processing to Filtered by Quality Inspection, or from stage Total Harvested Crop to Post-Harvest?",
            "A": "The reduction from stage {Total Harvested Crop} to stage {Post-Harvest} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Total Harvested Crop} and {Post-Harvest} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Packaged for Distribution} and {Delivered to Retail} stages."
        }
    ],
    "VA": []
}