{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {4} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Treatment Initiated stage positioned above or below the Treatment Completed stage?",
            "A": "The Treatment Initiated stage is positioned {above} the Treatment Completed stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {logarithmic} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Treatment Initiated?",
            "A": "The value of stage Treatment Initiated is {467}."
        },
        {
            "Q": "What is the value of stage Treatment Completed?",
            "A": "The value of stage Treatment Completed is {416}."
        },
        {
            "Q": "What is the value of stage Treatment Recommended?",
            "A": "The value of stage Treatment Recommended is {1126}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Diagnosis Confirmed, with a value of {2252}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Treatment Completed, with a value of {416}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Treatment Initiated to stage Treatment Completed?",
            "A": "Decreased by {51} Patients from stage Treatment Initiated to stage Treatment Completed."
        },
        {
            "Q": "How much did it decrease from stage Diagnosis Confirmed to stage Treatment Recommended?",
            "A": "Decreased by {1126} Patients from stage Diagnosis Confirmed to stage Treatment Recommended."
        },
        {
            "Q": "How much did it decrease from stage Treatment Recommended to stage Treatment Initiated?",
            "A": "Decreased by {659} Patients from stage Treatment Recommended to stage Treatment Initiated."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 441? Please list the stage labels and corresponding values.",
            "A": "The {Diagnosis Confirmed} stage has {2252}, the {Treatment Recommended} stage has {1126}, the {Treatment Initiated} stage has {467}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 1689? Please list the stage labels and corresponding values.",
            "A": "The {Treatment Recommended} stage has {1126}, the {Treatment Initiated} stage has {467}, the {Treatment Completed} stage has {416}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 441 and 796? Please list the stage labels and corresponding values.",
            "A": "The {Treatment Initiated} stage has {467}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Treatment Recommended to Treatment Initiated, or from stage Treatment Initiated to Treatment Completed?",
            "A": "The reduction from stage {Treatment Recommended} to {Treatment Initiated} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Treatment Recommended to Treatment Initiated, or from stage Diagnosis Confirmed to Treatment Recommended?",
            "A": "The reduction from stage {Diagnosis Confirmed} to {Treatment Recommended} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Treatment Recommended to Treatment Initiated, from stage Treatment Initiated to Treatment Completed, or from stage Diagnosis Confirmed to Treatment Recommended?",
            "A": "The reduction from stage {Diagnosis Confirmed} to stage {Treatment Recommended} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Diagnosis Confirmed} and {Treatment Recommended} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Treatment Initiated} and {Treatment Completed} stages."
        }
    ],
    "VA": []
}