{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {6} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Initial Consultation stage positioned above or below the Treatment Recommended stage?",
            "A": "The Initial Consultation stage is positioned {above} the Treatment Recommended stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {linear} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Treatment Recommended?",
            "A": "The value of stage Treatment Recommended is {609}."
        },
        {
            "Q": "What is the value of stage Diagnostic Testing?",
            "A": "The value of stage Diagnostic Testing is {1106}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Initial Consultation, with a value of {1325}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Treatment Completed, with a value of {199}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Initial Consultation to stage Diagnostic Testing?",
            "A": "Decreased by {219} Patients from stage Initial Consultation to stage Diagnostic Testing."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 1215? Please list the stage labels and corresponding values.",
            "A": "The {Initial Consultation} stage has {1325}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 735? Please list the stage labels and corresponding values.",
            "A": "The {Treatment Recommended} stage has {609}, the {Treatment Initiated} stage has {389}, the {Treatment Completed} stage has {199}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 499 and 735? Please list the stage labels and corresponding values.",
            "A": "The {Treatment Recommended} stage has {609}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Initial Consultation to Diagnostic Testing, or from stage Treatment Recommended to Treatment Initiated?",
            "A": "The reduction from stage {Treatment Recommended} to {Treatment Initiated} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Treatment Initiated to Treatment Completed, or from stage Treatment Recommended to Treatment Initiated?",
            "A": "The reduction from stage {Treatment Recommended} to {Treatment Initiated} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Treatment Initiated to Treatment Completed, from stage Diagnostic Testing to Diagnosis Confirmed, or from stage Diagnosis Confirmed to Treatment Recommended?",
            "A": "The reduction from stage {Diagnosis Confirmed} to stage {Treatment Recommended} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Diagnosis Confirmed} and {Treatment Recommended} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Treatment Initiated} and {Treatment Completed} stages."
        }
    ],
    "VA": []
}