{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {7} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Treatment Completed stage positioned above or below the Initial Consultation stage?",
            "A": "The Treatment Completed stage is positioned {below} the Initial Consultation stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {exponential} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Treatment Completed?",
            "A": "The value of stage Treatment Completed is {601}."
        },
        {
            "Q": "What is the value of stage Treatment Initiated?",
            "A": "The value of stage Treatment Initiated is {739}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Initial Consultation, with a value of {2059}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Post-Treatment Assessment, with a value of {523}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Diagnostic Testing to stage Diagnosis Confirmed?",
            "A": "Decreased by {409} Patients from stage Diagnostic Testing to stage Diagnosis Confirmed."
        },
        {
            "Q": "How much did it decrease from stage Treatment Recommended to stage Treatment Initiated?",
            "A": "Decreased by {265} Patients from stage Treatment Recommended to stage Treatment Initiated."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 1135? Please list the stage labels and corresponding values.",
            "A": "The {Initial Consultation} stage has {2059}, the {Diagnostic Testing} stage has {1676}, the {Diagnosis Confirmed} stage has {1267}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 562? Please list the stage labels and corresponding values.",
            "A": "The {Post-Treatment Assessment} stage has {523}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 670 and 1135? Please list the stage labels and corresponding values.",
            "A": "The {Treatment Recommended} stage has {1004}, the {Treatment Initiated} stage has {739}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Diagnostic Testing to Diagnosis Confirmed, or from stage Treatment Recommended to Treatment Initiated?",
            "A": "The reduction from stage {Diagnostic Testing} to {Diagnosis Confirmed} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Treatment Completed to Post-Treatment Assessment, or from stage Treatment Initiated to Treatment Completed?",
            "A": "The reduction from stage {Treatment Initiated} to {Treatment Completed} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Diagnostic Testing to Diagnosis Confirmed, from stage Treatment Initiated to Treatment Completed, or from stage Diagnosis Confirmed to Treatment Recommended?",
            "A": "The reduction from stage {Diagnostic Testing} to stage {Diagnosis Confirmed} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Diagnostic Testing} and {Diagnosis Confirmed} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Treatment Completed} and {Post-Treatment Assessment} stages."
        }
    ],
    "VA": []
}