{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {4} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Filtered by Quality Inspection stage positioned above or below the Purchased by Consumers stage?",
            "A": "The Filtered by Quality Inspection stage is positioned {above} the Purchased by Consumers stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {logarithmic} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Filtered by Quality Inspection?",
            "A": "The value of stage Filtered by Quality Inspection is {10952}."
        },
        {
            "Q": "What is the value of stage Packaged for Distribution?",
            "A": "The value of stage Packaged for Distribution is {5476}."
        },
        {
            "Q": "What is the value of stage Purchased by Consumers?",
            "A": "The value of stage Purchased by Consumers is {1826}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Filtered by Quality Inspection, with a value of {10952}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Purchased by Consumers, with a value of {1826}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Filtered by Quality Inspection to stage Packaged for Distribution?",
            "A": "Decreased by {5476} Tons from stage Filtered by Quality Inspection to stage Packaged for Distribution."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 8214? Please list the stage labels and corresponding values.",
            "A": "The {Filtered by Quality Inspection} stage has {10952}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 2049? Please list the stage labels and corresponding values.",
            "A": "The {Purchased by Consumers} stage has {1826}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 2049 and 8214? Please list the stage labels and corresponding values.",
            "A": "The {Packaged for Distribution} stage has {5476}, the {Delivered to Retail} stage has {2272}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Packaged for Distribution to Delivered to Retail, or from stage Delivered to Retail to Purchased by Consumers?",
            "A": "The reduction from stage {Packaged for Distribution} to {Delivered to Retail} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Filtered by Quality Inspection to Packaged for Distribution, from stage Delivered to Retail to Purchased by Consumers, or from stage Packaged for Distribution to Delivered to Retail?",
            "A": "The reduction from stage {Filtered by Quality Inspection} to stage {Packaged for Distribution} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Filtered by Quality Inspection} and {Packaged for Distribution} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Delivered to Retail} and {Purchased by Consumers} stages."
        }
    ],
    "VA": []
}