{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {4} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Technical Interview stage positioned above or below the Offer Extended stage?",
            "A": "The Technical Interview stage is positioned {above} the Offer Extended stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {linear} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage HR Interview?",
            "A": "The value of stage HR Interview is {100%}."
        },
        {
            "Q": "What is the value of stage Offer Accepted?",
            "A": "The value of stage Offer Accepted is {22%}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is HR Interview, with a value of {100%}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Offer Accepted, with a value of {22%}."
        }
    ],
    "SC": [
        {
            "Q": "What is the percentage reduction from stage HR Interview to stage Technical Interview?",
            "A": "The percentage reduction from stage HR Interview to stage Technical Interview is {26%}."
        },
        {
            "Q": "What is the percentage reduction from stage Technical Interview to stage Offer Extended?",
            "A": "The percentage reduction from stage Technical Interview to stage Offer Extended is {28%}."
        },
        {
            "Q": "What is the percentage reduction from stage Offer Extended to stage Offer Accepted?",
            "A": "The percentage reduction from stage Offer Extended to stage Offer Accepted is {24%}."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 34%? Please list the stage labels and corresponding values.",
            "A": "The {HR Interview} stage has {100%}, the {Technical Interview} stage has {74%}, the {Offer Extended} stage has {46%}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 34%? Please list the stage labels and corresponding values.",
            "A": "The {Offer Accepted} stage has {22%}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 11% and 87%? Please list the stage labels and corresponding values.",
            "A": "The {Technical Interview} stage has {74%}, the {Offer Extended} stage has {46%}, the {Offer Accepted} stage has {22%}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Technical Interview to Offer Extended, or from stage Offer Extended to Offer Accepted?",
            "A": "The reduction from stage {Technical Interview} to {Offer Extended} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage HR Interview to Technical Interview, or from stage Technical Interview to Offer Extended?",
            "A": "The reduction from stage {Technical Interview} to {Offer Extended} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage HR Interview to Technical Interview, from stage Technical Interview to Offer Extended, or from stage Offer Extended to Offer Accepted?",
            "A": "The reduction from stage {Technical Interview} to stage {Offer Extended} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Technical Interview} and {Offer Extended} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Offer Extended} and {Offer Accepted} stages."
        }
    ],
    "VA": []
}