{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {4} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Contract Signed stage positioned above or below the Negotiation stage?",
            "A": "The Contract Signed stage is positioned {below} the Negotiation stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {linear} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Negotiation?",
            "A": "The value of stage Negotiation is {639}."
        },
        {
            "Q": "What is the value of stage Sale Closed?",
            "A": "The value of stage Sale Closed is {278}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Negotiation, with a value of {639}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Post-sale Survey, with a value of {127}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Sale Closed to stage Post-sale Survey?",
            "A": "Decreased by {151} Properties from stage Sale Closed to stage Post-sale Survey."
        },
        {
            "Q": "How much did it decrease from stage Negotiation to stage Contract Signed?",
            "A": "Decreased by {190} Properties from stage Negotiation to stage Contract Signed."
        },
        {
            "Q": "How much did it decrease from stage Contract Signed to stage Sale Closed?",
            "A": "Decreased by {171} Properties from stage Contract Signed to stage Sale Closed."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 202? Please list the stage labels and corresponding values.",
            "A": "The {Negotiation} stage has {639}, the {Contract Signed} stage has {449}, the {Sale Closed} stage has {278}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 202? Please list the stage labels and corresponding values.",
            "A": "The {Post-sale Survey} stage has {127}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 63 and 544? Please list the stage labels and corresponding values.",
            "A": "The {Contract Signed} stage has {449}, the {Sale Closed} stage has {278}, the {Post-sale Survey} stage has {127}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Sale Closed to Post-sale Survey, or from stage Negotiation to Contract Signed?",
            "A": "The reduction from stage {Negotiation} to {Contract Signed} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Sale Closed to Post-sale Survey, from stage Contract Signed to Sale Closed, or from stage Negotiation to Contract Signed?",
            "A": "The reduction from stage {Negotiation} to stage {Contract Signed} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Negotiation} and {Contract Signed} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Sale Closed} and {Post-sale Survey} stages."
        }
    ],
    "VA": []
}