{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {7} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Add to Cart stage positioned above or below the Visit Product Page stage?",
            "A": "The Add to Cart stage is positioned {below} the Visit Product Page stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {exponential} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Initiate Checkout?",
            "A": "The value of stage Initiate Checkout is {2361}."
        },
        {
            "Q": "What is the value of stage Visit Product Page?",
            "A": "The value of stage Visit Product Page is {6232}."
        },
        {
            "Q": "What is the value of stage Enter Payment Information?",
            "A": "The value of stage Enter Payment Information is {2360}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Visit Product Page, with a value of {6232}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Leave Product Review, with a value of {1246}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Add to Wishlist to stage Add to Cart?",
            "A": "Decreased by {715} Users from stage Add to Wishlist to stage Add to Cart."
        },
        {
            "Q": "How much did it decrease from stage Visit Product Page to stage Add to Wishlist?",
            "A": "Decreased by {1762} Users from stage Visit Product Page to stage Add to Wishlist."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 3058? Please list the stage labels and corresponding values.",
            "A": "The {Visit Product Page} stage has {6232}, the {Add to Wishlist} stage has {4470}, the {Add to Cart} stage has {3755}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 2360? Please list the stage labels and corresponding values.",
            "A": "The {Complete Purchase} stage has {1414}, the {Leave Product Review} stage has {1246}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 2360 and 3058? Please list the stage labels and corresponding values.",
            "A": "The {Initiate Checkout} stage has {2361}, the {Enter Payment Information} stage has {2360}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Enter Payment Information to Complete Purchase, or from stage Add to Cart to Initiate Checkout?",
            "A": "The reduction from stage {Add to Cart} to {Initiate Checkout} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Visit Product Page to Add to Wishlist, or from stage Enter Payment Information to Complete Purchase?",
            "A": "The reduction from stage {Visit Product Page} to {Add to Wishlist} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Visit Product Page to Add to Wishlist, from stage Enter Payment Information to Complete Purchase, or from stage Add to Cart to Initiate Checkout?",
            "A": "The reduction from stage {Visit Product Page} to stage {Add to Wishlist} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Visit Product Page} and {Add to Wishlist} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Initiate Checkout} and {Enter Payment Information} stages."
        }
    ],
    "VA": []
}