{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {5} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Add to Cart stage positioned above or below the Enter Payment Information stage?",
            "A": "The Add to Cart stage is positioned {above} the Enter Payment Information stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {exponential} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Add to Cart?",
            "A": "The value of stage Add to Cart is {11304}."
        },
        {
            "Q": "What is the value of stage Complete Purchase?",
            "A": "The value of stage Complete Purchase is {4565}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Add to Wishlist, with a value of {18490}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Complete Purchase, with a value of {4565}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Enter Payment Information to stage Complete Purchase?",
            "A": "Decreased by {548} Users from stage Enter Payment Information to stage Complete Purchase."
        },
        {
            "Q": "How much did it decrease from stage Initiate Checkout to stage Enter Payment Information?",
            "A": "Decreased by {1590} Users from stage Initiate Checkout to stage Enter Payment Information."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 9003? Please list the stage labels and corresponding values.",
            "A": "The {Add to Wishlist} stage has {18490}, the {Add to Cart} stage has {11304}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 4839? Please list the stage labels and corresponding values.",
            "A": "The {Complete Purchase} stage has {4565}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 4839 and 9003? Please list the stage labels and corresponding values.",
            "A": "The {Initiate Checkout} stage has {6703}, the {Enter Payment Information} stage has {5113}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Initiate Checkout to Enter Payment Information, or from stage Add to Cart to Initiate Checkout?",
            "A": "The reduction from stage {Add to Cart} to {Initiate Checkout} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Add to Wishlist to Add to Cart, or from stage Initiate Checkout to Enter Payment Information?",
            "A": "The reduction from stage {Add to Wishlist} to {Add to Cart} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Add to Cart to Initiate Checkout, from stage Enter Payment Information to Complete Purchase, or from stage Add to Wishlist to Add to Cart?",
            "A": "The reduction from stage {Add to Wishlist} to stage {Add to Cart} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Add to Wishlist} and {Add to Cart} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Enter Payment Information} and {Complete Purchase} stages."
        }
    ],
    "VA": []
}