{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {7} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the Enter Payment Information stage positioned above or below the Complete Purchase stage?",
            "A": "The Enter Payment Information stage is positioned {above} the Complete Purchase stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {exponential} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Add to Cart?",
            "A": "The value of stage Add to Cart is {8163}."
        },
        {
            "Q": "What is the value of stage Leave Product Review?",
            "A": "The value of stage Leave Product Review is {3160}."
        },
        {
            "Q": "What is the value of stage Enter Payment Information?",
            "A": "The value of stage Enter Payment Information is {3967}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is Visit Product Page, with a value of {13590}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Leave Product Review, with a value of {3160}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Add to Cart to stage Initiate Checkout?",
            "A": "Decreased by {2470} Users from stage Add to Cart to stage Initiate Checkout."
        },
        {
            "Q": "How much did it decrease from stage Add to Wishlist to stage Add to Cart?",
            "A": "Decreased by {1952} Users from stage Add to Wishlist to stage Add to Cart."
        },
        {
            "Q": "How much did it decrease from stage Enter Payment Information to stage Complete Purchase?",
            "A": "Decreased by {99} Users from stage Enter Payment Information to stage Complete Purchase."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 9139? Please list the stage labels and corresponding values.",
            "A": "The {Visit Product Page} stage has {13590}, the {Add to Wishlist} stage has {10115}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 4830? Please list the stage labels and corresponding values.",
            "A": "The {Enter Payment Information} stage has {3967}, the {Complete Purchase} stage has {3868}, the {Leave Product Review} stage has {3160}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 4830 and 6928? Please list the stage labels and corresponding values.",
            "A": "The {Initiate Checkout} stage has {5693}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Initiate Checkout to Enter Payment Information, or from stage Enter Payment Information to Complete Purchase?",
            "A": "The reduction from stage {Initiate Checkout} to {Enter Payment Information} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Add to Cart to Initiate Checkout, or from stage Complete Purchase to Leave Product Review?",
            "A": "The reduction from stage {Add to Cart} to {Initiate Checkout} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Visit Product Page to Add to Wishlist, from stage Add to Cart to Initiate Checkout, or from stage Add to Wishlist to Add to Cart?",
            "A": "The reduction from stage {Visit Product Page} to stage {Add to Wishlist} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {Visit Product Page} and {Add to Wishlist} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Enter Payment Information} and {Complete Purchase} stages."
        }
    ],
    "VA": []
}