{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {funnel} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many stages are there in this funnel chart?",
            "A": "There are {7} stages."
        }
    ],
    "SRP": [
        {
            "Q": "Is the View Advertisement stage positioned above or below the Complete Purchase stage?",
            "A": "The View Advertisement stage is positioned {above} the Complete Purchase stage."
        }
    ],
    "VPR": [
        {
            "Q": "What pattern does the data reduction follow in this funnel chart?",
            "A": "The data reduction follows a {exponential} pattern."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of stage Initiate Checkout?",
            "A": "The value of stage Initiate Checkout is {2215}."
        },
        {
            "Q": "What is the value of stage View Advertisement?",
            "A": "The value of stage View Advertisement is {7417}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in the funnel chart?",
            "A": "The stage with the highest value is View Advertisement, with a value of {7417}."
        },
        {
            "Q": "What is the minimum value in the funnel chart?",
            "A": "The stage with the lowest value is Complete Purchase, with a value of {956}."
        }
    ],
    "SC": [
        {
            "Q": "How much did it decrease from stage Add to Wishlist to stage Add to Cart?",
            "A": "Decreased by {1350} Users from stage Add to Wishlist to stage Add to Cart."
        }
    ],
    "NF": [
        {
            "Q": "In which stages of the funnel chart does the value exceed 4598? Please list the stage labels and corresponding values.",
            "A": "The {View Advertisement} stage has {7417}, the {Visit Product Page} stage has {5167}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall below 1687? Please list the stage labels and corresponding values.",
            "A": "The {Enter Payment Information} stage has {1159}, the {Complete Purchase} stage has {956}."
        },
        {
            "Q": "In which stages of the funnel chart does the value fall between 2447 and 3354? Please list the stage labels and corresponding values.",
            "A": "The {Add to Cart} stage has {2679}."
        }
    ],
    "NC": [
        {
            "Q": "Which reduction is greater: from stage Add to Wishlist to Add to Cart, or from stage Visit Product Page to Add to Wishlist?",
            "A": "The reduction from stage {Add to Wishlist} to {Add to Cart} is greater."
        },
        {
            "Q": "Which reduction is greater: from stage Add to Cart to Initiate Checkout, or from stage Add to Wishlist to Add to Cart?",
            "A": "The reduction from stage {Add to Wishlist} to {Add to Cart} is greater."
        },
        {
            "Q": "Which reduction is the greatest: from stage Enter Payment Information to Complete Purchase, from stage View Advertisement to Visit Product Page, or from stage Add to Cart to Initiate Checkout?",
            "A": "The reduction from stage {View Advertisement} to stage {Visit Product Page} is the greatest."
        }
    ],
    "MSR": [
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the largest?",
            "A": "The largest drop in conversion rate occurs between the {View Advertisement} and {Visit Product Page} stages."
        },
        {
            "Q": "Between which two consecutive stages in the funnel chart is the conversion rate drop the smallest?",
            "A": "The smallest drop in conversion rate occurs between the {Enter Payment Information} and {Complete Purchase} stages."
        }
    ],
    "VA": []
}