{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {3} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Walk score (0-100) dimension, what is the spatial relationship of board Mansion relative to throughout Villa in terms of vertical (above/below) direction?",
            "A": "{board Mansion} is {below} {throughout Villa} on the Walk score (0-100) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Bedroom count (units)?",
            "A": "The second position to the left of Bedroom count (units) is {Bathroom count (units)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Bedroom count (units)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Energy efficiency rating (1-10)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Square footage (sq ft)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Bathroom count (units) and dimension Square footage (sq ft)",
            "A": "There is {No Correlation} between Bathroom count (units) and Square footage (sq ft)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of throughout Villa on the Bedroom count (units) dimension in the parallel-coordinates chart?",
            "A": "The value of throughout Villa on the Bedroom count (units) dimension is {6.0}"
        },
        {
            "Q": "What is the value of throughout Villa on the Square footage (sq ft) dimension in the parallel-coordinates chart?",
            "A": "The value of throughout Villa on the Square footage (sq ft) dimension is {10000.0}"
        },
        {
            "Q": "What is the value of throughout Villa on the Year built (year) dimension in the parallel-coordinates chart?",
            "A": "The value of throughout Villa on the Year built (year) dimension is {2023.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label heavy Cottage across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of heavy Cottage across all dimensions is {1933.12}"
        },
        {
            "Q": "What is the minimum value of label throughout Villa across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of throughout Villa across all dimensions is {5.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Year built (year)?",
            "A": "The average value of Year built (year) is {1918.71}"
        },
        {
            "Q": "What is the difference in coding Energy efficiency rating (1-10) between label heavy Cottage and label board Mansion",
            "A": "The difference in coding Energy efficiency rating (1-10) between heavy Cottage and board Mansion is {5.97}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Bathroom count (units) dimension in the parallel coordinates?",
            "A": "{[5.0, 3.83, 1.0]}"
        },
        {
            "Q": "What are the bottom 3 values for Bedroom count (units) dimension in the parallel coordinates?",
            "A": "{[1.0, 2.1, 6.0]}"
        }
    ],
    "NC": [
        {
            "Q": "On Walk score (0-100), which label has a higher score: board Mansion or heavy Cottage?",
            "A": "{heavy Cottage} has a higher score on Walk score (0-100)."
        },
        {
            "Q": "On Energy efficiency rating (1-10), which label has a higher score: heavy Cottage or board Mansion?",
            "A": "{heavy Cottage} has a higher score on Energy efficiency rating (1-10)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Square footage (sq ft)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Year built (year) being greater than 1925.08 and Energy efficiency rating (1-10) being less than 4.78?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}