{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {3} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Bedroom count (units) dimension, what is the spatial relationship of view Villa relative to cold Mansion in terms of vertical (above/below) direction?",
            "A": "{view Villa} is {below} {cold Mansion} on the Bedroom count (units) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Bedroom count (units)?",
            "A": "The first position to the left of Bedroom count (units) is {Square footage (sq ft)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Bedroom count (units)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Walk score (0-100)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Square footage (sq ft)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Square footage (sq ft) and dimension Bedroom count (units)",
            "A": "There is {Clustering} between Square footage (sq ft) and Bedroom count (units)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of evidence Cottage on the Bedroom count (units) dimension in the parallel-coordinates chart?",
            "A": "The value of evidence Cottage on the Bedroom count (units) dimension is {1.0}"
        },
        {
            "Q": "What is the value of during Mansion on the Bedroom count (units) dimension in the parallel-coordinates chart?",
            "A": "The value of during Mansion on the Bedroom count (units) dimension is {4.52}"
        },
        {
            "Q": "What is the value of view Villa on the Walk score (0-100) dimension in the parallel-coordinates chart?",
            "A": "The value of view Villa on the Walk score (0-100) dimension is {0.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label evidence Cottage across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of evidence Cottage across all dimensions is {1000.74}"
        },
        {
            "Q": "What is the minimum value of label manage Cottage across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of manage Cottage across all dimensions is {4.11}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Bedroom count (units)?",
            "A": "The average value of Bedroom count (units) is {3.38}"
        },
        {
            "Q": "What is the difference in coding Bedroom count (units) between label during Mansion and label view Villa",
            "A": "The difference in coding Bedroom count (units) between during Mansion and view Villa is {2.27}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Square footage (sq ft) dimension in the parallel coordinates?",
            "A": "{[10000.0, 8206.82, 7482.79]}"
        },
        {
            "Q": "What are the bottom 3 values for Walk score (0-100) dimension in the parallel coordinates?",
            "A": "{[0.0, 6.43, 35.34]}"
        }
    ],
    "NC": [
        {
            "Q": "On Bedroom count (units), which label has a higher score: cold Mansion or manage Cottage?",
            "A": "{cold Mansion} has a higher score on Bedroom count (units)."
        },
        {
            "Q": "On Square footage (sq ft), which label has a higher score: evidence Cottage or cold Mansion?",
            "A": "{evidence Cottage} has a higher score on Square footage (sq ft)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Square footage (sq ft)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Walk score (0-100) being greater than 44.08 and Walk score (0-100) being less than 59.56?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}