{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Energy efficiency rating (1-10) dimension, what is the spatial relationship of college Villa relative to boy Mansion in terms of vertical (above/below) direction?",
            "A": "{college Villa} is {above} {boy Mansion} on the Energy efficiency rating (1-10) dimension."
        },
        {
            "Q": "Which dimension is the third position to the left of dimension Bathroom count (units)?",
            "A": "The third position to the left of Bathroom count (units) is {Bedroom count (units)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Bathroom count (units)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Energy efficiency rating (1-10)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Days on market (days)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Bedroom count (units) and dimension Days on market (days)",
            "A": "There is {No Correlation} between Bedroom count (units) and Days on market (days)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of ten Villa on the Days on market (days) dimension in the parallel-coordinates chart?",
            "A": "The value of ten Villa on the Days on market (days) dimension is {1.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label boy Mansion across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of boy Mansion across all dimensions is {365.0}"
        },
        {
            "Q": "What is the minimum value of label ten Villa across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of ten Villa across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Days on market (days)?",
            "A": "The average value of Days on market (days) is {173.09}"
        },
        {
            "Q": "What is the difference in coding Days on market (days) between label college Villa and label boy Mansion",
            "A": "The difference in coding Days on market (days) between college Villa and boy Mansion is {204.67}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Days on market (days) dimension in the parallel coordinates?",
            "A": "{[365.0, 348.74, 184.87]}"
        },
        {
            "Q": "What are the bottom 3 values for Bedroom count (units) dimension in the parallel coordinates?",
            "A": "{[1.0, 1.85, 2.68]}"
        }
    ],
    "NC": [
        {
            "Q": "On Bedroom count (units), which label has a higher score: economic Cottage or boy Mansion?",
            "A": "{boy Mansion} has a higher score on Bedroom count (units)."
        },
        {
            "Q": "On Walk score (0-100), which label has a higher score: college Villa or ten Villa?",
            "A": "{college Villa} has a higher score on Walk score (0-100)."
        },
        {
            "Q": "On Days on market (days), which label has a higher score: age Villa or ten Villa?",
            "A": "{age Villa} has a higher score on Days on market (days)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Days on market (days)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Bathroom count (units) being greater than 3.13 and Bathroom count (units) being less than 3.7?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}