{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Bedroom count (units) dimension, what is the spatial relationship of field Cottage relative to loss Mansion in terms of vertical (above/below) direction?",
            "A": "{field Cottage} is {above} {loss Mansion} on the Bedroom count (units) dimension."
        },
        {
            "Q": "Which dimension is the fourth position to the left of dimension Bedroom count (units)?",
            "A": "The fourth position to the left of Bedroom count (units) is {Square footage (sq ft)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Bedroom count (units)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Bathroom count (units)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Square footage (sq ft)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Bathroom count (units) and dimension Energy efficiency rating (1-10)",
            "A": "There is {Weak Correlation} between Bathroom count (units) and Energy efficiency rating (1-10)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of field Cottage on the Square footage (sq ft) dimension in the parallel-coordinates chart?",
            "A": "The value of field Cottage on the Square footage (sq ft) dimension is {6329.3}"
        },
        {
            "Q": "What is the value of field Cottage on the Bathroom count (units) dimension in the parallel-coordinates chart?",
            "A": "The value of field Cottage on the Bathroom count (units) dimension is {1.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label loss Mansion across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of loss Mansion across all dimensions is {7830.19}"
        },
        {
            "Q": "What is the minimum value of label field Cottage across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of field Cottage across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Walk score (0-100)?",
            "A": "The average value of Walk score (0-100) is {51.0}"
        },
        {
            "Q": "What is the difference in coding Bathroom count (units) between label training Cottage and label loss Mansion",
            "A": "The difference in coding Bathroom count (units) between training Cottage and loss Mansion is {1.45}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Energy efficiency rating (1-10) dimension in the parallel coordinates?",
            "A": "{[10.0, 5.68, 5.27]}"
        },
        {
            "Q": "What are the bottom 3 values for Year built (year) dimension in the parallel coordinates?",
            "A": "{[1800.0, 1806.9, 1819.41]}"
        }
    ],
    "NC": [
        {
            "Q": "On Days on market (days), which label has a higher score: field Cottage or training Cottage?",
            "A": "{field Cottage} has a higher score on Days on market (days)."
        },
        {
            "Q": "On Bedroom count (units), which label has a higher score: institution Mansion or training Cottage?",
            "A": "{training Cottage} has a higher score on Bedroom count (units)."
        },
        {
            "Q": "On Bathroom count (units), which label has a higher score: field Cottage or American Villa?",
            "A": "{American Villa} has a higher score on Bathroom count (units)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Square footage (sq ft)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Energy efficiency rating (1-10) being greater than 5.9 and Bedroom count (units) being less than 2.81?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}