{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {3} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Square footage (sq ft) dimension, what is the spatial relationship of authority Villa relative to citizen Cottage in terms of vertical (above/below) direction?",
            "A": "{authority Villa} is {below} {citizen Cottage} on the Square footage (sq ft) dimension."
        },
        {
            "Q": "Which dimension is the sixth position to the left of dimension Bathroom count (units)?",
            "A": "The sixth position to the left of Bathroom count (units) is {Energy efficiency rating (1-10)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Bathroom count (units)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Energy efficiency rating (1-10)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Square footage (sq ft)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Square footage (sq ft) and dimension Days on market (days)",
            "A": "There is {No Correlation} between Square footage (sq ft) and Days on market (days)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of authority Villa on the Bathroom count (units) dimension in the parallel-coordinates chart?",
            "A": "The value of authority Villa on the Bathroom count (units) dimension is {5.0}"
        },
        {
            "Q": "What is the value of authority Villa on the Walk score (0-100) dimension in the parallel-coordinates chart?",
            "A": "The value of authority Villa on the Walk score (0-100) dimension is {75.55}"
        },
        {
            "Q": "What is the value of important Villa on the Year built (year) dimension in the parallel-coordinates chart?",
            "A": "The value of important Villa on the Year built (year) dimension is {1800.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label citizen Cottage across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of citizen Cottage across all dimensions is {10000.0}"
        },
        {
            "Q": "What is the minimum value of label important Villa across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of important Villa across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Year built (year)?",
            "A": "The average value of Year built (year) is {1902.25}"
        },
        {
            "Q": "What is the difference in coding Year built (year) between label important Villa and label authority Villa",
            "A": "The difference in coding Year built (year) between important Villa and authority Villa is {223.0}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Days on market (days) dimension in the parallel coordinates?",
            "A": "{[365.0, 114.98, 1.0]}"
        },
        {
            "Q": "What are the bottom 3 values for Year built (year) dimension in the parallel coordinates?",
            "A": "{[1800.0, 1883.74, 2023.0]}"
        }
    ],
    "NC": [
        {
            "Q": "On Walk score (0-100), which label has a higher score: important Villa or authority Villa?",
            "A": "{authority Villa} has a higher score on Walk score (0-100)."
        },
        {
            "Q": "On Days on market (days), which label has a higher score: citizen Cottage or important Villa?",
            "A": "{important Villa} has a higher score on Days on market (days)."
        },
        {
            "Q": "On Walk score (0-100), which label has a higher score: authority Villa or important Villa?",
            "A": "{authority Villa} has a higher score on Walk score (0-100)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Square footage (sq ft)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Days on market (days) being greater than 175.76 and Square footage (sq ft) being less than 4671.46?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}