{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Days on market (days) dimension, what is the spatial relationship of side Villa relative to so Cottage in terms of vertical (above/below) direction?",
            "A": "{side Villa} is {below} {so Cottage} on the Days on market (days) dimension."
        },
        {
            "Q": "Which dimension is the fourth position to the left of dimension Year built (year)?",
            "A": "The fourth position to the left of Year built (year) is {Square footage (sq ft)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Days on market (days)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Square footage (sq ft)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Square footage (sq ft)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Walk score (0-100) and dimension Energy efficiency rating (1-10)",
            "A": "There is {Clustering} between Walk score (0-100) and Energy efficiency rating (1-10)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of our Mansion on the Walk score (0-100) dimension in the parallel-coordinates chart?",
            "A": "The value of our Mansion on the Walk score (0-100) dimension is {96.24}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label hear Cottage across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of hear Cottage across all dimensions is {2008.14}"
        },
        {
            "Q": "What is the minimum value of label side Villa across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of side Villa across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Energy efficiency rating (1-10)?",
            "A": "The average value of Energy efficiency rating (1-10) is {4.9}"
        },
        {
            "Q": "What is the difference in coding Energy efficiency rating (1-10) between label hear Cottage and label side Villa",
            "A": "The difference in coding Energy efficiency rating (1-10) between hear Cottage and side Villa is {3.03}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Energy efficiency rating (1-10) dimension in the parallel coordinates?",
            "A": "{[10.0, 6.97, 4.63]}"
        },
        {
            "Q": "What are the bottom 3 values for Walk score (0-100) dimension in the parallel coordinates?",
            "A": "{[0.0, 25.33, 67.13]}"
        }
    ],
    "NC": [
        {
            "Q": "On Square footage (sq ft), which label has a higher score: draw Villa or our Mansion?",
            "A": "{our Mansion} has a higher score on Square footage (sq ft)."
        },
        {
            "Q": "On Bathroom count (units), which label has a higher score: draw Villa or so Cottage?",
            "A": "{draw Villa} has a higher score on Bathroom count (units)."
        },
        {
            "Q": "On Square footage (sq ft), which label has a higher score: hear Cottage or our Mansion?",
            "A": "{our Mansion} has a higher score on Square footage (sq ft)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Square footage (sq ft)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Walk score (0-100) being greater than 55.12 and Days on market (days) being less than 212.07?",
            "A": "There are {2} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}