{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {3} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Research funding (USD millions) dimension, what is the spatial relationship of Mills-Webb  Research Center relative to Solomon PLC  Lab in terms of vertical (above/below) direction?",
            "A": "{Mills-Webb  Research Center} is {above} {Solomon PLC  Lab} on the Research funding (USD millions) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Lab efficiency (%)?",
            "A": "The first position to the left of Lab efficiency (%) is {Experiment success rate (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Research funding (USD millions)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Experiment success rate (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Research funding (USD millions)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Experiment success rate (%) and dimension Lab efficiency (%)",
            "A": "There is {Strong Correlation} between Experiment success rate (%) and Lab efficiency (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Price and Sons  Lab on the Research funding (USD millions) dimension in the parallel-coordinates chart?",
            "A": "The value of Price and Sons  Lab on the Research funding (USD millions) dimension is {94.34}"
        },
        {
            "Q": "What is the value of Mills-Webb  Research Center on the Lab efficiency (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Mills-Webb  Research Center on the Lab efficiency (%) dimension is {88.57}"
        },
        {
            "Q": "What is the value of Solomon PLC  Lab on the Research funding (USD millions) dimension in the parallel-coordinates chart?",
            "A": "The value of Solomon PLC  Lab on the Research funding (USD millions) dimension is {0.1}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Solomon PLC  Lab across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Solomon PLC  Lab across all dimensions is {79.85}"
        },
        {
            "Q": "What is the minimum value of label Mills-Webb  Research Center across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Mills-Webb  Research Center across all dimensions is {88.57}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Experiment success rate (%)?",
            "A": "The average value of Experiment success rate (%) is {52.31}"
        },
        {
            "Q": "What is the difference in coding Lab efficiency (%) between label Price and Sons  Lab and label Rodriguez Group  Research Center",
            "A": "The difference in coding Lab efficiency (%) between Price and Sons  Lab and Rodriguez Group  Research Center is {5.65}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Experiment success rate (%) dimension in the parallel coordinates?",
            "A": "{[100.0, 79.85, 73.73]}"
        },
        {
            "Q": "What are the bottom 3 values for Research funding (USD millions) dimension in the parallel coordinates?",
            "A": "{[0.1, 2.19, 71.19]}"
        }
    ],
    "NC": [
        {
            "Q": "On Lab efficiency (%), which label has a higher score: Gonzalez Ltd  Lab or Rodriguez Group  Research Center?",
            "A": "{Rodriguez Group  Research Center} has a higher score on Lab efficiency (%)."
        },
        {
            "Q": "On Research funding (USD millions), which label has a higher score: Klein, Payne and Ball  Research Institute or Solomon PLC  Lab?",
            "A": "{Klein, Payne and Ball  Research Institute} has a higher score on Research funding (USD millions)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Research funding (USD millions)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Experiment success rate (%) being greater than 66.34 and Research funding (USD millions) being less than 30.63?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}