{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {5} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Research funding (USD millions) dimension, what is the spatial relationship of Mayer Group  Lab relative to Andrade and Sons  Research Institute in terms of vertical (above/below) direction?",
            "A": "{Mayer Group  Lab} is {below} {Andrade and Sons  Research Institute} on the Research funding (USD millions) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Lab efficiency (%)?",
            "A": "The second position to the left of Lab efficiency (%) is {Citation index (citations/paper)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Experiment success rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Patent applications (patents)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Citation index (citations/paper)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Publication count (papers) and dimension Lab efficiency (%)",
            "A": "There is {Weak Correlation} between Publication count (papers) and Lab efficiency (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Cabrera, Todd and Underwood  Research Institute on the Publication count (papers) dimension in the parallel-coordinates chart?",
            "A": "The value of Cabrera, Todd and Underwood  Research Institute on the Publication count (papers) dimension is {0.0}"
        },
        {
            "Q": "What is the value of Mayer Group  Lab on the Publication count (papers) dimension in the parallel-coordinates chart?",
            "A": "The value of Mayer Group  Lab on the Publication count (papers) dimension is {32.5}"
        },
        {
            "Q": "What is the value of Cabrera, Todd and Underwood  Research Institute on the Publication count (papers) dimension in the parallel-coordinates chart?",
            "A": "The value of Cabrera, Todd and Underwood  Research Institute on the Publication count (papers) dimension is {0.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Cabrera, Todd and Underwood  Research Institute across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Cabrera, Todd and Underwood  Research Institute across all dimensions is {99.88}"
        },
        {
            "Q": "What is the minimum value of label Mayer Group  Lab across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Mayer Group  Lab across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Experiment success rate (%)?",
            "A": "The average value of Experiment success rate (%) is {67.89}"
        },
        {
            "Q": "What is the difference in coding Publication count (papers) between label Dalton-Gibson  Research Center and label Andrade and Sons  Research Institute",
            "A": "The difference in coding Publication count (papers) between Dalton-Gibson  Research Center and Andrade and Sons  Research Institute is {68.13}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Collaboration index (1-10) dimension in the parallel coordinates?",
            "A": "{[10.0, 7.49, 3.54]}"
        },
        {
            "Q": "What are the bottom 3 values for Collaboration index (1-10) dimension in the parallel coordinates?",
            "A": "{[1.0, 1.31, 3.54]}"
        }
    ],
    "NC": [
        {
            "Q": "On Experiment success rate (%), which label has a higher score: Cabrera, Todd and Underwood  Research Institute or Dalton-Gibson  Research Center?",
            "A": "{Dalton-Gibson  Research Center} has a higher score on Experiment success rate (%)."
        },
        {
            "Q": "On Citation index (citations/paper), which label has a higher score: Mayer Group  Lab or Cabrera, Todd and Underwood  Research Institute?",
            "A": "{Mayer Group  Lab} has a higher score on Citation index (citations/paper)."
        },
        {
            "Q": "On Research funding (USD millions), which label has a higher score: Dalton-Gibson  Research Center or Cabrera, Todd and Underwood  Research Institute?",
            "A": "{Cabrera, Todd and Underwood  Research Institute} has a higher score on Research funding (USD millions)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Citation index (citations/paper)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Citation index (citations/paper) being greater than 454.95 and Research funding (USD millions) being less than 60.01?",
            "A": "There are {2} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}