{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {4} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Experiment success rate (%) dimension, what is the spatial relationship of Park, Allison and Jones  Research Institute relative to Baker, Gray and Taylor  Lab in terms of vertical (above/below) direction?",
            "A": "{Park, Allison and Jones  Research Institute} is {above} {Baker, Gray and Taylor  Lab} on the Experiment success rate (%) dimension."
        },
        {
            "Q": "Which dimension is the fifth position to the left of dimension Lab efficiency (%)?",
            "A": "The fifth position to the left of Lab efficiency (%) is {Publication count (papers)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Collaboration index (1-10)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Publication count (papers)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Citation index (citations/paper)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Citation index (citations/paper) and dimension Lab efficiency (%)",
            "A": "There is {No Correlation} between Citation index (citations/paper) and Lab efficiency (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Higgins Ltd  Research Institute on the Publication count (papers) dimension in the parallel-coordinates chart?",
            "A": "The value of Higgins Ltd  Research Institute on the Publication count (papers) dimension is {100.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Higgins Ltd  Research Institute across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Higgins Ltd  Research Institute across all dimensions is {425.38}"
        },
        {
            "Q": "What is the minimum value of label Hunt and Sons  Research Center across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Hunt and Sons  Research Center across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Lab efficiency (%)?",
            "A": "The average value of Lab efficiency (%) is {53.59}"
        },
        {
            "Q": "What is the difference in coding Citation index (citations/paper) between label Higgins Ltd  Research Institute and label Park, Allison and Jones  Research Institute",
            "A": "The difference in coding Citation index (citations/paper) between Higgins Ltd  Research Institute and Park, Allison and Jones  Research Institute is {574.62}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Research funding (USD millions) dimension in the parallel coordinates?",
            "A": "{[100.0, 49.31, 26.27]}"
        },
        {
            "Q": "What are the bottom 3 values for Research funding (USD millions) dimension in the parallel coordinates?",
            "A": "{[0.1, 26.27, 49.31]}"
        }
    ],
    "NC": [
        {
            "Q": "On Research funding (USD millions), which label has a higher score: Park, Allison and Jones  Research Institute or Hunt and Sons  Research Center?",
            "A": "{Park, Allison and Jones  Research Institute} has a higher score on Research funding (USD millions)."
        },
        {
            "Q": "On Research funding (USD millions), which label has a higher score: Baker, Gray and Taylor  Lab or Hunt and Sons  Research Center?",
            "A": "{Baker, Gray and Taylor  Lab} has a higher score on Research funding (USD millions)."
        },
        {
            "Q": "On Collaboration index (1-10), which label has a higher score: Baker, Gray and Taylor  Lab or Higgins Ltd  Research Institute?",
            "A": "{Baker, Gray and Taylor  Lab} has a higher score on Collaboration index (1-10)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Citation index (citations/paper)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Collaboration index (1-10) being greater than 3.73 and Publication count (papers) being less than 43.55?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}