{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {3} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Publication count (papers) dimension, what is the spatial relationship of Mills and Sons  Lab relative to Brown, Martin and Carter  Research Institute in terms of vertical (above/below) direction?",
            "A": "{Mills and Sons  Lab} is {above} {Brown, Martin and Carter  Research Institute} on the Publication count (papers) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Lab efficiency (%)?",
            "A": "The first position to the left of Lab efficiency (%) is {Patent applications (patents)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Experiment success rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Patent applications (patents)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Citation index (citations/paper)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Patent applications (patents) and dimension Lab efficiency (%)",
            "A": "There is {Strong Correlation} between Patent applications (patents) and Lab efficiency (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Brown, Martin and Carter  Research Institute on the Lab efficiency (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Brown, Martin and Carter  Research Institute on the Lab efficiency (%) dimension is {30.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Mills and Sons  Lab across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Mills and Sons  Lab across all dimensions is {1000.0}"
        },
        {
            "Q": "What is the minimum value of label Brown, Martin and Carter  Research Institute across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Brown, Martin and Carter  Research Institute across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Publication count (papers)?",
            "A": "The average value of Publication count (papers) is {44.2}"
        },
        {
            "Q": "What is the difference in coding Citation index (citations/paper) between label Mills and Sons  Lab and label Brown, Martin and Carter  Research Institute",
            "A": "The difference in coding Citation index (citations/paper) between Mills and Sons  Lab and Brown, Martin and Carter  Research Institute is {1000.0}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Citation index (citations/paper) dimension in the parallel coordinates?",
            "A": "{[1000.0, 104.18, 0.0]}"
        },
        {
            "Q": "What are the bottom 3 values for Research funding (USD millions) dimension in the parallel coordinates?",
            "A": "{[0.1, 32.68, 100.0]}"
        }
    ],
    "NC": [
        {
            "Q": "On Publication count (papers), which label has a higher score: Wright-Pitts  Research Center or Mills and Sons  Lab?",
            "A": "{Mills and Sons  Lab} has a higher score on Publication count (papers)."
        },
        {
            "Q": "On Patent applications (patents), which label has a higher score: Wright-Pitts  Research Center or Brown, Martin and Carter  Research Institute?",
            "A": "{Wright-Pitts  Research Center} has a higher score on Patent applications (patents)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Citation index (citations/paper)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Lab efficiency (%) being greater than 56.85 and Citation index (citations/paper) being less than 678.44?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}