{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Customer retention rate (%) dimension, what is the spatial relationship of Gray, Pennington and Holland relative to Dodson-Holmes in terms of vertical (above/below) direction?",
            "A": "{Gray, Pennington and Holland} is {above} {Dodson-Holmes} on the Customer retention rate (%) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Cart abandonment rate (%)?",
            "A": "The first position to the left of Cart abandonment rate (%) is {Gross margin (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Inventory accuracy (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Conversion rate (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Gross margin (%)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Conversion rate (%) and dimension Customer retention rate (%)",
            "A": "There is {Weak Correlation} between Conversion rate (%) and Customer retention rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Gray, Pennington and Holland on the Gross margin (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Gray, Pennington and Holland on the Gross margin (%) dimension is {46.96}"
        },
        {
            "Q": "What is the value of Gordon-Hahn on the Conversion rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Gordon-Hahn on the Conversion rate (%) dimension is {0.77}"
        },
        {
            "Q": "What is the value of Henson-Jacobs on the Gross margin (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Henson-Jacobs on the Gross margin (%) dimension is {12.2}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Richardson, Oconnell and Wiley across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Richardson, Oconnell and Wiley across all dimensions is {92.69}"
        },
        {
            "Q": "What is the minimum value of label Gordon-Hahn across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Gordon-Hahn across all dimensions is {0.77}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Customer retention rate (%)?",
            "A": "The average value of Customer retention rate (%) is {24.94}"
        },
        {
            "Q": "What is the difference in coding Cart abandonment rate (%) between label Richardson, Oconnell and Wiley and label Bush and Sons",
            "A": "The difference in coding Cart abandonment rate (%) between Richardson, Oconnell and Wiley and Bush and Sons is {10.04}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Customer retention rate (%) dimension in the parallel coordinates?",
            "A": "{[50.0, 33.82, 25.9]}"
        },
        {
            "Q": "What are the bottom 3 values for Conversion rate (%) dimension in the parallel coordinates?",
            "A": "{[0.5, 0.58, 0.77]}"
        }
    ],
    "NC": [
        {
            "Q": "On Customer retention rate (%), which label has a higher score: Henson-Jacobs or Bush and Sons?",
            "A": "{Bush and Sons} has a higher score on Customer retention rate (%)."
        },
        {
            "Q": "On Gross margin (%), which label has a higher score: Gray, Pennington and Holland or Bush and Sons?",
            "A": "{Gray, Pennington and Holland} has a higher score on Gross margin (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Gross margin (%)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Gross margin (%) being greater than 38.25 and Inventory accuracy (%) being less than 93.89?",
            "A": "There are {3} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}