{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {5} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {3} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Customer retention rate (%) dimension, what is the spatial relationship of Myers-Barber relative to Evans-Wilkerson in terms of vertical (above/below) direction?",
            "A": "{Myers-Barber} is {below} {Evans-Wilkerson} on the Customer retention rate (%) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Average order value (USD)?",
            "A": "The second position to the left of Average order value (USD) is {Customer retention rate (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Average order value (USD)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Customer retention rate (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Average order value (USD)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Gross margin (%) and dimension Average order value (USD)",
            "A": "There is {Clustering} between Gross margin (%) and Average order value (USD)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Williams-Juarez on the Gross margin (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Williams-Juarez on the Gross margin (%) dimension is {38.43}"
        },
        {
            "Q": "What is the value of Williams-Juarez on the Average order value (USD) dimension in the parallel-coordinates chart?",
            "A": "The value of Williams-Juarez on the Average order value (USD) dimension is {339.83}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Logan, Vaughan and Wagner across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Logan, Vaughan and Wagner across all dimensions is {50.0}"
        },
        {
            "Q": "What is the minimum value of label Myers-Barber across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Myers-Barber across all dimensions is {19.02}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Average order value (USD)?",
            "A": "The average value of Average order value (USD) is {262.32}"
        },
        {
            "Q": "What is the difference in coding Customer retention rate (%) between label Williams-Juarez and label Riddle LLC",
            "A": "The difference in coding Customer retention rate (%) between Williams-Juarez and Riddle LLC is {8.63}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Average order value (USD) dimension in the parallel coordinates?",
            "A": "{[500.0, 339.83, 298.68]}"
        },
        {
            "Q": "What are the bottom 3 values for Customer retention rate (%) dimension in the parallel coordinates?",
            "A": "{[5.0, 13.63, 19.02]}"
        }
    ],
    "NC": [
        {
            "Q": "On Customer retention rate (%), which label has a higher score: Williams-Juarez or Logan, Vaughan and Wagner?",
            "A": "{Logan, Vaughan and Wagner} has a higher score on Customer retention rate (%)."
        },
        {
            "Q": "On Average order value (USD), which label has a higher score: Myers-Barber or Riddle LLC?",
            "A": "{Riddle LLC} has a higher score on Average order value (USD)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Average order value (USD)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Gross margin (%) being greater than 38.58 and Average order value (USD) being less than 209.1?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}