{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {3} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Cart abandonment rate (%) dimension, what is the spatial relationship of Perry, Cross and Owens relative to Guzman-Knight in terms of vertical (above/below) direction?",
            "A": "{Perry, Cross and Owens} is {above} {Guzman-Knight} on the Cart abandonment rate (%) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Cart abandonment rate (%)?",
            "A": "The first position to the left of Cart abandonment rate (%) is {Inventory accuracy (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Cart abandonment rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Average order value (USD)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Average order value (USD)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Average order value (USD) and dimension Conversion rate (%)",
            "A": "There is {No Correlation} between Average order value (USD) and Conversion rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Guzman-Knight on the Average order value (USD) dimension in the parallel-coordinates chart?",
            "A": "The value of Guzman-Knight on the Average order value (USD) dimension is {500.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Tucker Inc across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Tucker Inc across all dimensions is {100.0}"
        },
        {
            "Q": "What is the minimum value of label Tucker Inc across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Tucker Inc across all dimensions is {9.73}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Conversion rate (%)?",
            "A": "The average value of Conversion rate (%) is {6.74}"
        },
        {
            "Q": "What is the difference in coding Inventory accuracy (%) between label Tucker Inc and label Perry, Cross and Owens",
            "A": "The difference in coding Inventory accuracy (%) between Tucker Inc and Perry, Cross and Owens is {20.0}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Cart abandonment rate (%) dimension in the parallel coordinates?",
            "A": "{[90.0, 64.34, 40.0]}"
        },
        {
            "Q": "What are the bottom 3 values for Average order value (USD) dimension in the parallel coordinates?",
            "A": "{[10.0, 453.53, 500.0]}"
        }
    ],
    "NC": [
        {
            "Q": "On Conversion rate (%), which label has a higher score: Perry, Cross and Owens or Tucker Inc?",
            "A": "{Perry, Cross and Owens} has a higher score on Conversion rate (%)."
        },
        {
            "Q": "On Conversion rate (%), which label has a higher score: Perry, Cross and Owens or Tucker Inc?",
            "A": "{Perry, Cross and Owens} has a higher score on Conversion rate (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Average order value (USD)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Inventory accuracy (%) being greater than 88.66 and Conversion rate (%) being less than 5.99?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}