{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Conversion rate (%) dimension, what is the spatial relationship of Avery, Thompson and Ramos relative to Smith Group in terms of vertical (above/below) direction?",
            "A": "{Avery, Thompson and Ramos} is {below} {Smith Group} on the Conversion rate (%) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Gross margin (%)?",
            "A": "The first position to the left of Gross margin (%) is {Return rate (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Conversion rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Return rate (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Average order value (USD)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Average order value (USD) and dimension Conversion rate (%)",
            "A": "There is {Weak Correlation} between Average order value (USD) and Conversion rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Barker, Johnson and Robinson on the Conversion rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Barker, Johnson and Robinson on the Conversion rate (%) dimension is {0.5}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Green, Stafford and Ford across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Green, Stafford and Ford across all dimensions is {500.0}"
        },
        {
            "Q": "What is the minimum value of label Dawson-Simmons across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Dawson-Simmons across all dimensions is {6.81}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Conversion rate (%)?",
            "A": "The average value of Conversion rate (%) is {5.25}"
        },
        {
            "Q": "What is the difference in coding Conversion rate (%) between label Bolton-Juarez and label Green, Stafford and Ford",
            "A": "The difference in coding Conversion rate (%) between Bolton-Juarez and Green, Stafford and Ford is {0.28}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Return rate (%) dimension in the parallel coordinates?",
            "A": "{[30.0, 29.44, 28.59]}"
        },
        {
            "Q": "What are the bottom 3 values for Gross margin (%) dimension in the parallel coordinates?",
            "A": "{[10.0, 11.61, 14.41]}"
        }
    ],
    "NC": [
        {
            "Q": "On Return rate (%), which label has a higher score: Ramirez, Everett and Porter or Barker, Johnson and Robinson?",
            "A": "{Ramirez, Everett and Porter} has a higher score on Return rate (%)."
        },
        {
            "Q": "On Average order value (USD), which label has a higher score: Bolton-Juarez or Green, Stafford and Ford?",
            "A": "{Green, Stafford and Ford} has a higher score on Average order value (USD)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Average order value (USD)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Average order value (USD) being greater than 277.21 and Conversion rate (%) being less than 3.86?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}