{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Moving time (hours) dimension, what is the spatial relationship of black Tram relative to six ship in terms of vertical (above/below) direction?",
            "A": "{black Tram} is {below} {six ship} on the Moving time (hours) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Route deviation rate (%)?",
            "A": "The second position to the left of Route deviation rate (%) is {Total transit time (hours)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Moving time (hours)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Total transit time (hours)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Total transit time (hours)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Route deviation rate (%) and dimension Moving time (hours)",
            "A": "There is {Weak Correlation} between Route deviation rate (%) and Moving time (hours)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of suddenly train on the Max speed (km/h) dimension in the parallel-coordinates chart?",
            "A": "The value of suddenly train on the Max speed (km/h) dimension is {76.06}"
        },
        {
            "Q": "What is the value of pick Ferry on the Max speed (km/h) dimension in the parallel-coordinates chart?",
            "A": "The value of pick Ferry on the Max speed (km/h) dimension is {115.89}"
        },
        {
            "Q": "What is the value of might train on the Max speed (km/h) dimension in the parallel-coordinates chart?",
            "A": "The value of might train on the Max speed (km/h) dimension is {60.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label might train across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of might train across all dimensions is {72.0}"
        },
        {
            "Q": "What is the minimum value of label black Tram across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of black Tram across all dimensions is {2.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Total transit time (hours)?",
            "A": "The average value of Total transit time (hours) is {36.45}"
        },
        {
            "Q": "What is the difference in coding Max speed (km/h) between label from Tram and label might train",
            "A": "The difference in coding Max speed (km/h) between from Tram and might train is {25.06}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Total transit time (hours) dimension in the parallel coordinates?",
            "A": "{[72.0, 50.06, 39.24]}"
        },
        {
            "Q": "What are the bottom 3 values for Route deviation rate (%) dimension in the parallel coordinates?",
            "A": "{[0.0, 6.65, 8.36]}"
        }
    ],
    "NC": [
        {
            "Q": "On Moving time (hours), which label has a higher score: economic Cargo ship or from Tram?",
            "A": "{economic Cargo ship} has a higher score on Moving time (hours)."
        },
        {
            "Q": "On Max speed (km/h), which label has a higher score: six ship or black Tram?",
            "A": "{black Tram} has a higher score on Max speed (km/h)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Total transit time (hours)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Moving time (hours) being greater than 23.33 and Route deviation rate (%) being less than 10.26?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}