{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Loading/unloading time (hours) dimension, what is the spatial relationship of without Cargo ship relative to also ship in terms of vertical (above/below) direction?",
            "A": "{without Cargo ship} is {above} {also ship} on the Loading/unloading time (hours) dimension."
        },
        {
            "Q": "Which dimension is the third position to the left of dimension Route deviation rate (%)?",
            "A": "The third position to the left of Route deviation rate (%) is {Loading/unloading time (hours)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Route deviation rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Loading/unloading time (hours)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Average speed (km/h)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Moving time (hours) and dimension Route deviation rate (%)",
            "A": "There is {Clustering} between Moving time (hours) and Route deviation rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of street Tram on the Route deviation rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of street Tram on the Route deviation rate (%) dimension is {18.06}"
        },
        {
            "Q": "What is the value of also ship on the Loading/unloading time (hours) dimension in the parallel-coordinates chart?",
            "A": "The value of also ship on the Loading/unloading time (hours) dimension is {1.18}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label another Tram across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of another Tram across all dimensions is {30.0}"
        },
        {
            "Q": "What is the minimum value of label seek Ferry across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of seek Ferry across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Route deviation rate (%)?",
            "A": "The average value of Route deviation rate (%) is {12.75}"
        },
        {
            "Q": "What is the difference in coding Average speed (km/h) between label where plane and label another Tram",
            "A": "The difference in coding Average speed (km/h) between where plane and another Tram is {5.88}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Moving time (hours) dimension in the parallel coordinates?",
            "A": "{[48.0, 47.23, 24.68]}"
        },
        {
            "Q": "What are the bottom 3 values for Average speed (km/h) dimension in the parallel coordinates?",
            "A": "{[30.0, 35.88, 44.07]}"
        }
    ],
    "NC": [
        {
            "Q": "On Average speed (km/h), which label has a higher score: without Cargo ship or another Tram?",
            "A": "{without Cargo ship} has a higher score on Average speed (km/h)."
        },
        {
            "Q": "On Average speed (km/h), which label has a higher score: another Tram or street Tram?",
            "A": "{street Tram} has a higher score on Average speed (km/h)."
        },
        {
            "Q": "On Average speed (km/h), which label has a higher score: another Tram or street Tram?",
            "A": "{street Tram} has a higher score on Average speed (km/h)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Average speed (km/h)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Route deviation rate (%) being greater than 9.39 and Route deviation rate (%) being less than 12.2?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}