{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Moving time (hours) dimension, what is the spatial relationship of someone train relative to its ship in terms of vertical (above/below) direction?",
            "A": "{someone train} is {above} {its ship} on the Moving time (hours) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Average speed (km/h)?",
            "A": "The second position to the left of Average speed (km/h) is {Loading/unloading time (hours)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Moving time (hours)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Idling time (minutes)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Total transit time (hours)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Average speed (km/h) and dimension Max speed (km/h)",
            "A": "There is {Strong Correlation} between Average speed (km/h) and Max speed (km/h)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of someone train on the Loading/unloading time (hours) dimension in the parallel-coordinates chart?",
            "A": "The value of someone train on the Loading/unloading time (hours) dimension is {0.95}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label race train across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of race train across all dimensions is {120.0}"
        },
        {
            "Q": "What is the minimum value of label test Cargo ship across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of test Cargo ship across all dimensions is {4.84}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Average speed (km/h)?",
            "A": "The average value of Average speed (km/h) is {67.96}"
        },
        {
            "Q": "What is the difference in coding Idling time (minutes) between label movie Tram and label test Cargo ship",
            "A": "The difference in coding Idling time (minutes) between movie Tram and test Cargo ship is {28.25}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Route deviation rate (%) dimension in the parallel coordinates?",
            "A": "{[20.0, 18.57, 14.42]}"
        },
        {
            "Q": "What are the bottom 3 values for Average speed (km/h) dimension in the parallel coordinates?",
            "A": "{[30.0, 44.07, 59.98]}"
        }
    ],
    "NC": [
        {
            "Q": "On Moving time (hours), which label has a higher score: someone train or role plane?",
            "A": "{role plane} has a higher score on Moving time (hours)."
        },
        {
            "Q": "On Total transit time (hours), which label has a higher score: interesting Tram or race train?",
            "A": "{race train} has a higher score on Total transit time (hours)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Total transit time (hours)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Idling time (minutes) being greater than 42.8 and Moving time (hours) being less than 25.75?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}