{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {4} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Booking lead time (days) dimension, what is the spatial relationship of Calvinmouth relative to New Donaldtown in terms of vertical (above/below) direction?",
            "A": "{Calvinmouth} is {below} {New Donaldtown} on the Booking lead time (days) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Average stay duration (nights)?",
            "A": "The second position to the left of Average stay duration (nights) is {Booking lead time (days)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Average stay duration (nights)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Repeat visitor rate (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Booking lead time (days)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Customer satisfaction (1-10) and dimension Average stay duration (nights)",
            "A": "There is {Clustering} between Customer satisfaction (1-10) and Average stay duration (nights)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of New Donaldtown on the Average stay duration (nights) dimension in the parallel-coordinates chart?",
            "A": "The value of New Donaldtown on the Average stay duration (nights) dimension is {3.46}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Calvinmouth across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Calvinmouth across all dimensions is {6.11}"
        },
        {
            "Q": "What is the minimum value of label Calvinmouth across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Calvinmouth across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Repeat visitor rate (%)?",
            "A": "The average value of Repeat visitor rate (%) is {29.08}"
        },
        {
            "Q": "What is the difference in coding Booking lead time (days) between label Gomezfurt and label South Trevorburgh",
            "A": "The difference in coding Booking lead time (days) between Gomezfurt and South Trevorburgh is {72.75}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Average stay duration (nights) dimension in the parallel coordinates?",
            "A": "{[14.0, 9.72, 3.46]}"
        },
        {
            "Q": "What are the bottom 3 values for Booking lead time (days) dimension in the parallel coordinates?",
            "A": "{[0.0, 100.75, 173.5]}"
        }
    ],
    "NC": [
        {
            "Q": "On Customer satisfaction (1-10), which label has a higher score: Gomezfurt or South Trevorburgh?",
            "A": "{South Trevorburgh} has a higher score on Customer satisfaction (1-10)."
        },
        {
            "Q": "On Booking lead time (days), which label has a higher score: Calvinmouth or New Donaldtown?",
            "A": "{New Donaldtown} has a higher score on Booking lead time (days)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Booking lead time (days)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Booking lead time (days) being greater than 202.28 and Average stay duration (nights) being less than 9.01?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}