{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Accessibility score (1-5) dimension, what is the spatial relationship of Scottmouth relative to South Jeremyhaven in terms of vertical (above/below) direction?",
            "A": "{Scottmouth} is {above} {South Jeremyhaven} on the Accessibility score (1-5) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Customer satisfaction (1-10)?",
            "A": "The second position to the left of Customer satisfaction (1-10) is {Attraction visit rate (per day)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Accessibility score (1-5)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Attraction visit rate (per day)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Repeat visitor rate (%)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Average stay duration (nights) and dimension Accessibility score (1-5)",
            "A": "There is {No Correlation} between Average stay duration (nights) and Accessibility score (1-5)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Alexanderborough on the Attraction visit rate (per day) dimension in the parallel-coordinates chart?",
            "A": "The value of Alexanderborough on the Attraction visit rate (per day) dimension is {1.43}"
        },
        {
            "Q": "What is the value of Scottmouth on the Average stay duration (nights) dimension in the parallel-coordinates chart?",
            "A": "The value of Scottmouth on the Average stay duration (nights) dimension is {5.57}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label South Jeremyhaven across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of South Jeremyhaven across all dimensions is {25.43}"
        },
        {
            "Q": "What is the minimum value of label Scottmouth across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Scottmouth across all dimensions is {4.94}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Accessibility score (1-5)?",
            "A": "The average value of Accessibility score (1-5) is {3.34}"
        },
        {
            "Q": "What is the difference in coding Repeat visitor rate (%) between label New Amandafort and label South Jeremyhaven",
            "A": "The difference in coding Repeat visitor rate (%) between New Amandafort and South Jeremyhaven is {4.04}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Repeat visitor rate (%) dimension in the parallel coordinates?",
            "A": "{[60.0, 30.36, 29.47]}"
        },
        {
            "Q": "What are the bottom 3 values for Attraction visit rate (per day) dimension in the parallel coordinates?",
            "A": "{[1.0, 1.16, 1.43]}"
        }
    ],
    "NC": [
        {
            "Q": "On Average stay duration (nights), which label has a higher score: Scottmouth or East Robert?",
            "A": "{East Robert} has a higher score on Average stay duration (nights)."
        },
        {
            "Q": "On Accessibility score (1-5), which label has a higher score: Alexanderborough or Scottmouth?",
            "A": "{Alexanderborough} has a higher score on Accessibility score (1-5)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Repeat visitor rate (%)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Repeat visitor rate (%) being greater than 38.43 and Customer satisfaction (1-10) being less than 7.1?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}