{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {3} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Bonus percentage (%) dimension, what is the spatial relationship of Russell PLC relative to Rodriguez and Sons in terms of vertical (above/below) direction?",
            "A": "{Russell PLC} is {above} {Rodriguez and Sons} on the Bonus percentage (%) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Stock options (%)?",
            "A": "The second position to the left of Stock options (%) is {Pay equity ratio (ratio)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Stock options (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Bonus percentage (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Benefits cost (USD/year)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Overtime hours/month(hours) and dimension Stock options (%)",
            "A": "There is {Weak Correlation} between Overtime hours/month(hours) and Stock options (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Rodriguez and Sons on the Overtime hours/month(hours) dimension in the parallel-coordinates chart?",
            "A": "The value of Rodriguez and Sons on the Overtime hours/month(hours) dimension is {0.0}"
        },
        {
            "Q": "What is the value of Rodriguez and Sons on the Bonus percentage (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Rodriguez and Sons on the Bonus percentage (%) dimension is {0.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Gonzalez, Coleman and Vaughan across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Gonzalez, Coleman and Vaughan across all dimensions is {1000.0}"
        },
        {
            "Q": "What is the minimum value of label Rodriguez and Sons across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Rodriguez and Sons across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Remote work allowance (days/week)?",
            "A": "The average value of Remote work allowance (days/week) is {3.3}"
        },
        {
            "Q": "What is the difference in coding Bonus percentage (%) between label Rodriguez and Sons and label Gonzalez, Coleman and Vaughan",
            "A": "The difference in coding Bonus percentage (%) between Rodriguez and Sons and Gonzalez, Coleman and Vaughan is {11.37}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Stock options (%) dimension in the parallel coordinates?",
            "A": "{[20.0, 14.82, 0.0]}"
        },
        {
            "Q": "What are the bottom 3 values for Stock options (%) dimension in the parallel coordinates?",
            "A": "{[0.0, 14.82, 20.0]}"
        }
    ],
    "NC": [
        {
            "Q": "On Stock options (%), which label has a higher score: Gonzalez, Coleman and Vaughan or Russell PLC?",
            "A": "{Russell PLC} has a higher score on Stock options (%)."
        },
        {
            "Q": "On Remote work allowance (days/week), which label has a higher score: Gonzalez, Coleman and Vaughan or Rodriguez and Sons?",
            "A": "{Gonzalez, Coleman and Vaughan} has a higher score on Remote work allowance (days/week)."
        },
        {
            "Q": "On Benefits cost (USD/year), which label has a higher score: Russell PLC or Gonzalez, Coleman and Vaughan?",
            "A": "{Russell PLC} has a higher score on Benefits cost (USD/year)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Benefits cost (USD/year)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Pay equity ratio (ratio) being greater than 0.97 and Remote work allowance (days/week) being less than 2.06?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}