{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {4} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Time spent (minutes/day) dimension, what is the spatial relationship of ProfConnect relative to FaceLink in terms of vertical (above/below) direction?",
            "A": "{ProfConnect} is {above} {FaceLink} on the Time spent (minutes/day) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Share rate (%)?",
            "A": "The second position to the left of Share rate (%) is {Click-through rate (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Time spent (minutes/day)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Virality coefficient (shares/view)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Time spent (minutes/day)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Follower growth rate (%) and dimension Share rate (%)",
            "A": "There is {Strong Correlation} between Follower growth rate (%) and Share rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of FaceLink on the Follower growth rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of FaceLink on the Follower growth rate (%) dimension is {-5.0}"
        },
        {
            "Q": "What is the value of FaceLink on the Follower growth rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of FaceLink on the Follower growth rate (%) dimension is {-5.0}"
        },
        {
            "Q": "What is the value of SnapFrame on the Time spent (minutes/day) dimension in the parallel-coordinates chart?",
            "A": "The value of SnapFrame on the Time spent (minutes/day) dimension is {1.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label ProfConnect across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of ProfConnect across all dimensions is {181.58}"
        },
        {
            "Q": "What is the minimum value of label SnapFrame across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of SnapFrame across all dimensions is {0.1}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Virality coefficient (shares/view)?",
            "A": "The average value of Virality coefficient (shares/view) is {1.81}"
        },
        {
            "Q": "What is the difference in coding Follower growth rate (%) between label ProfConnect and label ProfConnect",
            "A": "The difference in coding Follower growth rate (%) between ProfConnect and ProfConnect is {30.41}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Virality coefficient (shares/view) dimension in the parallel coordinates?",
            "A": "{[5.0, 1.66, 0.47]}"
        },
        {
            "Q": "What are the bottom 3 values for Share rate (%) dimension in the parallel coordinates?",
            "A": "{[0.1, 3.87, 10.88]}"
        }
    ],
    "NC": [
        {
            "Q": "On Time spent (minutes/day), which label has a higher score: ProfConnect or FaceLink?",
            "A": "{ProfConnect} has a higher score on Time spent (minutes/day)."
        },
        {
            "Q": "On Follower growth rate (%), which label has a higher score: FaceLink or ProfConnect?",
            "A": "{ProfConnect} has a higher score on Follower growth rate (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Time spent (minutes/day)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Virality coefficient (shares/view) being greater than 2.0 and Time spent (minutes/day) being less than 137.93?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}