{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {3} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Time spent (minutes/day) dimension, what is the spatial relationship of FaceLink relative to GhostPic in terms of vertical (above/below) direction?",
            "A": "{FaceLink} is {below} {GhostPic} on the Time spent (minutes/day) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Click-through rate (%)?",
            "A": "The second position to the left of Click-through rate (%) is {Time spent (minutes/day)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Sentiment score (-1 to 1)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Time spent (minutes/day)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Daily active users (millions)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Daily active users (millions) and dimension Follower growth rate (%)",
            "A": "There is {Clustering} between Daily active users (millions) and Follower growth rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of GhostPic on the Daily active users (millions) dimension in the parallel-coordinates chart?",
            "A": "The value of GhostPic on the Daily active users (millions) dimension is {546.3}"
        },
        {
            "Q": "What is the value of FaceLink on the Click-through rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of FaceLink on the Click-through rate (%) dimension is {10.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label GhostPic across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of GhostPic across all dimensions is {546.3}"
        },
        {
            "Q": "What is the minimum value of label GhostPic across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of GhostPic across all dimensions is {0.1}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Follower growth rate (%)?",
            "A": "The average value of Follower growth rate (%) is {25.65}"
        },
        {
            "Q": "What is the difference in coding Follower growth rate (%) between label GhostPic and label SnapFrame",
            "A": "The difference in coding Follower growth rate (%) between GhostPic and SnapFrame is {55.0}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Sentiment score (-1 to 1) dimension in the parallel coordinates?",
            "A": "{[1.0, 0.84, -1.0]}"
        },
        {
            "Q": "What are the bottom 3 values for Virality coefficient (shares/view) dimension in the parallel coordinates?",
            "A": "{[0.1, 2.06, 5.0]}"
        }
    ],
    "NC": [
        {
            "Q": "On Daily active users (millions), which label has a higher score: SnapFrame or FaceLink?",
            "A": "{FaceLink} has a higher score on Daily active users (millions)."
        },
        {
            "Q": "On Share rate (%), which label has a higher score: FaceLink or SnapFrame?",
            "A": "{SnapFrame} has a higher score on Share rate (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Daily active users (millions)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Follower growth rate (%) being greater than 17.41 and Follower growth rate (%) being less than 19.33?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}