{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Time spent (minutes/day) dimension, what is the spatial relationship of Chirper relative to SnapFrame in terms of vertical (above/below) direction?",
            "A": "{Chirper} is {below} {SnapFrame} on the Time spent (minutes/day) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Virality coefficient (shares/view)?",
            "A": "The first position to the left of Virality coefficient (shares/view) is {Sentiment score (-1 to 1)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Virality coefficient (shares/view)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Time spent (minutes/day)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Daily active users (millions)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Follower growth rate (%) and dimension Sentiment score (-1 to 1)",
            "A": "There is {Strong Correlation} between Follower growth rate (%) and Sentiment score (-1 to 1)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Chirper on the Follower growth rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Chirper on the Follower growth rate (%) dimension is {-5.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label SnapFrame across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of SnapFrame across all dimensions is {1772.81}"
        },
        {
            "Q": "What is the minimum value of label ProfConnect across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of ProfConnect across all dimensions is {0.5}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Daily active users (millions)?",
            "A": "The average value of Daily active users (millions) is {1116.44}"
        },
        {
            "Q": "What is the difference in coding Time spent (minutes/day) between label SnapFrame and label ClipVibe",
            "A": "The difference in coding Time spent (minutes/day) between SnapFrame and ClipVibe is {21.29}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Time spent (minutes/day) dimension in the parallel coordinates?",
            "A": "{[240.0, 152.74, 132.24]}"
        },
        {
            "Q": "What are the bottom 3 values for Time spent (minutes/day) dimension in the parallel coordinates?",
            "A": "{[1.0, 11.69, 32.98]}"
        }
    ],
    "NC": [
        {
            "Q": "On Daily active users (millions), which label has a higher score: Chirper or FaceLink?",
            "A": "{FaceLink} has a higher score on Daily active users (millions)."
        },
        {
            "Q": "On Sentiment score (-1 to 1), which label has a higher score: ProfConnect or Chirper?",
            "A": "{ProfConnect} has a higher score on Sentiment score (-1 to 1)."
        },
        {
            "Q": "On Time spent (minutes/day), which label has a higher score: Chirper or ProfConnect?",
            "A": "{ProfConnect} has a higher score on Time spent (minutes/day)."
        },
        {
            "Q": "On Virality coefficient (shares/view), which label has a higher score: ClipVibe or ProfConnect?",
            "A": "{ClipVibe} has a higher score on Virality coefficient (shares/view)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Daily active users (millions)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Share rate (%) being greater than 11.15 and Time spent (minutes/day) being less than 137.71?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}