{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {5} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Recovery time (hours) dimension, what is the spatial relationship of Harold Stevens relative to Cynthia Gentry in terms of vertical (above/below) direction?",
            "A": "{Harold Stevens} is {below} {Cynthia Gentry} on the Recovery time (hours) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Speed (km/h)?",
            "A": "The first position to the left of Speed (km/h) is {Accuracy (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Endurance (minutes)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Recovery time (hours)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Endurance (minutes)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Recovery time (hours) and dimension Accuracy (%)",
            "A": "There is {Weak Correlation} between Recovery time (hours) and Accuracy (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Carl Hansen on the Recovery time (hours) dimension in the parallel-coordinates chart?",
            "A": "The value of Carl Hansen on the Recovery time (hours) dimension is {12.0}"
        },
        {
            "Q": "What is the value of Jamie Pena on the Speed (km/h) dimension in the parallel-coordinates chart?",
            "A": "The value of Jamie Pena on the Speed (km/h) dimension is {18.68}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Cynthia Gentry across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Cynthia Gentry across all dimensions is {120.0}"
        },
        {
            "Q": "What is the minimum value of label Jamie Pena across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Jamie Pena across all dimensions is {18.68}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Recovery time (hours)?",
            "A": "The average value of Recovery time (hours) is {29.94}"
        },
        {
            "Q": "What is the difference in coding Endurance (minutes) between label Jamie Pena and label Harold Stevens",
            "A": "The difference in coding Endurance (minutes) between Jamie Pena and Harold Stevens is {11.88}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Recovery time (hours) dimension in the parallel coordinates?",
            "A": "{[72.0, 31.42, 21.27]}"
        },
        {
            "Q": "What are the bottom 3 values for Accuracy (%) dimension in the parallel coordinates?",
            "A": "{[50.0, 61.45, 62.07]}"
        }
    ],
    "NC": [
        {
            "Q": "On Speed (km/h), which label has a higher score: Cynthia Gentry or Carl Hansen?",
            "A": "{Cynthia Gentry} has a higher score on Speed (km/h)."
        },
        {
            "Q": "On Recovery time (hours), which label has a higher score: Harold Stevens or Cynthia Gentry?",
            "A": "{Cynthia Gentry} has a higher score on Recovery time (hours)."
        },
        {
            "Q": "On Recovery time (hours), which label has a higher score: Mario Miller or Jamie Pena?",
            "A": "{Jamie Pena} has a higher score on Recovery time (hours)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Endurance (minutes)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Recovery time (hours) being greater than 49.26 and Accuracy (%) being less than 81.77?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}