{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Student-teacher ratio (ratio) dimension, what is the spatial relationship of Thompson, Gregory and Price  Institute relative to Hicks-Bonilla  Institute in terms of vertical (above/below) direction?",
            "A": "{Thompson, Gregory and Price  Institute} is {below} {Hicks-Bonilla  Institute} on the Student-teacher ratio (ratio) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Facility utilization (%)?",
            "A": "The first position to the left of Facility utilization (%) is {Student-teacher ratio (ratio)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {College acceptance rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Test scores (percentile)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Test scores (percentile)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Student-teacher ratio (ratio) and dimension Facility utilization (%)",
            "A": "There is {Strong Correlation} between Student-teacher ratio (ratio) and Facility utilization (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Alvarado-Avila  School on the Test scores (percentile) dimension in the parallel-coordinates chart?",
            "A": "The value of Alvarado-Avila  School on the Test scores (percentile) dimension is {7.87}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Rodriguez, Sanchez and Pierce  College across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Rodriguez, Sanchez and Pierce  College across all dimensions is {81.18}"
        },
        {
            "Q": "What is the minimum value of label Rodriguez, Sanchez and Pierce  College across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Rodriguez, Sanchez and Pierce  College across all dimensions is {30.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Facility utilization (%)?",
            "A": "The average value of Facility utilization (%) is {58.49}"
        },
        {
            "Q": "What is the difference in coding Facility utilization (%) between label Alvarado-Avila  School and label Hernandez LLC  Institute",
            "A": "The difference in coding Facility utilization (%) between Alvarado-Avila  School and Hernandez LLC  Institute is {55.03}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for College acceptance rate (%) dimension in the parallel coordinates?",
            "A": "{[100.0, 83.37, 76.71]}"
        },
        {
            "Q": "What are the bottom 3 values for Test scores (percentile) dimension in the parallel coordinates?",
            "A": "{[1.0, 7.87, 49.22]}"
        }
    ],
    "NC": [
        {
            "Q": "On Student-teacher ratio (ratio), which label has a higher score: Alvarado-Avila  School or Rodriguez, Sanchez and Pierce  College?",
            "A": "{Rodriguez, Sanchez and Pierce  College} has a higher score on Student-teacher ratio (ratio)."
        },
        {
            "Q": "On Facility utilization (%), which label has a higher score: Hernandez LLC  Institute or Thompson, Gregory and Price  Institute?",
            "A": "{Hernandez LLC  Institute} has a higher score on Facility utilization (%)."
        },
        {
            "Q": "On Facility utilization (%), which label has a higher score: Rodriguez, Sanchez and Pierce  College or Hernandez LLC  Institute?",
            "A": "{Rodriguez, Sanchez and Pierce  College} has a higher score on Facility utilization (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Test scores (percentile)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Facility utilization (%) being greater than 65.77 and Test scores (percentile) being less than 56.08?",
            "A": "There are {2} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}