{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the College acceptance rate (%) dimension, what is the spatial relationship of Hartman PLC  School relative to Conway Ltd  School in terms of vertical (above/below) direction?",
            "A": "{Hartman PLC  School} is {below} {Conway Ltd  School} on the College acceptance rate (%) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension College acceptance rate (%)?",
            "A": "The second position to the left of College acceptance rate (%) is {Research funding (USD millions)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {College acceptance rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Alumni donation rate (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Research funding (USD millions)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Facility utilization (%) and dimension Research funding (USD millions)",
            "A": "There is {Clustering} between Facility utilization (%) and Research funding (USD millions)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Rodriguez, Salas and Martin  Institute on the Test scores (percentile) dimension in the parallel-coordinates chart?",
            "A": "The value of Rodriguez, Salas and Martin  Institute on the Test scores (percentile) dimension is {14.41}"
        },
        {
            "Q": "What is the value of Conway Ltd  School on the Facility utilization (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Conway Ltd  School on the Facility utilization (%) dimension is {82.51}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Scott, Huffman and Perry  School across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Scott, Huffman and Perry  School across all dimensions is {500.0}"
        },
        {
            "Q": "What is the minimum value of label White-Novak  School across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of White-Novak  School across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Facility utilization (%)?",
            "A": "The average value of Facility utilization (%) is {64.61}"
        },
        {
            "Q": "What is the difference in coding Student-teacher ratio (ratio) between label Scott, Huffman and Perry  School and label White-Novak  School",
            "A": "The difference in coding Student-teacher ratio (ratio) between Scott, Huffman and Perry  School and White-Novak  School is {17.79}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Student-teacher ratio (ratio) dimension in the parallel coordinates?",
            "A": "{[30.0, 27.07, 19.06]}"
        },
        {
            "Q": "What are the bottom 3 values for Research funding (USD millions) dimension in the parallel coordinates?",
            "A": "{[0.1, 21.43, 50.94]}"
        }
    ],
    "NC": [
        {
            "Q": "On Alumni donation rate (%), which label has a higher score: Hartman PLC  School or White-Novak  School?",
            "A": "{Hartman PLC  School} has a higher score on Alumni donation rate (%)."
        },
        {
            "Q": "On Test scores (percentile), which label has a higher score: Jones Group  University or Scott, Huffman and Perry  School?",
            "A": "{Jones Group  University} has a higher score on Test scores (percentile)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Research funding (USD millions)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Research funding (USD millions) being greater than 265.2 and Alumni donation rate (%) being less than 18.97?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}