{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {3} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the College acceptance rate (%) dimension, what is the spatial relationship of Fletcher-Jones  College relative to Kelley-Fletcher  Institute in terms of vertical (above/below) direction?",
            "A": "{Fletcher-Jones  College} is {above} {Kelley-Fletcher  Institute} on the College acceptance rate (%) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension College acceptance rate (%)?",
            "A": "The first position to the left of College acceptance rate (%) is {Student-teacher ratio (ratio)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {College acceptance rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Research funding (USD millions)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Research funding (USD millions)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Student-teacher ratio (ratio) and dimension College acceptance rate (%)",
            "A": "There is {Clustering} between Student-teacher ratio (ratio) and College acceptance rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Padilla Inc  College on the College acceptance rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Padilla Inc  College on the College acceptance rate (%) dimension is {86.48}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Green, Bridges and Thomas  College across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Green, Bridges and Thomas  College across all dimensions is {328.88}"
        },
        {
            "Q": "What is the minimum value of label Fletcher-Jones  College across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Fletcher-Jones  College across all dimensions is {20.29}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of College acceptance rate (%)?",
            "A": "The average value of College acceptance rate (%) is {71.29}"
        },
        {
            "Q": "What is the difference in coding Student-teacher ratio (ratio) between label Preston PLC  School and label Weaver-Hamilton  University",
            "A": "The difference in coding Student-teacher ratio (ratio) between Preston PLC  School and Weaver-Hamilton  University is {9.8}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Research funding (USD millions) dimension in the parallel coordinates?",
            "A": "{[500.0, 452.54, 429.68]}"
        },
        {
            "Q": "What are the bottom 3 values for College acceptance rate (%) dimension in the parallel coordinates?",
            "A": "{[10.0, 52.44, 64.46]}"
        }
    ],
    "NC": [
        {
            "Q": "On Student-teacher ratio (ratio), which label has a higher score: Green, Bridges and Thomas  College or Preston PLC  School?",
            "A": "{Preston PLC  School} has a higher score on Student-teacher ratio (ratio)."
        },
        {
            "Q": "On Research funding (USD millions), which label has a higher score: Green, Bridges and Thomas  College or Preston PLC  School?",
            "A": "{Preston PLC  School} has a higher score on Research funding (USD millions)."
        },
        {
            "Q": "On College acceptance rate (%), which label has a higher score: Preston PLC  School or Green, Bridges and Thomas  College?",
            "A": "{Green, Bridges and Thomas  College} has a higher score on College acceptance rate (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Research funding (USD millions)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Student-teacher ratio (ratio) being greater than 19.42 and Student-teacher ratio (ratio) being less than 17.76?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}