{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Behavior change rate (%) dimension, what is the spatial relationship of guy  Civilization relative to should  Culture in terms of vertical (above/below) direction?",
            "A": "{guy  Civilization} is {above} {should  Culture} on the Behavior change rate (%) dimension."
        },
        {
            "Q": "Which dimension is the third position to the left of dimension Language adoption (new words)?",
            "A": "The third position to the left of Language adoption (new words) is {Policy influence index (1-10)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Behavior change rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Policy influence index (1-10)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Media coverage (articles/month)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Media coverage (articles/month) and dimension Behavior change rate (%)",
            "A": "There is {Clustering} between Media coverage (articles/month) and Behavior change rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of should  Culture on the Policy influence index (1-10) dimension in the parallel-coordinates chart?",
            "A": "The value of should  Culture on the Policy influence index (1-10) dimension is {6.52}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label current  Culture across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of current  Culture across all dimensions is {1000.0}"
        },
        {
            "Q": "What is the minimum value of label nice  Culture across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of nice  Culture across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Behavior change rate (%)?",
            "A": "The average value of Behavior change rate (%) is {28.43}"
        },
        {
            "Q": "What is the difference in coding Language adoption (new words) between label guy  Civilization and label should  Culture",
            "A": "The difference in coding Language adoption (new words) between guy  Civilization and should  Culture is {6.12}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Historical significance (1-10) dimension in the parallel coordinates?",
            "A": "{[10.0, 5.01, 4.52]}"
        },
        {
            "Q": "What are the bottom 3 values for Historical significance (1-10) dimension in the parallel coordinates?",
            "A": "{[1.0, 2.32, 3.78]}"
        }
    ],
    "NC": [
        {
            "Q": "On Media coverage (articles/month), which label has a higher score: should  Culture or current  Culture?",
            "A": "{should  Culture} has a higher score on Media coverage (articles/month)."
        },
        {
            "Q": "On Historical significance (1-10), which label has a higher score: nice  Culture or affect  Culture?",
            "A": "{affect  Culture} has a higher score on Historical significance (1-10)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Media coverage (articles/month)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Historical significance (1-10) being greater than 4.6 and Language adoption (new words) being less than 47.23?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}