{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {4} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Behavior change rate (%) dimension, what is the spatial relationship of degree  Civilization relative to career  Civilization in terms of vertical (above/below) direction?",
            "A": "{degree  Civilization} is {below} {career  Civilization} on the Behavior change rate (%) dimension."
        },
        {
            "Q": "Which dimension is the sixth position to the left of dimension Historical significance (1-10)?",
            "A": "The sixth position to the left of Historical significance (1-10) is {Media coverage (articles/month)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Historical significance (1-10)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Media coverage (articles/month)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Artistic references (cultural citations)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Behavior change rate (%) and dimension Artistic references (cultural citations)",
            "A": "There is {No Correlation} between Behavior change rate (%) and Artistic references (cultural citations)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of degree  Civilization on the Policy influence index (1-10) dimension in the parallel-coordinates chart?",
            "A": "The value of degree  Civilization on the Policy influence index (1-10) dimension is {4.77}"
        },
        {
            "Q": "What is the value of nearly  Culture on the Language adoption (new words) dimension in the parallel-coordinates chart?",
            "A": "The value of nearly  Culture on the Language adoption (new words) dimension is {100.0}"
        },
        {
            "Q": "What is the value of nearly  Culture on the Artistic references (cultural citations) dimension in the parallel-coordinates chart?",
            "A": "The value of nearly  Culture on the Artistic references (cultural citations) dimension is {974.38}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label nearly  Culture across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of nearly  Culture across all dimensions is {1000.0}"
        },
        {
            "Q": "What is the minimum value of label career  Civilization across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of career  Civilization across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Artistic references (cultural citations)?",
            "A": "The average value of Artistic references (cultural citations) is {501.17}"
        },
        {
            "Q": "What is the difference in coding Historical significance (1-10) between label film  Civilization and label career  Civilization",
            "A": "The difference in coding Historical significance (1-10) between film  Civilization and career  Civilization is {2.57}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Policy influence index (1-10) dimension in the parallel coordinates?",
            "A": "{[10.0, 5.85, 4.77]}"
        },
        {
            "Q": "What are the bottom 3 values for Behavior change rate (%) dimension in the parallel coordinates?",
            "A": "{[1.0, 14.99, 18.36]}"
        }
    ],
    "NC": [
        {
            "Q": "On Opinion leader count(verified accounts), which label has a higher score: film  Civilization or career  Civilization?",
            "A": "{film  Civilization} has a higher score on Opinion leader count(verified accounts)."
        },
        {
            "Q": "On Behavior change rate (%), which label has a higher score: film  Civilization or nearly  Culture?",
            "A": "{nearly  Culture} has a higher score on Behavior change rate (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Artistic references (cultural citations)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Opinion leader count(verified accounts) being greater than 599.48 and Media coverage (articles/month) being less than 641.94?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}