{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {3} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Policy influence index (1-10) dimension, what is the spatial relationship of table  Civilization relative to arrive  Civilization in terms of vertical (above/below) direction?",
            "A": "{table  Civilization} is {below} {arrive  Civilization} on the Policy influence index (1-10) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Historical significance (1-10)?",
            "A": "The second position to the left of Historical significance (1-10) is {Language adoption (new words)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Historical significance (1-10)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Language adoption (new words)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Language adoption (new words)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Language adoption (new words) and dimension Policy influence index (1-10)",
            "A": "There is {Strong Correlation} between Language adoption (new words) and Policy influence index (1-10)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of table  Civilization on the Language adoption (new words) dimension in the parallel-coordinates chart?",
            "A": "The value of table  Civilization on the Language adoption (new words) dimension is {0.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label experience  Civilization across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of experience  Civilization across all dimensions is {40.74}"
        },
        {
            "Q": "What is the minimum value of label western  Civilization across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of western  Civilization across all dimensions is {3.85}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Policy influence index (1-10)?",
            "A": "The average value of Policy influence index (1-10) is {5.5}"
        },
        {
            "Q": "What is the difference in coding Historical significance (1-10) between label experience  Civilization and label attack  Civilization",
            "A": "The difference in coding Historical significance (1-10) between experience  Civilization and attack  Civilization is {2.83}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Language adoption (new words) dimension in the parallel coordinates?",
            "A": "{[100.0, 73.49, 71.45]}"
        },
        {
            "Q": "What are the bottom 3 values for Policy influence index (1-10) dimension in the parallel coordinates?",
            "A": "{[1.0, 2.28, 3.33]}"
        }
    ],
    "NC": [
        {
            "Q": "On Policy influence index (1-10), which label has a higher score: state  Civilization or throw  Civilization?",
            "A": "{throw  Civilization} has a higher score on Policy influence index (1-10)."
        },
        {
            "Q": "On Policy influence index (1-10), which label has a higher score: state  Civilization or experience  Civilization?",
            "A": "{state  Civilization} has a higher score on Policy influence index (1-10)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Language adoption (new words)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Policy influence index (1-10) being greater than 4.06 and Historical significance (1-10) being less than 3.81?",
            "A": "There are {2} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}