{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {7} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Historical significance (1-10) dimension, what is the spatial relationship of weight  Culture relative to member  Civilization in terms of vertical (above/below) direction?",
            "A": "{weight  Culture} is {above} {member  Civilization} on the Historical significance (1-10) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Historical significance (1-10)?",
            "A": "The first position to the left of Historical significance (1-10) is {Language adoption (new words)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Policy influence index (1-10)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Language adoption (new words)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Artistic references (cultural citations)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Artistic references (cultural citations) and dimension Policy influence index (1-10)",
            "A": "There is {Strong Correlation} between Artistic references (cultural citations) and Policy influence index (1-10)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of member  Civilization on the Policy influence index (1-10) dimension in the parallel-coordinates chart?",
            "A": "The value of member  Civilization on the Policy influence index (1-10) dimension is {1.25}"
        },
        {
            "Q": "What is the value of college  Civilization on the Policy influence index (1-10) dimension in the parallel-coordinates chart?",
            "A": "The value of college  Civilization on the Policy influence index (1-10) dimension is {5.56}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label rule  Civilization across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of rule  Civilization across all dimensions is {29.81}"
        },
        {
            "Q": "What is the minimum value of label experience  Culture across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of experience  Culture across all dimensions is {1.84}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Language adoption (new words)?",
            "A": "The average value of Language adoption (new words) is {38.21}"
        },
        {
            "Q": "What is the difference in coding Historical significance (1-10) between label member  Civilization and label audience  Culture",
            "A": "The difference in coding Historical significance (1-10) between member  Civilization and audience  Culture is {6.85}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Policy influence index (1-10) dimension in the parallel coordinates?",
            "A": "{[10.0, 9.28, 5.97]}"
        },
        {
            "Q": "What are the bottom 3 values for Language adoption (new words) dimension in the parallel coordinates?",
            "A": "{[0.0, 1.84, 20.73]}"
        }
    ],
    "NC": [
        {
            "Q": "On Policy influence index (1-10), which label has a higher score: reduce  Culture or audience  Culture?",
            "A": "{reduce  Culture} has a higher score on Policy influence index (1-10)."
        },
        {
            "Q": "On Policy influence index (1-10), which label has a higher score: experience  Culture or rule  Civilization?",
            "A": "{experience  Culture} has a higher score on Policy influence index (1-10)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Artistic references (cultural citations)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Historical significance (1-10) being greater than 5.03 and Language adoption (new words) being less than 64.62?",
            "A": "There are {2} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}