{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {4} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Behavior change rate (%) dimension, what is the spatial relationship of late  Culture relative to why  Civilization in terms of vertical (above/below) direction?",
            "A": "{late  Culture} is {below} {why  Civilization} on the Behavior change rate (%) dimension."
        },
        {
            "Q": "Which dimension is the third position to the left of dimension Behavior change rate (%)?",
            "A": "The third position to the left of Behavior change rate (%) is {Artistic references (cultural citations)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Behavior change rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Artistic references (cultural citations)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Media coverage (articles/month)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Media coverage (articles/month) and dimension Behavior change rate (%)",
            "A": "There is {Strong Correlation} between Media coverage (articles/month) and Behavior change rate (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of culture  Culture on the Behavior change rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of culture  Culture on the Behavior change rate (%) dimension is {14.05}"
        },
        {
            "Q": "What is the value of physical  Culture on the Media coverage (articles/month) dimension in the parallel-coordinates chart?",
            "A": "The value of physical  Culture on the Media coverage (articles/month) dimension is {1.0}"
        },
        {
            "Q": "What is the value of why  Civilization on the Artistic references (cultural citations) dimension in the parallel-coordinates chart?",
            "A": "The value of why  Civilization on the Artistic references (cultural citations) dimension is {309.65}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label culture  Culture across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of culture  Culture across all dimensions is {461.68}"
        },
        {
            "Q": "What is the minimum value of label physical  Culture across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of physical  Culture across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Policy influence index (1-10)?",
            "A": "The average value of Policy influence index (1-10) is {5.27}"
        },
        {
            "Q": "What is the difference in coding Policy influence index (1-10) between label why  Civilization and label physical  Culture",
            "A": "The difference in coding Policy influence index (1-10) between why  Civilization and physical  Culture is {3.89}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Media coverage (articles/month) dimension in the parallel coordinates?",
            "A": "{[1000.0, 183.65, 163.05]}"
        },
        {
            "Q": "What are the bottom 3 values for Policy influence index (1-10) dimension in the parallel coordinates?",
            "A": "{[1.0, 4.89, 5.19]}"
        }
    ],
    "NC": [
        {
            "Q": "On Behavior change rate (%), which label has a higher score: culture  Culture or late  Culture?",
            "A": "{culture  Culture} has a higher score on Behavior change rate (%)."
        },
        {
            "Q": "On Policy influence index (1-10), which label has a higher score: why  Civilization or physical  Culture?",
            "A": "{physical  Culture} has a higher score on Policy influence index (1-10)."
        },
        {
            "Q": "On Behavior change rate (%), which label has a higher score: late  Culture or physical  Culture?",
            "A": "{physical  Culture} has a higher score on Behavior change rate (%)."
        },
        {
            "Q": "On Media coverage (articles/month), which label has a higher score: culture  Culture or physical  Culture?",
            "A": "{culture  Culture} has a higher score on Media coverage (articles/month)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Media coverage (articles/month)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Behavior change rate (%) being greater than 16.31 and Artistic references (cultural citations) being less than 330.33?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}