{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {3} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {3} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Opinion leader count(verified accounts) dimension, what is the spatial relationship of foot  Civilization relative to reason  Civilization in terms of vertical (above/below) direction?",
            "A": "{foot  Civilization} is {below} {reason  Civilization} on the Opinion leader count(verified accounts) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Artistic references (cultural citations)?",
            "A": "The second position to the left of Artistic references (cultural citations) is {Language adoption (new words)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Artistic references (cultural citations)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Language adoption (new words)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Artistic references (cultural citations)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Language adoption (new words) and dimension Opinion leader count(verified accounts)",
            "A": "There is {Clustering} between Language adoption (new words) and Opinion leader count(verified accounts)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of reason  Civilization on the Opinion leader count(verified accounts) dimension in the parallel-coordinates chart?",
            "A": "The value of reason  Civilization on the Opinion leader count(verified accounts) dimension is {1000.0}"
        },
        {
            "Q": "What is the value of reason  Civilization on the Artistic references (cultural citations) dimension in the parallel-coordinates chart?",
            "A": "The value of reason  Civilization on the Artistic references (cultural citations) dimension is {0.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label foot  Civilization across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of foot  Civilization across all dimensions is {239.53}"
        },
        {
            "Q": "What is the minimum value of label reason  Civilization across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of reason  Civilization across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Artistic references (cultural citations)?",
            "A": "The average value of Artistic references (cultural citations) is {413.18}"
        },
        {
            "Q": "What is the difference in coding Opinion leader count(verified accounts) between label foot  Civilization and label actually  Culture",
            "A": "The difference in coding Opinion leader count(verified accounts) between foot  Civilization and actually  Culture is {414.38}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Language adoption (new words) dimension in the parallel coordinates?",
            "A": "{[100.0, 25.67, 0.0]}"
        },
        {
            "Q": "What are the bottom 3 values for Opinion leader count(verified accounts) dimension in the parallel coordinates?",
            "A": "{[1.0, 415.38, 1000.0]}"
        }
    ],
    "NC": [
        {
            "Q": "On Language adoption (new words), which label has a higher score: reason  Civilization or foot  Civilization?",
            "A": "{reason  Civilization} has a higher score on Language adoption (new words)."
        },
        {
            "Q": "On Artistic references (cultural citations), which label has a higher score: reason  Civilization or foot  Civilization?",
            "A": "{foot  Civilization} has a higher score on Artistic references (cultural citations)."
        },
        {
            "Q": "On Artistic references (cultural citations), which label has a higher score: reason  Civilization or foot  Civilization?",
            "A": "{foot  Civilization} has a higher score on Artistic references (cultural citations)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Artistic references (cultural citations)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Language adoption (new words) being greater than 48.28 and Opinion leader count(verified accounts) being less than 494.31?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}