{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {5} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Market share (%) dimension, what is the spatial relationship of Rogers-Johnson relative to Burton, Pitts and Schmidt in terms of vertical (above/below) direction?",
            "A": "{Rogers-Johnson} is {below} {Burton, Pitts and Schmidt} on the Market share (%) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Price elasticity (unitless)?",
            "A": "The second position to the left of Price elasticity (unitless) is {Customer lifetime value (USD)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Price elasticity (unitless)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Competitor count (number)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Customer lifetime value (USD)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Customer lifetime value (USD) and dimension Market share (%)",
            "A": "There is {Weak Correlation} between Customer lifetime value (USD) and Market share (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Munoz-Brown on the Customer lifetime value (USD) dimension in the parallel-coordinates chart?",
            "A": "The value of Munoz-Brown on the Customer lifetime value (USD) dimension is {209.73}"
        },
        {
            "Q": "What is the value of Munoz-Brown on the Price elasticity (unitless) dimension in the parallel-coordinates chart?",
            "A": "The value of Munoz-Brown on the Price elasticity (unitless) dimension is {3.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Burton, Pitts and Schmidt across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Burton, Pitts and Schmidt across all dimensions is {3735.85}"
        },
        {
            "Q": "What is the minimum value of label Burton, Pitts and Schmidt across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Burton, Pitts and Schmidt across all dimensions is {1.1}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Market share (%)?",
            "A": "The average value of Market share (%) is {24.73}"
        },
        {
            "Q": "What is the difference in coding Competitor count (number) between label Burton, Pitts and Schmidt and label Rogers-Johnson",
            "A": "The difference in coding Competitor count (number) between Burton, Pitts and Schmidt and Rogers-Johnson is {9.39}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Competitor count (number) dimension in the parallel coordinates?",
            "A": "{[20.0, 16.34, 12.11]}"
        },
        {
            "Q": "What are the bottom 3 values for Market share (%) dimension in the parallel coordinates?",
            "A": "{[0.1, 19.41, 23.79]}"
        }
    ],
    "NC": [
        {
            "Q": "On Customer lifetime value (USD), which label has a higher score: Owen-Edwards or Munoz-Brown?",
            "A": "{Munoz-Brown} has a higher score on Customer lifetime value (USD)."
        },
        {
            "Q": "On Price elasticity (unitless), which label has a higher score: Owen-Edwards or Black, Booker and Johnson?",
            "A": "{Black, Booker and Johnson} has a higher score on Price elasticity (unitless)."
        },
        {
            "Q": "On Competitor count (number), which label has a higher score: Rogers-Johnson or Black, Booker and Johnson?",
            "A": "{Rogers-Johnson} has a higher score on Competitor count (number)."
        },
        {
            "Q": "On Customer lifetime value (USD), which label has a higher score: Burton, Pitts and Schmidt or Munoz-Brown?",
            "A": "{Burton, Pitts and Schmidt} has a higher score on Customer lifetime value (USD)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Customer lifetime value (USD)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Market share (%) being greater than 27.71 and Market share (%) being less than 30.95?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}