{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {5} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Readmission rate (%) dimension, what is the spatial relationship of Roberson-Ramirez  Hospital relative to Foley, Norris and Rivera  Hospital in terms of vertical (above/below) direction?",
            "A": "{Roberson-Ramirez  Hospital} is {above} {Foley, Norris and Rivera  Hospital} on the Readmission rate (%) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Medication error rate (per 1000)?",
            "A": "The first position to the left of Medication error rate (per 1000) is {Staff-to-patient ratio (per shift)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Patient satisfaction (1-10)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Readmission rate (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Preventive care rate (%)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Readmission rate (%) and dimension Staff-to-patient ratio (per shift)",
            "A": "There is {Weak Correlation} between Readmission rate (%) and Staff-to-patient ratio (per shift)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Foley, Norris and Rivera  Hospital on the Patient satisfaction (1-10) dimension in the parallel-coordinates chart?",
            "A": "The value of Foley, Norris and Rivera  Hospital on the Patient satisfaction (1-10) dimension is {5.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Foley, Norris and Rivera  Hospital across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Foley, Norris and Rivera  Hospital across all dimensions is {90.0}"
        },
        {
            "Q": "What is the minimum value of label Fisher, Gibson and Fletcher  Hospital across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Fisher, Gibson and Fletcher  Hospital across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Preventive care rate (%)?",
            "A": "The average value of Preventive care rate (%) is {51.23}"
        },
        {
            "Q": "What is the difference in coding Staff-to-patient ratio (per shift) between label Foley, Norris and Rivera  Hospital and label Turner Inc  Hospital",
            "A": "The difference in coding Staff-to-patient ratio (per shift) between Foley, Norris and Rivera  Hospital and Turner Inc  Hospital is {16.42}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Staff-to-patient ratio (per shift) dimension in the parallel coordinates?",
            "A": "{[20.0, 17.65, 17.42]}"
        },
        {
            "Q": "What are the bottom 3 values for Readmission rate (%) dimension in the parallel coordinates?",
            "A": "{[1.0, 7.44, 8.41]}"
        }
    ],
    "NC": [
        {
            "Q": "On Readmission rate (%), which label has a higher score: Davidson Group  Medical Center or Fisher, Gibson and Fletcher  Hospital?",
            "A": "{Fisher, Gibson and Fletcher  Hospital} has a higher score on Readmission rate (%)."
        },
        {
            "Q": "On Patient satisfaction (1-10), which label has a higher score: Foley, Norris and Rivera  Hospital or Turner Inc  Hospital?",
            "A": "{Turner Inc  Hospital} has a higher score on Patient satisfaction (1-10)."
        },
        {
            "Q": "On Medication error rate (per 1000), which label has a higher score: Davidson Group  Medical Center or Foley, Norris and Rivera  Hospital?",
            "A": "{Foley, Norris and Rivera  Hospital} has a higher score on Medication error rate (per 1000)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Preventive care rate (%)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Preventive care rate (%) being greater than 52.58 and Patient satisfaction (1-10) being less than 7.9?",
            "A": "There are {2} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}