{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {4} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Preventive care rate (%) dimension, what is the spatial relationship of Dunn Ltd  Medical Center relative to Turner-Riley  Clinic in terms of vertical (above/below) direction?",
            "A": "{Dunn Ltd  Medical Center} is {below} {Turner-Riley  Clinic} on the Preventive care rate (%) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Staff-to-patient ratio (per shift)?",
            "A": "The second position to the left of Staff-to-patient ratio (per shift) is {Patient satisfaction (1-10)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Average length of stay (days)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Medication error rate (per 1000)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Wait time (minutes)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Preventive care rate (%) and dimension Wait time (minutes)",
            "A": "There is {No Correlation} between Preventive care rate (%) and Wait time (minutes)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Campbell LLC  Hospital on the Preventive care rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Campbell LLC  Hospital on the Preventive care rate (%) dimension is {10.0}"
        },
        {
            "Q": "What is the value of Campbell LLC  Hospital on the Staff-to-patient ratio (per shift) dimension in the parallel-coordinates chart?",
            "A": "The value of Campbell LLC  Hospital on the Staff-to-patient ratio (per shift) dimension is {7.42}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Campbell LLC  Hospital across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Campbell LLC  Hospital across all dimensions is {103.09}"
        },
        {
            "Q": "What is the minimum value of label Campbell LLC  Hospital across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Campbell LLC  Hospital across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Wait time (minutes)?",
            "A": "The average value of Wait time (minutes) is {125.44}"
        },
        {
            "Q": "What is the difference in coding Readmission rate (%) between label Campbell LLC  Hospital and label Turner-Riley  Clinic",
            "A": "The difference in coding Readmission rate (%) between Campbell LLC  Hospital and Turner-Riley  Clinic is {4.23}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Average length of stay (days) dimension in the parallel coordinates?",
            "A": "{[14.0, 7.93, 6.73]}"
        },
        {
            "Q": "What are the bottom 3 values for Staff-to-patient ratio (per shift) dimension in the parallel coordinates?",
            "A": "{[1.0, 7.42, 10.1]}"
        }
    ],
    "NC": [
        {
            "Q": "On Wait time (minutes), which label has a higher score: Dunn Ltd  Medical Center or Campbell LLC  Hospital?",
            "A": "{Dunn Ltd  Medical Center} has a higher score on Wait time (minutes)."
        },
        {
            "Q": "On Wait time (minutes), which label has a higher score: Campbell LLC  Hospital or Turner-Riley  Clinic?",
            "A": "{Campbell LLC  Hospital} has a higher score on Wait time (minutes)."
        },
        {
            "Q": "On Staff-to-patient ratio (per shift), which label has a higher score: Turner-Riley  Clinic or Campbell LLC  Hospital?",
            "A": "{Campbell LLC  Hospital} has a higher score on Staff-to-patient ratio (per shift)."
        },
        {
            "Q": "On Preventive care rate (%), which label has a higher score: Campbell LLC  Hospital or Dunn Ltd  Medical Center?",
            "A": "{Dunn Ltd  Medical Center} has a higher score on Preventive care rate (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Wait time (minutes)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Patient satisfaction (1-10) being greater than 7.17 and Preventive care rate (%) being less than 42.52?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}