{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {3} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Wait time (minutes) dimension, what is the spatial relationship of Hart-Arnold  Medical Center relative to Huber LLC  Medical Center in terms of vertical (above/below) direction?",
            "A": "{Hart-Arnold  Medical Center} is {above} {Huber LLC  Medical Center} on the Wait time (minutes) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Medication error rate (per 1000)?",
            "A": "The first position to the left of Medication error rate (per 1000) is {Patient satisfaction (1-10)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Preventive care rate (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Wait time (minutes)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Wait time (minutes)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Patient satisfaction (1-10) and dimension Medication error rate (per 1000)",
            "A": "There is {Strong Correlation} between Patient satisfaction (1-10) and Medication error rate (per 1000)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Huber LLC  Medical Center on the Patient satisfaction (1-10) dimension in the parallel-coordinates chart?",
            "A": "The value of Huber LLC  Medical Center on the Patient satisfaction (1-10) dimension is {10.0}"
        },
        {
            "Q": "What is the value of Carroll PLC  Hospital on the Preventive care rate (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Carroll PLC  Hospital on the Preventive care rate (%) dimension is {36.39}"
        },
        {
            "Q": "What is the value of Carroll PLC  Hospital on the Medication error rate (per 1000) dimension in the parallel-coordinates chart?",
            "A": "The value of Carroll PLC  Hospital on the Medication error rate (per 1000) dimension is {0.94}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Huber LLC  Medical Center across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Huber LLC  Medical Center across all dimensions is {20.0}"
        },
        {
            "Q": "What is the minimum value of label Carroll PLC  Hospital across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Carroll PLC  Hospital across all dimensions is {0.94}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Patient satisfaction (1-10)?",
            "A": "The average value of Patient satisfaction (1-10) is {5.45}"
        },
        {
            "Q": "What is the difference in coding Wait time (minutes) between label Carroll PLC  Hospital and label Huber LLC  Medical Center",
            "A": "The difference in coding Wait time (minutes) between Carroll PLC  Hospital and Huber LLC  Medical Center is {235.0}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Patient satisfaction (1-10) dimension in the parallel coordinates?",
            "A": "{[10.0, 3.35, 3.0]}"
        },
        {
            "Q": "What are the bottom 3 values for Wait time (minutes) dimension in the parallel coordinates?",
            "A": "{[5.0, 140.25, 240.0]}"
        }
    ],
    "NC": [
        {
            "Q": "On Preventive care rate (%), which label has a higher score: Huber LLC  Medical Center or Carroll PLC  Hospital?",
            "A": "{Carroll PLC  Hospital} has a higher score on Preventive care rate (%)."
        },
        {
            "Q": "On Preventive care rate (%), which label has a higher score: Huber LLC  Medical Center or Carroll PLC  Hospital?",
            "A": "{Carroll PLC  Hospital} has a higher score on Preventive care rate (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Wait time (minutes)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Wait time (minutes) being greater than 93.47 and Medication error rate (per 1000) being less than 8.91?",
            "A": "There are {2} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}