{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {5} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Allergen-free options (%) dimension, what is the spatial relationship of Scott LLC  Diner relative to Montoya, Joseph and Perkins  Brasserie in terms of vertical (above/below) direction?",
            "A": "{Scott LLC  Diner} is {above} {Montoya, Joseph and Perkins  Brasserie} on the Allergen-free options (%) dimension."
        },
        {
            "Q": "Which dimension is the third position to the left of dimension Nutritional value (1-10)?",
            "A": "The third position to the left of Nutritional value (1-10) is {Organic content (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Allergen-free options (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Packaging efficiency (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Organic content (%)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Packaging efficiency (%) and dimension Organic content (%)",
            "A": "There is {Weak Correlation} between Packaging efficiency (%) and Organic content (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Brown, Rose and Ramirez  Bistro on the Nutritional value (1-10) dimension in the parallel-coordinates chart?",
            "A": "The value of Brown, Rose and Ramirez  Bistro on the Nutritional value (1-10) dimension is {1.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Montoya, Joseph and Perkins  Brasserie across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Montoya, Joseph and Perkins  Brasserie across all dimensions is {97.5}"
        },
        {
            "Q": "What is the minimum value of label Lee, Wallace and Moore  Diner across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Lee, Wallace and Moore  Diner across all dimensions is {0.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Organic content (%)?",
            "A": "The average value of Organic content (%) is {48.63}"
        },
        {
            "Q": "What is the difference in coding Allergen-free options (%) between label Montoya, Joseph and Perkins  Brasserie and label Scott LLC  Diner",
            "A": "The difference in coding Allergen-free options (%) between Montoya, Joseph and Perkins  Brasserie and Scott LLC  Diner is {3.79}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Organic content (%) dimension in the parallel coordinates?",
            "A": "{[100.0, 56.82, 47.12]}"
        },
        {
            "Q": "What are the bottom 3 values for Organic content (%) dimension in the parallel coordinates?",
            "A": "{[0.0, 39.22, 47.12]}"
        }
    ],
    "NC": [
        {
            "Q": "On Freshness score (1-10), which label has a higher score: Brown, Rose and Ramirez  Bistro or Montoya, Joseph and Perkins  Brasserie?",
            "A": "{Brown, Rose and Ramirez  Bistro} has a higher score on Freshness score (1-10)."
        },
        {
            "Q": "On Taste rating (1-10), which label has a higher score: Oliver Inc  Restaurant or Brown, Rose and Ramirez  Bistro?",
            "A": "{Brown, Rose and Ramirez  Bistro} has a higher score on Taste rating (1-10)."
        },
        {
            "Q": "On Taste rating (1-10), which label has a higher score: Lee, Wallace and Moore  Diner or Brown, Rose and Ramirez  Bistro?",
            "A": "{Brown, Rose and Ramirez  Bistro} has a higher score on Taste rating (1-10)."
        },
        {
            "Q": "On Organic content (%), which label has a higher score: Scott LLC  Diner or Lee, Wallace and Moore  Diner?",
            "A": "{Scott LLC  Diner} has a higher score on Organic content (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Organic content (%)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Freshness score (1-10) being greater than 6.64 and Nutritional value (1-10) being less than 7.13?",
            "A": "There are {2} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}