{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Capacity factor (%) dimension, what is the spatial relationship of Porter Ltd  Energy Facility relative to Davenport, Bailey and Caldwell  Energy Facility in terms of vertical (above/below) direction?",
            "A": "{Porter Ltd  Energy Facility} is {below} {Davenport, Bailey and Caldwell  Energy Facility} on the Capacity factor (%) dimension."
        },
        {
            "Q": "Which dimension is the third position to the left of dimension Carbon intensity (kgCO2/MWh)?",
            "A": "The third position to the left of Carbon intensity (kgCO2/MWh) is {Fuel efficiency (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Carbon intensity (kgCO2/MWh)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Maintenance cost (USD/MWh)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Output (MWh)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Downtime (%) and dimension Fuel efficiency (%)",
            "A": "There is {Weak Correlation} between Downtime (%) and Fuel efficiency (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Walker, Peterson and Santana  Energy Facility on the Output (MWh) dimension in the parallel-coordinates chart?",
            "A": "The value of Walker, Peterson and Santana  Energy Facility on the Output (MWh) dimension is {10000.0}"
        },
        {
            "Q": "What is the value of Davenport, Bailey and Caldwell  Energy Facility on the Downtime (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Davenport, Bailey and Caldwell  Energy Facility on the Downtime (%) dimension is {16.2}"
        },
        {
            "Q": "What is the value of Porter Ltd  Energy Facility on the Output (MWh) dimension in the parallel-coordinates chart?",
            "A": "The value of Porter Ltd  Energy Facility on the Output (MWh) dimension is {840.06}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Walker, Peterson and Santana  Energy Facility across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Walker, Peterson and Santana  Energy Facility across all dimensions is {10000.0}"
        },
        {
            "Q": "What is the minimum value of label Lucas and Sons  Power Plant across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Lucas and Sons  Power Plant across all dimensions is {1.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Renewable percentage (%)?",
            "A": "The average value of Renewable percentage (%) is {64.93}"
        },
        {
            "Q": "What is the difference in coding Carbon intensity (kgCO2/MWh) between label Lee and Sons  Energy Facility and label Porter Ltd  Energy Facility",
            "A": "The difference in coding Carbon intensity (kgCO2/MWh) between Lee and Sons  Energy Facility and Porter Ltd  Energy Facility is {199.18}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Fuel efficiency (%) dimension in the parallel coordinates?",
            "A": "{[90.0, 85.76, 52.94]}"
        },
        {
            "Q": "What are the bottom 3 values for Fuel efficiency (%) dimension in the parallel coordinates?",
            "A": "{[20.0, 21.57, 38.71]}"
        }
    ],
    "NC": [
        {
            "Q": "On Renewable percentage (%), which label has a higher score: Porter Ltd  Energy Facility or Lee and Sons  Energy Facility?",
            "A": "{Lee and Sons  Energy Facility} has a higher score on Renewable percentage (%)."
        },
        {
            "Q": "On Maintenance cost (USD/MWh), which label has a higher score: Lee and Sons  Energy Facility or Davenport, Bailey and Caldwell  Energy Facility?",
            "A": "{Davenport, Bailey and Caldwell  Energy Facility} has a higher score on Maintenance cost (USD/MWh)."
        },
        {
            "Q": "On Renewable percentage (%), which label has a higher score: Lucas and Sons  Power Plant or Walker, Peterson and Santana  Energy Facility?",
            "A": "{Lucas and Sons  Power Plant} has a higher score on Renewable percentage (%)."
        },
        {
            "Q": "On Renewable percentage (%), which label has a higher score: Davenport, Bailey and Caldwell  Energy Facility or Meyer-Ellis  Energy Facility?",
            "A": "{Davenport, Bailey and Caldwell  Energy Facility} has a higher score on Renewable percentage (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Output (MWh)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Carbon intensity (kgCO2/MWh) being greater than 447.56 and Fuel efficiency (%) being less than 52.45?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}