{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {5} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Capacity factor (%) dimension, what is the spatial relationship of Vega Group  Power Plant relative to Williams, Bradley and Butler  Energy Facility in terms of vertical (above/below) direction?",
            "A": "{Vega Group  Power Plant} is {above} {Williams, Bradley and Butler  Energy Facility} on the Capacity factor (%) dimension."
        },
        {
            "Q": "Which dimension is the second position to the left of dimension Downtime (%)?",
            "A": "The second position to the left of Downtime (%) is {Carbon intensity (kgCO2/MWh)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Fuel efficiency (%)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Renewable percentage (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Carbon intensity (kgCO2/MWh)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Renewable percentage (%) and dimension Capacity factor (%)",
            "A": "There is {No Correlation} between Renewable percentage (%) and Capacity factor (%)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Turner, Mcneil and Morse  Power Plant on the Carbon intensity (kgCO2/MWh) dimension in the parallel-coordinates chart?",
            "A": "The value of Turner, Mcneil and Morse  Power Plant on the Carbon intensity (kgCO2/MWh) dimension is {364.98}"
        },
        {
            "Q": "What is the value of Turner, Mcneil and Morse  Power Plant on the Downtime (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Turner, Mcneil and Morse  Power Plant on the Downtime (%) dimension is {3.06}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Lam PLC  Generation Station across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Lam PLC  Generation Station across all dimensions is {624.82}"
        },
        {
            "Q": "What is the minimum value of label Davis Inc  Power Plant across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Davis Inc  Power Plant across all dimensions is {3.87}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Capacity factor (%)?",
            "A": "The average value of Capacity factor (%) is {35.25}"
        },
        {
            "Q": "What is the difference in coding Carbon intensity (kgCO2/MWh) between label Vega Group  Power Plant and label Davis Inc  Power Plant",
            "A": "The difference in coding Carbon intensity (kgCO2/MWh) between Vega Group  Power Plant and Davis Inc  Power Plant is {892.36}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Renewable percentage (%) dimension in the parallel coordinates?",
            "A": "{[100.0, 92.88, 37.98]}"
        },
        {
            "Q": "What are the bottom 3 values for Fuel efficiency (%) dimension in the parallel coordinates?",
            "A": "{[20.0, 34.33, 39.25]}"
        }
    ],
    "NC": [
        {
            "Q": "On Maintenance cost (USD/MWh), which label has a higher score: Davis Inc  Power Plant or Williams, Bradley and Butler  Energy Facility?",
            "A": "{Davis Inc  Power Plant} has a higher score on Maintenance cost (USD/MWh)."
        },
        {
            "Q": "On Fuel efficiency (%), which label has a higher score: Lam PLC  Generation Station or Turner, Mcneil and Morse  Power Plant?",
            "A": "{Lam PLC  Generation Station} has a higher score on Fuel efficiency (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Carbon intensity (kgCO2/MWh)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Downtime (%) being greater than 8.82 and Carbon intensity (kgCO2/MWh) being less than 572.85?",
            "A": "There are {0} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}