{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Parallel Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this parallel-coordinates chart",
            "A": "There are {6} lines."
        },
        {
            "Q": "How many dimensions are in this parallel-coordinates chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "On the Capacity factor (%) dimension, what is the spatial relationship of Taylor, Carlson and Combs  Power Plant relative to Hamilton-Beasley  Energy Facility in terms of vertical (above/below) direction?",
            "A": "{Taylor, Carlson and Combs  Power Plant} is {below} {Hamilton-Beasley  Energy Facility} on the Capacity factor (%) dimension."
        },
        {
            "Q": "Which dimension is the first position to the left of dimension Maintenance cost (USD/MWh)?",
            "A": "The first position to the left of Maintenance cost (USD/MWh) is {Downtime (%)}."
        },
        {
            "Q": "Which dimension axis is positioned at the rightmost of the parallel chart?",
            "A": "The {Carbon intensity (kgCO2/MWh)} axis is positioned at the rightmost of the parallel chart."
        },
        {
            "Q": "Which dimension axis is positioned at the leftmost of the parallel chart?",
            "A": "The {Downtime (%)} axis is positioned at the leftmost of the parallel chart."
        }
    ],
    "VPR": [
        {
            "Q": "Which dimension has the highest variability in the parallel-coordinates chart?",
            "A": " {Output (MWh)} shows the highest variability."
        },
        {
            "Q": "What kind of correlation exists between Downtime (%) and dimension Maintenance cost (USD/MWh)",
            "A": "There is {Clustering} between Downtime (%) and Maintenance cost (USD/MWh)."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Melton-Martin  Generation Station on the Output (MWh) dimension in the parallel-coordinates chart?",
            "A": "The value of Melton-Martin  Generation Station on the Output (MWh) dimension is {771.29}"
        },
        {
            "Q": "What is the value of Melton-Martin  Generation Station on the Capacity factor (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Melton-Martin  Generation Station on the Capacity factor (%) dimension is {33.39}"
        },
        {
            "Q": "What is the value of Evans LLC  Energy Facility on the Capacity factor (%) dimension in the parallel-coordinates chart?",
            "A": "The value of Evans LLC  Energy Facility on the Capacity factor (%) dimension is {95.0}"
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Ford LLC  Power Plant across all dimensions in the parallel-coordinates chart?",
            "A": "The maximum value of Ford LLC  Power Plant across all dimensions is {7597.09}"
        },
        {
            "Q": "What is the minimum value of label Evans LLC  Energy Facility across all dimensions in the parallel-coordinates chart?",
            "A": "The minimum value of Evans LLC  Energy Facility across all dimensions is {16.52}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Fuel efficiency (%)?",
            "A": "The average value of Fuel efficiency (%) is {46.68}"
        },
        {
            "Q": "What is the difference in coding Downtime (%) between label Ford LLC  Power Plant and label Evans LLC  Energy Facility",
            "A": "The difference in coding Downtime (%) between Ford LLC  Power Plant and Evans LLC  Energy Facility is {3.94}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 values for Fuel efficiency (%) dimension in the parallel coordinates?",
            "A": "{[90.0, 65.36, 39.54]}"
        },
        {
            "Q": "What are the bottom 3 values for Renewable percentage (%) dimension in the parallel coordinates?",
            "A": "{[0.0, 20.01, 64.68]}"
        }
    ],
    "NC": [
        {
            "Q": "On Maintenance cost (USD/MWh), which label has a higher score: Ford LLC  Power Plant or Taylor, Carlson and Combs  Power Plant?",
            "A": "{Ford LLC  Power Plant} has a higher score on Maintenance cost (USD/MWh)."
        },
        {
            "Q": "On Carbon intensity (kgCO2/MWh), which label has a higher score: Melton-Martin  Generation Station or Miles Group  Generation Station?",
            "A": "{Miles Group  Generation Station} has a higher score on Carbon intensity (kgCO2/MWh)."
        },
        {
            "Q": "On Fuel efficiency (%), which label has a higher score: Melton-Martin  Generation Station or Evans LLC  Energy Facility?",
            "A": "{Evans LLC  Energy Facility} has a higher score on Fuel efficiency (%)."
        },
        {
            "Q": "On Renewable percentage (%), which label has a higher score: Hamilton-Beasley  Energy Facility or Ford LLC  Power Plant?",
            "A": "{Ford LLC  Power Plant} has a higher score on Renewable percentage (%)."
        }
    ],
    "MSR": [
        {
            "Q": "In the parallel coordinates plot, which dimension has the highest degree of dispersion?",
            "A": "The dimension with the highest degree of dispersion is {Output (MWh)}."
        },
        {
            "Q": "How many labels satisfy both the conditions of Carbon intensity (kgCO2/MWh) being greater than 349.89 and Output (MWh) being less than 5153.26?",
            "A": "There are {1} label(s) that satisfy both conditions."
        }
    ],
    "VA": []
}