{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {5} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {10} links."
        },
        {
            "Q": "How many nodes link with node Urban Theater House?",
            "A": "There are {4} nodes link with node Urban Theater House."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Heritage Art Museum and node Modern Music Studio in this node-link chart?",
            "A": "The relationship between node Heritage Art Museum and node Modern Music Studio is {cross_cultural_event}."
        },
        {
            "Q": "What is the relationship between node Global Culture Pavilion and node Urban Theater House in this node-link chart?",
            "A": "The relationship between node Global Culture Pavilion and node Urban Theater House is {cross_cultural_event}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type cross_cultural_event?",
            "A": "There are {4} links with the relation type cross_cultural_event."
        },
        {
            "Q": "How many links have the relation type festival_participation?",
            "A": "There are {3} links with the relation type festival_participation."
        }
    ],
    "NF": [
        {
            "Q": "Under node Global Culture Pavilion, how many links are of type festival_participation?",
            "A": "Node Global Culture Pavilion has {1} links of type festival_participation."
        },
        {
            "Q": "Under node Heritage Art Museum, how many links are of type artist_collaboration?",
            "A": "Node Heritage Art Museum has {1} links of type artist_collaboration."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Global Culture Pavilion}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Global Culture Pavilion with a degree of 4}, {node Heritage Art Museum with a degree of 4}, {node Modern Music Studio with a degree of 4}."
        },
        {
            "Q": "What is the shortest path from node Urban Theater House to node Global Culture Pavilion in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Urban Theater House to node Global Culture Pavilion is: {Urban Theater House to Global Culture Pavilion}."
        }
    ],
    "VA": []
}