{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {8} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Whispering Pines Farmstead?",
            "A": "There are {3} nodes link with node Whispering Pines Farmstead."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Willow Valley Ranch and node Sunrise Dairy Farm in this node-link chart?",
            "A": "The relationship between node Willow Valley Ranch and node Sunrise Dairy Farm is {crop_rotation}."
        },
        {
            "Q": "What is the relationship between node Sunnydale Organic Farm and node Green Acre Orchards in this node-link chart?",
            "A": "The relationship between node Sunnydale Organic Farm and node Green Acre Orchards is {agro_supply_chain}."
        },
        {
            "Q": "What is the relationship between node Green Acre Orchards and node Blueberry Hill Estate in this node-link chart?",
            "A": "The relationship between node Green Acre Orchards and node Blueberry Hill Estate is {farmers_cooperative}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type processing_link?",
            "A": "There are {1} links with the relation type processing_link."
        },
        {
            "Q": "How many links have the relation type agro_supply_chain?",
            "A": "There are {1} links with the relation type agro_supply_chain."
        },
        {
            "Q": "How many links have the relation type market_linkage?",
            "A": "There are {1} links with the relation type market_linkage."
        }
    ],
    "NF": [
        {
            "Q": "Under node Sunnydale Organic Farm, how many links are of type agro_supply_chain?",
            "A": "Node Sunnydale Organic Farm has {1} links of type agro_supply_chain."
        },
        {
            "Q": "Under node Sunnydale Organic Farm, how many links are of type market_linkage?",
            "A": "Node Sunnydale Organic Farm has {1} links of type market_linkage."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Green Acre Orchards}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Green Acre Orchards with a degree of 7}, {node Sunnydale Organic Farm with a degree of 5}, {node Willow Valley Ranch with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Blueberry Hill Estate to node Green Acre Orchards in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Blueberry Hill Estate to node Green Acre Orchards is: {Blueberry Hill Estate to Green Acre Orchards}."
        }
    ],
    "VA": []
}