{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {12} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {16} links."
        },
        {
            "Q": "How many nodes link with node Meadowlark Middle School?",
            "A": "There are {3} nodes link with node Meadowlark Middle School."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Starlight Elementary School and node Sunrise Montessori School in this node-link chart?",
            "A": "The relationship between node Starlight Elementary School and node Sunrise Montessori School is {joint_program}."
        },
        {
            "Q": "What is the relationship between node Greenwood High School and node Westfield Engineering School in this node-link chart?",
            "A": "The relationship between node Greenwood High School and node Westfield Engineering School is {research_collaboration}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type student_exchange?",
            "A": "There are {2} links with the relation type student_exchange."
        },
        {
            "Q": "How many links have the relation type funding_support?",
            "A": "There are {3} links with the relation type funding_support."
        }
    ],
    "NF": [
        {
            "Q": "Under node Greenwood High School, how many links are of type research_collaboration?",
            "A": "Node Greenwood High School has {2} links of type research_collaboration."
        },
        {
            "Q": "Under node Starlight Elementary School, how many links are of type funding_support?",
            "A": "Node Starlight Elementary School has {2} links of type funding_support."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Starlight Elementary School}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Starlight Elementary School with a degree of 6}, {node Greenwood High School with a degree of 5}, {node Oakridge International Academy with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Meadowlark Middle School to node Hillcrest Technical School in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Meadowlark Middle School to node Hillcrest Technical School is: {Meadowlark Middle School to Starlight Elementary School to Hillcrest Technical School}."
        }
    ],
    "VA": []
}