{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {12} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Harborview STEM School?",
            "A": "There are {3} nodes link with node Harborview STEM School."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Oakridge International Academy and node Meadowlark Middle School in this node-link chart?",
            "A": "The relationship between node Oakridge International Academy and node Meadowlark Middle School is {student_exchange}."
        },
        {
            "Q": "What is the relationship between node Greenwood High School and node Beacon Arts Academy in this node-link chart?",
            "A": "The relationship between node Greenwood High School and node Beacon Arts Academy is {student_exchange}."
        },
        {
            "Q": "What is the relationship between node Greenwood High School and node Meadowlark Middle School in this node-link chart?",
            "A": "The relationship between node Greenwood High School and node Meadowlark Middle School is {student_exchange}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type joint_program?",
            "A": "There are {4} links with the relation type joint_program."
        },
        {
            "Q": "How many links have the relation type student_exchange?",
            "A": "There are {5} links with the relation type student_exchange."
        }
    ],
    "NF": [
        {
            "Q": "Under node Greenwood High School, how many links are of type research_collaboration?",
            "A": "Node Greenwood High School has {1} links of type research_collaboration."
        },
        {
            "Q": "Under node Starlight Elementary School, how many links are of type research_collaboration?",
            "A": "Node Starlight Elementary School has {1} links of type research_collaboration."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Greenwood High School}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Greenwood High School with a degree of 6}, {node Oakridge International Academy with a degree of 6}, {node Starlight Elementary School with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Trinity Language School to node Silverstream Science School in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Trinity Language School to node Silverstream Science School is: {Trinity Language School to Oakridge International Academy to Silverstream Science School}."
        }
    ],
    "VA": []
}