{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {12} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {17} links."
        },
        {
            "Q": "How many nodes link with node Harborview STEM School?",
            "A": "There are {3} nodes link with node Harborview STEM School."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Trinity Language School and node Riverside Public School in this node-link chart?",
            "A": "The relationship between node Trinity Language School and node Riverside Public School is {research_collaboration}."
        },
        {
            "Q": "What is the relationship between node Starlight Elementary School and node Harborview STEM School in this node-link chart?",
            "A": "The relationship between node Starlight Elementary School and node Harborview STEM School is {student_exchange}."
        },
        {
            "Q": "What is the relationship between node Greenwood High School and node Oakridge International Academy in this node-link chart?",
            "A": "The relationship between node Greenwood High School and node Oakridge International Academy is {academic_advising}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type research_collaboration?",
            "A": "There are {6} links with the relation type research_collaboration."
        },
        {
            "Q": "How many links have the relation type funding_support?",
            "A": "There are {1} links with the relation type funding_support."
        },
        {
            "Q": "How many links have the relation type student_exchange?",
            "A": "There are {4} links with the relation type student_exchange."
        }
    ],
    "NF": [
        {
            "Q": "Under node Oakridge International Academy, how many links are of type academic_advising?",
            "A": "Node Oakridge International Academy has {1} links of type academic_advising."
        },
        {
            "Q": "Under node Westfield Engineering School, how many links are of type research_collaboration?",
            "A": "Node Westfield Engineering School has {1} links of type research_collaboration."
        },
        {
            "Q": "Under node Greenwood High School, how many links are of type funding_support?",
            "A": "Node Greenwood High School has {1} links of type funding_support."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Greenwood High School}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Greenwood High School with a degree of 6}, {node Oakridge International Academy with a degree of 6}, {node Starlight Elementary School with a degree of 6}."
        },
        {
            "Q": "What is the shortest path from node Oakridge International Academy to node Silverstream Science School in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Oakridge International Academy to node Silverstream Science School is: {Oakridge International Academy to Silverstream Science School}."
        }
    ],
    "VA": []
}