{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {5} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {10} links."
        },
        {
            "Q": "How many nodes link with node Bluefin Sushi Bar?",
            "A": "There are {4} nodes link with node Bluefin Sushi Bar."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Olive & Thyme and node Bluefin Sushi Bar in this node-link chart?",
            "A": "The relationship between node Olive & Thyme and node Bluefin Sushi Bar is {ingredient_supply}."
        },
        {
            "Q": "What is the relationship between node The Golden Fork and node Sunset Bistro in this node-link chart?",
            "A": "The relationship between node The Golden Fork and node Sunset Bistro is {ingredient_supply}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type brand_franchise?",
            "A": "There are {2} links with the relation type brand_franchise."
        },
        {
            "Q": "How many links have the relation type retail_partner?",
            "A": "There are {2} links with the relation type retail_partner."
        }
    ],
    "NF": [
        {
            "Q": "Under node Crimson Table, how many links are of type retail_partner?",
            "A": "Node Crimson Table has {1} links of type retail_partner."
        },
        {
            "Q": "Under node Sunset Bistro, how many links are of type ingredient_supply?",
            "A": "Node Sunset Bistro has {1} links of type ingredient_supply."
        },
        {
            "Q": "Under node Olive & Thyme, how many links are of type brand_franchise?",
            "A": "Node Olive & Thyme has {1} links of type brand_franchise."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {The Golden Fork}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node The Golden Fork with a degree of 4}, {node Sunset Bistro with a degree of 4}, {node Bluefin Sushi Bar with a degree of 4}."
        },
        {
            "Q": "What is the shortest path from node The Golden Fork to node Crimson Table in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node The Golden Fork to node Crimson Table is: {The Golden Fork to Crimson Table}."
        }
    ],
    "VA": []
}