{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {14} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {18} links."
        },
        {
            "Q": "How many nodes link with node Global Health Clinic?",
            "A": "There are {3} nodes link with node Global Health Clinic."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Evercare Medical Center and node Global Health Clinic in this node-link chart?",
            "A": "The relationship between node Evercare Medical Center and node Global Health Clinic is {specialty_sharing}."
        },
        {
            "Q": "What is the relationship between node St. Mary's General Hospital and node Global Health Clinic in this node-link chart?",
            "A": "The relationship between node St. Mary's General Hospital and node Global Health Clinic is {healthcare_network}."
        },
        {
            "Q": "What is the relationship between node Cityview Children's Hospital and node Evercare Medical Center in this node-link chart?",
            "A": "The relationship between node Cityview Children's Hospital and node Evercare Medical Center is {referral_path}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type patient_transfer?",
            "A": "There are {1} links with the relation type patient_transfer."
        },
        {
            "Q": "How many links have the relation type healthcare_network?",
            "A": "There are {5} links with the relation type healthcare_network."
        },
        {
            "Q": "How many links have the relation type specialty_sharing?",
            "A": "There are {3} links with the relation type specialty_sharing."
        }
    ],
    "NF": [
        {
            "Q": "Under node Cityview Children's Hospital, how many links are of type medical_collaboration?",
            "A": "Node Cityview Children's Hospital has {3} links of type medical_collaboration."
        },
        {
            "Q": "Under node Mercy Heart Institute, how many links are of type medical_collaboration?",
            "A": "Node Mercy Heart Institute has {1} links of type medical_collaboration."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Evercare Medical Center}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Evercare Medical Center with a degree of 7}, {node St. Mary's General Hospital with a degree of 5}, {node Cityview Children's Hospital with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Northfield Emergency Center to node St. Mary's General Hospital in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Northfield Emergency Center to node St. Mary's General Hospital is: {Northfield Emergency Center to St. Mary's General Hospital}."
        }
    ],
    "VA": []
}