{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {5} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {10} links."
        },
        {
            "Q": "How many nodes link with node Bluewave Energy Inc.?",
            "A": "There are {4} nodes link with node Bluewave Energy Inc.."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Orion Tech Corporation and node Summit Financial Group in this node-link chart?",
            "A": "The relationship between node Orion Tech Corporation and node Summit Financial Group is {strategic_alliance}."
        },
        {
            "Q": "What is the relationship between node NovaGen Biotech and node Summit Financial Group in this node-link chart?",
            "A": "The relationship between node NovaGen Biotech and node Summit Financial Group is {strategic_alliance}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type strategic_alliance?",
            "A": "There are {4} links with the relation type strategic_alliance."
        }
    ],
    "NF": [
        {
            "Q": "Under node NovaGen Biotech, how many links are of type strategic_alliance?",
            "A": "Node NovaGen Biotech has {1} links of type strategic_alliance."
        },
        {
            "Q": "Under node NovaGen Biotech, how many links are of type investment_partnership?",
            "A": "Node NovaGen Biotech has {1} links of type investment_partnership."
        },
        {
            "Q": "Under node Evergreen Logistics Ltd., how many links are of type merger_link?",
            "A": "Node Evergreen Logistics Ltd. has {1} links of type merger_link."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Orion Tech Corporation}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Orion Tech Corporation with a degree of 4}, {node NovaGen Biotech with a degree of 4}, {node Bluewave Energy Inc. with a degree of 4}."
        },
        {
            "Q": "What is the shortest path from node NovaGen Biotech to node Summit Financial Group in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node NovaGen Biotech to node Summit Financial Group is: {NovaGen Biotech to Summit Financial Group}."
        }
    ],
    "VA": []
}