{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {12} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Crystal Bay Residence?",
            "A": "There are {3} nodes link with node Crystal Bay Residence."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Willow Creek Estate and node Lakeside Heights in this node-link chart?",
            "A": "The relationship between node Willow Creek Estate and node Lakeside Heights is {real_estate_agency_link}."
        },
        {
            "Q": "What is the relationship between node Sunset Villas Complex and node Golden Terrace Apartments in this node-link chart?",
            "A": "The relationship between node Sunset Villas Complex and node Golden Terrace Apartments is {lease_chain}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type broker_affiliation?",
            "A": "There are {3} links with the relation type broker_affiliation."
        },
        {
            "Q": "How many links have the relation type real_estate_agency_link?",
            "A": "There are {2} links with the relation type real_estate_agency_link."
        },
        {
            "Q": "How many links have the relation type property_exchange?",
            "A": "There are {5} links with the relation type property_exchange."
        }
    ],
    "NF": [
        {
            "Q": "Under node Willow Creek Estate, how many links are of type real_estate_agency_link?",
            "A": "Node Willow Creek Estate has {1} links of type real_estate_agency_link."
        },
        {
            "Q": "Under node Sunset Villas Complex, how many links are of type broker_affiliation?",
            "A": "Node Sunset Villas Complex has {1} links of type broker_affiliation."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Sunset Villas Complex}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Sunset Villas Complex with a degree of 6}, {node Willow Creek Estate with a degree of 5}, {node Riverstone Residences with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Oceanfront Horizon Estate to node Riverstone Residences in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Oceanfront Horizon Estate to node Riverstone Residences is: {Oceanfront Horizon Estate to Riverstone Residences}."
        }
    ],
    "VA": []
}