{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {12} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {17} links."
        },
        {
            "Q": "How many nodes link with node Pinehill Townhomes?",
            "A": "There are {5} nodes link with node Pinehill Townhomes."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Sunset Villas Complex and node Crystal Bay Residence in this node-link chart?",
            "A": "The relationship between node Sunset Villas Complex and node Crystal Bay Residence is {rental_agreement}."
        },
        {
            "Q": "What is the relationship between node Sunset Villas Complex and node Lakeside Heights in this node-link chart?",
            "A": "The relationship between node Sunset Villas Complex and node Lakeside Heights is {rental_agreement}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type real_estate_agency_link?",
            "A": "There are {2} links with the relation type real_estate_agency_link."
        }
    ],
    "NF": [
        {
            "Q": "Under node Emerald Tower, how many links are of type property_exchange?",
            "A": "Node Emerald Tower has {1} links of type property_exchange."
        },
        {
            "Q": "Under node Willow Creek Estate, how many links are of type lease_chain?",
            "A": "Node Willow Creek Estate has {1} links of type lease_chain."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Riverstone Residences}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Riverstone Residences with a degree of 7}, {node Willow Creek Estate with a degree of 5}, {node Pinehill Townhomes with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Golden Terrace Apartments to node Harborview Condominiums in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Golden Terrace Apartments to node Harborview Condominiums is: {Golden Terrace Apartments to Riverstone Residences to Harborview Condominiums}."
        }
    ],
    "VA": []
}