{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {12} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {17} links."
        },
        {
            "Q": "How many nodes link with node Oceanfront Horizon Estate?",
            "A": "There are {3} nodes link with node Oceanfront Horizon Estate."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Willow Creek Estate and node Emerald Tower in this node-link chart?",
            "A": "The relationship between node Willow Creek Estate and node Emerald Tower is {lease_chain}."
        },
        {
            "Q": "What is the relationship between node Sunset Villas Complex and node Golden Terrace Apartments in this node-link chart?",
            "A": "The relationship between node Sunset Villas Complex and node Golden Terrace Apartments is {property_exchange}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type property_exchange?",
            "A": "There are {3} links with the relation type property_exchange."
        },
        {
            "Q": "How many links have the relation type lease_chain?",
            "A": "There are {4} links with the relation type lease_chain."
        }
    ],
    "NF": [
        {
            "Q": "Under node Riverstone Residences, how many links are of type rental_agreement?",
            "A": "Node Riverstone Residences has {3} links of type rental_agreement."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Willow Creek Estate}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Willow Creek Estate with a degree of 6}, {node Riverstone Residences with a degree of 6}, {node Sunset Villas Complex with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Oceanfront Horizon Estate to node Pinehill Townhomes in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Oceanfront Horizon Estate to node Pinehill Townhomes is: {Oceanfront Horizon Estate to Willow Creek Estate to Pinehill Townhomes}."
        }
    ],
    "VA": []
}