{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {16} links."
        },
        {
            "Q": "How many nodes link with node Advanced Mathematics Institute?",
            "A": "There are {3} nodes link with node Advanced Mathematics Institute."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Global Policy Institute and node Energy Innovation Lab in this node-link chart?",
            "A": "The relationship between node Global Policy Institute and node Energy Innovation Lab is {co_authorship}."
        },
        {
            "Q": "What is the relationship between node Institute of Robotics and AI and node Energy Innovation Lab in this node-link chart?",
            "A": "The relationship between node Institute of Robotics and AI and node Energy Innovation Lab is {tech_transfer}."
        },
        {
            "Q": "What is the relationship between node Institute of Robotics and AI and node Center for Data Ethics in this node-link chart?",
            "A": "The relationship between node Institute of Robotics and AI and node Center for Data Ethics is {patent_sharing}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type tech_transfer?",
            "A": "There are {4} links with the relation type tech_transfer."
        },
        {
            "Q": "How many links have the relation type patent_sharing?",
            "A": "There are {1} links with the relation type patent_sharing."
        }
    ],
    "NF": [
        {
            "Q": "Under node Climate Research Center, how many links are of type joint_lab?",
            "A": "Node Climate Research Center has {3} links of type joint_lab."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Climate Research Center}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Climate Research Center with a degree of 7}, {node Global Policy Institute with a degree of 5}, {node Institute of Robotics and AI with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Institute of Robotics and AI to node Energy Innovation Lab in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Institute of Robotics and AI to node Energy Innovation Lab is: {Institute of Robotics and AI to Energy Innovation Lab}."
        }
    ],
    "VA": []
}