{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Cultural Heritage Institute?",
            "A": "There are {3} nodes link with node Cultural Heritage Institute."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Climate Research Center and node Advanced Mathematics Institute in this node-link chart?",
            "A": "The relationship between node Climate Research Center and node Advanced Mathematics Institute is {tech_transfer}."
        },
        {
            "Q": "What is the relationship between node Global Policy Institute and node Energy Innovation Lab in this node-link chart?",
            "A": "The relationship between node Global Policy Institute and node Energy Innovation Lab is {joint_lab}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type joint_lab?",
            "A": "There are {5} links with the relation type joint_lab."
        },
        {
            "Q": "How many links have the relation type research_funding?",
            "A": "There are {2} links with the relation type research_funding."
        }
    ],
    "NF": [
        {
            "Q": "Under node Global Policy Institute, how many links are of type joint_lab?",
            "A": "Node Global Policy Institute has {3} links of type joint_lab."
        },
        {
            "Q": "Under node Global Policy Institute, how many links are of type tech_transfer?",
            "A": "Node Global Policy Institute has {1} links of type tech_transfer."
        },
        {
            "Q": "Under node Climate Research Center, how many links are of type patent_sharing?",
            "A": "Node Climate Research Center has {2} links of type patent_sharing."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Global Policy Institute}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Global Policy Institute with a degree of 6}, {node Institute of Robotics and AI with a degree of 6}, {node Climate Research Center with a degree of 6}."
        },
        {
            "Q": "What is the shortest path from node Center for Data Ethics to node Biomedical Research Institute in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Center for Data Ethics to node Biomedical Research Institute is: {Center for Data Ethics to Institute of Robotics and AI to Climate Research Center to Biomedical Research Institute}."
        }
    ],
    "VA": []
}