{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Ocean Studies Institute?",
            "A": "There are {3} nodes link with node Ocean Studies Institute."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Global Policy Institute and node Climate Research Center in this node-link chart?",
            "A": "The relationship between node Global Policy Institute and node Climate Research Center is {joint_lab}."
        },
        {
            "Q": "What is the relationship between node Institute of Robotics and AI and node Advanced Mathematics Institute in this node-link chart?",
            "A": "The relationship between node Institute of Robotics and AI and node Advanced Mathematics Institute is {patent_sharing}."
        },
        {
            "Q": "What is the relationship between node Climate Research Center and node Institute of Robotics and AI in this node-link chart?",
            "A": "The relationship between node Climate Research Center and node Institute of Robotics and AI is {patent_sharing}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type patent_sharing?",
            "A": "There are {4} links with the relation type patent_sharing."
        },
        {
            "Q": "How many links have the relation type research_funding?",
            "A": "There are {1} links with the relation type research_funding."
        },
        {
            "Q": "How many links have the relation type joint_lab?",
            "A": "There are {3} links with the relation type joint_lab."
        }
    ],
    "NF": [
        {
            "Q": "Under node Global Policy Institute, how many links are of type joint_lab?",
            "A": "Node Global Policy Institute has {2} links of type joint_lab."
        },
        {
            "Q": "Under node Institute of Robotics and AI, how many links are of type patent_sharing?",
            "A": "Node Institute of Robotics and AI has {2} links of type patent_sharing."
        },
        {
            "Q": "Under node Climate Research Center, how many links are of type patent_sharing?",
            "A": "Node Climate Research Center has {2} links of type patent_sharing."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Institute of Robotics and AI}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Institute of Robotics and AI with a degree of 7}, {node Climate Research Center with a degree of 6}, {node Global Policy Institute with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Center for Data Ethics to node Global Policy Institute in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Center for Data Ethics to node Global Policy Institute is: {Center for Data Ethics to Global Policy Institute}."
        }
    ],
    "VA": []
}