{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {16} links."
        },
        {
            "Q": "How many nodes link with node Biomedical Research Institute?",
            "A": "There are {4} nodes link with node Biomedical Research Institute."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Institute of Robotics and AI and node Ocean Studies Institute in this node-link chart?",
            "A": "The relationship between node Institute of Robotics and AI and node Ocean Studies Institute is {co_authorship}."
        },
        {
            "Q": "What is the relationship between node Climate Research Center and node Neuroscience Research Group in this node-link chart?",
            "A": "The relationship between node Climate Research Center and node Neuroscience Research Group is {patent_sharing}."
        },
        {
            "Q": "What is the relationship between node Climate Research Center and node Cultural Heritage Institute in this node-link chart?",
            "A": "The relationship between node Climate Research Center and node Cultural Heritage Institute is {tech_transfer}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type research_funding?",
            "A": "There are {4} links with the relation type research_funding."
        },
        {
            "Q": "How many links have the relation type joint_lab?",
            "A": "There are {3} links with the relation type joint_lab."
        }
    ],
    "NF": [
        {
            "Q": "Under node Institute of Robotics and AI, how many links are of type joint_lab?",
            "A": "Node Institute of Robotics and AI has {1} links of type joint_lab."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Climate Research Center}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Climate Research Center with a degree of 7}, {node Institute of Robotics and AI with a degree of 6}, {node Global Policy Institute with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Ocean Studies Institute to node Neuroscience Research Group in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Ocean Studies Institute to node Neuroscience Research Group is: {Ocean Studies Institute to Climate Research Center to Neuroscience Research Group}."
        }
    ],
    "VA": []
}