{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Falcon Investment Profile?",
            "A": "There are {3} nodes link with node Falcon Investment Profile."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Quantum Trading Profile and node UrbanTrend Member Account in this node-link chart?",
            "A": "The relationship between node Quantum Trading Profile and node UrbanTrend Member Account is {follower_link}."
        },
        {
            "Q": "What is the relationship between node Anderson Premium Account and node UrbanTrend Member Account in this node-link chart?",
            "A": "The relationship between node Anderson Premium Account and node UrbanTrend Member Account is {collab_post}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type content_stream?",
            "A": "There are {3} links with the relation type content_stream."
        }
    ],
    "NF": [
        {
            "Q": "Under node Quantum Trading Profile, how many links are of type collab_post?",
            "A": "Node Quantum Trading Profile has {1} links of type collab_post."
        },
        {
            "Q": "Under node Quantum Trading Profile, how many links are of type media_affiliation?",
            "A": "Node Quantum Trading Profile has {2} links of type media_affiliation."
        },
        {
            "Q": "Under node Sunrise Savings Account, how many links are of type follower_link?",
            "A": "Node Sunrise Savings Account has {1} links of type follower_link."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Anderson Premium Account}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Anderson Premium Account with a degree of 6}, {node Sunrise Savings Account with a degree of 5}, {node Quantum Trading Profile with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node BlueOcean Finance Account to node Evergreen Business Account in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node BlueOcean Finance Account to node Evergreen Business Account is: {BlueOcean Finance Account to Anderson Premium Account to Quantum Trading Profile to Evergreen Business Account}."
        }
    ],
    "VA": []
}