{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Velocity Pro Account?",
            "A": "There are {3} nodes link with node Velocity Pro Account."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Anderson Premium Account and node Velocity Pro Account in this node-link chart?",
            "A": "The relationship between node Anderson Premium Account and node Velocity Pro Account is {tag_mention}."
        },
        {
            "Q": "What is the relationship between node Quantum Trading Profile and node BlueOcean Finance Account in this node-link chart?",
            "A": "The relationship between node Quantum Trading Profile and node BlueOcean Finance Account is {content_stream}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type follower_link?",
            "A": "There are {5} links with the relation type follower_link."
        },
        {
            "Q": "How many links have the relation type media_affiliation?",
            "A": "There are {3} links with the relation type media_affiliation."
        }
    ],
    "NF": [
        {
            "Q": "Under node Sunrise Savings Account, how many links are of type tag_mention?",
            "A": "Node Sunrise Savings Account has {1} links of type tag_mention."
        },
        {
            "Q": "Under node Quantum Trading Profile, how many links are of type media_affiliation?",
            "A": "Node Quantum Trading Profile has {2} links of type media_affiliation."
        },
        {
            "Q": "Under node Anderson Premium Account, how many links are of type tag_mention?",
            "A": "Node Anderson Premium Account has {2} links of type tag_mention."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Quantum Trading Profile}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Quantum Trading Profile with a degree of 7}, {node Sunrise Savings Account with a degree of 6}, {node Anderson Premium Account with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Quantum Trading Profile to node Velocity Pro Account in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Quantum Trading Profile to node Velocity Pro Account is: {Quantum Trading Profile to Velocity Pro Account}."
        }
    ],
    "VA": []
}