{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {14} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {17} links."
        },
        {
            "Q": "How many nodes link with node Sierra Survey Team?",
            "A": "There are {3} nodes link with node Sierra Survey Team."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Alpha Research Team and node Nova Creative Taskforce in this node-link chart?",
            "A": "The relationship between node Alpha Research Team and node Nova Creative Taskforce is {match_schedule}."
        },
        {
            "Q": "What is the relationship between node Beta Operations Group and node Gamma Security Unit in this node-link chart?",
            "A": "The relationship between node Beta Operations Group and node Gamma Security Unit is {league_affiliation}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type venue_booking?",
            "A": "There are {4} links with the relation type venue_booking."
        },
        {
            "Q": "How many links have the relation type match_schedule?",
            "A": "There are {3} links with the relation type match_schedule."
        },
        {
            "Q": "How many links have the relation type league_affiliation?",
            "A": "There are {3} links with the relation type league_affiliation."
        }
    ],
    "NF": [
        {
            "Q": "Under node Epsilon Design Team, how many links are of type ticket_sharing?",
            "A": "Node Epsilon Design Team has {1} links of type ticket_sharing."
        },
        {
            "Q": "Under node Gamma Security Unit, how many links are of type broadcast_right?",
            "A": "Node Gamma Security Unit has {1} links of type broadcast_right."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Gamma Security Unit}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Gamma Security Unit with a degree of 7}, {node Alpha Research Team with a degree of 6}, {node Beta Operations Group with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Draco Robotics Team to node Alpha Research Team in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Draco Robotics Team to node Alpha Research Team is: {Draco Robotics Team to Alpha Research Team}."
        }
    ],
    "VA": []
}