{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {14} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {18} links."
        },
        {
            "Q": "How many nodes link with node Omega Testing Division?",
            "A": "There are {3} nodes link with node Omega Testing Division."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Lynx Data Science Team and node Sierra Survey Team in this node-link chart?",
            "A": "The relationship between node Lynx Data Science Team and node Sierra Survey Team is {match_schedule}."
        },
        {
            "Q": "What is the relationship between node Alpha Research Team and node Beta Operations Group in this node-link chart?",
            "A": "The relationship between node Alpha Research Team and node Beta Operations Group is {venue_booking}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type match_schedule?",
            "A": "There are {5} links with the relation type match_schedule."
        }
    ],
    "NF": [
        {
            "Q": "Under node Alpha Research Team, how many links are of type broadcast_right?",
            "A": "Node Alpha Research Team has {1} links of type broadcast_right."
        },
        {
            "Q": "Under node Alpha Research Team, how many links are of type venue_booking?",
            "A": "Node Alpha Research Team has {1} links of type venue_booking."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Gamma Security Unit}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Gamma Security Unit with a degree of 7}, {node Beta Operations Group with a degree of 6}, {node Alpha Research Team with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Omega Testing Division to node Atlas Engineering Unit in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Omega Testing Division to node Atlas Engineering Unit is: {Omega Testing Division to Gamma Security Unit to Beta Operations Group to Atlas Engineering Unit}."
        }
    ],
    "VA": []
}