{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {14} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {17} links."
        },
        {
            "Q": "How many nodes link with node Sierra Survey Team?",
            "A": "There are {3} nodes link with node Sierra Survey Team."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Falcon Deployment Crew and node Sierra Survey Team in this node-link chart?",
            "A": "The relationship between node Falcon Deployment Crew and node Sierra Survey Team is {ticket_sharing}."
        },
        {
            "Q": "What is the relationship between node Alpha Research Team and node Draco Robotics Team in this node-link chart?",
            "A": "The relationship between node Alpha Research Team and node Draco Robotics Team is {broadcast_right}."
        },
        {
            "Q": "What is the relationship between node Alpha Research Team and node Omega Testing Division in this node-link chart?",
            "A": "The relationship between node Alpha Research Team and node Omega Testing Division is {league_affiliation}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type match_schedule?",
            "A": "There are {2} links with the relation type match_schedule."
        },
        {
            "Q": "How many links have the relation type broadcast_right?",
            "A": "There are {6} links with the relation type broadcast_right."
        }
    ],
    "NF": [
        {
            "Q": "Under node Gamma Security Unit, how many links are of type match_schedule?",
            "A": "Node Gamma Security Unit has {2} links of type match_schedule."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Alpha Research Team}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Alpha Research Team with a degree of 6}, {node Beta Operations Group with a degree of 6}, {node Gamma Security Unit with a degree of 6}."
        },
        {
            "Q": "What is the shortest path from node Sierra Survey Team to node Alpha Research Team in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Sierra Survey Team to node Alpha Research Team is: {Sierra Survey Team to Alpha Research Team}."
        }
    ],
    "VA": []
}