{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {14} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {18} links."
        },
        {
            "Q": "How many nodes link with node Atlas Engineering Unit?",
            "A": "There are {4} nodes link with node Atlas Engineering Unit."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Beta Operations Group and node Omega Testing Division in this node-link chart?",
            "A": "The relationship between node Beta Operations Group and node Omega Testing Division is {venue_booking}."
        },
        {
            "Q": "What is the relationship between node Alpha Research Team and node Phoenix Rescue Squad in this node-link chart?",
            "A": "The relationship between node Alpha Research Team and node Phoenix Rescue Squad is {match_schedule}."
        },
        {
            "Q": "What is the relationship between node Beta Operations Group and node Epsilon Design Team in this node-link chart?",
            "A": "The relationship between node Beta Operations Group and node Epsilon Design Team is {league_affiliation}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type broadcast_right?",
            "A": "There are {4} links with the relation type broadcast_right."
        }
    ],
    "NF": [
        {
            "Q": "Under node Beta Operations Group, how many links are of type ticket_sharing?",
            "A": "Node Beta Operations Group has {1} links of type ticket_sharing."
        },
        {
            "Q": "Under node Alpha Research Team, how many links are of type ticket_sharing?",
            "A": "Node Alpha Research Team has {1} links of type ticket_sharing."
        },
        {
            "Q": "Under node Alpha Research Team, how many links are of type venue_booking?",
            "A": "Node Alpha Research Team has {1} links of type venue_booking."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Alpha Research Team}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Alpha Research Team with a degree of 6}, {node Gamma Security Unit with a degree of 6}, {node Beta Operations Group with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Falcon Deployment Crew to node Sierra Survey Team in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Falcon Deployment Crew to node Sierra Survey Team is: {Falcon Deployment Crew to Alpha Research Team to Beta Operations Group to Sierra Survey Team}."
        }
    ],
    "VA": []
}