{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {14} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {18} links."
        },
        {
            "Q": "How many nodes link with node Delta Innovation Crew?",
            "A": "There are {5} nodes link with node Delta Innovation Crew."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Falcon Deployment Crew and node Delta Innovation Crew in this node-link chart?",
            "A": "The relationship between node Falcon Deployment Crew and node Delta Innovation Crew is {broadcast_right}."
        },
        {
            "Q": "What is the relationship between node Gamma Security Unit and node Delta Innovation Crew in this node-link chart?",
            "A": "The relationship between node Gamma Security Unit and node Delta Innovation Crew is {league_affiliation}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type broadcast_right?",
            "A": "There are {4} links with the relation type broadcast_right."
        }
    ],
    "NF": [
        {
            "Q": "Under node Alpha Research Team, how many links are of type match_schedule?",
            "A": "Node Alpha Research Team has {1} links of type match_schedule."
        },
        {
            "Q": "Under node Gamma Security Unit, how many links are of type venue_booking?",
            "A": "Node Gamma Security Unit has {1} links of type venue_booking."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Alpha Research Team}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Alpha Research Team with a degree of 6}, {node Gamma Security Unit with a degree of 6}, {node Delta Innovation Crew with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Delta Innovation Crew to node Atlas Engineering Unit in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Delta Innovation Crew to node Atlas Engineering Unit is: {Delta Innovation Crew to Gamma Security Unit to Atlas Engineering Unit}."
        }
    ],
    "VA": []
}