{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Venice Canal District?",
            "A": "There are {3} nodes link with node Venice Canal District."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Paris Historical Spot and node Rome Ancient Ruins in this node-link chart?",
            "A": "The relationship between node Paris Historical Spot and node Rome Ancient Ruins is {tourism_package_link}."
        },
        {
            "Q": "What is the relationship between node Paris Historical Spot and node New York City Landmark in this node-link chart?",
            "A": "The relationship between node Paris Historical Spot and node New York City Landmark is {tour_route}."
        },
        {
            "Q": "What is the relationship between node New York City Landmark and node Bali Beach Resort in this node-link chart?",
            "A": "The relationship between node New York City Landmark and node Bali Beach Resort is {sightseeing_bus_connection}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type hotel_chain_membership?",
            "A": "There are {2} links with the relation type hotel_chain_membership."
        }
    ],
    "NF": [
        {
            "Q": "Under node Kyoto Temple Area, how many links are of type hotel_chain_membership?",
            "A": "Node Kyoto Temple Area has {2} links of type hotel_chain_membership."
        },
        {
            "Q": "Under node Paris Historical Spot, how many links are of type shared_transport?",
            "A": "Node Paris Historical Spot has {2} links of type shared_transport."
        },
        {
            "Q": "Under node Paris Historical Spot, how many links are of type tourism_package_link?",
            "A": "Node Paris Historical Spot has {1} links of type tourism_package_link."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {New York City Landmark}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node New York City Landmark with a degree of 6}, {node Kyoto Temple Area with a degree of 6}, {node Paris Historical Spot with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Rome Ancient Ruins to node New York City Landmark in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Rome Ancient Ruins to node New York City Landmark is: {Rome Ancient Ruins to Kyoto Temple Area to New York City Landmark}."
        }
    ],
    "VA": []
}