{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {5} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {10} links."
        },
        {
            "Q": "How many nodes link with node Bluewave Energy Inc.?",
            "A": "There are {4} nodes link with node Bluewave Energy Inc.."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node NovaGen Biotech and node Bluewave Energy Inc. in this node-link chart?",
            "A": "The relationship between node NovaGen Biotech and node Bluewave Energy Inc. is {strategic_alliance}."
        },
        {
            "Q": "What is the relationship between node NovaGen Biotech and node Summit Financial Group in this node-link chart?",
            "A": "The relationship between node NovaGen Biotech and node Summit Financial Group is {financial_transaction}."
        },
        {
            "Q": "What is the relationship between node Evergreen Logistics Ltd. and node Summit Financial Group in this node-link chart?",
            "A": "The relationship between node Evergreen Logistics Ltd. and node Summit Financial Group is {financial_transaction}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type merger_link?",
            "A": "There are {3} links with the relation type merger_link."
        },
        {
            "Q": "How many links have the relation type supply_contract?",
            "A": "There are {1} links with the relation type supply_contract."
        }
    ],
    "NF": [
        {
            "Q": "Under node Orion Tech Corporation, how many links are of type supply_contract?",
            "A": "Node Orion Tech Corporation has {1} links of type supply_contract."
        },
        {
            "Q": "Under node Evergreen Logistics Ltd., how many links are of type financial_transaction?",
            "A": "Node Evergreen Logistics Ltd. has {1} links of type financial_transaction."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Orion Tech Corporation}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Orion Tech Corporation with a degree of 4}, {node Summit Financial Group with a degree of 4}, {node NovaGen Biotech with a degree of 4}."
        },
        {
            "Q": "What is the shortest path from node Evergreen Logistics Ltd. to node Bluewave Energy Inc. in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Evergreen Logistics Ltd. to node Bluewave Energy Inc. is: {Evergreen Logistics Ltd. to Bluewave Energy Inc.}."
        }
    ],
    "VA": []
}