{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {15} links."
        },
        {
            "Q": "How many nodes link with node Rome Ancient Ruins?",
            "A": "There are {3} nodes link with node Rome Ancient Ruins."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Kyoto Temple Area and node Bali Beach Resort in this node-link chart?",
            "A": "The relationship between node Kyoto Temple Area and node Bali Beach Resort is {sightseeing_bus_connection}."
        },
        {
            "Q": "What is the relationship between node Kyoto Temple Area and node Rome Ancient Ruins in this node-link chart?",
            "A": "The relationship between node Kyoto Temple Area and node Rome Ancient Ruins is {tourism_package_link}."
        },
        {
            "Q": "What is the relationship between node Kyoto Temple Area and node Beijing Forbidden Site in this node-link chart?",
            "A": "The relationship between node Kyoto Temple Area and node Beijing Forbidden Site is {sightseeing_bus_connection}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type shared_transport?",
            "A": "There are {2} links with the relation type shared_transport."
        },
        {
            "Q": "How many links have the relation type hotel_chain_membership?",
            "A": "There are {1} links with the relation type hotel_chain_membership."
        },
        {
            "Q": "How many links have the relation type tourism_package_link?",
            "A": "There are {4} links with the relation type tourism_package_link."
        }
    ],
    "NF": [
        {
            "Q": "Under node New York City Landmark, how many links are of type sightseeing_bus_connection?",
            "A": "Node New York City Landmark has {2} links of type sightseeing_bus_connection."
        },
        {
            "Q": "Under node New York City Landmark, how many links are of type tourism_package_link?",
            "A": "Node New York City Landmark has {2} links of type tourism_package_link."
        },
        {
            "Q": "Under node Kyoto Temple Area, how many links are of type tour_route?",
            "A": "Node Kyoto Temple Area has {1} links of type tour_route."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {New York City Landmark}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node New York City Landmark with a degree of 6}, {node Paris Historical Spot with a degree of 5}, {node Kyoto Temple Area with a degree of 5}."
        },
        {
            "Q": "What is the shortest path from node Paris Historical Spot to node Venice Canal District in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Paris Historical Spot to node Venice Canal District is: {Paris Historical Spot to Venice Canal District}."
        }
    ],
    "VA": []
}