{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {5} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {10} links."
        },
        {
            "Q": "How many nodes link with node Singapore Distribution Node?",
            "A": "There are {4} nodes link with node Singapore Distribution Node."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Rotterdam Port and node Dubai Transport Center in this node-link chart?",
            "A": "The relationship between node Rotterdam Port and node Dubai Transport Center is {air_route}."
        },
        {
            "Q": "What is the relationship between node Chicago Logistics Hub and node Rotterdam Port in this node-link chart?",
            "A": "The relationship between node Chicago Logistics Hub and node Rotterdam Port is {air_route}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type logistics_alliance?",
            "A": "There are {1} links with the relation type logistics_alliance."
        }
    ],
    "NF": [
        {
            "Q": "Under node Shanghai Freight Station, how many links are of type air_route?",
            "A": "Node Shanghai Freight Station has {1} links of type air_route."
        },
        {
            "Q": "Under node Rotterdam Port, how many links are of type highway_connection?",
            "A": "Node Rotterdam Port has {1} links of type highway_connection."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Chicago Logistics Hub}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Chicago Logistics Hub with a degree of 4}, {node Shanghai Freight Station with a degree of 4}, {node Rotterdam Port with a degree of 4}."
        },
        {
            "Q": "What is the shortest path from node Rotterdam Port to node Dubai Transport Center in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Rotterdam Port to node Dubai Transport Center is: {Rotterdam Port to Dubai Transport Center}."
        }
    ],
    "VA": []
}