{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {node_link chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this node-link chart?",
            "A": "There are {5} nodes."
        },
        {
            "Q": "How many links are in this node-link chart?",
            "A": "There are {10} links."
        },
        {
            "Q": "How many nodes link with node Singapore Distribution Node?",
            "A": "There are {4} nodes link with node Singapore Distribution Node."
        }
    ],
    "SRP": [],
    "VPR": [],
    "VE": [
        {
            "Q": "What is the relationship between node Dubai Transport Center and node Singapore Distribution Node in this node-link chart?",
            "A": "The relationship between node Dubai Transport Center and node Singapore Distribution Node is {air_route}."
        },
        {
            "Q": "What is the relationship between node Shanghai Freight Station and node Dubai Transport Center in this node-link chart?",
            "A": "The relationship between node Shanghai Freight Station and node Dubai Transport Center is {logistics_alliance}."
        }
    ],
    "EVJ": [],
    "SC": [
        {
            "Q": "How many links have the relation type air_route?",
            "A": "There are {1} links with the relation type air_route."
        },
        {
            "Q": "How many links have the relation type shipping_lane?",
            "A": "There are {1} links with the relation type shipping_lane."
        },
        {
            "Q": "How many links have the relation type logistics_alliance?",
            "A": "There are {2} links with the relation type logistics_alliance."
        }
    ],
    "NF": [
        {
            "Q": "Under node Chicago Logistics Hub, how many links are of type intercity_bus_route?",
            "A": "Node Chicago Logistics Hub has {2} links of type intercity_bus_route."
        },
        {
            "Q": "Under node Rotterdam Port, how many links are of type intercity_bus_route?",
            "A": "Node Rotterdam Port has {3} links of type intercity_bus_route."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "Which node is considered the most important in the node link chart?",
            "A": "The most important node is {Chicago Logistics Hub}."
        },
        {
            "Q": "Please list the top three nodes by degree and their corresponding degrees.",
            "A": "The top three nodes by degree are: {node Chicago Logistics Hub with a degree of 4}, {node Shanghai Freight Station with a degree of 4}, {node Singapore Distribution Node with a degree of 4}."
        },
        {
            "Q": "What is the shortest path from node Chicago Logistics Hub to node Dubai Transport Center in the node link diagram? Please list all nodes along this path in sequence.",
            "A": "The shortest path from node Chicago Logistics Hub to node Dubai Transport Center is: {Chicago Logistics Hub to Dubai Transport Center}."
        }
    ],
    "VA": []
}