{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Terra Tempo Festival relative to Azure Sky Symphony?",
            "A": "Terra Tempo Festival is {below} Azure Sky Symphony in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total music festival attendance?",
            "A": "The series with the largest contribution is {Terra Tempo Festival}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total music festival attendance?",
            "A": "The series with the smallest contribution is {Zenith Rhythm Fest}."
        }
    ],
    "VE": [
        {
            "Q": "What is Azure Sky Symphony's Music Festival Attendance in 1974?",
            "A": "Azure Sky Symphony's music festival attendance in 1974 is {104683.52} attendees."
        },
        {
            "Q": "What is Terra Tempo Festival's Music Festival Attendance in 1983?",
            "A": "Terra Tempo Festival's music festival attendance in 1983 is {72525.39} attendees."
        },
        {
            "Q": "What is Azure Sky Symphony's Music Festival Attendance in 1981?",
            "A": "Azure Sky Symphony's music festival attendance in 1981 is {112731.58} attendees."
        },
        {
            "Q": "What are the music festival attendance of Terra Tempo Festival, Zenith Rhythm Fest, and Azure Sky Symphony in 1971?",
            "A": "Terra Tempo Festival's music festival attendance is {120796.69} attendees, Zenith Rhythm Fest's music festival attendance is {16084.71} attendees, Azure Sky Symphony's music festival attendance is {110755.90} attendees."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Music Festival Attendance in the area chart?",
            "A": "The global minimum music festival attendance is {2615.45} attendees."
        },
        {
            "Q": "What is the global maximum Music Festival Attendance in the area chart?",
            "A": "The global maximum music festival attendance is {135373.72} attendees."
        },
        {
            "Q": "What is the highest Music Festival Attendance level recorded for Azure Sky Symphony?",
            "A": "Azure Sky Symphony reached approximately {133805.95} attendees in {1960}."
        },
        {
            "Q": "What is the lowest Music Festival Attendance level recorded for Azure Sky Symphony?",
            "A": "Azure Sky Symphony's lowest recorded level is approximately {73236.34} attendees in {1983}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Music Festival Attendance?",
            "A": "The average total music festival attendance is {233341.26} attendees."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Music Festival Attendance go below 207989.33 attendees? Please list the years and corresponding total values.",
            "A": "{195951.35} attendees in {1972}, {169874.96} attendees in {1973}, {178678.27} attendees in {1982}."
        },
        {
            "Q": "Which years did the total Music Festival Attendance exceed 253676.71 attendees? Please list the years and corresponding total values.",
            "A": "{299359.44} attendees in {1961}, {289883.56} attendees in {1970}, {280468.43} attendees in {1959}."
        },
        {
            "Q": "Which years did the total Music Festival Attendance fall between 219291.37 and 242374.67 attendees? Please list the years and corresponding total values.",
            "A": "{237821.92} attendees in {1976}, {233123.72} attendees in {1969}, {228977.83} attendees in {1962}."
        }
    ],
    "NC": [
        {
            "Q": "Was the total Music Festival Attendance in 1969 higher or lower than in 1983?",
            "A": "The total music festival attendance in 1969 was {higher} than in 1983."
        },
        {
            "Q": "Was the total Music Festival Attendance in 1961 higher or lower than in 1983?",
            "A": "The total music festival attendance in 1961 was {higher} than in 1983."
        },
        {
            "Q": "Between 1970 and 1982, did the total Music Festival Attendance experience a larger or smaller change than between 1968 and 1984?",
            "A": "The change in total music festival attendance between 1970 and 1982 was {larger} than between 1968 and 1984."
        },
        {
            "Q": "Was the total Music Festival Attendance in 1977 higher or lower than in 1984?",
            "A": "The total music festival attendance in 1977 was {lower} than in 1984."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Terra Tempo Festival} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Zenith Rhythm Fest, Azure Sky Symphony, Terra Tempo Festival}."
        }
    ]
}