{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {6} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Stellar Exhibit Hall relative to Meridian Art Collective?",
            "A": "Stellar Exhibit Hall is {above} Meridian Art Collective in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total art gallery visitors?",
            "A": "The series with the largest contribution is {Aura Fine Arts}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total art gallery visitors?",
            "A": "The series with the smallest contribution is {The Gilded Frame}."
        }
    ],
    "VE": [
        {
            "Q": "What is The Gilded Frame's Art Gallery Visitors in 1978?",
            "A": "The Gilded Frame's art gallery visitors in 1978 is {125619.13} visitors."
        },
        {
            "Q": "What is Zenith Sculpture Garden's Art Gallery Visitors in 1979?",
            "A": "Zenith Sculpture Garden's art gallery visitors in 1979 is {223113.51} visitors."
        },
        {
            "Q": "What is Meridian Art Collective's Art Gallery Visitors in 1976?",
            "A": "Meridian Art Collective's art gallery visitors in 1976 is {327139.18} visitors."
        },
        {
            "Q": "What are the art gallery visitors of Ironwood Gallery, Zenith Sculpture Garden, and Aura Fine Arts in 1974?",
            "A": "Ironwood Gallery's art gallery visitors is {188502.02} visitors, Zenith Sculpture Garden's art gallery visitors is {251635.03} visitors, Aura Fine Arts's art gallery visitors is {450328.90} visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Art Gallery Visitors in the area chart?",
            "A": "The global minimum art gallery visitors is {53530.54} visitors."
        },
        {
            "Q": "What is the global maximum Art Gallery Visitors in the area chart?",
            "A": "The global maximum art gallery visitors is {612619.47} visitors."
        },
        {
            "Q": "What is the highest Art Gallery Visitors level recorded for Aura Fine Arts?",
            "A": "Aura Fine Arts reached approximately {612619.47} visitors in {1982}."
        },
        {
            "Q": "What is the lowest Art Gallery Visitors level recorded for Aura Fine Arts?",
            "A": "Aura Fine Arts's lowest recorded level is approximately {296329.88} visitors in {1970}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Art Gallery Visitors?",
            "A": "The average total art gallery visitors is {1579701.49} visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Art Gallery Visitors go below 1482884.11 visitors? Please list the years and corresponding total values.",
            "A": "{1323993.48} visitors in {1983}, {1480745.89} visitors in {1977}, {1471190.95} visitors in {1979}."
        },
        {
            "Q": "Which years did the total Art Gallery Visitors fall between 1470904.09 and 1625736.10 visitors? Please list the years and corresponding total values.",
            "A": "{1580540.79} visitors in {1976}, {1570636.63} visitors in {1980}, {1480745.89} visitors in {1977}."
        },
        {
            "Q": "Which years did the total Art Gallery Visitors exceed 1613756.08 visitors? Please list the years and corresponding total values.",
            "A": "{1725558.01} visitors in {1975}, {1818580.57} visitors in {1969}, {1782685.37} visitors in {1970}."
        }
    ],
    "NC": [
        {
            "Q": "Between 1978 and 1979, was the average total Art Gallery Visitors higher or lower than between 1969 and 1979?",
            "A": "The average total art gallery visitors between 1978 and 1979 was {lower} than between 1969 and 1979."
        },
        {
            "Q": "Between 1972 and 1983, was the average total Art Gallery Visitors higher or lower than between 1969 and 1977?",
            "A": "The average total art gallery visitors between 1972 and 1983 was {lower} than between 1969 and 1977."
        },
        {
            "Q": "Was the total Art Gallery Visitors in 1977 higher or lower than in 1982?",
            "A": "The total art gallery visitors in 1977 was {higher} than in 1982."
        },
        {
            "Q": "Between 1970 and 1974, did the total Art Gallery Visitors experience a larger or smaller change than between 1971 and 1977?",
            "A": "The change in total art gallery visitors between 1970 and 1974 was {smaller} than between 1971 and 1977."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Aura Fine Arts} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Ironwood Gallery, The Gilded Frame, Stellar Exhibit Hall, Zenith Sculpture Garden, Meridian Art Collective, Aura Fine Arts}."
        }
    ]
}