{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {4} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Meridian Art Collective relative to The Gilded Frame?",
            "A": "Meridian Art Collective is {below} The Gilded Frame in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total art gallery visitors?",
            "A": "The series with the largest contribution is {Meridian Art Collective}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total art gallery visitors?",
            "A": "The series with the smallest contribution is {Whispering Canvas}."
        }
    ],
    "VE": [
        {
            "Q": "What is Whispering Canvas's Art Gallery Visitors in 1972?",
            "A": "Whispering Canvas's art gallery visitors in 1972 is {262374.11} visitors."
        },
        {
            "Q": "What is The Gilded Frame's Art Gallery Visitors in 1971?",
            "A": "The Gilded Frame's art gallery visitors in 1971 is {381986.20} visitors."
        },
        {
            "Q": "What is Whispering Canvas's Art Gallery Visitors in 1971?",
            "A": "Whispering Canvas's art gallery visitors in 1971 is {255328.08} visitors."
        },
        {
            "Q": "What are the art gallery visitors of The Gilded Frame, Zenith Sculpture Garden, and Meridian Art Collective in 1977?",
            "A": "The Gilded Frame's art gallery visitors is {552624.54} visitors, Zenith Sculpture Garden's art gallery visitors is {297506.52} visitors, Meridian Art Collective's art gallery visitors is {535871.72} visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Art Gallery Visitors in the area chart?",
            "A": "The global minimum art gallery visitors is {104999.50} visitors."
        },
        {
            "Q": "What is the global maximum Art Gallery Visitors in the area chart?",
            "A": "The global maximum art gallery visitors is {810698.20} visitors."
        },
        {
            "Q": "What is the highest Art Gallery Visitors level recorded for Meridian Art Collective?",
            "A": "Meridian Art Collective reached approximately {810698.20} visitors in {1988}."
        },
        {
            "Q": "What is the lowest Art Gallery Visitors level recorded for Meridian Art Collective?",
            "A": "Meridian Art Collective's lowest recorded level is approximately {274706.64} visitors in {1967}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Art Gallery Visitors?",
            "A": "The average total art gallery visitors is {1614216.98} visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Art Gallery Visitors fall between 1526155.77 and 1686803.74 visitors? Please list the years and corresponding total values.",
            "A": "{1680045.55} visitors in {1979}, {1531129.24} visitors in {1974}, {1584080.78} visitors in {1977}."
        },
        {
            "Q": "Which years did the total Art Gallery Visitors go below 1444472.55 visitors? Please list the years and corresponding total values.",
            "A": "{1444152.77} visitors in {1976}, {1333569.16} visitors in {1969}, {1283683.46} visitors in {1970}."
        },
        {
            "Q": "Which years did the total Art Gallery Visitors exceed 1768486.96 visitors? Please list the years and corresponding total values.",
            "A": "{1901743.86} visitors in {1983}, {2091347.67} visitors in {1988}, {1908851.57} visitors in {1984}."
        }
    ],
    "NC": [
        {
            "Q": "Was the total Art Gallery Visitors in 1972 higher or lower than in 1985?",
            "A": "The total art gallery visitors in 1972 was {lower} than in 1985."
        },
        {
            "Q": "Was the total Art Gallery Visitors in 1967 higher or lower than in 1986?",
            "A": "The total art gallery visitors in 1967 was {lower} than in 1986."
        },
        {
            "Q": "Between 1967 and 1988, was the average total Art Gallery Visitors higher or lower than between 1975 and 1980?",
            "A": "The average total art gallery visitors between 1967 and 1988 was {higher} than between 1975 and 1980."
        },
        {
            "Q": "Between 1978 and 1984, was the average total Art Gallery Visitors higher or lower than between 1976 and 1987?",
            "A": "The average total art gallery visitors between 1978 and 1984 was {higher} than between 1976 and 1987."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Meridian Art Collective} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Whispering Canvas, Zenith Sculpture Garden, The Gilded Frame, Meridian Art Collective}."
        }
    ]
}