{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {2} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Echo Bloom Festival relative to Azure Sky Symphony?",
            "A": "Echo Bloom Festival is {above} Azure Sky Symphony in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total music festival attendance?",
            "A": "The series with the largest contribution is {Azure Sky Symphony}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total music festival attendance?",
            "A": "The series with the smallest contribution is {Echo Bloom Festival}."
        }
    ],
    "VE": [
        {
            "Q": "What is Azure Sky Symphony's Music Festival Attendance in 1989?",
            "A": "Azure Sky Symphony's music festival attendance in 1989 is {85122.85} attendees."
        },
        {
            "Q": "What is Echo Bloom Festival's Music Festival Attendance in 1987?",
            "A": "Echo Bloom Festival's music festival attendance in 1987 is {95285.72} attendees."
        },
        {
            "Q": "What is Azure Sky Symphony's Music Festival Attendance in 1986?",
            "A": "Azure Sky Symphony's music festival attendance in 1986 is {102901.27} attendees."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Music Festival Attendance in the area chart?",
            "A": "The global minimum music festival attendance is {63154.04} attendees."
        },
        {
            "Q": "What is the global maximum Music Festival Attendance in the area chart?",
            "A": "The global maximum music festival attendance is {104726.78} attendees."
        },
        {
            "Q": "What is the highest Music Festival Attendance level recorded for Azure Sky Symphony?",
            "A": "Azure Sky Symphony reached approximately {102901.27} attendees in {1986}."
        },
        {
            "Q": "What is the lowest Music Festival Attendance level recorded for Azure Sky Symphony?",
            "A": "Azure Sky Symphony's lowest recorded level is approximately {85122.85} attendees in {1989}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Music Festival Attendance?",
            "A": "The average total music festival attendance is {181111.63} attendees."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Music Festival Attendance exceed 195286.72 attendees? Please list the years and corresponding total values.",
            "A": "{195578.67} attendees in {1985}, {198882.98} attendees in {1984}."
        },
        {
            "Q": "Which years did the total Music Festival Attendance go below 174468.24 attendees? Please list the years and corresponding total values.",
            "A": "{148276.89} attendees in {1989}, {162014.83} attendees in {1988}."
        },
        {
            "Q": "Which years did the total Music Festival Attendance fall between 175633.61 and 194121.36 attendees? Please list the years and corresponding total values.",
            "A": "{186921.65} attendees in {1987}."
        }
    ],
    "NC": [
        {
            "Q": "Between 1984 and 1986, did the total Music Festival Attendance experience a larger or smaller change than between 1986 and 1988?",
            "A": "The change in total music festival attendance between 1984 and 1986 was {smaller} than between 1986 and 1988."
        },
        {
            "Q": "Was the total Music Festival Attendance in 1984 higher or lower than in 1989?",
            "A": "The total music festival attendance in 1984 was {higher} than in 1989."
        },
        {
            "Q": "Between 1987 and 1988, was the average total Music Festival Attendance higher or lower than between 1985 and 1986?",
            "A": "The average total music festival attendance between 1987 and 1988 was {lower} than between 1985 and 1986."
        },
        {
            "Q": "Between 1985 and 1986, did the total Music Festival Attendance experience a larger or smaller change than between 1985 and 1989?",
            "A": "The change in total music festival attendance between 1985 and 1986 was {smaller} than between 1985 and 1989."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Azure Sky Symphony} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Echo Bloom Festival, Azure Sky Symphony}."
        }
    ]
}