{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Zenith Institute of Technology relative to Silverhaven Polytechnic?",
            "A": "Zenith Institute of Technology is {below} Silverhaven Polytechnic in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total faculty satisfaction?",
            "A": "The series with the largest contribution is {Silverhaven Polytechnic}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total faculty satisfaction?",
            "A": "The series with the smallest contribution is {Zenith Institute of Technology}."
        }
    ],
    "VE": [
        {
            "Q": "What is Celestial College's Faculty Satisfaction in 1955?",
            "A": "Celestial College's faculty satisfaction in 1955 is {70.53} %."
        },
        {
            "Q": "What is Celestial College's Faculty Satisfaction in 1958?",
            "A": "Celestial College's faculty satisfaction in 1958 is {62.84} %."
        },
        {
            "Q": "What is Celestial College's Faculty Satisfaction in 1959?",
            "A": "Celestial College's faculty satisfaction in 1959 is {60.16} %."
        },
        {
            "Q": "What are the faculty satisfaction of Zenith Institute of Technology, Celestial College, and Silverhaven Polytechnic in 1956?",
            "A": "Zenith Institute of Technology's faculty satisfaction is {68.55} %, Celestial College's faculty satisfaction is {68.70} %, Silverhaven Polytechnic's faculty satisfaction is {93.53} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Faculty Satisfaction in the area chart?",
            "A": "The global minimum faculty satisfaction is {47.10} %."
        },
        {
            "Q": "What is the global maximum Faculty Satisfaction in the area chart?",
            "A": "The global maximum faculty satisfaction is {100.00} %."
        },
        {
            "Q": "What is the highest Faculty Satisfaction level recorded for Celestial College?",
            "A": "Celestial College reached approximately {75.28} % in {1953}."
        },
        {
            "Q": "What is the lowest Faculty Satisfaction level recorded for Celestial College?",
            "A": "Celestial College's lowest recorded level is approximately {47.10} % in {1965}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Faculty Satisfaction?",
            "A": "The average total faculty satisfaction is {218.10} %."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Faculty Satisfaction go below 212.92 %? Please list the years and corresponding total values.",
            "A": "{204.59} % in {1963}, {205.74} % in {1962}, {195.55} % in {1965}."
        },
        {
            "Q": "Which years did the total Faculty Satisfaction exceed 226.91 %? Please list the years and corresponding total values.",
            "A": "{227.90} % in {1954}, {230.78} % in {1956}, {230.82} % in {1957}."
        }
    ],
    "NC": [
        {
            "Q": "Was the total Faculty Satisfaction in 1953 higher or lower than in 1965?",
            "A": "The total faculty satisfaction in 1953 was {higher} than in 1965."
        },
        {
            "Q": "Between 1957 and 1964, was the average total Faculty Satisfaction higher or lower than between 1953 and 1956?",
            "A": "The average total faculty satisfaction between 1957 and 1964 was {lower} than between 1953 and 1956."
        },
        {
            "Q": "Between 1954 and 1957, was the average total Faculty Satisfaction higher or lower than between 1954 and 1963?",
            "A": "The average total faculty satisfaction between 1954 and 1957 was {higher} than between 1954 and 1963."
        },
        {
            "Q": "Between 1960 and 1964, was the average total Faculty Satisfaction higher or lower than between 1959 and 1963?",
            "A": "The average total faculty satisfaction between 1960 and 1964 was {lower} than between 1959 and 1963."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Silverhaven Polytechnic} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Celestial College, Zenith Institute of Technology, Silverhaven Polytechnic}."
        }
    ]
}