{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {5} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Silverhaven Polytechnic Fund relative to Celestial College Graduates?",
            "A": "Silverhaven Polytechnic Fund is {below} Celestial College Graduates in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total alumni giving rate?",
            "A": "The series with the largest contribution is {Arcane University Alumni Association}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total alumni giving rate?",
            "A": "The series with the smallest contribution is {Meridian Academy Patrons}."
        }
    ],
    "VE": [
        {
            "Q": "What is Celestial College Graduates's Alumni Giving Rate in 1998?",
            "A": "Celestial College Graduates's alumni giving rate in 1998 is {11.80} %."
        },
        {
            "Q": "What is Arcane University Alumni Association's Alumni Giving Rate in 1996?",
            "A": "Arcane University Alumni Association's alumni giving rate in 1996 is {9.69} %."
        },
        {
            "Q": "What is Meridian Academy Patrons's Alumni Giving Rate in 1997?",
            "A": "Meridian Academy Patrons's alumni giving rate in 1997 is {12.54} %."
        },
        {
            "Q": "What are the alumni giving rate of Aethelgard Arts Circle, Celestial College Graduates, and Arcane University Alumni Association in 2007?",
            "A": "Aethelgard Arts Circle's alumni giving rate is {12.38} %, Celestial College Graduates's alumni giving rate is {19.24} %, Arcane University Alumni Association's alumni giving rate is {28.67} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Alumni Giving Rate in the area chart?",
            "A": "The global minimum alumni giving rate is {7.15} %."
        },
        {
            "Q": "What is the global maximum Alumni Giving Rate in the area chart?",
            "A": "The global maximum alumni giving rate is {100.00} %."
        },
        {
            "Q": "What is the highest Alumni Giving Rate level recorded for Aethelgard Arts Circle?",
            "A": "Aethelgard Arts Circle reached approximately {12.54} % in {2017}."
        },
        {
            "Q": "What is the lowest Alumni Giving Rate level recorded for Aethelgard Arts Circle?",
            "A": "Aethelgard Arts Circle's lowest recorded level is approximately {7.33} % in {2015}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Alumni Giving Rate?",
            "A": "The average total alumni giving rate is {91.79} %."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Alumni Giving Rate fall between 82.88 and 91.60 %? Please list the years and corresponding total values.",
            "A": "{84.58} % in {2007}, {85.27} % in {2008}."
        },
        {
            "Q": "Which years did the total Alumni Giving Rate exceed 107.57 %? Please list the years and corresponding total values.",
            "A": "{108.68} % in {2013}, {108.99} % in {2015}, {137.98} % in {2017}."
        },
        {
            "Q": "Which years did the total Alumni Giving Rate go below 66.91 %? Please list the years and corresponding total values.",
            "A": "{49.67} % in {1996}, {64.21} % in {2005}, {51.06} % in {1999}."
        }
    ],
    "NC": [
        {
            "Q": "Between 2003 and 2013, did the total Alumni Giving Rate experience a larger or smaller change than between 2004 and 2006?",
            "A": "The change in total alumni giving rate between 2003 and 2013 was {larger} than between 2004 and 2006."
        },
        {
            "Q": "Between 2005 and 2010, was the average total Alumni Giving Rate higher or lower than between 2005 and 2019?",
            "A": "The average total alumni giving rate between 2005 and 2010 was {lower} than between 2005 and 2019."
        },
        {
            "Q": "Between 2002 and 2010, did the total Alumni Giving Rate experience a larger or smaller change than between 1997 and 2009?",
            "A": "The change in total alumni giving rate between 2002 and 2010 was {smaller} than between 1997 and 2009."
        },
        {
            "Q": "Between 1998 and 2018, did the total Alumni Giving Rate experience a larger or smaller change than between 1999 and 2006?",
            "A": "The change in total alumni giving rate between 1998 and 2018 was {larger} than between 1999 and 2006."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Arcane University Alumni Association} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Silverhaven Polytechnic Fund, Meridian Academy Patrons, Aethelgard Arts Circle, Celestial College Graduates, Arcane University Alumni Association}."
        }
    ]
}