{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {6} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Zephyr Gas Index relative to GeoHeat Commodity?",
            "A": "Zephyr Gas Index is {below} GeoHeat Commodity in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total natural gas prices?",
            "A": "The series with the largest contribution is {Zephyr Gas Index}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total natural gas prices?",
            "A": "The series with the smallest contribution is {GeoHeat Commodity}."
        }
    ],
    "VE": [
        {
            "Q": "What is Solara Power Futures's Natural Gas Prices in 1980?",
            "A": "Solara Power Futures's natural gas prices in 1980 is {2.94} $/cubic meter."
        },
        {
            "Q": "What is Lumina Energy Market's Natural Gas Prices in 1981?",
            "A": "Lumina Energy Market's natural gas prices in 1981 is {3.23} $/cubic meter."
        },
        {
            "Q": "What is SkyFlow Water Index's Natural Gas Prices in 1979?",
            "A": "SkyFlow Water Index's natural gas prices in 1979 is {1.74} $/cubic meter."
        },
        {
            "Q": "What are the natural gas prices of AquaSource Trading, SkyFlow Water Index, and Solara Power Futures in 1983?",
            "A": "AquaSource Trading's natural gas prices is {2.25} $/cubic meter, SkyFlow Water Index's natural gas prices is {2.31} $/cubic meter, Solara Power Futures's natural gas prices is {3.86} $/cubic meter."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Natural Gas Prices in the area chart?",
            "A": "The global minimum natural gas prices is {1.54} $/cubic meter."
        },
        {
            "Q": "What is the global maximum Natural Gas Prices in the area chart?",
            "A": "The global maximum natural gas prices is {3.93} $/cubic meter."
        },
        {
            "Q": "What is the highest Natural Gas Prices level recorded for AquaSource Trading?",
            "A": "AquaSource Trading reached approximately {2.48} $/cubic meter in {1977}."
        },
        {
            "Q": "What is the lowest Natural Gas Prices level recorded for AquaSource Trading?",
            "A": "AquaSource Trading's lowest recorded level is approximately {1.54} $/cubic meter in {1980}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Natural Gas Prices?",
            "A": "The average total natural gas prices is {14.54} $/cubic meter."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Natural Gas Prices exceed 15.15 $/cubic meter? Please list the years and corresponding total values.",
            "A": "{17.11} $/cubic meter in {1982}, {17.86} $/cubic meter in {1983}, {15.32} $/cubic meter in {1981}."
        },
        {
            "Q": "Which years did the total Natural Gas Prices go below 13.54 $/cubic meter? Please list the years and corresponding total values.",
            "A": "{13.14} $/cubic meter in {1979}, {13.54} $/cubic meter in {1977}, {12.09} $/cubic meter in {1976}."
        },
        {
            "Q": "Which years did the total Natural Gas Prices fall between 13.63 and 15.07 $/cubic meter? Please list the years and corresponding total values.",
            "A": "{13.65} $/cubic meter in {1978}."
        }
    ],
    "NC": [
        {
            "Q": "Between 1978 and 1979, did the total Natural Gas Prices experience a larger or smaller change than between 1976 and 1981?",
            "A": "The change in total natural gas prices between 1978 and 1979 was {smaller} than between 1976 and 1981."
        },
        {
            "Q": "Between 1982 and 1983, did the total Natural Gas Prices experience a larger or smaller change than between 1977 and 1980?",
            "A": "The change in total natural gas prices between 1982 and 1983 was {larger} than between 1977 and 1980."
        },
        {
            "Q": "Was the total Natural Gas Prices in 1978 higher or lower than in 1979?",
            "A": "The total natural gas prices in 1978 was {higher} than in 1979."
        },
        {
            "Q": "Between 1977 and 1983, was the average total Natural Gas Prices higher or lower than between 1979 and 1983?",
            "A": "The average total natural gas prices between 1977 and 1983 was {lower} than between 1979 and 1983."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Zephyr Gas Index} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {GeoHeat Commodity, AquaSource Trading, SkyFlow Water Index, Solara Power Futures, Lumina Energy Market, Zephyr Gas Index}."
        }
    ]
}