{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Borealis Electric Cooperative relative to Azure Energy Distribution?",
            "A": "Borealis Electric Cooperative is {below} Azure Energy Distribution in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total electricity demand?",
            "A": "The series with the largest contribution is {Borealis Electric Cooperative}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total electricity demand?",
            "A": "The series with the smallest contribution is {Aethelgard Power Grid}."
        }
    ],
    "VE": [
        {
            "Q": "What is Aethelgard Power Grid's Electricity Demand in 1993?",
            "A": "Aethelgard Power Grid's electricity demand in 1993 is {267594849.79} MWh."
        },
        {
            "Q": "What is Aethelgard Power Grid's Electricity Demand in 1982?",
            "A": "Aethelgard Power Grid's electricity demand in 1982 is {927737328.60} MWh."
        },
        {
            "Q": "What is Azure Energy Distribution's Electricity Demand in 1998?",
            "A": "Azure Energy Distribution's electricity demand in 1998 is {1154012889.75} MWh."
        },
        {
            "Q": "What are the electricity demand of Borealis Electric Cooperative, Aethelgard Power Grid, and Azure Energy Distribution in 1987?",
            "A": "Borealis Electric Cooperative's electricity demand is {1280073131.08} MWh, Aethelgard Power Grid's electricity demand is {562329642.32} MWh, Azure Energy Distribution's electricity demand is {1231995070.79} MWh."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Electricity Demand in the area chart?",
            "A": "The global minimum electricity demand is {129848463.94} MWh."
        },
        {
            "Q": "What is the global maximum Electricity Demand in the area chart?",
            "A": "The global maximum electricity demand is {1960568347.64} MWh."
        },
        {
            "Q": "What is the highest Electricity Demand level recorded for Aethelgard Power Grid?",
            "A": "Aethelgard Power Grid reached approximately {990672610.54} MWh in {1981}."
        },
        {
            "Q": "What is the lowest Electricity Demand level recorded for Aethelgard Power Grid?",
            "A": "Aethelgard Power Grid's lowest recorded level is approximately {129848463.94} MWh in {2000}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Electricity Demand?",
            "A": "The average total electricity demand is {2914133817.12} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Electricity Demand go below 2797273715.58 MWh? Please list the years and corresponding total values.",
            "A": "{2689275307.97} MWh in {1989}, {2602535166.73} MWh in {1990}, {2771495018.32} MWh in {1994}."
        },
        {
            "Q": "Which years did the total Electricity Demand exceed 3034580462.74 MWh? Please list the years and corresponding total values.",
            "A": "{3142427618.66} MWh in {1998}, {3217440715.97} MWh in {1982}, {3208990100.77} MWh in {1997}."
        },
        {
            "Q": "Which years did the total Electricity Demand fall between 2770130734.70 and 3061723443.62 MWh? Please list the years and corresponding total values.",
            "A": "{3026174135.87} MWh in {1993}, {2956573795.96} MWh in {1996}, {2844009848.07} MWh in {1991}."
        }
    ],
    "NC": [
        {
            "Q": "Was the total Electricity Demand in 1990 higher or lower than in 1996?",
            "A": "The total electricity demand in 1990 was {lower} than in 1996."
        },
        {
            "Q": "Between 1997 and 1998, did the total Electricity Demand experience a larger or smaller change than between 1981 and 1992?",
            "A": "The change in total electricity demand between 1997 and 1998 was {smaller} than between 1981 and 1992."
        },
        {
            "Q": "Was the total Electricity Demand in 1987 higher or lower than in 1993?",
            "A": "The total electricity demand in 1987 was {higher} than in 1993."
        },
        {
            "Q": "Was the total Electricity Demand in 1992 higher or lower than in 1995?",
            "A": "The total electricity demand in 1992 was {higher} than in 1995."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Borealis Electric Cooperative} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Aethelgard Power Grid, Azure Energy Distribution, Borealis Electric Cooperative}."
        }
    ]
}