{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Zenith Utility Services relative to Meridian Energy Network?",
            "A": "Zenith Utility Services is {below} Meridian Energy Network in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total electricity demand?",
            "A": "The series with the largest contribution is {Zenith Utility Services}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total electricity demand?",
            "A": "The series with the smallest contribution is {Meridian Energy Network}."
        }
    ],
    "VE": [
        {
            "Q": "What is Zenith Utility Services's Electricity Demand in 1966?",
            "A": "Zenith Utility Services's electricity demand in 1966 is {1708258288.56} MWh."
        },
        {
            "Q": "What is Azure Energy Distribution's Electricity Demand in 1983?",
            "A": "Azure Energy Distribution's electricity demand in 1983 is {3095129531.44} MWh."
        },
        {
            "Q": "What is Zenith Utility Services's Electricity Demand in 1984?",
            "A": "Zenith Utility Services's electricity demand in 1984 is {3189812674.94} MWh."
        },
        {
            "Q": "What are the electricity demand of Azure Energy Distribution, Meridian Energy Network, and Zenith Utility Services in 1972?",
            "A": "Azure Energy Distribution's electricity demand is {2228765888.37} MWh, Meridian Energy Network's electricity demand is {208798306.84} MWh, Zenith Utility Services's electricity demand is {2220793201.42} MWh."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Electricity Demand in the area chart?",
            "A": "The global minimum electricity demand is {60119579.74} MWh."
        },
        {
            "Q": "What is the global maximum Electricity Demand in the area chart?",
            "A": "The global maximum electricity demand is {3189812674.94} MWh."
        },
        {
            "Q": "What is the highest Electricity Demand level recorded for Azure Energy Distribution?",
            "A": "Azure Energy Distribution reached approximately {3108428700.22} MWh in {1984}."
        },
        {
            "Q": "What is the lowest Electricity Demand level recorded for Azure Energy Distribution?",
            "A": "Azure Energy Distribution's lowest recorded level is approximately {1013918839.64} MWh in {1957}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Electricity Demand?",
            "A": "The average total electricity demand is {4493618789.69} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Electricity Demand exceed 5165036918.49 MWh? Please list the years and corresponding total values.",
            "A": "{6262101934.71} MWh in {1983}, {5949410809.77} MWh in {1981}, {5610085105.37} MWh in {1979}."
        },
        {
            "Q": "Which years did the total Electricity Demand fall between 4225367904.75 and 4670143473.67 MWh? Please list the years and corresponding total values.",
            "A": "{4659947868.30} MWh in {1973}, {4491503284.16} MWh in {1971}, {4268641534.54} MWh in {1970}."
        },
        {
            "Q": "Which years did the total Electricity Demand go below 3730474459.92 MWh? Please list the years and corresponding total values.",
            "A": "{3245256758.48} MWh in {1960}, {3030840007.23} MWh in {1958}, {3481900752.19} MWh in {1963}."
        }
    ],
    "NC": [
        {
            "Q": "Was the total Electricity Demand in 1974 higher or lower than in 1975?",
            "A": "The total electricity demand in 1974 was {lower} than in 1975."
        },
        {
            "Q": "Was the total Electricity Demand in 1976 higher or lower than in 1980?",
            "A": "The total electricity demand in 1976 was {lower} than in 1980."
        },
        {
            "Q": "Between 1964 and 1981, did the total Electricity Demand experience a larger or smaller change than between 1959 and 1968?",
            "A": "The change in total electricity demand between 1964 and 1981 was {larger} than between 1959 and 1968."
        },
        {
            "Q": "Was the total Electricity Demand in 1971 higher or lower than in 1983?",
            "A": "The total electricity demand in 1971 was {lower} than in 1983."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Zenith Utility Services} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Meridian Energy Network, Azure Energy Distribution, Zenith Utility Services}."
        }
    ]
}