{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {5} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Crimson Quarter relative to Verdant Ward?",
            "A": "Crimson Quarter is {above} Verdant Ward in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total vaccination rate?",
            "A": "The series with the largest contribution is {Crimson Quarter}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total vaccination rate?",
            "A": "The series with the smallest contribution is {Verdant Ward}."
        }
    ],
    "VE": [
        {
            "Q": "What is Verdant Ward's Vaccination Rate in 2012?",
            "A": "Verdant Ward's vaccination rate in 2012 is {33.64} %."
        },
        {
            "Q": "What is Crimson Quarter's Vaccination Rate in 2015?",
            "A": "Crimson Quarter's vaccination rate in 2015 is {100} %."
        },
        {
            "Q": "What is Azure Enclave's Vaccination Rate in 2006?",
            "A": "Azure Enclave's vaccination rate in 2006 is {99.71} %."
        },
        {
            "Q": "What are the vaccination rate of Verdant Ward, Azure Enclave, and Crimson Quarter in 2013?",
            "A": "Verdant Ward's vaccination rate is {29.08} %, Azure Enclave's vaccination rate is {100} %, Crimson Quarter's vaccination rate is {100} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Vaccination Rate in the area chart?",
            "A": "The global minimum vaccination rate is {18.96} %."
        },
        {
            "Q": "What is the global maximum Vaccination Rate in the area chart?",
            "A": "The global maximum vaccination rate is {100.00} %."
        },
        {
            "Q": "What is the highest Vaccination Rate level recorded for Azure Enclave?",
            "A": "Azure Enclave reached approximately {100.00} % in {2007}."
        },
        {
            "Q": "What is the lowest Vaccination Rate level recorded for Azure Enclave?",
            "A": "Azure Enclave's lowest recorded level is approximately {74.08} % in {2003}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Vaccination Rate?",
            "A": "The average total vaccination rate is {334.75} %."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Vaccination Rate go below 308.39 %? Please list the years and corresponding total values.",
            "A": "{261.19} % in {2015}, {301.93} % in {2012}, {276.36} % in {2014}."
        },
        {
            "Q": "Which years did the total Vaccination Rate exceed 372.73 %? Please list the years and corresponding total values.",
            "A": "{385.16} % in {2006}, {374.08} % in {2005}, {374.88} % in {2003}."
        },
        {
            "Q": "Which years did the total Vaccination Rate fall between 323.53 and 357.59 %? Please list the years and corresponding total values.",
            "A": "{342.46} % in {2009}, {328.79} % in {2010}, {356.47} % in {2008}."
        }
    ],
    "NC": [
        {
            "Q": "Between 2010 and 2014, was the average total Vaccination Rate higher or lower than between 2004 and 2009?",
            "A": "The average total vaccination rate between 2010 and 2014 was {lower} than between 2004 and 2009."
        },
        {
            "Q": "Between 2005 and 2012, was the average total Vaccination Rate higher or lower than between 2004 and 2009?",
            "A": "The average total vaccination rate between 2005 and 2012 was {lower} than between 2004 and 2009."
        },
        {
            "Q": "Between 2003 and 2014, did the total Vaccination Rate experience a larger or smaller change than between 2003 and 2012?",
            "A": "The change in total vaccination rate between 2003 and 2014 was {larger} than between 2003 and 2012."
        },
        {
            "Q": "Was the total Vaccination Rate in 2009 higher or lower than in 2010?",
            "A": "The total vaccination rate in 2009 was {higher} than in 2010."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Crimson Quarter} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {District Alpha, Verdant Ward, Sector Beta, Crimson Quarter, Azure Enclave}."
        }
    ]
}