{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {5} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Home Essentials relative to Outlet Centers?",
            "A": "Home Essentials is {above} Outlet Centers in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total in-store foot traffic?",
            "A": "The series with the largest contribution is {Pop-Up Shops}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total in-store foot traffic?",
            "A": "The series with the smallest contribution is {Fashion Boutiques}."
        }
    ],
    "VE": [
        {
            "Q": "What is Pop-Up Shops's In-Store Foot Traffic in 2012?",
            "A": "Pop-Up Shops's in-store foot traffic in 2012 is {23588.24} visitors/day."
        },
        {
            "Q": "What is Fashion Boutiques's In-Store Foot Traffic in 2002?",
            "A": "Fashion Boutiques's in-store foot traffic in 2002 is {8694.52} visitors/day."
        },
        {
            "Q": "What is Home Essentials's In-Store Foot Traffic in 2012?",
            "A": "Home Essentials's in-store foot traffic in 2012 is {3578.24} visitors/day."
        },
        {
            "Q": "What are the in-store foot traffic of Pop-Up Shops, Outlet Centers, and Home Essentials in 1999?",
            "A": "Pop-Up Shops's in-store foot traffic is {16106.89} visitors/day, Outlet Centers's in-store foot traffic is {18122.03} visitors/day, Home Essentials's in-store foot traffic is {11365.45} visitors/day."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum In-Store Foot Traffic in the area chart?",
            "A": "The global minimum in-store foot traffic is {2008.02} visitors/day."
        },
        {
            "Q": "What is the global maximum In-Store Foot Traffic in the area chart?",
            "A": "The global maximum in-store foot traffic is {27366.98} visitors/day."
        },
        {
            "Q": "What is the highest In-Store Foot Traffic level recorded for Fashion Boutiques?",
            "A": "Fashion Boutiques reached approximately {19533.62} visitors/day in {1995}."
        },
        {
            "Q": "What is the lowest In-Store Foot Traffic level recorded for Fashion Boutiques?",
            "A": "Fashion Boutiques's lowest recorded level is approximately {2008.02} visitors/day in {2011}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total In-Store Foot Traffic?",
            "A": "The average total in-store foot traffic is {65412.41} visitors/day."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total In-Store Foot Traffic go below 50346.99 visitors/day? Please list the years and corresponding total values.",
            "A": "{50022.29} visitors/day in {2004}, {43267.54} visitors/day in {2010}, {44659.26} visitors/day in {2011}."
        },
        {
            "Q": "Which years did the total In-Store Foot Traffic exceed 76114.69 visitors/day? Please list the years and corresponding total values.",
            "A": "{88198.05} visitors/day in {1997}, {76227.35} visitors/day in {1999}, {80662.60} visitors/day in {2000}."
        },
        {
            "Q": "Which years did the total In-Store Foot Traffic fall between 60069.30 and 66392.39 visitors/day? Please list the years and corresponding total values.",
            "A": "{63664.39} visitors/day in {2003}, {64115.68} visitors/day in {2002}."
        }
    ],
    "NC": [
        {
            "Q": "Was the total In-Store Foot Traffic in 1997 higher or lower than in 2005?",
            "A": "The total in-store foot traffic in 1997 was {higher} than in 2005."
        },
        {
            "Q": "Was the total In-Store Foot Traffic in 2000 higher or lower than in 2008?",
            "A": "The total in-store foot traffic in 2000 was {higher} than in 2008."
        },
        {
            "Q": "Was the total In-Store Foot Traffic in 2003 higher or lower than in 2009?",
            "A": "The total in-store foot traffic in 2003 was {higher} than in 2009."
        },
        {
            "Q": "Between 2000 and 2007, did the total In-Store Foot Traffic experience a larger or smaller change than between 2007 and 2011?",
            "A": "The change in total in-store foot traffic between 2000 and 2007 was {larger} than between 2007 and 2011."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Pop-Up Shops} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Tech Gadget Hubs, Home Essentials, Fashion Boutiques, Outlet Centers, Pop-Up Shops}."
        }
    ]
}