{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {2} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing NovaStream relative to OracleFeed?",
            "A": "NovaStream is {below} OracleFeed in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total daily active users?",
            "A": "The series with the largest contribution is {NovaStream}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total daily active users?",
            "A": "The series with the smallest contribution is {OracleFeed}."
        }
    ],
    "VE": [
        {
            "Q": "What is NovaStream's Daily Active Users in 1974?",
            "A": "NovaStream's daily active users in 1974 is {401325409.50} users."
        },
        {
            "Q": "What is NovaStream's Daily Active Users in 1980?",
            "A": "NovaStream's daily active users in 1980 is {10000000} users."
        },
        {
            "Q": "What is OracleFeed's Daily Active Users in 1974?",
            "A": "OracleFeed's daily active users in 1974 is {159549725.79} users."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Daily Active Users in the area chart?",
            "A": "The global minimum daily active users is {10000000.00} users."
        },
        {
            "Q": "What is the global maximum Daily Active Users in the area chart?",
            "A": "The global maximum daily active users is {1159569313.20} users."
        },
        {
            "Q": "What is the highest Daily Active Users level recorded for NovaStream?",
            "A": "NovaStream reached approximately {1159569313.20} users in {1960}."
        },
        {
            "Q": "What is the lowest Daily Active Users level recorded for NovaStream?",
            "A": "NovaStream's lowest recorded level is approximately {10000000.00} users in {1977}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Daily Active Users?",
            "A": "The average total daily active users is {674754382.72} users."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Daily Active Users exceed 1095167105.16 users? Please list the years and corresponding total values.",
            "A": "{1132587802.19} users in {1965}, {1723988175.83} users in {1961}, {1700026482.11} users in {1963}."
        },
        {
            "Q": "Which years did the total Daily Active Users fall between 535042532.05 and 591362798.58 users? Please list the years and corresponding total values.",
            "A": "{560875135.29} users in {1974}, {543273538} users in {1972}."
        },
        {
            "Q": "Which years did the total Daily Active Users go below 31238225.47 users? Please list the years and corresponding total values.",
            "A": "{20000000} users in {1977}, {28096236.17} users in {1978}, {20000000} users in {1980}."
        }
    ],
    "NC": [
        {
            "Q": "Between 1961 and 1974, was the average total Daily Active Users higher or lower than between 1972 and 1979?",
            "A": "The average total daily active users between 1961 and 1974 was {higher} than between 1972 and 1979."
        },
        {
            "Q": "Between 1964 and 1978, did the total Daily Active Users experience a larger or smaller change than between 1961 and 1966?",
            "A": "The change in total daily active users between 1964 and 1978 was {larger} than between 1961 and 1966."
        },
        {
            "Q": "Between 1963 and 1971, was the average total Daily Active Users higher or lower than between 1974 and 1978?",
            "A": "The average total daily active users between 1963 and 1971 was {higher} than between 1974 and 1978."
        },
        {
            "Q": "Between 1966 and 1972, was the average total Daily Active Users higher or lower than between 1960 and 1983?",
            "A": "The average total daily active users between 1966 and 1972 was {higher} than between 1960 and 1983."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{NovaStream} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {OracleFeed, NovaStream}."
        }
    ]
}