{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {2} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Silverhaven Reserve Bank relative to Borealis Investment Council?",
            "A": "Silverhaven Reserve Bank is {below} Borealis Investment Council in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total interest rate?",
            "A": "The series with the largest contribution is {Borealis Investment Council}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total interest rate?",
            "A": "The series with the smallest contribution is {Silverhaven Reserve Bank}."
        }
    ],
    "VE": [
        {
            "Q": "What is Borealis Investment Council's Interest Rate in 1965?",
            "A": "Borealis Investment Council's interest rate in 1965 is {3.56} %."
        },
        {
            "Q": "What is Silverhaven Reserve Bank's Interest Rate in 1971?",
            "A": "Silverhaven Reserve Bank's interest rate in 1971 is {2.83} %."
        },
        {
            "Q": "What is Silverhaven Reserve Bank's Interest Rate in 1970?",
            "A": "Silverhaven Reserve Bank's interest rate in 1970 is {2.85} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Interest Rate in the area chart?",
            "A": "The global minimum interest rate is {2.68} %."
        },
        {
            "Q": "What is the global maximum Interest Rate in the area chart?",
            "A": "The global maximum interest rate is {4.85} %."
        },
        {
            "Q": "What is the highest Interest Rate level recorded for Borealis Investment Council?",
            "A": "Borealis Investment Council reached approximately {4.85} % in {1972}."
        },
        {
            "Q": "What is the lowest Interest Rate level recorded for Borealis Investment Council?",
            "A": "Borealis Investment Council's lowest recorded level is approximately {3.47} % in {1964}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Interest Rate?",
            "A": "The average total interest rate is {7.23} %."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Interest Rate exceed 7.40 %? Please list the years and corresponding total values.",
            "A": "{7.40} % in {1969}, {7.53} % in {1972}, {7.61} % in {1971}."
        },
        {
            "Q": "Which years did the total Interest Rate go below 7.05 %? Please list the years and corresponding total values.",
            "A": "{6.91} % in {1967}, {6.90} % in {1965}, {6.97} % in {1964}."
        }
    ],
    "NC": [
        {
            "Q": "Between 1966 and 1971, was the average total Interest Rate higher or lower than between 1964 and 1972?",
            "A": "The average total interest rate between 1966 and 1971 was {higher} than between 1964 and 1972."
        },
        {
            "Q": "Was the total Interest Rate in 1964 higher or lower than in 1972?",
            "A": "The total interest rate in 1964 was {lower} than in 1972."
        },
        {
            "Q": "Between 1965 and 1971, did the total Interest Rate experience a larger or smaller change than between 1965 and 1966?",
            "A": "The change in total interest rate between 1965 and 1971 was {larger} than between 1965 and 1966."
        },
        {
            "Q": "Was the total Interest Rate in 1965 higher or lower than in 1972?",
            "A": "The total interest rate in 1965 was {lower} than in 1972."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Borealis Investment Council} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Silverhaven Reserve Bank, Borealis Investment Council}."
        }
    ]
}