{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {4} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Azure Legion relative to Ironwood Fanatics?",
            "A": "Azure Legion is {below} Ironwood Fanatics in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total fan engagement?",
            "A": "The series with the largest contribution is {Azure Legion}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total fan engagement?",
            "A": "The series with the smallest contribution is {Shadowfen Devotees}."
        }
    ],
    "VE": [
        {
            "Q": "What is Azure Legion's Fan Engagement in 1966?",
            "A": "Azure Legion's fan engagement in 1966 is {114.23} index."
        },
        {
            "Q": "What is Azure Legion's Fan Engagement in 1961?",
            "A": "Azure Legion's fan engagement in 1961 is {70.55} index."
        },
        {
            "Q": "What is Azure Legion's Fan Engagement in 1963?",
            "A": "Azure Legion's fan engagement in 1963 is {83.91} index."
        },
        {
            "Q": "What are the fan engagement of Shadowfen Devotees, Ironwood Fanatics, and Silverleaf Supporters in 1964?",
            "A": "Shadowfen Devotees's fan engagement is {54.04} index, Ironwood Fanatics's fan engagement is {64.54} index, Silverleaf Supporters's fan engagement is {93.51} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Fan Engagement in the area chart?",
            "A": "The global minimum fan engagement is {42.31} index."
        },
        {
            "Q": "What is the global maximum Fan Engagement in the area chart?",
            "A": "The global maximum fan engagement is {114.23} index."
        },
        {
            "Q": "What is the highest Fan Engagement level recorded for Azure Legion?",
            "A": "Azure Legion reached approximately {114.23} index in {1966}."
        },
        {
            "Q": "What is the lowest Fan Engagement level recorded for Azure Legion?",
            "A": "Azure Legion's lowest recorded level is approximately {70.55} index in {1961}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Fan Engagement?",
            "A": "The average total fan engagement is {299.75} index."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Fan Engagement fall between 283.58 and 313.43 index? Please list the years and corresponding total values.",
            "A": "{288.72} index in {1963}, {306.57} index in {1964}."
        },
        {
            "Q": "Which years did the total Fan Engagement exceed 310.90 index? Please list the years and corresponding total values.",
            "A": "{327.21} index in {1966}, {315.23} index in {1965}."
        },
        {
            "Q": "Which years did the total Fan Engagement go below 286.11 index? Please list the years and corresponding total values.",
            "A": "{277.26} index in {1961}, {283.49} index in {1962}."
        }
    ],
    "NC": [
        {
            "Q": "Between 1961 and 1962, was the average total Fan Engagement higher or lower than between 1961 and 1964?",
            "A": "The average total fan engagement between 1961 and 1962 was {lower} than between 1961 and 1964."
        },
        {
            "Q": "Between 1962 and 1964, was the average total Fan Engagement higher or lower than between 1961 and 1963?",
            "A": "The average total fan engagement between 1962 and 1964 was {higher} than between 1961 and 1963."
        },
        {
            "Q": "Between 1961 and 1965, did the total Fan Engagement experience a larger or smaller change than between 1963 and 1964?",
            "A": "The change in total fan engagement between 1961 and 1965 was {larger} than between 1963 and 1964."
        },
        {
            "Q": "Between 1964 and 1966, did the total Fan Engagement experience a larger or smaller change than between 1965 and 1966?",
            "A": "The change in total fan engagement between 1964 and 1966 was {larger} than between 1965 and 1966."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Azure Legion} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Shadowfen Devotees, Ironwood Fanatics, Silverleaf Supporters, Azure Legion}."
        }
    ]
}