{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {5} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing Golden Enthusiasts relative to Azure Legion?",
            "A": "Golden Enthusiasts is {below} Azure Legion in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total fan engagement?",
            "A": "The series with the largest contribution is {Azure Legion}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total fan engagement?",
            "A": "The series with the smallest contribution is {Silverleaf Supporters}."
        }
    ],
    "VE": [
        {
            "Q": "What is Crimson Faithful's Fan Engagement in 1996?",
            "A": "Crimson Faithful's fan engagement in 1996 is {59.62} index."
        },
        {
            "Q": "What is Silverleaf Supporters's Fan Engagement in 1990?",
            "A": "Silverleaf Supporters's fan engagement in 1990 is {72.58} index."
        },
        {
            "Q": "What is Silverleaf Supporters's Fan Engagement in 1994?",
            "A": "Silverleaf Supporters's fan engagement in 1994 is {61.21} index."
        },
        {
            "Q": "What are the fan engagement of Golden Enthusiasts, Silverleaf Supporters, and Azure Legion in 1991?",
            "A": "Golden Enthusiasts's fan engagement is {85.72} index, Silverleaf Supporters's fan engagement is {69.03} index, Azure Legion's fan engagement is {84.89} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Fan Engagement in the area chart?",
            "A": "The global minimum fan engagement is {51.89} index."
        },
        {
            "Q": "What is the global maximum Fan Engagement in the area chart?",
            "A": "The global maximum fan engagement is {88.80} index."
        },
        {
            "Q": "What is the highest Fan Engagement level recorded for Azure Legion?",
            "A": "Azure Legion reached approximately {85.81} index in {1996}."
        },
        {
            "Q": "What is the lowest Fan Engagement level recorded for Azure Legion?",
            "A": "Azure Legion's lowest recorded level is approximately {54.95} index in {1994}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total Fan Engagement?",
            "A": "The average total fan engagement is {335.62} index."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total Fan Engagement fall between 317.17 and 350.55 index? Please list the years and corresponding total values.",
            "A": "{349.97} index in {1990}, {344.68} index in {1996}."
        },
        {
            "Q": "Which years did the total Fan Engagement exceed 352.92 index? Please list the years and corresponding total values.",
            "A": "{371.01} index in {1991}, {364.71} index in {1992}."
        },
        {
            "Q": "Which years did the total Fan Engagement go below 314.80 index? Please list the years and corresponding total values.",
            "A": "{295.25} index in {1994}, {306.98} index in {1993}."
        }
    ],
    "NC": [
        {
            "Q": "Between 1992 and 1995, was the average total Fan Engagement higher or lower than between 1990 and 1994?",
            "A": "The average total fan engagement between 1992 and 1995 was {lower} than between 1990 and 1994."
        },
        {
            "Q": "Between 1991 and 1992, did the total Fan Engagement experience a larger or smaller change than between 1990 and 1991?",
            "A": "The change in total fan engagement between 1991 and 1992 was {smaller} than between 1990 and 1991."
        },
        {
            "Q": "Was the total Fan Engagement in 1990 higher or lower than in 1996?",
            "A": "The total fan engagement in 1990 was {higher} than in 1996."
        },
        {
            "Q": "Between 1993 and 1995, did the total Fan Engagement experience a larger or smaller change than between 1995 and 1996?",
            "A": "The change in total fan engagement between 1993 and 1995 was {smaller} than between 1995 and 1996."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Azure Legion} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {Silverleaf Supporters, Shadowfen Devotees, Crimson Faithful, Azure Legion, Golden Enthusiasts}."
        }
    ]
}