{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {area chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many series are represented in this area chart?",
            "A": "There are {3} series."
        }
    ],
    "SRP": [
        {
            "Q": "What is the vertical (above/below) relationship of the area representing E-Commerce Parcels relative to Pharmaceuticals?",
            "A": "E-Commerce Parcels is {above} Pharmaceuticals in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "Which series contributes the largest portion to the total on-time delivery rate?",
            "A": "The series with the largest contribution is {Automotive Parts}."
        },
        {
            "Q": "Which series contributes the smallest portion to the total on-time delivery rate?",
            "A": "The series with the smallest contribution is {E-Commerce Parcels}."
        }
    ],
    "VE": [
        {
            "Q": "What is E-Commerce Parcels's On-Time Delivery Rate in 1972?",
            "A": "E-Commerce Parcels's on-time delivery rate in 1972 is {41.83} %."
        },
        {
            "Q": "What is E-Commerce Parcels's On-Time Delivery Rate in 1967?",
            "A": "E-Commerce Parcels's on-time delivery rate in 1967 is {70.55} %."
        },
        {
            "Q": "What is Pharmaceuticals's On-Time Delivery Rate in 1966?",
            "A": "Pharmaceuticals's on-time delivery rate in 1966 is {100} %."
        },
        {
            "Q": "What are the on-time delivery rate of Automotive Parts, Pharmaceuticals, and E-Commerce Parcels in 1972?",
            "A": "Automotive Parts's on-time delivery rate is {100} %, Pharmaceuticals's on-time delivery rate is {100} %, E-Commerce Parcels's on-time delivery rate is {41.83} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum On-Time Delivery Rate in the area chart?",
            "A": "The global minimum on-time delivery rate is {29.83} %."
        },
        {
            "Q": "What is the global maximum On-Time Delivery Rate in the area chart?",
            "A": "The global maximum on-time delivery rate is {100.00} %."
        },
        {
            "Q": "What is the highest On-Time Delivery Rate level recorded for Automotive Parts?",
            "A": "Automotive Parts reached approximately {100.00} % in {1965}."
        },
        {
            "Q": "What is the lowest On-Time Delivery Rate level recorded for Automotive Parts?",
            "A": "Automotive Parts's lowest recorded level is approximately {98.22} % in {1964}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average total On-Time Delivery Rate?",
            "A": "The average total on-time delivery rate is {257.03} %."
        }
    ],
    "NF": [
        {
            "Q": "Which years did the total On-Time Delivery Rate exceed 270.55 %? Please list the years and corresponding total values.",
            "A": "{275.49} % in {1964}, {282.53} % in {1965}, {280.70} % in {1966}."
        },
        {
            "Q": "Which years did the total On-Time Delivery Rate go below 246.40 %? Please list the years and corresponding total values.",
            "A": "{241.83} % in {1972}, {232.63} % in {1973}, {229.83} % in {1974}."
        },
        {
            "Q": "Which years did the total On-Time Delivery Rate fall between 245.55 and 271.40 %? Please list the years and corresponding total values.",
            "A": "{270.55} % in {1967}, {263.71} % in {1968}, {246.40} % in {1971}."
        }
    ],
    "NC": [
        {
            "Q": "Was the total On-Time Delivery Rate in 1965 higher or lower than in 1974?",
            "A": "The total on-time delivery rate in 1965 was {higher} than in 1974."
        },
        {
            "Q": "Between 1967 and 1968, was the average total On-Time Delivery Rate higher or lower than between 1968 and 1972?",
            "A": "The average total on-time delivery rate between 1967 and 1968 was {higher} than between 1968 and 1972."
        },
        {
            "Q": "Between 1973 and 1974, was the average total On-Time Delivery Rate higher or lower than between 1966 and 1971?",
            "A": "The average total on-time delivery rate between 1973 and 1974 was {lower} than between 1966 and 1971."
        },
        {
            "Q": "Between 1966 and 1970, was the average total On-Time Delivery Rate higher or lower than between 1964 and 1967?",
            "A": "The average total on-time delivery rate between 1966 and 1970 was {lower} than between 1964 and 1967."
        }
    ],
    "MSR": [
        {
            "Q": "Which series has the largest cumulative area in this area chart?",
            "A": "{Automotive Parts} has the largest cumulative area."
        }
    ],
    "VA": [
        {
            "Q": "To reduce the 'waving' visual effect in the area chart, reorder the layers by end value and list the labels from top to bottom after sorting.",
            "A": "The reordered layer order from top to bottom is: {E-Commerce Parcels, Automotive Parts, Pharmaceuticals}."
        }
    ]
}