{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {ridgeline}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ridgelines are in this ridgeline chart?",
            "A": "There are {5} slices in this chart."
        }
    ],
    "SRP": [
        {
            "Q": "What is the spatial relationship of the peak of Angel Investments relative to the peak of Real Estate in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The peak of  Angel Investments is to the {left} of the peak of Real Estate."
        }
    ],
    "VPR": [
        {
            "Q": "What distribution pattern does the ridgeline representing Peer-to-Peer Lending show?",
            "A": "The ridgeline representing Peer-to-Peer Lending shows a {Single Peak Distribution}."
        },
        {
            "Q": "At what value do  Stock Market reach its peaks?",
            "A": "At {24.03}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which ridgeline has the highest peak",
            "A": "The ridgeline representing {Angel Investments} has the highest peak."
        },
        {
            "Q": "Which label has the highest density at X =8.7?",
            "A": "At X =8.7,the label with the highest density is {Real Estate}"
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which countries in the ridgeline chart have ridgeline peaks exceed 5? Please list the countries and corresponding peak values.",
            "A": "{Real Estate}'s peak at {24},{Stock Market}'s peak at {24}"
        },
        {
            "Q": "Which countries in the ridgeline chart have ridgeline peaks below 8? Please list the countries and corresponding peak values.",
            "A": "{Venture Capital}'s peak at {-6},{Peer-to-Peer Lending}'s peak at {-6},{Angel Investments}'s peak at {-5}"
        }
    ],
    "NC": [
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Peer-to-Peer Lending or Stock Market?",
            "A": "{Stock Market} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Peer-to-Peer Lending or Angel Investments?",
            "A": "{Angel Investments} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Real Estate or Angel Investments?",
            "A": "{Real Estate} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Stock Market or Peer-to-Peer Lending?",
            "A": "{Stock Market} has a larger X value at the peak of its ridgeline."
        }
    ],
    "MSR": [
        {
            "Q": "How many ridges have their peak located to the right of the average X value across all ridges?",
            "A": "There are {2} ridges whose peaks are located to the right of the average X value."
        },
        {
            "Q": "What is the label of the ridge with the largest span along the mountain height?",
            "A": "The ridge with the largest span in the mountain height is {Venture Capital}"
        }
    ],
    "VA": []
}