{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {ridgeline}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ridgelines are in this ridgeline chart?",
            "A": "There are {5} slices in this chart."
        }
    ],
    "SRP": [
        {
            "Q": "What is the spatial relationship of the peak of Premium Brands relative to the peak of Budget Shoppers in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The peak of  Premium Brands is to the {left} of the peak of Budget Shoppers."
        }
    ],
    "VPR": [
        {
            "Q": "What distribution pattern does the ridgeline representing Premium Brands show?",
            "A": "The ridgeline representing Premium Brands shows a {Periodic fluctuation}."
        },
        {
            "Q": "At what value do  Premium Brands reach its peaks?",
            "A": "At {17.82}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which ridgeline has the highest peak",
            "A": "The ridgeline representing {Ethical Consumers} has the highest peak."
        },
        {
            "Q": "Which label has the highest density at X =73.1?",
            "A": "At X =73.1,the label with the highest density is {Ethical Consumers}"
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which countries in the ridgeline chart have ridgeline peaks exceed 28? Please list the countries and corresponding peak values.",
            "A": "{Ethical Consumers}'s peak at {67},{Convenience-Oriented}'s peak at {73},{Budget Shoppers}'s peak at {83}"
        },
        {
            "Q": "Which countries in the ridgeline chart have ridgeline peaks below 70? Please list the countries and corresponding peak values.",
            "A": "{Ethical Consumers}'s peak at {67},{Premium Brands}'s peak at {18},{Organic Shoppers}'s peak at {17}"
        }
    ],
    "NC": [
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Convenience-Oriented or Ethical Consumers?",
            "A": "{Convenience-Oriented} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Convenience-Oriented or Organic Shoppers?",
            "A": "{Convenience-Oriented} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Ethical Consumers or Premium Brands?",
            "A": "{Ethical Consumers} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Convenience-Oriented or Premium Brands?",
            "A": "{Convenience-Oriented} has a larger X value at the peak of its ridgeline."
        }
    ],
    "MSR": [
        {
            "Q": "How many ridges have their peak located to the right of the average X value across all ridges?",
            "A": "There are {3} ridges whose peaks are located to the right of the average X value."
        },
        {
            "Q": "What is the label of the ridge with the largest span along the mountain height?",
            "A": "The ridge with the largest span in the mountain height is {Ethical Consumers}"
        }
    ],
    "VA": []
}