{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {ridgeline}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ridgelines are in this ridgeline chart?",
            "A": "There are {6} slices in this chart."
        }
    ],
    "SRP": [
        {
            "Q": "What is the spatial relationship of the peak of Elective Procedures relative to the peak of Preventive Care in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The peak of  Elective Procedures is to the {right} of the peak of Preventive Care."
        }
    ],
    "VPR": [
        {
            "Q": "What distribution pattern does the ridgeline representing Chronic Disease Management show?",
            "A": "The ridgeline representing Chronic Disease Management shows a {Periodic fluctuation}."
        },
        {
            "Q": "At what value do  Chronic Disease Management reach its peaks?",
            "A": "At {8578.58}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which ridgeline has the highest peak",
            "A": "The ridgeline representing {Pediatric Care} has the highest peak."
        },
        {
            "Q": "Which label has the highest density at X =853.5?",
            "A": "At X =853.5,the label with the highest density is {Pediatric Care}"
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which countries in the ridgeline chart have ridgeline peaks exceed 4031? Please list the countries and corresponding peak values.",
            "A": "{Chronic Disease Management}'s peak at {8579},{Surgical Treatments}'s peak at {8148}"
        },
        {
            "Q": "Which countries in the ridgeline chart have ridgeline peaks below 3657? Please list the countries and corresponding peak values.",
            "A": "{Elective Procedures}'s peak at {3163},{Preventive Care}'s peak at {2132},{Pediatric Care}'s peak at {921},{Mental Health}'s peak at {991}"
        }
    ],
    "NC": [
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Mental Health or Chronic Disease Management?",
            "A": "{Chronic Disease Management} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Surgical Treatments or Elective Procedures?",
            "A": "{Surgical Treatments} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Preventive Care or Pediatric Care?",
            "A": "{Preventive Care} has a larger X value at the peak of its ridgeline."
        }
    ],
    "MSR": [
        {
            "Q": "How many ridges have their peak located to the right of the average X value across all ridges?",
            "A": "There are {2} ridges whose peaks are located to the right of the average X value."
        },
        {
            "Q": "What is the label of the ridge with the largest span along the mountain height?",
            "A": "The ridge with the largest span in the mountain height is {Pediatric Care}"
        }
    ],
    "VA": []
}