{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {ridgeline}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ridgelines are in this ridgeline chart?",
            "A": "There are {3} slices in this chart."
        }
    ],
    "SRP": [
        {
            "Q": "What is the spatial relationship of the peak of Urban Redevelopment Areas relative to the peak of Rural Areas in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The peak of  Urban Redevelopment Areas is to the {left} of the peak of Rural Areas."
        }
    ],
    "VPR": [
        {
            "Q": "What distribution pattern does the ridgeline representing Urban Redevelopment Areas show?",
            "A": "The ridgeline representing Urban Redevelopment Areas shows a {Random fluctuation}."
        },
        {
            "Q": "At what value do  Urban Redevelopment Areas reach its peaks?",
            "A": "At {618618.62}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "Which ridgeline has the highest peak",
            "A": "The ridgeline representing {Suburbs} has the highest peak."
        },
        {
            "Q": "Which label has the highest density at X =383342.1?",
            "A": "At X =383342.1,the label with the highest density is {Suburbs}"
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which countries in the ridgeline chart have ridgeline peaks exceed 586045? Please list the countries and corresponding peak values.",
            "A": "{Urban Redevelopment Areas}'s peak at {618619},{Rural Areas}'s peak at {847848},{Suburbs}'s peak at {649650}"
        },
        {
            "Q": "Which countries in the ridgeline chart have ridgeline peaks below 289231? Please list the countries and corresponding peak values.",
            "A": "No matching label."
        }
    ],
    "NC": [
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Rural Areas or Urban Redevelopment Areas?",
            "A": "{Rural Areas} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Urban Redevelopment Areas or Suburbs?",
            "A": "{Suburbs} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Suburbs or Rural Areas?",
            "A": "{Rural Areas} has a larger X value at the peak of its ridgeline."
        },
        {
            "Q": "Which one has a larger X value at the peak of its ridgeline: Urban Redevelopment Areas or Rural Areas?",
            "A": "{Rural Areas} has a larger X value at the peak of its ridgeline."
        }
    ],
    "MSR": [
        {
            "Q": "How many ridges have their peak located to the right of the average X value across all ridges?",
            "A": "There are {3} ridges whose peaks are located to the right of the average X value."
        },
        {
            "Q": "What is the label of the ridge with the largest span along the mountain height?",
            "A": "The ridge with the largest span in the mountain height is {Suburbs}"
        }
    ],
    "VA": []
}