{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {NovaEdge}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {BrightEdge}."
        },
        {
            "Q": "Which violin is the second position to the left of the violin BrightEdge?",
            "A": "The second position to the left of the violin BrightEdge is {NovaEdge}."
        },
        {
            "Q": "What is the spatial relationship of violin NovaEdge relative to the violin BrightEdge in terms of horizontal (left/right) direction?",
            "A": "violin NovaEdge is to the {left} of the violin BrightEdge."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {BrightEdge}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {BrightEdge}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing MarketZen?",
            "A": "The density distribution pattern of the MarketZen shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of NovaEdge in the violin plot?",
            "A": "The median of NovaEdge is {52372.00} USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of MarketZen in the violin plot?",
            "A": "The lower quartile (Q1) of MarketZen is {40614.00} USD."
        },
        {
            "Q": "What is the upper whisker limit of BrightEdge in the violin plot?",
            "A": "The upper whisker limit of BrightEdge is {97535.00} USD."
        },
        {
            "Q": "What is the lowest lower outlier value in BrightEdge in the violin plot?",
            "A": "The lowest upper outlier value in BrightEdge is {5808.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the violin plot?",
            "A": "The global maximum USD value in the violin plot is {129879.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the violin plot?",
            "A": "The global minimum USD value in the violin plot is {394.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin BrightEdge and NovaEdge?",
            "A": "The Q3 difference between violin BrightEdge and NovaEdge is {5442.00} USD."
        },
        {
            "Q": "What is the toal Q1 value of violin BrightEdge and MarketZen?",
            "A": "The total Q1 value of violin BrightEdge and BrightEdge is {84723.00} USD."
        },
        {
            "Q": "What is the average Median value of violin MarketZen and NovaEdge?",
            "A": "The average Median value of violin MarketZen and NovaEdge is {51614.50} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 53311.50 USD? Please list the violins and corresponding values.",
            "A": "{BrightEdge} has {54251.00} USD "
        },
        {
            "Q": "Which violins have median values below 53311.50 USD? Please list the violins and corresponding values.",
            "A": "{NovaEdge} has {52372.00} USD , {MarketZen} has {50857.00} USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 39634.50 USD and the upper quartile (Q3) below 64022.00 USD?",
            "A": "Violin {MarketZen} has the Q1 above 39634.50 USD and the Q3 below 64022.0 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 52173.95 USD?",
            "A": "Violin {NovaEdge} has {53448.01} USD ,{MarketZen} has {53208.65} USD have their highest density peak exceed 52173.95 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 53328.33 USD?",
            "A": "Violin {MarketZen} has {53208.65} USD ,{BrightEdge} has {51139.25} USD have their highest density peak below 53328.33 USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of MarketZen or NovaEdge ",
            "A": "The median value of the {NovaEdge} is larger."
        },
        {
            "Q": "Which is larger, the median value of BrightEdge, MarketZen or NovaEdge ",
            "A": "The median value of the {BrightEdge} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {BrightEdge}."
        }
    ],
    "VA": []
}