{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {4} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Creston}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Northgate}."
        },
        {
            "Q": "Which violin is the first position to the left of the violin Quarryville?",
            "A": "The first position to the left of the violin Quarryville is {Zephyr}."
        },
        {
            "Q": "What is the spatial relationship of violin Quarryville relative to the violin Creston in terms of horizontal (left/right) direction?",
            "A": "violin Quarryville is to the {right} of the violin Creston."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Northgate}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Northgate}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Zephyr?",
            "A": "The density distribution pattern of the Zephyr shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Northgate in the violin plot?",
            "A": "The median of Northgate is {574.00} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Quarryville in the violin plot?",
            "A": "The lower quartile (Q1) of Quarryville is {392.00} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Creston in the violin plot?",
            "A": "The upper whisker limit of Creston is {694.00} million USD."
        },
        {
            "Q": "What is the lowest lower outlier value in Northgate in the violin plot?",
            "A": "The lowest upper outlier value in Northgate is {212.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {909.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {34.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Northgate and Quarryville?",
            "A": "The Median difference between violin Northgate and Quarryville is {102.00} million USD."
        },
        {
            "Q": "What is the toal Median value of violin Zephyr and Northgate?",
            "A": "The total Median value of violin Zephyr and Northgate is {1087.50} million USD."
        },
        {
            "Q": "What is the average Q1 value of violin Northgate and Creston?",
            "A": "The average Q1 value of violin Northgate and Creston is {465.12} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 543.75 million USD? Please list the violins and corresponding values.",
            "A": "{Northgate} has {574.00} million USD "
        },
        {
            "Q": "Which violins have median values below 484.00 million USD? Please list the violins and corresponding values.",
            "A": "{Quarryville} has {472.00} million USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 407.00 million USD and the upper quartile (Q3) below 615.00 million USD?",
            "A": "Violin {Creston},{Zephyr} has the Q1 above 407.00 million USD and the Q3 below 615.0 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 511.10 million USD?",
            "A": "Violin {Creston} has {511.66} million USD ,{Northgate} has {564.41} million USD have their highest density peak exceed 511.10 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 538.04 million USD?",
            "A": "Violin {Creston} has {511.66} million USD ,{Zephyr} has {510.53} million USD ,{Quarryville} has {443.27} million USD have their highest density peak below 538.04 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Northgate or Quarryville ",
            "A": "The median value of the {Northgate} is larger."
        },
        {
            "Q": "Which is larger, the median value of Zephyr, Northgate or Quarryville ",
            "A": "The median value of the {Northgate} is larger."
        },
        {
            "Q": "Which is larger, the median value of Zephyr, Northgate, Quarryville or Creston ",
            "A": "The median value of the {Northgate} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Zephyr}."
        }
    ],
    "VA": []
}