{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Showio}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {SceneX}."
        },
        {
            "Q": "Which violin is the first position to the left of the violin Reelix?",
            "A": "The first position to the left of the violin Reelix is {Showio}."
        },
        {
            "Q": "What is the spatial relationship of violin Reelix relative to the violin SceneX in terms of horizontal (left/right) direction?",
            "A": "violin Reelix is to the {left} of the violin SceneX."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Reelix}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Reelix}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Reelix?",
            "A": "The density distribution pattern of the Reelix shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Reelix in the violin plot?",
            "A": "The median of Reelix is {22738.00} viewers."
        },
        {
            "Q": "What is the upper quartile (Q3) of Showio in the violin plot?",
            "A": "The upper quartile (Q3) of Showio is {20808.00} viewers."
        },
        {
            "Q": "What is the upper whisker limit of Showio in the violin plot?",
            "A": "The upper whisker limit of Showio is {28757.00} viewers."
        },
        {
            "Q": "What is the lowest lower outlier value in Reelix in the violin plot?",
            "A": "The lowest upper outlier value in Reelix is {17789.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum viewers value in the violin plot?",
            "A": "The global maximum viewers value in the violin plot is {29077.00} viewers."
        },
        {
            "Q": "What is the global minimum viewers value in the violin plot?",
            "A": "The global minimum viewers value in the violin plot is {1999.00} viewers."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Reelix and Showio?",
            "A": "The Q1 difference between violin Reelix and Showio is {6496.00} viewers."
        },
        {
            "Q": "What is the toal Median value of violin Showio and SceneX?",
            "A": "The total Median value of violin Showio and SceneX is {31869.00} viewers."
        },
        {
            "Q": "What is the average Q3 value of violin Showio and SceneX?",
            "A": "The average Q3 value of violin Showio and SceneX is {18551.50} viewers."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 15934.50 viewers? Please list the violins and corresponding values.",
            "A": "{Showio} has {18427.00} viewers , {Reelix} has {22738.00} viewers "
        },
        {
            "Q": "Which violins have median values below 15934.50 viewers? Please list the violins and corresponding values.",
            "A": "{SceneX} has {13442.00} viewers "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 13106.50 viewers and the upper quartile (Q3) below 22203.00 viewers?",
            "A": "Violin {Showio} has the Q1 above 13106.50 viewers and the Q3 below 22203.0 viewers."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 16259.69 viewers?",
            "A": "Violin {Showio} has {19116.96} viewers ,{Reelix} has {22732.85} viewers have their highest density peak exceed 16259.69 viewers."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 16259.69 viewers?",
            "A": "Violin {SceneX} has {13402.42} viewers have their highest density peak below 16259.69 viewers."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Reelix or Showio ",
            "A": "The median value of the {Reelix} is larger."
        },
        {
            "Q": "Which is larger, the median value of Showio, Reelix or SceneX ",
            "A": "The median value of the {Reelix} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Showio}."
        }
    ],
    "VA": []
}