{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Castio}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Showio}."
        },
        {
            "Q": "Which violin is the second position to the right of the violin SceneX?",
            "A": "The second position to the right of the violin SceneX is {Streamo}."
        },
        {
            "Q": "What is the spatial relationship of violin Castio relative to the violin Showio in terms of horizontal (left/right) direction?",
            "A": "violin Castio is to the {left} of the violin Showio."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Castio}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Castio}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing MoviQ?",
            "A": "The density distribution pattern of the MoviQ shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Streamo in the violin plot?",
            "A": "The median of Streamo is {7202.00} viewers."
        },
        {
            "Q": "What is the lower quartile (Q1) of Streamo in the violin plot?",
            "A": "The lower quartile (Q1) of Streamo is {5873.75} viewers."
        },
        {
            "Q": "What is the upper whisker limit of Showio in the violin plot?",
            "A": "The upper whisker limit of Showio is {27208.00} viewers."
        },
        {
            "Q": "What is the largest upper outlier value in Showio in the violin plot?",
            "A": "The largest upper outlier value in Showio is {33338.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum viewers value in the violin plot?",
            "A": "The global maximum viewers value in the violin plot is {40129.00} viewers."
        },
        {
            "Q": "What is the global minimum viewers value in the violin plot?",
            "A": "The global minimum viewers value in the violin plot is {3074.00} viewers."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Castio and MoviQ?",
            "A": "The Q1 difference between violin Castio and MoviQ is {16157.00} viewers."
        },
        {
            "Q": "What is the toal Q1 value of violin MoviQ and Castio?",
            "A": "The total Q1 value of violin MoviQ and Showio is {23256.00} viewers."
        },
        {
            "Q": "What is the average Median value of violin Castio and SceneX?",
            "A": "The average Median value of violin Castio and SceneX is {19379.25} viewers."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 15856.00 viewers? Please list the violins and corresponding values.",
            "A": "{Castio} has {23075.00} viewers , {Showio} has {16028.50} viewers "
        },
        {
            "Q": "Which violins have median values below 11442.75 viewers? Please list the violins and corresponding values.",
            "A": "{MoviQ} has {4047.50} viewers , {Streamo} has {7202.00} viewers "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 9527.25 viewers and the upper quartile (Q3) below 18895.88 viewers?",
            "A": "Violin {SceneX} has the Q1 above 9527.25 viewers and the Q3 below 18895.875 viewers."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 10149.88 viewers?",
            "A": "Violin {Castio} has {22622.73} viewers ,{SceneX} has {14087.99} viewers ,{Showio} has {14837.62} viewers have their highest density peak exceed 10149.88 viewers."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 14462.80 viewers?",
            "A": "Violin {SceneX} has {14087.99} viewers ,{MoviQ} has {3636.13} viewers ,{Streamo} has {6211.78} viewers have their highest density peak below 14462.80 viewers."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of SceneX or Castio ",
            "A": "The median value of the {Castio} is larger."
        },
        {
            "Q": "Which is larger, the median value of Showio, Streamo or SceneX ",
            "A": "The median value of the {Showio} is larger."
        },
        {
            "Q": "Which is larger, the median value of Castio, Showio, SceneX or MoviQ ",
            "A": "The median value of the {Castio} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Castio}."
        }
    ],
    "VA": []
}