{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Castio}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {PixelX}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Castio?",
            "A": "The first position to the right of the violin Castio is {Vizzle}."
        },
        {
            "Q": "What is the spatial relationship of violin Vido relative to the violin Castio in terms of horizontal (left/right) direction?",
            "A": "violin Vido is to the {right} of the violin Castio."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Videx}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Videx}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Videx?",
            "A": "The density distribution pattern of the Videx shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Vizzle in the violin plot?",
            "A": "The median of Vizzle is {15786.50} viewers."
        },
        {
            "Q": "What is the upper quartile (Q3) of Vizzle in the violin plot?",
            "A": "The upper quartile (Q3) of Vizzle is {19860.00} viewers."
        },
        {
            "Q": "What is the upper whisker limit of Videx in the violin plot?",
            "A": "The upper whisker limit of Videx is {28667.00} viewers."
        },
        {
            "Q": "What is the largest upper outlier value in Videx in the violin plot?",
            "A": "The largest upper outlier value in Videx is {35339.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum viewers value in the violin plot?",
            "A": "The global maximum viewers value in the violin plot is {35339.00} viewers."
        },
        {
            "Q": "What is the global minimum viewers value in the violin plot?",
            "A": "The global minimum viewers value in the violin plot is {3124.00} viewers."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Vido and Videx?",
            "A": "The Median difference between violin Vido and Videx is {6000.00} viewers."
        },
        {
            "Q": "What is the toal Median value of violin PixelX and Vido?",
            "A": "The total Median value of violin PixelX and PixelX is {23014.50} viewers."
        },
        {
            "Q": "What is the average Q3 value of violin PixelX and Castio?",
            "A": "The average Q3 value of violin PixelX and Castio is {10474.88} viewers."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 15896.25 viewers? Please list the violins and corresponding values.",
            "A": "{Videx} has {22006.00} viewers , {Vido} has {16006.00} viewers "
        },
        {
            "Q": "Which violins have median values below 12188.00 viewers? Please list the violins and corresponding values.",
            "A": "{Castio} has {8589.50} viewers , {PixelX} has {7008.50} viewers "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 9756.50 viewers and the upper quartile (Q3) below 18323.62 viewers?",
            "A": "Violin {Vido} has the Q1 above 9756.50 viewers and the Q3 below 18323.625 viewers."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 11314.69 viewers?",
            "A": "Violin {Vizzle} has {15004.54} viewers ,{Videx} has {21018.95} viewers ,{Vido} has {15885.91} viewers have their highest density peak exceed 11314.69 viewers."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 6711.55 viewers?",
            "A": "Violin {PixelX} has {5798.27} viewers have their highest density peak below 6711.55 viewers."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of PixelX or Vizzle ",
            "A": "The median value of the {Vizzle} is larger."
        },
        {
            "Q": "Which is larger, the median value of Vizzle, Vido or Videx ",
            "A": "The median value of the {Videx} is larger."
        },
        {
            "Q": "Which is larger, the median value of Videx, Vizzle, Castio or Vido ",
            "A": "The median value of the {Videx} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Vizzle}."
        }
    ],
    "VA": []
}