{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {6} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Dark Horizon}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {True Edge}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Plain Sight?",
            "A": "The first position to the right of the violin Plain Sight is {True Edge}."
        },
        {
            "Q": "What is the spatial relationship of violin True Edge relative to the violin Plain Sight in terms of horizontal (left/right) direction?",
            "A": "violin True Edge is to the {right} of the violin Plain Sight."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {True Edge}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {True Edge}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Plain Sight?",
            "A": "The density distribution pattern of the Plain Sight shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Twin Souls in the violin plot?",
            "A": "The median of Twin Souls is {473.00} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of True Edge in the violin plot?",
            "A": "The lower quartile (Q1) of True Edge is {506.00} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Plain Sight in the violin plot?",
            "A": "The upper whisker limit of Plain Sight is {637.00} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Iron Heart in the violin plot?",
            "A": "The largest upper outlier value in Iron Heart is {810.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {810.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {5.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin True Edge and Iron Heart?",
            "A": "The Median difference between violin True Edge and Iron Heart is {52.00} million USD."
        },
        {
            "Q": "What is the toal Median value of violin Iron Heart and Lost Signal?",
            "A": "The total Median value of violin Iron Heart and True Edge is {1071.00} million USD."
        },
        {
            "Q": "What is the average Q1 value of violin Lost Signal and Dark Horizon?",
            "A": "The average Q1 value of violin Lost Signal and Dark Horizon is {480.00} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 549.50 million USD? Please list the violins and corresponding values.",
            "A": "{Dark Horizon} has {553.00} million USD , {True Edge} has {577.00} million USD "
        },
        {
            "Q": "Which violins have median values below 535.50 million USD? Please list the violins and corresponding values.",
            "A": "{Iron Heart} has {525.00} million USD , {Twin Souls} has {473.00} million USD , {Plain Sight} has {422.00} million USD "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 575.84 million USD?",
            "A": "Violin {True Edge} has {585.95} million USD have their highest density peak exceed 575.84 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 522.46 million USD?",
            "A": "Violin {Lost Signal} has {515.17} million USD ,{Iron Heart} has {519.43} million USD ,{Plain Sight} has {422.54} million USD have their highest density peak below 522.46 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Dark Horizon or Twin Souls ",
            "A": "The median value of the {Dark Horizon} is larger."
        },
        {
            "Q": "Which is larger, the median value of Plain Sight, Twin Souls or Lost Signal ",
            "A": "The median value of the {Lost Signal} is larger."
        },
        {
            "Q": "Which is larger, the median value of Lost Signal, Twin Souls, True Edge or Plain Sight ",
            "A": "The median value of the {True Edge} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Lost Signal}."
        }
    ],
    "VA": []
}