{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {BrightWave}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {BrightEdge}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin BrightWave?",
            "A": "The first position to the right of the violin BrightWave is {UrbanFlow}."
        },
        {
            "Q": "What is the spatial relationship of violin UrbanFlow relative to the violin BrightEdge in terms of horizontal (left/right) direction?",
            "A": "violin UrbanFlow is to the {left} of the violin BrightEdge."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {BrightWave}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {BrightEdge}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing BrightEdge?",
            "A": "The density distribution pattern of the BrightEdge shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of UrbanFlow in the violin plot?",
            "A": "The median of UrbanFlow is {46834.50} USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of UrbanFlow in the violin plot?",
            "A": "The lower quartile (Q1) of UrbanFlow is {37517.50} USD."
        },
        {
            "Q": "What is the upper whisker limit of BrightWave in the violin plot?",
            "A": "The upper whisker limit of BrightWave is {87411.00} USD."
        },
        {
            "Q": "What is the lowest lower outlier value in BrightEdge in the violin plot?",
            "A": "The lowest upper outlier value in BrightEdge is {11359.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the violin plot?",
            "A": "The global maximum USD value in the violin plot is {166269.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the violin plot?",
            "A": "The global minimum USD value in the violin plot is {1108.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin BrightEdge and UrbanFlow?",
            "A": "The Median difference between violin BrightEdge and UrbanFlow is {11467.50} USD."
        },
        {
            "Q": "What is the toal Q1 value of violin BrightEdge and UrbanFlow?",
            "A": "The total Q1 value of violin BrightEdge and BrightEdge is {85757.75} USD."
        },
        {
            "Q": "What is the average Q3 value of violin BrightEdge and UrbanFlow?",
            "A": "The average Q3 value of violin BrightEdge and UrbanFlow is {64930.38} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 52568.25 USD? Please list the violins and corresponding values.",
            "A": "{BrightWave} has {59779.00} USD , {BrightEdge} has {58302.00} USD "
        },
        {
            "Q": "Which violins have median values below 59040.50 USD? Please list the violins and corresponding values.",
            "A": "{UrbanFlow} has {46834.50} USD , {BrightEdge} has {58302.00} USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 42599.50 USD and the upper quartile (Q3) below 67282.25 USD?",
            "A": "Violin {BrightWave} has the Q1 above 42599.50 USD and the Q3 below 67282.25 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 51718.00 USD?",
            "A": "Violin {BrightWave} has {60374.99} USD ,{BrightEdge} has {59163.11} USD have their highest density peak exceed 51718.00 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 59769.05 USD?",
            "A": "Violin {UrbanFlow} has {44272.89} USD ,{BrightEdge} has {59163.11} USD have their highest density peak below 59769.05 USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of UrbanFlow or BrightEdge ",
            "A": "The median value of the {BrightEdge} is larger."
        },
        {
            "Q": "Which is larger, the median value of BrightEdge, BrightWave or UrbanFlow ",
            "A": "The median value of the {BrightWave} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {BrightWave}."
        }
    ],
    "VA": []
}