{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Starlight}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Dark Horizon}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Last Ember?",
            "A": "The first position to the right of the violin Last Ember is {Dark Horizon}."
        },
        {
            "Q": "What is the spatial relationship of violin Starlight relative to the violin Dark Horizon in terms of horizontal (left/right) direction?",
            "A": "violin Starlight is to the {left} of the violin Dark Horizon."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Dark Horizon}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Dark Horizon}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Last Ember?",
            "A": "The density distribution pattern of the Last Ember shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Last Ember in the violin plot?",
            "A": "The median of Last Ember is {538.50} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Starlight in the violin plot?",
            "A": "The lower quartile (Q1) of Starlight is {426.00} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Dark Horizon in the violin plot?",
            "A": "The upper whisker limit of Dark Horizon is {1451.00} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Starlight in the violin plot?",
            "A": "The largest upper outlier value in Starlight is {1470.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {1917.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {131.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Last Ember and Dark Horizon?",
            "A": "The Median difference between violin Last Ember and Dark Horizon is {96.00} million USD."
        },
        {
            "Q": "What is the toal Q3 value of violin Starlight and Last Ember?",
            "A": "The total Q3 value of violin Starlight and Dark Horizon is {1470.75} million USD."
        },
        {
            "Q": "What is the average Q1 value of violin Last Ember and Dark Horizon?",
            "A": "The average Q1 value of violin Last Ember and Dark Horizon is {413.12} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 537.00 million USD? Please list the violins and corresponding values.",
            "A": "{Last Ember} has {538.50} million USD , {Dark Horizon} has {634.50} million USD "
        },
        {
            "Q": "Which violins have median values below 537.00 million USD? Please list the violins and corresponding values.",
            "A": "{Starlight} has {535.50} million USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 390.25 million USD and the upper quartile (Q3) below 815.88 million USD?",
            "A": "Violin {Starlight} has the Q1 above 390.25 million USD and the Q3 below 815.875 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 448.00 million USD?",
            "A": "Violin {Starlight} has {496.08} million USD ,{Dark Horizon} has {614.42} million USD have their highest density peak exceed 448.00 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 448.00 million USD?",
            "A": "Violin {Last Ember} has {399.92} million USD have their highest density peak below 448.00 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Last Ember or Starlight ",
            "A": "The median value of the {Last Ember} is larger."
        },
        {
            "Q": "Which is larger, the median value of Starlight, Last Ember or Dark Horizon ",
            "A": "The median value of the {Dark Horizon} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Dark Horizon}."
        }
    ],
    "VA": []
}