{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Lost Signal}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Last Ember}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Nightfall?",
            "A": "The first position to the right of the violin Nightfall is {Last Ember}."
        },
        {
            "Q": "What is the spatial relationship of violin Lost Signal relative to the violin Last Ember in terms of horizontal (left/right) direction?",
            "A": "violin Lost Signal is to the {left} of the violin Last Ember."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Nightfall}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Nightfall}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Lost Signal?",
            "A": "The density distribution pattern of the Lost Signal shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Lost Signal in the violin plot?",
            "A": "The median of Lost Signal is {421.00} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Last Ember in the violin plot?",
            "A": "The lower quartile (Q1) of Last Ember is {529.00} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Last Ember in the violin plot?",
            "A": "The upper whisker limit of Last Ember is {824.00} million USD."
        },
        {
            "Q": "What is the lowest lower outlier value in Last Ember in the violin plot?",
            "A": "The lowest upper outlier value in Last Ember is {186.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {891.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {84.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Last Ember and Nightfall?",
            "A": "The Q1 difference between violin Last Ember and Nightfall is {65.00} million USD."
        },
        {
            "Q": "What is the toal Median value of violin Nightfall and Lost Signal?",
            "A": "The total Median value of violin Nightfall and Last Ember is {1073.00} million USD."
        },
        {
            "Q": "What is the average Median value of violin Lost Signal and Last Ember?",
            "A": "The average Median value of violin Lost Signal and Last Ember is {499.50} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 615.00 million USD? Please list the violins and corresponding values.",
            "A": "{Nightfall} has {652.00} million USD "
        },
        {
            "Q": "Which violins have median values below 615.00 million USD? Please list the violins and corresponding values.",
            "A": "{Lost Signal} has {421.00} million USD , {Last Ember} has {578.00} million USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 444.50 million USD and the upper quartile (Q3) below 687.50 million USD?",
            "A": "Violin {Last Ember} has the Q1 above 444.50 million USD and the Q3 below 687.5 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 619.00 million USD?",
            "A": "Violin {Nightfall} has {664.56} million USD have their highest density peak exceed 619.00 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 619.00 million USD?",
            "A": "Violin {Lost Signal} has {425.82} million USD ,{Last Ember} has {573.43} million USD have their highest density peak below 619.00 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Nightfall or Lost Signal ",
            "A": "The median value of the {Nightfall} is larger."
        },
        {
            "Q": "Which is larger, the median value of Lost Signal, Last Ember or Nightfall ",
            "A": "The median value of the {Nightfall} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Last Ember}."
        }
    ],
    "VA": []
}