{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {6} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Broken Mirror}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Dark Horizon}."
        },
        {
            "Q": "Which violin is the second position to the left of the violin Silent Echo?",
            "A": "The second position to the left of the violin Silent Echo is {Twin Souls}."
        },
        {
            "Q": "What is the spatial relationship of violin Broken Mirror relative to the violin Dark Horizon in terms of horizontal (left/right) direction?",
            "A": "violin Broken Mirror is to the {left} of the violin Dark Horizon."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Twin Souls}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Twin Souls}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Dark Horizon?",
            "A": "The density distribution pattern of the Dark Horizon shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Twin Souls in the violin plot?",
            "A": "The median of Twin Souls is {688.50} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Deep Waters in the violin plot?",
            "A": "The lower quartile (Q1) of Deep Waters is {286.50} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Deep Waters in the violin plot?",
            "A": "The upper whisker limit of Deep Waters is {1268.00} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Deep Waters in the violin plot?",
            "A": "The largest upper outlier value in Deep Waters is {1410.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {1935.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {98.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Silent Echo and Dark Horizon?",
            "A": "The Q3 difference between violin Silent Echo and Dark Horizon is {190.75} million USD."
        },
        {
            "Q": "What is the toal Median value of violin Broken Mirror and Dark Horizon?",
            "A": "The total Median value of violin Broken Mirror and Dark Horizon is {827.50} million USD."
        },
        {
            "Q": "What is the average Q3 value of violin Broken Mirror and Dark Horizon?",
            "A": "The average Q3 value of violin Broken Mirror and Dark Horizon is {593.12} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 477.75 million USD? Please list the violins and corresponding values.",
            "A": "{Twin Souls} has {688.50} million USD , {Silent Echo} has {478.00} million USD "
        },
        {
            "Q": "Which violins have median values below 413.75 million USD? Please list the violins and corresponding values.",
            "A": "{Dark Horizon} has {381.50} million USD "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 382.93 million USD?",
            "A": "Violin {Twin Souls} has {560.43} million USD ,{Silent Echo} has {401.72} million USD have their highest density peak exceed 382.93 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 356.56 million USD?",
            "A": "Violin {Broken Mirror} has {338.58} million USD ,{Deep Waters} has {333.75} million USD ,{Dark Horizon} has {348.98} million USD have their highest density peak below 356.56 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Broken Mirror or Twin Souls ",
            "A": "The median value of the {Twin Souls} is larger."
        },
        {
            "Q": "Which is larger, the median value of Twin Souls, Final Reckoning or Dark Horizon ",
            "A": "The median value of the {Twin Souls} is larger."
        },
        {
            "Q": "Which is larger, the median value of Final Reckoning, Broken Mirror, Silent Echo or Twin Souls ",
            "A": "The median value of the {Twin Souls} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Twin Souls}."
        }
    ],
    "VA": []
}