{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {7} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Iron Heart}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Hidden Truth}."
        },
        {
            "Q": "Which violin is the first position to the left of the violin Last Ember?",
            "A": "The first position to the left of the violin Last Ember is {Iron Heart}."
        },
        {
            "Q": "What is the spatial relationship of violin Hidden Truth relative to the violin Plain Sight in terms of horizontal (left/right) direction?",
            "A": "violin Hidden Truth is to the {right} of the violin Plain Sight."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Hidden Truth}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Hidden Truth}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Frozen Time?",
            "A": "The density distribution pattern of the Frozen Time shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Final Reckoning in the violin plot?",
            "A": "The median of Final Reckoning is {438.00} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Hidden Truth in the violin plot?",
            "A": "The lower quartile (Q1) of Hidden Truth is {538.00} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Frozen Time in the violin plot?",
            "A": "The upper whisker limit of Frozen Time is {721.00} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Final Reckoning in the violin plot?",
            "A": "The largest upper outlier value in Final Reckoning is {807.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {826.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {81.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Final Reckoning and Frozen Time?",
            "A": "The Q1 difference between violin Final Reckoning and Frozen Time is {64.00} million USD."
        },
        {
            "Q": "What is the toal Q3 value of violin Hidden Truth and Final Reckoning?",
            "A": "The total Q3 value of violin Hidden Truth and Hidden Truth is {1192.00} million USD."
        },
        {
            "Q": "What is the average Median value of violin Iron Heart and Final Reckoning?",
            "A": "The average Median value of violin Iron Heart and Final Reckoning is {515.50} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 574.50 million USD? Please list the violins and corresponding values.",
            "A": "{Iron Heart} has {593.00} million USD , {Hidden Truth} has {598.00} million USD "
        },
        {
            "Q": "Which violins have median values below 424.00 million USD? Please list the violins and corresponding values.",
            "A": "{Echoes} has {410.00} million USD "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 598.50 million USD?",
            "A": "Violin {Hidden Truth} has {606.82} million USD have their highest density peak exceed 598.50 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 457.27 million USD?",
            "A": "Violin {Echoes} has {418.41} million USD ,{Final Reckoning} has {408.40} million USD have their highest density peak below 457.27 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Plain Sight or Iron Heart ",
            "A": "The median value of the {Iron Heart} is larger."
        },
        {
            "Q": "Which is larger, the median value of Plain Sight, Frozen Time or Hidden Truth ",
            "A": "The median value of the {Hidden Truth} is larger."
        },
        {
            "Q": "Which is larger, the median value of Last Ember, Frozen Time, Echoes or Final Reckoning ",
            "A": "The median value of the {Last Ember} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Final Reckoning}."
        }
    ],
    "VA": []
}