{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Nightfall}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Starlight}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Empty Roads?",
            "A": "The first position to the right of the violin Empty Roads is {Starlight}."
        },
        {
            "Q": "What is the spatial relationship of violin Starlight relative to the violin Last Ember in terms of horizontal (left/right) direction?",
            "A": "violin Starlight is to the {right} of the violin Last Ember."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Last Ember}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Last Ember}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Nightfall?",
            "A": "The density distribution pattern of the Nightfall shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Deep Waters in the violin plot?",
            "A": "The median of Deep Waters is {533.00} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Deep Waters in the violin plot?",
            "A": "The lower quartile (Q1) of Deep Waters is {378.50} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Deep Waters in the violin plot?",
            "A": "The upper whisker limit of Deep Waters is {1330.00} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Last Ember in the violin plot?",
            "A": "The largest upper outlier value in Last Ember is {1838.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {2353.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {123.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Last Ember and Nightfall?",
            "A": "The Q1 difference between violin Last Ember and Nightfall is {107.25} million USD."
        },
        {
            "Q": "What is the toal Q3 value of violin Nightfall and Deep Waters?",
            "A": "The total Q3 value of violin Nightfall and Starlight is {1516.25} million USD."
        },
        {
            "Q": "What is the average Q3 value of violin Deep Waters and Nightfall?",
            "A": "The average Q3 value of violin Deep Waters and Nightfall is {758.12} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 544.00 million USD? Please list the violins and corresponding values.",
            "A": "{Nightfall} has {555.00} million USD , {Last Ember} has {681.50} million USD , {Starlight} has {628.00} million USD "
        },
        {
            "Q": "Which violins have median values below 544.00 million USD? Please list the violins and corresponding values.",
            "A": "{Deep Waters} has {533.00} million USD , {Empty Roads} has {386.50} million USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 370.25 million USD and the upper quartile (Q3) below 841.12 million USD?",
            "A": "Violin {Deep Waters} has the Q1 above 370.25 million USD and the Q3 below 841.125 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 596.02 million USD?",
            "A": "Violin {Last Ember} has {619.97} million USD have their highest density peak exceed 596.02 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 536.38 million USD?",
            "A": "Violin {Nightfall} has {500.68} million USD ,{Deep Waters} has {457.41} million USD ,{Empty Roads} has {332.36} million USD have their highest density peak below 536.38 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Nightfall or Empty Roads ",
            "A": "The median value of the {Nightfall} is larger."
        },
        {
            "Q": "Which is larger, the median value of Last Ember, Starlight or Empty Roads ",
            "A": "The median value of the {Last Ember} is larger."
        },
        {
            "Q": "Which is larger, the median value of Nightfall, Last Ember, Starlight or Empty Roads ",
            "A": "The median value of the {Last Ember} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Starlight}."
        }
    ],
    "VA": []
}