{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {4} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Lotus Temple}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Star Plateau}."
        },
        {
            "Q": "Which violin is the third position to the right of the violin Lotus Temple?",
            "A": "The third position to the right of the violin Lotus Temple is {Star Plateau}."
        },
        {
            "Q": "What is the spatial relationship of violin Misty Trail relative to the violin Star Plateau in terms of horizontal (left/right) direction?",
            "A": "violin Misty Trail is to the {left} of the violin Star Plateau."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Lotus Temple}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Lotus Temple}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Lotus Temple?",
            "A": "The density distribution pattern of the Lotus Temple shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Misty Trail in the violin plot?",
            "A": "The median of Misty Trail is {9807.00} Visitors."
        },
        {
            "Q": "What is the upper quartile (Q3) of Lotus Temple in the violin plot?",
            "A": "The upper quartile (Q3) of Lotus Temple is {16217.75} Visitors."
        },
        {
            "Q": "What is the upper whisker limit of Lotus Temple in the violin plot?",
            "A": "The upper whisker limit of Lotus Temple is {28001.00} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Willow Grove in the violin plot?",
            "A": "The largest upper outlier value in Willow Grove is {34364.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the violin plot?",
            "A": "The global maximum Visitors value in the violin plot is {34364.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the violin plot?",
            "A": "The global minimum Visitors value in the violin plot is {3541.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Willow Grove and Lotus Temple?",
            "A": "The Median difference between violin Willow Grove and Lotus Temple is {3814.00} Visitors."
        },
        {
            "Q": "What is the toal Median value of violin Misty Trail and Lotus Temple?",
            "A": "The total Median value of violin Misty Trail and Star Plateau is {22661.00} Visitors."
        },
        {
            "Q": "What is the average Median value of violin Willow Grove and Misty Trail?",
            "A": "The average Median value of violin Willow Grove and Misty Trail is {9423.50} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 9136.25 Visitors? Please list the violins and corresponding values.",
            "A": "{Lotus Temple} has {12854.00} Visitors , {Misty Trail} has {9807.00} Visitors , {Star Plateau} has {9232.50} Visitors "
        },
        {
            "Q": "Which violins have median values below 9136.25 Visitors? Please list the violins and corresponding values.",
            "A": "{Willow Grove} has {9040.00} Visitors "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 6688.12 Visitors and the upper quartile (Q3) below 15374.38 Visitors?",
            "A": "Violin {Misty Trail},{Star Plateau} has the Q1 above 6688.12 Visitors and the Q3 below 15374.375 Visitors."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 10817.68 Visitors?",
            "A": "Violin {Lotus Temple} has {13371.94} Visitors have their highest density peak exceed 10817.68 Visitors."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 10817.68 Visitors?",
            "A": "Violin {Misty Trail} has {7672.08} Visitors ,{Willow Grove} has {7994.31} Visitors ,{Star Plateau} has {8263.43} Visitors have their highest density peak below 10817.68 Visitors."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Lotus Temple or Willow Grove ",
            "A": "The median value of the {Lotus Temple} is larger."
        },
        {
            "Q": "Which is larger, the median value of Willow Grove, Star Plateau or Lotus Temple ",
            "A": "The median value of the {Lotus Temple} is larger."
        },
        {
            "Q": "Which is larger, the median value of Willow Grove, Misty Trail, Star Plateau or Lotus Temple ",
            "A": "The median value of the {Lotus Temple} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Willow Grove}."
        }
    ],
    "VA": []
}