{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {6} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Zephyr}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Oakridge}."
        },
        {
            "Q": "Which violin is the second position to the left of the violin Dunvale?",
            "A": "The second position to the left of the violin Dunvale is {Zephyr}."
        },
        {
            "Q": "What is the spatial relationship of violin Springfield relative to the violin Dunvale in terms of horizontal (left/right) direction?",
            "A": "violin Springfield is to the {right} of the violin Dunvale."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Westport}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Westport}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Springfield?",
            "A": "The density distribution pattern of the Springfield shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Dunvale in the violin plot?",
            "A": "The median of Dunvale is {42804.50} tons."
        },
        {
            "Q": "What is the lower quartile (Q1) of Dunvale in the violin plot?",
            "A": "The lower quartile (Q1) of Dunvale is {38135.00} tons."
        },
        {
            "Q": "What is the upper whisker limit of Oakridge in the violin plot?",
            "A": "The upper whisker limit of Oakridge is {69262.00} tons."
        },
        {
            "Q": "What is the lowest lower outlier value in Northgate in the violin plot?",
            "A": "The lowest upper outlier value in Northgate is {25795.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum tons value in the violin plot?",
            "A": "The global maximum tons value in the violin plot is {74844.00} tons."
        },
        {
            "Q": "What is the global minimum tons value in the violin plot?",
            "A": "The global minimum tons value in the violin plot is {22964.00} tons."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Zephyr and Springfield?",
            "A": "The Q1 difference between violin Zephyr and Springfield is {3332.50} tons."
        },
        {
            "Q": "What is the toal Median value of violin Dunvale and Springfield?",
            "A": "The total Median value of violin Dunvale and Oakridge is {92201.50} tons."
        },
        {
            "Q": "What is the average Q3 value of violin Westport and Zephyr?",
            "A": "The average Q3 value of violin Westport and Zephyr is {57489.62} tons."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 49152.00 tons? Please list the violins and corresponding values.",
            "A": "{Zephyr} has {50451.00} tons , {Westport} has {53901.00} tons , {Springfield} has {49397.00} tons "
        },
        {
            "Q": "Which violins have median values below 48355.25 tons? Please list the violins and corresponding values.",
            "A": "{Dunvale} has {42804.50} tons , {Oakridge} has {47803.50} tons "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 43869.75 tons and the upper quartile (Q3) below 54068.75 tons?",
            "A": "Violin {Northgate} has the Q1 above 43869.75 tons and the Q3 below 54068.75 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 49225.67 tons?",
            "A": "Violin {Zephyr} has {50264.67} tons ,{Westport} has {59549.19} tons ,{Springfield} has {50339.14} tons have their highest density peak exceed 49225.67 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 49225.67 tons?",
            "A": "Violin {Northgate} has {48186.67} tons ,{Dunvale} has {40610.52} tons ,{Oakridge} has {44363.77} tons have their highest density peak below 49225.67 tons."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Zephyr or Oakridge ",
            "A": "The median value of the {Zephyr} is larger."
        },
        {
            "Q": "Which is larger, the median value of Springfield, Westport or Oakridge ",
            "A": "The median value of the {Westport} is larger."
        },
        {
            "Q": "Which is larger, the median value of Oakridge, Northgate, Westport or Springfield ",
            "A": "The median value of the {Westport} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Dunvale}."
        }
    ],
    "VA": []
}