{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Fairmont}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Creston}."
        },
        {
            "Q": "Which violin is the second position to the right of the violin Glenhaven?",
            "A": "The second position to the right of the violin Glenhaven is {Highvale}."
        },
        {
            "Q": "What is the spatial relationship of violin Fairmont relative to the violin Creston in terms of horizontal (left/right) direction?",
            "A": "violin Fairmont is to the {left} of the violin Creston."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Highvale}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Highvale}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Highvale?",
            "A": "The density distribution pattern of the Highvale shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Glenhaven in the violin plot?",
            "A": "The median of Glenhaven is {48450.00} tons."
        },
        {
            "Q": "What is the upper quartile (Q3) of Creston in the violin plot?",
            "A": "The upper quartile (Q3) of Creston is {52262.25} tons."
        },
        {
            "Q": "What is the upper whisker limit of Creston in the violin plot?",
            "A": "The upper whisker limit of Creston is {65426.00} tons."
        },
        {
            "Q": "What is the largest upper outlier value in Glenhaven in the violin plot?",
            "A": "The largest upper outlier value in Glenhaven is {75033.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum tons value in the violin plot?",
            "A": "The global maximum tons value in the violin plot is {78549.00} tons."
        },
        {
            "Q": "What is the global minimum tons value in the violin plot?",
            "A": "The global minimum tons value in the violin plot is {26578.00} tons."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Glenhaven and Fairmont?",
            "A": "The Q1 difference between violin Glenhaven and Fairmont is {958.75} tons."
        },
        {
            "Q": "What is the toal Median value of violin Highvale and Glenhaven?",
            "A": "The total Median value of violin Highvale and Creston is {98645.50} tons."
        },
        {
            "Q": "What is the average Median value of violin Fairmont and Yorkton?",
            "A": "The average Median value of violin Fairmont and Yorkton is {46860.25} tons."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 49322.75 tons? Please list the violins and corresponding values.",
            "A": "{Highvale} has {50195.50} tons "
        },
        {
            "Q": "Which violins have median values below 47799.50 tons? Please list the violins and corresponding values.",
            "A": "{Fairmont} has {45485.00} tons , {Creston} has {47363.50} tons "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 42175.75 tons and the upper quartile (Q3) below 53993.50 tons?",
            "A": "Violin {Glenhaven} has the Q1 above 42175.75 tons and the Q3 below 53993.5 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 48693.43 tons?",
            "A": "Violin {Glenhaven} has {49762.67} tons ,{Highvale} has {50924.09} tons have their highest density peak exceed 48693.43 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 46426.18 tons?",
            "A": "Violin {Fairmont} has {45767.60} tons have their highest density peak below 46426.18 tons."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Highvale or Glenhaven ",
            "A": "The median value of the {Highvale} is larger."
        },
        {
            "Q": "Which is larger, the median value of Fairmont, Creston or Glenhaven ",
            "A": "The median value of the {Glenhaven} is larger."
        },
        {
            "Q": "Which is larger, the median value of Glenhaven, Highvale, Yorkton or Fairmont ",
            "A": "The median value of the {Highvale} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Yorkton}."
        }
    ],
    "VA": []
}