{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {2} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Westport}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Lakeview}."
        },
        {
            "Q": "Which violin is the first position to the left of the violin Lakeview?",
            "A": "The first position to the left of the violin Lakeview is {Westport}."
        },
        {
            "Q": "What is the spatial relationship of violin Lakeview relative to the violin Westport in terms of horizontal (left/right) direction?",
            "A": "violin Lakeview is to the {right} of the violin Westport."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Westport}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Westport}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Lakeview?",
            "A": "The density distribution pattern of the Lakeview shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Westport in the violin plot?",
            "A": "The median of Westport is {51737.00} tons."
        },
        {
            "Q": "What is the upper quartile (Q3) of Lakeview in the violin plot?",
            "A": "The upper quartile (Q3) of Lakeview is {50284.25} tons."
        },
        {
            "Q": "What is the upper whisker limit of Westport in the violin plot?",
            "A": "The upper whisker limit of Westport is {76982.00} tons."
        },
        {
            "Q": "What is the lowest lower outlier value in Westport in the violin plot?",
            "A": "The lowest upper outlier value in Westport is {22218.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum tons value in the violin plot?",
            "A": "The global maximum tons value in the violin plot is {82680.00} tons."
        },
        {
            "Q": "What is the global minimum tons value in the violin plot?",
            "A": "The global minimum tons value in the violin plot is {21105.00} tons."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Westport and Lakeview?",
            "A": "The Median difference between violin Westport and Lakeview is {7699.00} tons."
        },
        {
            "Q": "What is the toal Median value of violin Lakeview and Westport?",
            "A": "The total Median value of violin Lakeview and Lakeview is {95775.00} tons."
        },
        {
            "Q": "What is the average Median value of violin Westport and Lakeview?",
            "A": "The average Median value of violin Westport and Lakeview is {47887.50} tons."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 47887.50 tons? Please list the violins and corresponding values.",
            "A": "{Westport} has {51737.00} tons "
        },
        {
            "Q": "Which violins have median values below 47887.50 tons? Please list the violins and corresponding values.",
            "A": "{Lakeview} has {44038.00} tons "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 48344.82 tons?",
            "A": "Violin {Westport} has {52039.44} tons have their highest density peak exceed 48344.82 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 48344.82 tons?",
            "A": "Violin {Lakeview} has {44650.20} tons have their highest density peak below 48344.82 tons."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Westport or Lakeview ",
            "A": "The median value of the {Westport} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Lakeview}."
        }
    ],
    "VA": []
}