{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {7} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Dunvale}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Oakridge}."
        },
        {
            "Q": "Which violin is the third position to the right of the violin Elmhurst?",
            "A": "The third position to the right of the violin Elmhurst is {Creston}."
        },
        {
            "Q": "What is the spatial relationship of violin Oakridge relative to the violin Creston in terms of horizontal (left/right) direction?",
            "A": "violin Oakridge is to the {right} of the violin Creston."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Ashford}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Creston}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Elmhurst?",
            "A": "The density distribution pattern of the Elmhurst shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Fairmont in the violin plot?",
            "A": "The median of Fairmont is {46601.50} tons."
        },
        {
            "Q": "What is the upper quartile (Q3) of Creston in the violin plot?",
            "A": "The upper quartile (Q3) of Creston is {58991.50} tons."
        },
        {
            "Q": "What is the upper whisker limit of Oakridge in the violin plot?",
            "A": "The upper whisker limit of Oakridge is {62095.00} tons."
        },
        {
            "Q": "What is the lowest lower outlier value in Elmhurst in the violin plot?",
            "A": "The lowest upper outlier value in Elmhurst is {22904.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum tons value in the violin plot?",
            "A": "The global maximum tons value in the violin plot is {85908.00} tons."
        },
        {
            "Q": "What is the global minimum tons value in the violin plot?",
            "A": "The global minimum tons value in the violin plot is {2905.00} tons."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Ashford and Dunvale?",
            "A": "The Q3 difference between violin Ashford and Dunvale is {4366.00} tons."
        },
        {
            "Q": "What is the toal Q3 value of violin Dunvale and Creston?",
            "A": "The total Q3 value of violin Dunvale and Oakridge is {113195.75} tons."
        },
        {
            "Q": "What is the average Q3 value of violin Brookfield and Ashford?",
            "A": "The average Q3 value of violin Brookfield and Ashford is {57385.88} tons."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 53418.50 tons? Please list the violins and corresponding values.",
            "A": "{Ashford} has {54107.50} tons "
        },
        {
            "Q": "Which violins have median values below 45450.75 tons? Please list the violins and corresponding values.",
            "A": "{Elmhurst} has {44808.50} tons "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 48816.77 tons?",
            "A": "Violin {Ashford} has {55375.06} tons ,{Brookfield} has {49517.24} tons ,{Creston} has {51536.23} tons have their highest density peak exceed 48816.77 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 45982.57 tons?",
            "A": "Violin {Fairmont} has {45860.51} tons ,{Elmhurst} has {44728.37} tons have their highest density peak below 45982.57 tons."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Brookfield or Creston ",
            "A": "The median value of the {Creston} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ashford, Elmhurst or Creston ",
            "A": "The median value of the {Ashford} is larger."
        },
        {
            "Q": "Which is larger, the median value of Creston, Oakridge, Fairmont or Dunvale ",
            "A": "The median value of the {Creston} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Fairmont}."
        }
    ],
    "VA": []
}