{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {2} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Zephyr}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Northgate}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Zephyr?",
            "A": "The first position to the right of the violin Zephyr is {Northgate}."
        },
        {
            "Q": "What is the spatial relationship of violin Zephyr relative to the violin Northgate in terms of horizontal (left/right) direction?",
            "A": "violin Zephyr is to the {left} of the violin Northgate."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Northgate}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Northgate}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Zephyr?",
            "A": "The density distribution pattern of the Zephyr shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Northgate in the violin plot?",
            "A": "The median of Northgate is {55753.00} tons."
        },
        {
            "Q": "What is the lower quartile (Q1) of Northgate in the violin plot?",
            "A": "The lower quartile (Q1) of Northgate is {49892.50} tons."
        },
        {
            "Q": "What is the upper whisker limit of Northgate in the violin plot?",
            "A": "The upper whisker limit of Northgate is {72086.00} tons."
        },
        {
            "Q": "What is the largest upper outlier value in Zephyr in the violin plot?",
            "A": "The largest upper outlier value in Zephyr is {64715.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum tons value in the violin plot?",
            "A": "The global maximum tons value in the violin plot is {72086.00} tons."
        },
        {
            "Q": "What is the global minimum tons value in the violin plot?",
            "A": "The global minimum tons value in the violin plot is {21159.00} tons."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Zephyr and Northgate?",
            "A": "The Q1 difference between violin Zephyr and Northgate is {9453.75} tons."
        },
        {
            "Q": "What is the toal Median value of violin Zephyr and Northgate?",
            "A": "The total Median value of violin Zephyr and Northgate is {101147.50} tons."
        },
        {
            "Q": "What is the average Q3 value of violin Northgate and Zephyr?",
            "A": "The average Q3 value of violin Northgate and Zephyr is {55111.38} tons."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 50573.75 tons? Please list the violins and corresponding values.",
            "A": "{Northgate} has {55753.00} tons "
        },
        {
            "Q": "Which violins have median values below 50573.75 tons? Please list the violins and corresponding values.",
            "A": "{Zephyr} has {45394.50} tons "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 52061.99 tons?",
            "A": "Violin {Northgate} has {58331.22} tons have their highest density peak exceed 52061.99 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 52061.99 tons?",
            "A": "Violin {Zephyr} has {45792.77} tons have their highest density peak below 52061.99 tons."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Northgate or Zephyr ",
            "A": "The median value of the {Northgate} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Zephyr}."
        }
    ],
    "VA": []
}