{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Lakeview}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Zephyr}."
        },
        {
            "Q": "Which violin is the second position to the left of the violin Zephyr?",
            "A": "The second position to the left of the violin Zephyr is {Lakeview}."
        },
        {
            "Q": "What is the spatial relationship of violin Zephyr relative to the violin Lakeview in terms of horizontal (left/right) direction?",
            "A": "violin Zephyr is to the {right} of the violin Lakeview."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Zephyr}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Zephyr}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Lakeview?",
            "A": "The density distribution pattern of the Lakeview shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Zephyr in the violin plot?",
            "A": "The median of Zephyr is {49513.50} tons."
        },
        {
            "Q": "What is the upper quartile (Q3) of Lakeview in the violin plot?",
            "A": "The upper quartile (Q3) of Lakeview is {52880.50} tons."
        },
        {
            "Q": "What is the upper whisker limit of Zephyr in the violin plot?",
            "A": "The upper whisker limit of Zephyr is {69288.00} tons."
        },
        {
            "Q": "What is the largest upper outlier value in Zephyr in the violin plot?",
            "A": "The largest upper outlier value in Zephyr is {76420.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum tons value in the violin plot?",
            "A": "The global maximum tons value in the violin plot is {76420.00} tons."
        },
        {
            "Q": "What is the global minimum tons value in the violin plot?",
            "A": "The global minimum tons value in the violin plot is {24946.00} tons."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Ironwood and Lakeview?",
            "A": "The Q3 difference between violin Ironwood and Lakeview is {2468.00} tons."
        },
        {
            "Q": "What is the toal Q3 value of violin Zephyr and Ironwood?",
            "A": "The total Q3 value of violin Zephyr and Zephyr is {106346.00} tons."
        },
        {
            "Q": "What is the average Q3 value of violin Ironwood and Lakeview?",
            "A": "The average Q3 value of violin Ironwood and Lakeview is {51646.50} tons."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 46429.25 tons? Please list the violins and corresponding values.",
            "A": "{Lakeview} has {47137.50} tons , {Zephyr} has {49513.50} tons "
        },
        {
            "Q": "Which violins have median values below 46429.25 tons? Please list the violins and corresponding values.",
            "A": "{Ironwood} has {45721.00} tons "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 40759.75 tons and the upper quartile (Q3) below 54407.00 tons?",
            "A": "Violin {Lakeview} has the Q1 above 40759.75 tons and the Q3 below 54407.0 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 45174.66 tons?",
            "A": "Violin {Lakeview} has {48515.06} tons ,{Zephyr} has {50399.61} tons have their highest density peak exceed 45174.66 tons."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 49457.34 tons?",
            "A": "Violin {Lakeview} has {48515.06} tons ,{Ironwood} has {41834.26} tons have their highest density peak below 49457.34 tons."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Lakeview or Ironwood ",
            "A": "The median value of the {Lakeview} is larger."
        },
        {
            "Q": "Which is larger, the median value of Lakeview, Zephyr or Ironwood ",
            "A": "The median value of the {Zephyr} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Zephyr}."
        }
    ],
    "VA": []
}