{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {BrightEdge}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {PureSync}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin BrightEdge?",
            "A": "The first position to the right of the violin BrightEdge is {QuantumX}."
        },
        {
            "Q": "What is the spatial relationship of violin SwiftLink relative to the violin QuantumX in terms of horizontal (left/right) direction?",
            "A": "violin SwiftLink is to the {right} of the violin QuantumX."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {PureSync}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {PureSync}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing NextGen?",
            "A": "The density distribution pattern of the NextGen shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of QuantumX in the violin plot?",
            "A": "The median of QuantumX is {58869.50} USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of QuantumX in the violin plot?",
            "A": "The lower quartile (Q1) of QuantumX is {46320.00} USD."
        },
        {
            "Q": "What is the upper whisker limit of PureSync in the violin plot?",
            "A": "The upper whisker limit of PureSync is {208048.00} USD."
        },
        {
            "Q": "What is the largest upper outlier value in PureSync in the violin plot?",
            "A": "The largest upper outlier value in PureSync is {274325.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the violin plot?",
            "A": "The global maximum USD value in the violin plot is {274325.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the violin plot?",
            "A": "The global minimum USD value in the violin plot is {19767.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin SwiftLink and BrightEdge?",
            "A": "The Q1 difference between violin SwiftLink and BrightEdge is {8262.00} USD."
        },
        {
            "Q": "What is the toal Q3 value of violin SwiftLink and NextGen?",
            "A": "The total Q3 value of violin SwiftLink and PureSync is {176255.00} USD."
        },
        {
            "Q": "What is the average Median value of violin SwiftLink and BrightEdge?",
            "A": "The average Median value of violin SwiftLink and BrightEdge is {58557.50} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 60659.25 USD? Please list the violins and corresponding values.",
            "A": "{NextGen} has {63843.00} USD , {SwiftLink} has {62449.00} USD , {PureSync} has {90387.50} USD "
        },
        {
            "Q": "Which violins have median values below 60659.25 USD? Please list the violins and corresponding values.",
            "A": "{BrightEdge} has {54666.00} USD , {QuantumX} has {58869.50} USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 46408.75 USD and the upper quartile (Q3) below 89597.38 USD?",
            "A": "Violin {NextGen},{SwiftLink} has the Q1 above 46408.75 USD and the Q3 below 89597.375 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 65789.07 USD?",
            "A": "Violin {PureSync} has {73006.93} USD have their highest density peak exceed 65789.07 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 51249.73 USD?",
            "A": "Violin {BrightEdge} has {45904.54} USD ,{QuantumX} has {51071.04} USD have their highest density peak below 51249.73 USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of PureSync or QuantumX ",
            "A": "The median value of the {PureSync} is larger."
        },
        {
            "Q": "Which is larger, the median value of NextGen, QuantumX or SwiftLink ",
            "A": "The median value of the {NextGen} is larger."
        },
        {
            "Q": "Which is larger, the median value of BrightEdge, NextGen, QuantumX or SwiftLink ",
            "A": "The median value of the {NextGen} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {PureSync}."
        }
    ],
    "VA": []
}