{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {2} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Oats}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Cotton}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Oats?",
            "A": "The first position to the right of the violin Oats is {Cotton}."
        },
        {
            "Q": "What is the spatial relationship of violin Oats relative to the violin Cotton in terms of horizontal (left/right) direction?",
            "A": "violin Oats is to the {left} of the violin Cotton."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Oats}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Cotton}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Oats?",
            "A": "The density distribution pattern of the Oats shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Cotton in the violin plot?",
            "A": "The median of Cotton is {6741.50} kilograms per hectare."
        },
        {
            "Q": "What is the lower quartile (Q1) of Oats in the violin plot?",
            "A": "The lower quartile (Q1) of Oats is {6402.50} kilograms per hectare."
        },
        {
            "Q": "What is the upper whisker limit of Cotton in the violin plot?",
            "A": "The upper whisker limit of Cotton is {11607.00} kilograms per hectare."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum kilograms per hectare value in the violin plot?",
            "A": "The global maximum kilograms per hectare value in the violin plot is {11607.00} kilograms per hectare."
        },
        {
            "Q": "What is the global minimum kilograms per hectare value in the violin plot?",
            "A": "The global minimum kilograms per hectare value in the violin plot is {2102.00} kilograms per hectare."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Cotton and Oats?",
            "A": "The Q3 difference between violin Cotton and Oats is {397.75} kilograms per hectare."
        },
        {
            "Q": "What is the toal Q1 value of violin Oats and Cotton?",
            "A": "The total Q1 value of violin Oats and Cotton is {11752.50} kilograms per hectare."
        },
        {
            "Q": "What is the average Q1 value of violin Cotton and Oats?",
            "A": "The average Q1 value of violin Cotton and Oats is {5876.25} kilograms per hectare."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 6963.50 kilograms per hectare? Please list the violins and corresponding values.",
            "A": "{Oats} has {7185.50} kilograms per hectare "
        },
        {
            "Q": "Which violins have median values below 6963.50 kilograms per hectare? Please list the violins and corresponding values.",
            "A": "{Cotton} has {6741.50} kilograms per hectare "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 5876.25 kilograms per hectare and the upper quartile (Q3) below 7869.38 kilograms per hectare?",
            "A": "Violin {Oats} has the Q1 above 5876.25 kilograms per hectare and the Q3 below 7869.375 kilograms per hectare."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 6800.10 kilograms per hectare?",
            "A": "Violin {Oats} has {7283.27} kilograms per hectare have their highest density peak exceed 6800.10 kilograms per hectare."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 6800.10 kilograms per hectare?",
            "A": "Violin {Cotton} has {6316.93} kilograms per hectare have their highest density peak below 6800.10 kilograms per hectare."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Cotton or Oats ",
            "A": "The median value of the {Oats} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Cotton}."
        }
    ],
    "VA": []
}