{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Fairmont}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Elmhurst}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Rosewood?",
            "A": "The first position to the right of the violin Rosewood is {Brookfield}."
        },
        {
            "Q": "What is the spatial relationship of violin Fairmont relative to the violin Elmhurst in terms of horizontal (left/right) direction?",
            "A": "violin Fairmont is to the {left} of the violin Elmhurst."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Elmhurst}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Elmhurst}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Fairmont?",
            "A": "The density distribution pattern of the Fairmont shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Elmhurst in the violin plot?",
            "A": "The median of Elmhurst is {1999.00} number."
        },
        {
            "Q": "What is the lower quartile (Q1) of Elmhurst in the violin plot?",
            "A": "The lower quartile (Q1) of Elmhurst is {1894.00} number."
        },
        {
            "Q": "What is the upper whisker limit of Fairmont in the violin plot?",
            "A": "The upper whisker limit of Fairmont is {878.00} number."
        },
        {
            "Q": "What is the lowest lower outlier value in Elmhurst in the violin plot?",
            "A": "The lowest upper outlier value in Elmhurst is {1504.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the violin plot?",
            "A": "The global maximum number value in the violin plot is {2343.00} number."
        },
        {
            "Q": "What is the global minimum number value in the violin plot?",
            "A": "The global minimum number value in the violin plot is {149.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Springfield and Brookfield?",
            "A": "The Median difference between violin Springfield and Brookfield is {972.00} number."
        },
        {
            "Q": "What is the toal Q1 value of violin Rosewood and Springfield?",
            "A": "The total Q1 value of violin Rosewood and Elmhurst is {952.00} number."
        },
        {
            "Q": "What is the average Q1 value of violin Springfield and Rosewood?",
            "A": "The average Q1 value of violin Springfield and Rosewood is {476.00} number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 1764.50 number? Please list the violins and corresponding values.",
            "A": "{Elmhurst} has {1999.00} number "
        },
        {
            "Q": "Which violins have median values below 650.50 number? Please list the violins and corresponding values.",
            "A": "{Springfield} has {558.00} number , {Rosewood} has {554.00} number "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 596.00 number and the upper quartile (Q3) below 1203.50 number?",
            "A": "Violin {Fairmont} has the Q1 above 596.00 number and the Q3 below 1203.5 number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 1145.26 number?",
            "A": "Violin {Brookfield} has {1554.89} number ,{Elmhurst} has {1992.79} number have their highest density peak exceed 1145.26 number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 551.14 number?",
            "A": "Violin {Rosewood} has {526.79} number have their highest density peak below 551.14 number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Elmhurst or Rosewood ",
            "A": "The median value of the {Elmhurst} is larger."
        },
        {
            "Q": "Which is larger, the median value of Brookfield, Rosewood or Springfield ",
            "A": "The median value of the {Brookfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Elmhurst, Brookfield, Rosewood or Fairmont ",
            "A": "The median value of the {Elmhurst} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Elmhurst}."
        }
    ],
    "VA": []
}