{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {4} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Creston}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Ashford}."
        },
        {
            "Q": "Which violin is the second position to the right of the violin Brookfield?",
            "A": "The second position to the right of the violin Brookfield is {Ashford}."
        },
        {
            "Q": "What is the spatial relationship of violin Ashford relative to the violin Brookfield in terms of horizontal (left/right) direction?",
            "A": "violin Ashford is to the {right} of the violin Brookfield."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Brookfield}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Brookfield}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Brookfield?",
            "A": "The density distribution pattern of the Brookfield shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Ashford in the violin plot?",
            "A": "The median of Ashford is {1642.00} number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Creston in the violin plot?",
            "A": "The upper quartile (Q3) of Creston is {1964.50} number."
        },
        {
            "Q": "What is the upper whisker limit of Ashford in the violin plot?",
            "A": "The upper whisker limit of Ashford is {1929.00} number."
        },
        {
            "Q": "What is the largest upper outlier value in Ashford in the violin plot?",
            "A": "The largest upper outlier value in Ashford is {1957.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the violin plot?",
            "A": "The global maximum number value in the violin plot is {3136.00} number."
        },
        {
            "Q": "What is the global minimum number value in the violin plot?",
            "A": "The global minimum number value in the violin plot is {1352.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Creston and Lakeview?",
            "A": "The Q3 difference between violin Creston and Lakeview is {31.75} number."
        },
        {
            "Q": "What is the toal Median value of violin Brookfield and Ashford?",
            "A": "The total Median value of violin Brookfield and Ashford is {4574.00} number."
        },
        {
            "Q": "What is the average Q3 value of violin Brookfield and Lakeview?",
            "A": "The average Q3 value of violin Brookfield and Lakeview is {2461.38} number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 1762.25 number? Please list the violins and corresponding values.",
            "A": "{Creston} has {1882.50} number , {Brookfield} has {2932.00} number , {Lakeview} has {1902.00} number "
        },
        {
            "Q": "Which violins have median values below 1762.25 number? Please list the violins and corresponding values.",
            "A": "{Ashford} has {1642.00} number "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 1688.50 number and the upper quartile (Q3) below 2477.25 number?",
            "A": "Violin {Creston},{Lakeview} has the Q1 above 1688.50 number and the Q3 below 2477.25 number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 1758.37 number?",
            "A": "Violin {Creston} has {1879.50} number ,{Brookfield} has {2953.66} number ,{Lakeview} has {1911.21} number have their highest density peak exceed 1758.37 number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 1758.37 number?",
            "A": "Violin {Ashford} has {1637.24} number have their highest density peak below 1758.37 number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Brookfield or Creston ",
            "A": "The median value of the {Brookfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ashford, Lakeview or Brookfield ",
            "A": "The median value of the {Brookfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Lakeview, Ashford, Creston or Brookfield ",
            "A": "The median value of the {Brookfield} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Creston}."
        }
    ],
    "VA": []
}