{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {2} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Ashford}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Yorkton}."
        },
        {
            "Q": "Which violin is the first position to the left of the violin Yorkton?",
            "A": "The first position to the left of the violin Yorkton is {Ashford}."
        },
        {
            "Q": "What is the spatial relationship of violin Ashford relative to the violin Yorkton in terms of horizontal (left/right) direction?",
            "A": "violin Ashford is to the {left} of the violin Yorkton."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Yorkton}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Yorkton}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Ashford?",
            "A": "The density distribution pattern of the Ashford shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Ashford in the violin plot?",
            "A": "The median of Ashford is {1817.50} number."
        },
        {
            "Q": "What is the lower quartile (Q1) of Ashford in the violin plot?",
            "A": "The lower quartile (Q1) of Ashford is {1736.50} number."
        },
        {
            "Q": "What is the upper whisker limit of Yorkton in the violin plot?",
            "A": "The upper whisker limit of Yorkton is {3040.00} number."
        },
        {
            "Q": "What is the lowest lower outlier value in Yorkton in the violin plot?",
            "A": "The lowest upper outlier value in Yorkton is {2638.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the violin plot?",
            "A": "The global maximum number value in the violin plot is {3040.00} number."
        },
        {
            "Q": "What is the global minimum number value in the violin plot?",
            "A": "The global minimum number value in the violin plot is {1393.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Yorkton and Ashford?",
            "A": "The Median difference between violin Yorkton and Ashford is {1064.00} number."
        },
        {
            "Q": "What is the toal Q3 value of violin Yorkton and Ashford?",
            "A": "The total Q3 value of violin Yorkton and Yorkton is {4839.75} number."
        },
        {
            "Q": "What is the average Q1 value of violin Ashford and Yorkton?",
            "A": "The average Q1 value of violin Ashford and Yorkton is {2283.25} number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 2349.50 number? Please list the violins and corresponding values.",
            "A": "{Yorkton} has {2881.50} number "
        },
        {
            "Q": "Which violins have median values below 2349.50 number? Please list the violins and corresponding values.",
            "A": "{Ashford} has {1817.50} number "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 2338.14 number?",
            "A": "Violin {Yorkton} has {2890.71} number have their highest density peak exceed 2338.14 number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 2338.14 number?",
            "A": "Violin {Ashford} has {1785.58} number have their highest density peak below 2338.14 number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Ashford or Yorkton ",
            "A": "The median value of the {Yorkton} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Ashford}."
        }
    ],
    "VA": []
}