{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {7} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Zephyr}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Brookfield}."
        },
        {
            "Q": "Which violin is the third position to the left of the violin Brookfield?",
            "A": "The third position to the left of the violin Brookfield is {Quarryville}."
        },
        {
            "Q": "What is the spatial relationship of violin Creston relative to the violin Mapleton in terms of horizontal (left/right) direction?",
            "A": "violin Creston is to the {left} of the violin Mapleton."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Creston}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Creston}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Creston?",
            "A": "The density distribution pattern of the Creston shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Ashford in the violin plot?",
            "A": "The median of Ashford is {1009.00} number."
        },
        {
            "Q": "What is the lower quartile (Q1) of Brookfield in the violin plot?",
            "A": "The lower quartile (Q1) of Brookfield is {1275.50} number."
        },
        {
            "Q": "What is the upper whisker limit of Northgate in the violin plot?",
            "A": "The upper whisker limit of Northgate is {2191.00} number."
        },
        {
            "Q": "What is the largest upper outlier value in Brookfield in the violin plot?",
            "A": "The largest upper outlier value in Brookfield is {2466.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the violin plot?",
            "A": "The global maximum number value in the violin plot is {3184.00} number."
        },
        {
            "Q": "What is the global minimum number value in the violin plot?",
            "A": "The global minimum number value in the violin plot is {309.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Ashford and Brookfield?",
            "A": "The Median difference between violin Ashford and Brookfield is {470.00} number."
        },
        {
            "Q": "What is the toal Q1 value of violin Creston and Northgate?",
            "A": "The total Q1 value of violin Creston and Brookfield is {2112.50} number."
        },
        {
            "Q": "What is the average Q1 value of violin Ashford and Zephyr?",
            "A": "The average Q1 value of violin Ashford and Zephyr is {839.38} number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 1546.50 number? Please list the violins and corresponding values.",
            "A": "{Creston} has {1614.00} number "
        },
        {
            "Q": "Which violins have median values below 1052.75 number? Please list the violins and corresponding values.",
            "A": "{Mapleton} has {994.50} number , {Quarryville} has {807.50} number , {Ashford} has {1009.00} number "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 933.14 number?",
            "A": "Violin {Zephyr} has {946.27} number ,{Creston} has {1532.87} number ,{Brookfield} has {1393.67} number have their highest density peak exceed 933.14 number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 816.29 number?",
            "A": "Violin {Quarryville} has {743.28} number have their highest density peak below 816.29 number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Brookfield or Quarryville ",
            "A": "The median value of the {Brookfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ashford, Brookfield or Mapleton ",
            "A": "The median value of the {Brookfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Creston, Ashford, Quarryville or Zephyr ",
            "A": "The median value of the {Creston} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Mapleton}."
        }
    ],
    "VA": []
}