{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {4} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Brookfield}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Westport}."
        },
        {
            "Q": "Which violin is the second position to the left of the violin Springfield?",
            "A": "The second position to the left of the violin Springfield is {Brookfield}."
        },
        {
            "Q": "What is the spatial relationship of violin Highvale relative to the violin Springfield in terms of horizontal (left/right) direction?",
            "A": "violin Highvale is to the {left} of the violin Springfield."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Highvale}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Springfield}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Springfield?",
            "A": "The density distribution pattern of the Springfield shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Highvale in the violin plot?",
            "A": "The median of Highvale is {1396.50} number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Brookfield in the violin plot?",
            "A": "The upper quartile (Q3) of Brookfield is {812.75} number."
        },
        {
            "Q": "What is the upper whisker limit of Westport in the violin plot?",
            "A": "The upper whisker limit of Westport is {2714.00} number."
        },
        {
            "Q": "What is the largest upper outlier value in Highvale in the violin plot?",
            "A": "The largest upper outlier value in Highvale is {2501.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the violin plot?",
            "A": "The global maximum number value in the violin plot is {2714.00} number."
        },
        {
            "Q": "What is the global minimum number value in the violin plot?",
            "A": "The global minimum number value in the violin plot is {386.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Brookfield and Highvale?",
            "A": "The Median difference between violin Brookfield and Highvale is {711.50} number."
        },
        {
            "Q": "What is the toal Q3 value of violin Springfield and Westport?",
            "A": "The total Q3 value of violin Springfield and Westport is {3374.00} number."
        },
        {
            "Q": "What is the average Median value of violin Brookfield and Highvale?",
            "A": "The average Median value of violin Brookfield and Highvale is {1040.75} number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 965.00 number? Please list the violins and corresponding values.",
            "A": "{Highvale} has {1396.50} number , {Springfield} has {1354.00} number , {Westport} has {1245.00} number "
        },
        {
            "Q": "Which violins have median values below 965.00 number? Please list the violins and corresponding values.",
            "A": "{Brookfield} has {685.00} number "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 737.25 number and the upper quartile (Q3) below 1687.00 number?",
            "A": "Violin {Highvale},{Westport} has the Q1 above 737.25 number and the Q3 below 1687.0 number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 1188.76 number?",
            "A": "Violin {Highvale} has {1325.04} number ,{Springfield} has {1334.87} number have their highest density peak exceed 1188.76 number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 822.26 number?",
            "A": "Violin {Brookfield} has {592.04} number have their highest density peak below 822.26 number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Highvale or Springfield ",
            "A": "The median value of the {Highvale} is larger."
        },
        {
            "Q": "Which is larger, the median value of Highvale, Brookfield or Westport ",
            "A": "The median value of the {Highvale} is larger."
        },
        {
            "Q": "Which is larger, the median value of Brookfield, Westport, Springfield or Highvale ",
            "A": "The median value of the {Highvale} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Westport}."
        }
    ],
    "VA": []
}