{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Glenhaven Academy}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Oakridge College}."
        },
        {
            "Q": "Which violin is the second position to the right of the violin Elmwood Prep?",
            "A": "The second position to the right of the violin Elmwood Prep is {Oakridge College}."
        },
        {
            "Q": "What is the spatial relationship of violin Riverdale High relative to the violin Silverton High in terms of horizontal (left/right) direction?",
            "A": "violin Riverdale High is to the {right} of the violin Silverton High."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Elmwood Prep}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Riverdale High}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Glenhaven Academy?",
            "A": "The density distribution pattern of the Glenhaven Academy shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Oakridge College in the violin plot?",
            "A": "The median of Oakridge College is {80.46} %."
        },
        {
            "Q": "What is the lower quartile (Q1) of Riverdale High in the violin plot?",
            "A": "The lower quartile (Q1) of Riverdale High is {84.42} %."
        },
        {
            "Q": "What is the upper whisker limit of Elmwood Prep in the violin plot?",
            "A": "The upper whisker limit of Elmwood Prep is {93.26} %."
        },
        {
            "Q": "What is the lowest lower outlier value in Glenhaven Academy in the violin plot?",
            "A": "The lowest upper outlier value in Glenhaven Academy is {75.45}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum % value in the violin plot?",
            "A": "The global maximum % value in the violin plot is {108.83} %."
        },
        {
            "Q": "What is the global minimum % value in the violin plot?",
            "A": "The global minimum % value in the violin plot is {51.43} %."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Elmwood Prep and Glenhaven Academy?",
            "A": "The Median difference between violin Elmwood Prep and Glenhaven Academy is {3.95} %."
        },
        {
            "Q": "What is the toal Q3 value of violin Elmwood Prep and Glenhaven Academy?",
            "A": "The total Q3 value of violin Elmwood Prep and Oakridge College is {173.39} %."
        },
        {
            "Q": "What is the average Median value of violin Glenhaven Academy and Silverton High?",
            "A": "The average Median value of violin Glenhaven Academy and Silverton High is {83.24} %."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 86.73 %? Please list the violins and corresponding values.",
            "A": "{Elmwood Prep} has {87.09} % "
        },
        {
            "Q": "Which violins have median values below 83.24 %? Please list the violins and corresponding values.",
            "A": "{Glenhaven Academy} has {83.15} % , {Oakridge College} has {80.46} % "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 80.88 % and the upper quartile (Q3) below 88.06 %?",
            "A": "Violin {Glenhaven Academy} has the Q1 above 80.88 % and the Q3 below 88.06125 %."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 83.01 %?",
            "A": "Violin {Glenhaven Academy} has {83.04} % ,{Elmwood Prep} has {86.89} % ,{Riverdale High} has {85.86} % have their highest density peak exceed 83.01 %."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 81.27 %?",
            "A": "Violin {Oakridge College} has {79.57} % have their highest density peak below 81.27 %."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Oakridge College or Elmwood Prep ",
            "A": "The median value of the {Elmwood Prep} is larger."
        },
        {
            "Q": "Which is larger, the median value of Glenhaven Academy, Riverdale High or Oakridge College ",
            "A": "The median value of the {Riverdale High} is larger."
        },
        {
            "Q": "Which is larger, the median value of Glenhaven Academy, Silverton High, Riverdale High or Elmwood Prep ",
            "A": "The median value of the {Elmwood Prep} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Silverton High}."
        }
    ],
    "VA": []
}