{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {4} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Redwood Prep}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Maplewood School}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Fairview School?",
            "A": "The first position to the right of the violin Fairview School is {Westport Academy}."
        },
        {
            "Q": "What is the spatial relationship of violin Westport Academy relative to the violin Fairview School in terms of horizontal (left/right) direction?",
            "A": "violin Westport Academy is to the {right} of the violin Fairview School."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Redwood Prep}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Redwood Prep}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Redwood Prep?",
            "A": "The density distribution pattern of the Redwood Prep shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Fairview School in the violin plot?",
            "A": "The median of Fairview School is {82.26} %."
        },
        {
            "Q": "What is the lower quartile (Q1) of Westport Academy in the violin plot?",
            "A": "The lower quartile (Q1) of Westport Academy is {77.77} %."
        },
        {
            "Q": "What is the upper whisker limit of Maplewood School in the violin plot?",
            "A": "The upper whisker limit of Maplewood School is {89.06} %."
        },
        {
            "Q": "What is the largest upper outlier value in Maplewood School in the violin plot?",
            "A": "The largest upper outlier value in Maplewood School is {90.20}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum % value in the violin plot?",
            "A": "The global maximum % value in the violin plot is {92.42} %."
        },
        {
            "Q": "What is the global minimum % value in the violin plot?",
            "A": "The global minimum % value in the violin plot is {67.22} %."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Redwood Prep and Fairview School?",
            "A": "The Q1 difference between violin Redwood Prep and Fairview School is {1.98} %."
        },
        {
            "Q": "What is the toal Q3 value of violin Redwood Prep and Fairview School?",
            "A": "The total Q3 value of violin Redwood Prep and Maplewood School is {170.28} %."
        },
        {
            "Q": "What is the average Q1 value of violin Fairview School and Redwood Prep?",
            "A": "The average Q1 value of violin Fairview School and Redwood Prep is {80.65} %."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 82.62 %? Please list the violins and corresponding values.",
            "A": "{Redwood Prep} has {83.72} % , {Maplewood School} has {82.97} % "
        },
        {
            "Q": "Which violins have median values below 81.23 %? Please list the violins and corresponding values.",
            "A": "{Westport Academy} has {80.20} % "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 78.72 % and the upper quartile (Q3) below 85.27 %?",
            "A": "Violin {Fairview School},{Maplewood School} has the Q1 above 78.72 % and the Q3 below 85.26625 %."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 80.73 %?",
            "A": "Violin {Redwood Prep} has {83.21} % ,{Fairview School} has {82.44} % ,{Maplewood School} has {82.59} % have their highest density peak exceed 80.73 %."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 80.73 %?",
            "A": "Violin {Westport Academy} has {79.03} % have their highest density peak below 80.73 %."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Maplewood School or Fairview School ",
            "A": "The median value of the {Maplewood School} is larger."
        },
        {
            "Q": "Which is larger, the median value of Fairview School, Maplewood School or Redwood Prep ",
            "A": "The median value of the {Redwood Prep} is larger."
        },
        {
            "Q": "Which is larger, the median value of Westport Academy, Redwood Prep, Fairview School or Maplewood School ",
            "A": "The median value of the {Redwood Prep} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Westport Academy}."
        }
    ],
    "VA": []
}