{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Highvale}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Ironwood}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Yorkton?",
            "A": "The first position to the right of the violin Yorkton is {Ironwood}."
        },
        {
            "Q": "What is the spatial relationship of violin Highvale relative to the violin Ironwood in terms of horizontal (left/right) direction?",
            "A": "violin Highvale is to the {left} of the violin Ironwood."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Ironwood}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Ironwood}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Yorkton?",
            "A": "The density distribution pattern of the Yorkton shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Highvale in the violin plot?",
            "A": "The median of Highvale is {2573.50} MWh."
        },
        {
            "Q": "What is the upper quartile (Q3) of Highvale in the violin plot?",
            "A": "The upper quartile (Q3) of Highvale is {2755.75} MWh."
        },
        {
            "Q": "What is the upper whisker limit of Highvale in the violin plot?",
            "A": "The upper whisker limit of Highvale is {3113.00} MWh."
        },
        {
            "Q": "What is the lowest lower outlier value in Ironwood in the violin plot?",
            "A": "The lowest upper outlier value in Ironwood is {3568.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the violin plot?",
            "A": "The global maximum MWh value in the violin plot is {6254.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the violin plot?",
            "A": "The global minimum MWh value in the violin plot is {1871.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Highvale and Yorkton?",
            "A": "The Q3 difference between violin Highvale and Yorkton is {1405.75} MWh."
        },
        {
            "Q": "What is the toal Q3 value of violin Yorkton and Highvale?",
            "A": "The total Q3 value of violin Yorkton and Ironwood is {6917.25} MWh."
        },
        {
            "Q": "What is the average Median value of violin Yorkton and Ironwood?",
            "A": "The average Median value of violin Yorkton and Ironwood is {4572.25} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 4572.25 MWh? Please list the violins and corresponding values.",
            "A": "{Ironwood} has {5172.50} MWh "
        },
        {
            "Q": "Which violins have median values below 4572.25 MWh? Please list the violins and corresponding values.",
            "A": "{Highvale} has {2573.50} MWh , {Yorkton} has {3972.00} MWh "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 3053.38 MWh and the upper quartile (Q3) below 4851.38 MWh?",
            "A": "Violin {Yorkton} has the Q1 above 3053.38 MWh and the Q3 below 4851.375 MWh."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 3276.57 MWh?",
            "A": "Violin {Yorkton} has {3874.03} MWh ,{Ironwood} has {5189.28} MWh have their highest density peak exceed 3276.57 MWh."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 4531.65 MWh?",
            "A": "Violin {Highvale} has {2679.11} MWh ,{Yorkton} has {3874.03} MWh have their highest density peak below 4531.65 MWh."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Highvale or Yorkton ",
            "A": "The median value of the {Yorkton} is larger."
        },
        {
            "Q": "Which is larger, the median value of Yorkton, Highvale or Ironwood ",
            "A": "The median value of the {Ironwood} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Ironwood}."
        }
    ],
    "VA": []
}