{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Quarryville}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Ironwood}."
        },
        {
            "Q": "Which violin is the third position to the left of the violin Ironwood?",
            "A": "The third position to the left of the violin Ironwood is {Creston}."
        },
        {
            "Q": "What is the spatial relationship of violin Springfield relative to the violin Ironwood in terms of horizontal (left/right) direction?",
            "A": "violin Springfield is to the {left} of the violin Ironwood."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Elmhurst}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Elmhurst}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Elmhurst?",
            "A": "The density distribution pattern of the Elmhurst shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Ironwood in the violin plot?",
            "A": "The median of Ironwood is {3048.00} MWh."
        },
        {
            "Q": "What is the lower quartile (Q1) of Springfield in the violin plot?",
            "A": "The lower quartile (Q1) of Springfield is {2715.50} MWh."
        },
        {
            "Q": "What is the upper whisker limit of Creston in the violin plot?",
            "A": "The upper whisker limit of Creston is {3576.00} MWh."
        },
        {
            "Q": "What is the lowest lower outlier value in Quarryville in the violin plot?",
            "A": "The lowest upper outlier value in Quarryville is {1185.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the violin plot?",
            "A": "The global maximum MWh value in the violin plot is {6148.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the violin plot?",
            "A": "The global minimum MWh value in the violin plot is {1185.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Springfield and Creston?",
            "A": "The Median difference between violin Springfield and Creston is {2.50} MWh."
        },
        {
            "Q": "What is the toal Q3 value of violin Ironwood and Springfield?",
            "A": "The total Q3 value of violin Ironwood and Ironwood is {6365.50} MWh."
        },
        {
            "Q": "What is the average Q3 value of violin Ironwood and Creston?",
            "A": "The average Q3 value of violin Ironwood and Creston is {3168.12} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 2966.75 MWh? Please list the violins and corresponding values.",
            "A": "{Elmhurst} has {5162.50} MWh , {Ironwood} has {3048.00} MWh "
        },
        {
            "Q": "Which violins have median values below 2548.00 MWh? Please list the violins and corresponding values.",
            "A": "{Quarryville} has {2213.00} MWh "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 2691.62 MWh and the upper quartile (Q3) below 3182.75 MWh?",
            "A": "Violin {Springfield} has the Q1 above 2691.62 MWh and the Q3 below 3182.75 MWh."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 2849.77 MWh?",
            "A": "Violin {Creston} has {2873.14} MWh ,{Elmhurst} has {5139.74} MWh ,{Ironwood} has {3094.30} MWh have their highest density peak exceed 2849.77 MWh."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 2983.72 MWh?",
            "A": "Violin {Quarryville} has {2246.14} MWh ,{Creston} has {2873.14} MWh ,{Springfield} has {2826.39} MWh have their highest density peak below 2983.72 MWh."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Ironwood or Springfield ",
            "A": "The median value of the {Ironwood} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ironwood, Elmhurst or Creston ",
            "A": "The median value of the {Elmhurst} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ironwood, Elmhurst, Quarryville or Springfield ",
            "A": "The median value of the {Elmhurst} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Elmhurst}."
        }
    ],
    "VA": []
}