{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Oakridge}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Northgate}."
        },
        {
            "Q": "Which violin is the second position to the right of the violin Highvale?",
            "A": "The second position to the right of the violin Highvale is {Northgate}."
        },
        {
            "Q": "What is the spatial relationship of violin Dunvale relative to the violin Oakridge in terms of horizontal (left/right) direction?",
            "A": "violin Dunvale is to the {right} of the violin Oakridge."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Northgate}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Northgate}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Northgate?",
            "A": "The density distribution pattern of the Northgate shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Highvale in the violin plot?",
            "A": "The median of Highvale is {3397.50} MWh."
        },
        {
            "Q": "What is the lower quartile (Q1) of Highvale in the violin plot?",
            "A": "The lower quartile (Q1) of Highvale is {3196.25} MWh."
        },
        {
            "Q": "What is the upper whisker limit of Northgate in the violin plot?",
            "A": "The upper whisker limit of Northgate is {6142.00} MWh."
        },
        {
            "Q": "What is the lowest lower outlier value in Oakridge in the violin plot?",
            "A": "The lowest upper outlier value in Oakridge is {1565.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the violin plot?",
            "A": "The global maximum MWh value in the violin plot is {6142.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the violin plot?",
            "A": "The global minimum MWh value in the violin plot is {1565.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Westport and Oakridge?",
            "A": "The Q1 difference between violin Westport and Oakridge is {746.00} MWh."
        },
        {
            "Q": "What is the toal Q1 value of violin Northgate and Dunvale?",
            "A": "The total Q1 value of violin Northgate and Northgate is {9415.00} MWh."
        },
        {
            "Q": "What is the average Q1 value of violin Oakridge and Westport?",
            "A": "The average Q1 value of violin Oakridge and Westport is {2597.25} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 4901.50 MWh? Please list the violins and corresponding values.",
            "A": "{Northgate} has {5181.00} MWh "
        },
        {
            "Q": "Which violins have median values below 4009.75 MWh? Please list the violins and corresponding values.",
            "A": "{Oakridge} has {2381.50} MWh , {Highvale} has {3397.50} MWh , {Westport} has {3158.00} MWh "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 3083.25 MWh and the upper quartile (Q3) below 4234.88 MWh?",
            "A": "Violin {Highvale} has the Q1 above 3083.25 MWh and the Q3 below 4234.875 MWh."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 3951.68 MWh?",
            "A": "Violin {Dunvale} has {4603.89} MWh ,{Northgate} has {5101.22} MWh have their highest density peak exceed 3951.68 MWh."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 3951.68 MWh?",
            "A": "Violin {Oakridge} has {2336.47} MWh ,{Highvale} has {3299.47} MWh ,{Westport} has {3033.09} MWh have their highest density peak below 3951.68 MWh."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Oakridge or Westport ",
            "A": "The median value of the {Westport} is larger."
        },
        {
            "Q": "Which is larger, the median value of Oakridge, Dunvale or Highvale ",
            "A": "The median value of the {Dunvale} is larger."
        },
        {
            "Q": "Which is larger, the median value of Oakridge, Northgate, Dunvale or Westport ",
            "A": "The median value of the {Northgate} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Northgate}."
        }
    ],
    "VA": []
}