{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {4} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Fairmont}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Yorkton}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Lakeview?",
            "A": "The first position to the right of the violin Lakeview is {Yorkton}."
        },
        {
            "Q": "What is the spatial relationship of violin Quarryville relative to the violin Lakeview in terms of horizontal (left/right) direction?",
            "A": "violin Quarryville is to the {left} of the violin Lakeview."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Yorkton}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Yorkton}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Lakeview?",
            "A": "The density distribution pattern of the Lakeview shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Lakeview in the violin plot?",
            "A": "The median of Lakeview is {3638.50} MWh."
        },
        {
            "Q": "What is the upper quartile (Q3) of Lakeview in the violin plot?",
            "A": "The upper quartile (Q3) of Lakeview is {3792.75} MWh."
        },
        {
            "Q": "What is the upper whisker limit of Yorkton in the violin plot?",
            "A": "The upper whisker limit of Yorkton is {6229.00} MWh."
        },
        {
            "Q": "What is the largest upper outlier value in Fairmont in the violin plot?",
            "A": "The largest upper outlier value in Fairmont is {3072.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the violin plot?",
            "A": "The global maximum MWh value in the violin plot is {6229.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the violin plot?",
            "A": "The global minimum MWh value in the violin plot is {1249.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Yorkton and Lakeview?",
            "A": "The Q1 difference between violin Yorkton and Lakeview is {2304.00} MWh."
        },
        {
            "Q": "What is the toal Q1 value of violin Yorkton and Lakeview?",
            "A": "The total Q1 value of violin Yorkton and Yorkton is {9220.00} MWh."
        },
        {
            "Q": "What is the average Q1 value of violin Fairmont and Yorkton?",
            "A": "The average Q1 value of violin Fairmont and Yorkton is {3926.75} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 2971.00 MWh? Please list the violins and corresponding values.",
            "A": "{Lakeview} has {3638.50} MWh , {Yorkton} has {5882.00} MWh "
        },
        {
            "Q": "Which violins have median values below 4760.25 MWh? Please list the violins and corresponding values.",
            "A": "{Fairmont} has {2303.50} MWh , {Quarryville} has {2276.50} MWh , {Lakeview} has {3638.50} MWh "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 2100.25 MWh and the upper quartile (Q3) below 4886.62 MWh?",
            "A": "Violin {Quarryville},{Lakeview} has the Q1 above 2100.25 MWh and the Q3 below 4886.625 MWh."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 2329.48 MWh?",
            "A": "Violin {Fairmont} has {2340.25} MWh ,{Lakeview} has {3671.92} MWh ,{Yorkton} has {5902.55} MWh have their highest density peak exceed 2329.48 MWh."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 4787.23 MWh?",
            "A": "Violin {Fairmont} has {2340.25} MWh ,{Quarryville} has {2318.71} MWh ,{Lakeview} has {3671.92} MWh have their highest density peak below 4787.23 MWh."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Lakeview or Fairmont ",
            "A": "The median value of the {Lakeview} is larger."
        },
        {
            "Q": "Which is larger, the median value of Quarryville, Lakeview or Fairmont ",
            "A": "The median value of the {Lakeview} is larger."
        },
        {
            "Q": "Which is larger, the median value of Yorkton, Quarryville, Fairmont or Lakeview ",
            "A": "The median value of the {Yorkton} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Fairmont}."
        }
    ],
    "VA": []
}