{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {4} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Steak Houses}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Coffee Shops}."
        },
        {
            "Q": "Which violin is the second position to the left of the violin Vegetarian Restaurants?",
            "A": "The second position to the left of the violin Vegetarian Restaurants is {Steak Houses}."
        },
        {
            "Q": "What is the spatial relationship of violin Steak Houses relative to the violin Buffet Restaurants in terms of horizontal (left/right) direction?",
            "A": "violin Steak Houses is to the {left} of the violin Buffet Restaurants."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Steak Houses}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Steak Houses}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Coffee Shops?",
            "A": "The density distribution pattern of the Coffee Shops shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Steak Houses in the violin plot?",
            "A": "The median of Steak Houses is {714.00} million USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Vegetarian Restaurants in the violin plot?",
            "A": "The upper quartile (Q3) of Vegetarian Restaurants is {819.25} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Buffet Restaurants in the violin plot?",
            "A": "The upper whisker limit of Buffet Restaurants is {1209.00} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Buffet Restaurants in the violin plot?",
            "A": "The largest upper outlier value in Buffet Restaurants is {1377.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {1746.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {132.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Coffee Shops and Buffet Restaurants?",
            "A": "The Q1 difference between violin Coffee Shops and Buffet Restaurants is {14.75} million USD."
        },
        {
            "Q": "What is the toal Q1 value of violin Steak Houses and Vegetarian Restaurants?",
            "A": "The total Q1 value of violin Steak Houses and Coffee Shops is {915.75} million USD."
        },
        {
            "Q": "What is the average Q1 value of violin Vegetarian Restaurants and Steak Houses?",
            "A": "The average Q1 value of violin Vegetarian Restaurants and Steak Houses is {457.88} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 664.50 million USD? Please list the violins and corresponding values.",
            "A": "{Steak Houses} has {714.00} million USD "
        },
        {
            "Q": "Which violins have median values below 664.50 million USD? Please list the violins and corresponding values.",
            "A": "{Buffet Restaurants} has {475.00} million USD , {Vegetarian Restaurants} has {615.00} million USD , {Coffee Shops} has {460.00} million USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 326.12 million USD and the upper quartile (Q3) below 871.25 million USD?",
            "A": "Violin {Vegetarian Restaurants},{Coffee Shops} has the Q1 above 326.12 million USD and the Q3 below 871.25 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 636.61 million USD?",
            "A": "Violin {Steak Houses} has {721.03} million USD have their highest density peak exceed 636.61 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 493.69 million USD?",
            "A": "Violin {Buffet Restaurants} has {355.08} million USD ,{Coffee Shops} has {435.19} million USD have their highest density peak below 493.69 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Steak Houses or Vegetarian Restaurants ",
            "A": "The median value of the {Steak Houses} is larger."
        },
        {
            "Q": "Which is larger, the median value of Steak Houses, Buffet Restaurants or Coffee Shops ",
            "A": "The median value of the {Steak Houses} is larger."
        },
        {
            "Q": "Which is larger, the median value of Coffee Shops, Buffet Restaurants, Steak Houses or Vegetarian Restaurants ",
            "A": "The median value of the {Steak Houses} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Steak Houses}."
        }
    ],
    "VA": []
}