{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {6} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Sorghum}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Cocoa}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Wheat?",
            "A": "The first position to the right of the violin Wheat is {Rye}."
        },
        {
            "Q": "What is the spatial relationship of violin Sorghum relative to the violin Wheat in terms of horizontal (left/right) direction?",
            "A": "violin Sorghum is to the {left} of the violin Wheat."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Rye}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Rye}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Oats?",
            "A": "The density distribution pattern of the Oats shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Sorghum in the violin plot?",
            "A": "The median of Sorghum is {6651.50} kilograms per hectare."
        },
        {
            "Q": "What is the lower quartile (Q1) of Sorghum in the violin plot?",
            "A": "The lower quartile (Q1) of Sorghum is {6309.25} kilograms per hectare."
        },
        {
            "Q": "What is the upper whisker limit of Rye in the violin plot?",
            "A": "The upper whisker limit of Rye is {8052.00} kilograms per hectare."
        },
        {
            "Q": "What is the largest upper outlier value in Sorghum in the violin plot?",
            "A": "The largest upper outlier value in Sorghum is {8324.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum kilograms per hectare value in the violin plot?",
            "A": "The global maximum kilograms per hectare value in the violin plot is {8324.00} kilograms per hectare."
        },
        {
            "Q": "What is the global minimum kilograms per hectare value in the violin plot?",
            "A": "The global minimum kilograms per hectare value in the violin plot is {2046.00} kilograms per hectare."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Rye and Cocoa?",
            "A": "The Q1 difference between violin Rye and Cocoa is {2697.25} kilograms per hectare."
        },
        {
            "Q": "What is the toal Q1 value of violin Rye and Wheat?",
            "A": "The total Q1 value of violin Rye and Cocoa is {11683.25} kilograms per hectare."
        },
        {
            "Q": "What is the average Q1 value of violin Oats and Wheat?",
            "A": "The average Q1 value of violin Oats and Wheat is {5109.12} kilograms per hectare."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 5559.50 kilograms per hectare? Please list the violins and corresponding values.",
            "A": "{Sorghum} has {6651.50} kilograms per hectare , {Rye} has {6982.50} kilograms per hectare , {Oats} has {5700.50} kilograms per hectare "
        },
        {
            "Q": "Which violins have median values below 4786.25 kilograms per hectare? Please list the violins and corresponding values.",
            "A": "{Cocoa} has {4320.00} kilograms per hectare "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 5673.03 kilograms per hectare?",
            "A": "Violin {Sorghum} has {6651.57} kilograms per hectare ,{Rye} has {6892.35} kilograms per hectare ,{Oats} has {5897.16} kilograms per hectare have their highest density peak exceed 5673.03 kilograms per hectare."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 5673.03 kilograms per hectare?",
            "A": "Violin {Coffee} has {5448.91} kilograms per hectare ,{Wheat} has {5209.79} kilograms per hectare ,{Cocoa} has {4369.32} kilograms per hectare have their highest density peak below 5673.03 kilograms per hectare."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Rye or Coffee ",
            "A": "The median value of the {Rye} is larger."
        },
        {
            "Q": "Which is larger, the median value of Wheat, Coffee or Cocoa ",
            "A": "The median value of the {Coffee} is larger."
        },
        {
            "Q": "Which is larger, the median value of Coffee, Oats, Sorghum or Rye ",
            "A": "The median value of the {Rye} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Cocoa}."
        }
    ],
    "VA": []
}