{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Sushi Restaurants}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Steak Houses}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Food Courts?",
            "A": "The first position to the right of the violin Food Courts is {Steak Houses}."
        },
        {
            "Q": "What is the spatial relationship of violin Steak Houses relative to the violin Sushi Restaurants in terms of horizontal (left/right) direction?",
            "A": "violin Steak Houses is to the {right} of the violin Sushi Restaurants."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Steak Houses}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Food Courts}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Food Courts?",
            "A": "The density distribution pattern of the Food Courts shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Sushi Restaurants in the violin plot?",
            "A": "The median of Sushi Restaurants is {512.00} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Steak Houses in the violin plot?",
            "A": "The lower quartile (Q1) of Steak Houses is {435.50} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Food Courts in the violin plot?",
            "A": "The upper whisker limit of Food Courts is {1017.00} million USD."
        },
        {
            "Q": "What is the lowest lower outlier value in Steak Houses in the violin plot?",
            "A": "The lowest upper outlier value in Steak Houses is {46.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the violin plot?",
            "A": "The global maximum million USD value in the violin plot is {1038.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the violin plot?",
            "A": "The global minimum million USD value in the violin plot is {2.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Steak Houses and Sushi Restaurants?",
            "A": "The Q1 difference between violin Steak Houses and Sushi Restaurants is {114.00} million USD."
        },
        {
            "Q": "What is the toal Median value of violin Sushi Restaurants and Steak Houses?",
            "A": "The total Median value of violin Sushi Restaurants and Steak Houses is {1073.00} million USD."
        },
        {
            "Q": "What is the average Q1 value of violin Steak Houses and Sushi Restaurants?",
            "A": "The average Q1 value of violin Steak Houses and Sushi Restaurants is {378.50} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 529.50 million USD? Please list the violins and corresponding values.",
            "A": "{Food Courts} has {547.00} million USD , {Steak Houses} has {561.00} million USD "
        },
        {
            "Q": "Which violins have median values below 554.00 million USD? Please list the violins and corresponding values.",
            "A": "{Sushi Restaurants} has {512.00} million USD , {Food Courts} has {547.00} million USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 378.50 million USD and the upper quartile (Q3) below 699.75 million USD?",
            "A": "Violin {Steak Houses} has the Q1 above 378.50 million USD and the Q3 below 699.75 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 535.62 million USD?",
            "A": "Violin {Sushi Restaurants} has {553.23} million USD ,{Steak Houses} has {565.34} million USD have their highest density peak exceed 535.62 million USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 559.28 million USD?",
            "A": "Violin {Sushi Restaurants} has {553.23} million USD ,{Food Courts} has {518.02} million USD have their highest density peak below 559.28 million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Sushi Restaurants or Food Courts ",
            "A": "The median value of the {Food Courts} is larger."
        },
        {
            "Q": "Which is larger, the median value of Sushi Restaurants, Food Courts or Steak Houses ",
            "A": "The median value of the {Steak Houses} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Sushi Restaurants}."
        }
    ],
    "VA": []
}