{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {7} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Rosewood}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Dunvale}."
        },
        {
            "Q": "Which violin is the first position to the left of the violin Dunvale?",
            "A": "The first position to the left of the violin Dunvale is {Mapleton}."
        },
        {
            "Q": "What is the spatial relationship of violin Rosewood relative to the violin Dunvale in terms of horizontal (left/right) direction?",
            "A": "violin Rosewood is to the {left} of the violin Dunvale."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Creston}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Oakridge}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Springfield?",
            "A": "The density distribution pattern of the Springfield shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Dunvale in the violin plot?",
            "A": "The median of Dunvale is {804.50} Number."
        },
        {
            "Q": "What is the lower quartile (Q1) of Mapleton in the violin plot?",
            "A": "The lower quartile (Q1) of Mapleton is {974.50} Number."
        },
        {
            "Q": "What is the upper whisker limit of Westport in the violin plot?",
            "A": "The upper whisker limit of Westport is {1721.00} Number."
        },
        {
            "Q": "What is the lowest lower outlier value in Springfield in the violin plot?",
            "A": "The lowest upper outlier value in Springfield is {230.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number value in the violin plot?",
            "A": "The global maximum Number value in the violin plot is {1915.00} Number."
        },
        {
            "Q": "What is the global minimum Number value in the violin plot?",
            "A": "The global minimum Number value in the violin plot is {228.00} Number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Rosewood and Dunvale?",
            "A": "The Q1 difference between violin Rosewood and Dunvale is {13.75} Number."
        },
        {
            "Q": "What is the toal Q1 value of violin Rosewood and Oakridge?",
            "A": "The total Q1 value of violin Rosewood and Dunvale is {1486.00} Number."
        },
        {
            "Q": "What is the average Median value of violin Creston and Dunvale?",
            "A": "The average Median value of violin Creston and Dunvale is {985.50} Number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 1159.75 Number? Please list the violins and corresponding values.",
            "A": "{Creston} has {1166.50} Number "
        },
        {
            "Q": "Which violins have median values below 847.00 Number? Please list the violins and corresponding values.",
            "A": "{Dunvale} has {804.50} Number "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 916.50 Number and the upper quartile (Q3) below 1229.25 Number?",
            "A": "Violin {Mapleton} has the Q1 above 916.50 Number and the Q3 below 1229.25 Number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 1082.38 Number?",
            "A": "Violin {Westport} has {1162.35} Number ,{Creston} has {1164.10} Number ,{Mapleton} has {1126.47} Number have their highest density peak exceed 1082.38 Number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 926.16 Number?",
            "A": "Violin {Oakridge} has {911.46} Number ,{Dunvale} has {736.26} Number have their highest density peak below 926.16 Number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Dunvale or Rosewood ",
            "A": "The median value of the {Rosewood} is larger."
        },
        {
            "Q": "Which is larger, the median value of Dunvale, Creston or Mapleton ",
            "A": "The median value of the {Creston} is larger."
        },
        {
            "Q": "Which is larger, the median value of Oakridge, Westport, Mapleton or Dunvale ",
            "A": "The median value of the {Westport} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Oakridge}."
        }
    ],
    "VA": []
}