{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {7} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Oakridge}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Ashford}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Westport?",
            "A": "The first position to the right of the violin Westport is {Ashford}."
        },
        {
            "Q": "What is the spatial relationship of violin Glenhaven relative to the violin Oakridge in terms of horizontal (left/right) direction?",
            "A": "violin Glenhaven is to the {right} of the violin Oakridge."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Westport}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Westport}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Oakridge?",
            "A": "The density distribution pattern of the Oakridge shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Ashford in the violin plot?",
            "A": "The median of Ashford is {1190.50} Number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Dunvale in the violin plot?",
            "A": "The upper quartile (Q3) of Dunvale is {1272.50} Number."
        },
        {
            "Q": "What is the upper whisker limit of Fairmont in the violin plot?",
            "A": "The upper whisker limit of Fairmont is {1738.00} Number."
        },
        {
            "Q": "What is the largest upper outlier value in Ashford in the violin plot?",
            "A": "The largest upper outlier value in Ashford is {2120.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number value in the violin plot?",
            "A": "The global maximum Number value in the violin plot is {2162.00} Number."
        },
        {
            "Q": "What is the global minimum Number value in the violin plot?",
            "A": "The global minimum Number value in the violin plot is {782.00} Number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Dunvale and Oakridge?",
            "A": "The Median difference between violin Dunvale and Oakridge is {72.00} Number."
        },
        {
            "Q": "What is the toal Q3 value of violin Westport and Oakridge?",
            "A": "The total Q3 value of violin Westport and Ashford is {2666.75} Number."
        },
        {
            "Q": "What is the average Q3 value of violin Fairmont and Dunvale?",
            "A": "The average Q3 value of violin Fairmont and Dunvale is {1306.62} Number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 1194.25 Number? Please list the violins and corresponding values.",
            "A": "{Westport} has {1198.00} Number "
        },
        {
            "Q": "Which violins have median values below 1070.75 Number? Please list the violins and corresponding values.",
            "A": "{Creston} has {1067.00} Number "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 1104.19 Number?",
            "A": "Violin {Fairmont} has {1116.92} Number ,{Westport} has {1156.69} Number ,{Ashford} has {1125.26} Number have their highest density peak exceed 1104.19 Number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 1047.87 Number?",
            "A": "Violin {Creston} has {985.78} Number ,{Glenhaven} has {997.81} Number ,{Dunvale} has {1004.29} Number have their highest density peak below 1047.87 Number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Dunvale or Westport ",
            "A": "The median value of the {Westport} is larger."
        },
        {
            "Q": "Which is larger, the median value of Westport, Ashford or Oakridge ",
            "A": "The median value of the {Westport} is larger."
        },
        {
            "Q": "Which is larger, the median value of Dunvale, Fairmont, Westport or Creston ",
            "A": "The median value of the {Westport} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Westport}."
        }
    ],
    "VA": []
}