{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {7} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Ironwood}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Oakridge}."
        },
        {
            "Q": "Which violin is the first position to the left of the violin Glenhaven?",
            "A": "The first position to the left of the violin Glenhaven is {Ironwood}."
        },
        {
            "Q": "What is the spatial relationship of violin Ironwood relative to the violin Highvale in terms of horizontal (left/right) direction?",
            "A": "violin Ironwood is to the {left} of the violin Highvale."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Highvale}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Highvale}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Ironwood?",
            "A": "The density distribution pattern of the Ironwood shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Glenhaven in the violin plot?",
            "A": "The median of Glenhaven is {1199.50} Number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Highvale in the violin plot?",
            "A": "The upper quartile (Q3) of Highvale is {1528.00} Number."
        },
        {
            "Q": "What is the upper whisker limit of Elmhurst in the violin plot?",
            "A": "The upper whisker limit of Elmhurst is {1781.00} Number."
        },
        {
            "Q": "What is the largest upper outlier value in Glenhaven in the violin plot?",
            "A": "The largest upper outlier value in Glenhaven is {2293.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number value in the violin plot?",
            "A": "The global maximum Number value in the violin plot is {2293.00} Number."
        },
        {
            "Q": "What is the global minimum Number value in the violin plot?",
            "A": "The global minimum Number value in the violin plot is {746.00} Number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Glenhaven and Oakridge?",
            "A": "The Median difference between violin Glenhaven and Oakridge is {40.50} Number."
        },
        {
            "Q": "What is the toal Median value of violin Highvale and Ironwood?",
            "A": "The total Median value of violin Highvale and Oakridge is {2429.00} Number."
        },
        {
            "Q": "What is the average Median value of violin Highvale and Zephyr?",
            "A": "The average Median value of violin Highvale and Zephyr is {1193.00} Number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 1233.25 Number? Please list the violins and corresponding values.",
            "A": "{Highvale} has {1350.50} Number , {Oakridge} has {1240.00} Number "
        },
        {
            "Q": "Which violins have median values below 1139.00 Number? Please list the violins and corresponding values.",
            "A": "{Ironwood} has {1078.50} Number , {Elmhurst} has {1075.00} Number , {Zephyr} has {1035.50} Number "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 1192.30 Number?",
            "A": "Violin {Highvale} has {1307.95} Number ,{Oakridge} has {1235.21} Number have their highest density peak exceed 1192.30 Number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 977.66 Number?",
            "A": "Violin {Ironwood} has {973.88} Number ,{Zephyr} has {919.93} Number have their highest density peak below 977.66 Number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Ironwood or Highvale ",
            "A": "The median value of the {Highvale} is larger."
        },
        {
            "Q": "Which is larger, the median value of Glenhaven, Highvale or Oakridge ",
            "A": "The median value of the {Highvale} is larger."
        },
        {
            "Q": "Which is larger, the median value of Highvale, Zephyr, Ironwood or Ashford ",
            "A": "The median value of the {Highvale} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Glenhaven}."
        }
    ],
    "VA": []
}