{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {4} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Ashford}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Lakeview}."
        },
        {
            "Q": "Which violin is the third position to the left of the violin Lakeview?",
            "A": "The third position to the left of the violin Lakeview is {Ashford}."
        },
        {
            "Q": "What is the spatial relationship of violin Ashford relative to the violin Highvale in terms of horizontal (left/right) direction?",
            "A": "violin Ashford is to the {left} of the violin Highvale."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Northgate}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Ashford}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Ashford?",
            "A": "The density distribution pattern of the Ashford shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Lakeview in the violin plot?",
            "A": "The median of Lakeview is {1187.00} Number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Highvale in the violin plot?",
            "A": "The upper quartile (Q3) of Highvale is {1294.50} Number."
        },
        {
            "Q": "What is the upper whisker limit of Highvale in the violin plot?",
            "A": "The upper whisker limit of Highvale is {1730.00} Number."
        },
        {
            "Q": "What is the largest upper outlier value in Northgate in the violin plot?",
            "A": "The largest upper outlier value in Northgate is {1888.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number value in the violin plot?",
            "A": "The global maximum Number value in the violin plot is {2012.00} Number."
        },
        {
            "Q": "What is the global minimum Number value in the violin plot?",
            "A": "The global minimum Number value in the violin plot is {786.00} Number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Highvale and Lakeview?",
            "A": "The Q3 difference between violin Highvale and Lakeview is {40.00} Number."
        },
        {
            "Q": "What is the toal Q1 value of violin Northgate and Ashford?",
            "A": "The total Q1 value of violin Northgate and Lakeview is {2065.25} Number."
        },
        {
            "Q": "What is the average Q3 value of violin Northgate and Ashford?",
            "A": "The average Q3 value of violin Northgate and Ashford is {1391.88} Number."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 1140.25 Number? Please list the violins and corresponding values.",
            "A": "{Ashford} has {1155.50} Number , {Northgate} has {1244.50} Number , {Lakeview} has {1187.00} Number "
        },
        {
            "Q": "Which violins have median values below 1140.25 Number? Please list the violins and corresponding values.",
            "A": "{Highvale} has {1125.00} Number "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 982.25 Number and the upper quartile (Q3) below 1391.88 Number?",
            "A": "Violin {Northgate},{Highvale},{Lakeview} has the Q1 above 982.25 Number and the Q3 below 1391.875 Number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 1009.48 Number?",
            "A": "Violin {Ashford} has {1014.26} Number ,{Northgate} has {1264.73} Number ,{Lakeview} has {1139.85} Number have their highest density peak exceed 1009.48 Number."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 1009.48 Number?",
            "A": "Violin {Highvale} has {1004.69} Number have their highest density peak below 1009.48 Number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Northgate or Ashford ",
            "A": "The median value of the {Northgate} is larger."
        },
        {
            "Q": "Which is larger, the median value of Northgate, Highvale or Ashford ",
            "A": "The median value of the {Northgate} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ashford, Highvale, Northgate or Lakeview ",
            "A": "The median value of the {Northgate} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Ashford}."
        }
    ],
    "VA": []
}