{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Pinehaven}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Creston}."
        },
        {
            "Q": "Which violin is the second position to the left of the violin Creston?",
            "A": "The second position to the left of the violin Creston is {Pinehaven}."
        },
        {
            "Q": "What is the spatial relationship of violin Creston relative to the violin Pinehaven in terms of horizontal (left/right) direction?",
            "A": "violin Creston is to the {right} of the violin Pinehaven."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Quarryville}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Creston}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Pinehaven?",
            "A": "The density distribution pattern of the Pinehaven shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Creston in the violin plot?",
            "A": "The median of Creston is {50381.00} USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Creston in the violin plot?",
            "A": "The lower quartile (Q1) of Creston is {40345.00} USD."
        },
        {
            "Q": "What is the upper whisker limit of Creston in the violin plot?",
            "A": "The upper whisker limit of Creston is {86920.00} USD."
        },
        {
            "Q": "What is the lowest lower outlier value in Pinehaven in the violin plot?",
            "A": "The lowest upper outlier value in Pinehaven is {2907.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the violin plot?",
            "A": "The global maximum USD value in the violin plot is {86920.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the violin plot?",
            "A": "The global minimum USD value in the violin plot is {2907.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Quarryville and Pinehaven?",
            "A": "The Q1 difference between violin Quarryville and Pinehaven is {4641.00} USD."
        },
        {
            "Q": "What is the toal Q1 value of violin Pinehaven and Quarryville?",
            "A": "The total Q1 value of violin Pinehaven and Creston is {77423.00} USD."
        },
        {
            "Q": "What is the average Median value of violin Quarryville and Pinehaven?",
            "A": "The average Median value of violin Quarryville and Pinehaven is {47688.50} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 50426.00 USD? Please list the violins and corresponding values.",
            "A": "{Quarryville} has {50471.00} USD "
        },
        {
            "Q": "Which violins have median values below 50426.00 USD? Please list the violins and corresponding values.",
            "A": "{Pinehaven} has {44906.00} USD , {Creston} has {50381.00} USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 38368.00 USD and the upper quartile (Q3) below 58864.50 USD?",
            "A": "Violin {Quarryville} has the Q1 above 38368.00 USD and the Q3 below 58864.5 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 47717.00 USD?",
            "A": "Violin {Quarryville} has {51339.99} USD ,{Creston} has {50351.46} USD have their highest density peak exceed 47717.00 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 50845.73 USD?",
            "A": "Violin {Pinehaven} has {45082.54} USD ,{Creston} has {50351.46} USD have their highest density peak below 50845.73 USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Pinehaven or Quarryville ",
            "A": "The median value of the {Quarryville} is larger."
        },
        {
            "Q": "Which is larger, the median value of Quarryville, Pinehaven or Creston ",
            "A": "The median value of the {Quarryville} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Creston}."
        }
    ],
    "VA": []
}