{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {2} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Northgate}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Springfield}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Northgate?",
            "A": "The first position to the right of the violin Northgate is {Springfield}."
        },
        {
            "Q": "What is the spatial relationship of violin Springfield relative to the violin Northgate in terms of horizontal (left/right) direction?",
            "A": "violin Springfield is to the {right} of the violin Northgate."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Northgate}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Northgate}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Springfield?",
            "A": "The density distribution pattern of the Springfield shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Springfield in the violin plot?",
            "A": "The median of Springfield is {53094.50} USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Northgate in the violin plot?",
            "A": "The lower quartile (Q1) of Northgate is {47244.50} USD."
        },
        {
            "Q": "What is the upper whisker limit of Springfield in the violin plot?",
            "A": "The upper whisker limit of Springfield is {105287.00} USD."
        },
        {
            "Q": "What is the largest upper outlier value in Northgate in the violin plot?",
            "A": "The largest upper outlier value in Northgate is {145187.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the violin plot?",
            "A": "The global maximum USD value in the violin plot is {145187.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the violin plot?",
            "A": "The global minimum USD value in the violin plot is {25777.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between violin Northgate and Springfield?",
            "A": "The Q1 difference between violin Northgate and Springfield is {4548.25} USD."
        },
        {
            "Q": "What is the toal Q1 value of violin Springfield and Northgate?",
            "A": "The total Q1 value of violin Springfield and Springfield is {89940.75} USD."
        },
        {
            "Q": "What is the average Median value of violin Springfield and Northgate?",
            "A": "The average Median value of violin Springfield and Northgate is {56155.75} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 56155.75 USD? Please list the violins and corresponding values.",
            "A": "{Northgate} has {59217.00} USD "
        },
        {
            "Q": "Which violins have median values below 56155.75 USD? Please list the violins and corresponding values.",
            "A": "{Springfield} has {53094.50} USD "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 50318.83 USD?",
            "A": "Violin {Northgate} has {52312.56} USD have their highest density peak exceed 50318.83 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 50318.83 USD?",
            "A": "Violin {Springfield} has {48325.11} USD have their highest density peak below 50318.83 USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Northgate or Springfield ",
            "A": "The median value of the {Northgate} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Northgate}."
        }
    ],
    "VA": []
}