{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {7} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Rosewood}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Springfield}."
        },
        {
            "Q": "Which violin is the second position to the right of the violin Creston?",
            "A": "The second position to the right of the violin Creston is {Springfield}."
        },
        {
            "Q": "What is the spatial relationship of violin Rosewood relative to the violin Northgate in terms of horizontal (left/right) direction?",
            "A": "violin Rosewood is to the {left} of the violin Northgate."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Northgate}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Creston}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Ashford?",
            "A": "The density distribution pattern of the Ashford shows a {normal} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Northgate in the violin plot?",
            "A": "The median of Northgate is {59449.50} USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Westport in the violin plot?",
            "A": "The upper quartile (Q3) of Westport is {46050.00} USD."
        },
        {
            "Q": "What is the upper whisker limit of Creston in the violin plot?",
            "A": "The upper whisker limit of Creston is {85210.00} USD."
        },
        {
            "Q": "What is the lowest lower outlier value in Ashford in the violin plot?",
            "A": "The lowest upper outlier value in Ashford is {16334.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the violin plot?",
            "A": "The global maximum USD value in the violin plot is {85210.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the violin plot?",
            "A": "The global minimum USD value in the violin plot is {16334.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Ashford and Creston?",
            "A": "The Median difference between violin Ashford and Creston is {13678.00} USD."
        },
        {
            "Q": "What is the toal Q3 value of violin Northgate and Rosewood?",
            "A": "The total Q3 value of violin Northgate and Springfield is {120076.75} USD."
        },
        {
            "Q": "What is the average Q3 value of violin Brookfield and Westport?",
            "A": "The average Q3 value of violin Brookfield and Westport is {53655.12} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 52527.00 USD? Please list the violins and corresponding values.",
            "A": "{Brookfield} has {53401.00} USD , {Northgate} has {59449.50} USD , {Creston} has {56585.00} USD "
        },
        {
            "Q": "Which violins have median values below 41794.00 USD? Please list the violins and corresponding values.",
            "A": "{Westport} has {40681.00} USD "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 56465.83 USD?",
            "A": "Violin {Northgate} has {59137.12} USD have their highest density peak exceed 56465.83 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 47153.81 USD?",
            "A": "Violin {Ashford} has {42741.36} USD ,{Westport} has {40601.87} USD have their highest density peak below 47153.81 USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Brookfield or Creston ",
            "A": "The median value of the {Creston} is larger."
        },
        {
            "Q": "Which is larger, the median value of Brookfield, Springfield or Rosewood ",
            "A": "The median value of the {Brookfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ashford, Rosewood, Creston or Brookfield ",
            "A": "The median value of the {Creston} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Creston}."
        }
    ],
    "VA": []
}