{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Brookfield}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Quarryville}."
        },
        {
            "Q": "Which violin is the first position to the left of the violin Quarryville?",
            "A": "The first position to the left of the violin Quarryville is {Zephyr}."
        },
        {
            "Q": "What is the spatial relationship of violin Quarryville relative to the violin Brookfield in terms of horizontal (left/right) direction?",
            "A": "violin Quarryville is to the {right} of the violin Brookfield."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Brookfield}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Zephyr}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Quarryville?",
            "A": "The density distribution pattern of the Quarryville shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Zephyr in the violin plot?",
            "A": "The median of Zephyr is {45942.50} USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Brookfield in the violin plot?",
            "A": "The upper quartile (Q3) of Brookfield is {56214.75} USD."
        },
        {
            "Q": "What is the upper whisker limit of Quarryville in the violin plot?",
            "A": "The upper whisker limit of Quarryville is {67982.00} USD."
        },
        {
            "Q": "What is the lowest lower outlier value in Brookfield in the violin plot?",
            "A": "The lowest upper outlier value in Brookfield is {11274.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the violin plot?",
            "A": "The global maximum USD value in the violin plot is {98272.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the violin plot?",
            "A": "The global minimum USD value in the violin plot is {53.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Zephyr and Quarryville?",
            "A": "The Q3 difference between violin Zephyr and Quarryville is {12471.25} USD."
        },
        {
            "Q": "What is the toal Q1 value of violin Quarryville and Brookfield?",
            "A": "The total Q1 value of violin Quarryville and Quarryville is {70977.25} USD."
        },
        {
            "Q": "What is the average Median value of violin Zephyr and Quarryville?",
            "A": "The average Median value of violin Zephyr and Quarryville is {42117.25} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 47440.00 USD? Please list the violins and corresponding values.",
            "A": "{Brookfield} has {48937.50} USD "
        },
        {
            "Q": "Which violins have median values below 47440.00 USD? Please list the violins and corresponding values.",
            "A": "{Zephyr} has {45942.50} USD , {Quarryville} has {38292.00} USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 32294.00 USD and the upper quartile (Q3) below 57595.25 USD?",
            "A": "Violin {Brookfield} has the Q1 above 32294.00 USD and the Q3 below 57595.25 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 40824.45 USD?",
            "A": "Violin {Brookfield} has {49306.40} USD ,{Zephyr} has {44745.48} USD have their highest density peak exceed 40824.45 USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 47025.94 USD?",
            "A": "Violin {Zephyr} has {44745.48} USD ,{Quarryville} has {36903.41} USD have their highest density peak below 47025.94 USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Brookfield or Quarryville ",
            "A": "The median value of the {Brookfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Brookfield, Zephyr or Quarryville ",
            "A": "The median value of the {Brookfield} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Zephyr}."
        }
    ],
    "VA": []
}