{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {6} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Mobile Home}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Bungalow}."
        },
        {
            "Q": "Which violin is the second position to the left of the violin Luxury Villa?",
            "A": "The second position to the left of the violin Luxury Villa is {Mobile Home}."
        },
        {
            "Q": "What is the spatial relationship of violin Bungalow relative to the violin Duplex in terms of horizontal (left/right) direction?",
            "A": "violin Bungalow is to the {right} of the violin Duplex."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Loft}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Loft}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Luxury Villa?",
            "A": "The density distribution pattern of the Luxury Villa shows a {t} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Luxury Villa in the violin plot?",
            "A": "The median of Luxury Villa is {584.50} thousand USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Luxury Villa in the violin plot?",
            "A": "The upper quartile (Q3) of Luxury Villa is {669.00} thousand USD."
        },
        {
            "Q": "What is the upper whisker limit of Mobile Home in the violin plot?",
            "A": "The upper whisker limit of Mobile Home is {907.00} thousand USD."
        },
        {
            "Q": "What is the lowest lower outlier value in Bungalow in the violin plot?",
            "A": "The lowest upper outlier value in Bungalow is {12.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum thousand USD value in the violin plot?",
            "A": "The global maximum thousand USD value in the violin plot is {1192.00} thousand USD."
        },
        {
            "Q": "What is the global minimum thousand USD value in the violin plot?",
            "A": "The global minimum thousand USD value in the violin plot is {3.00} thousand USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between violin Bungalow and Duplex?",
            "A": "The Median difference between violin Bungalow and Duplex is {27.00} thousand USD."
        },
        {
            "Q": "What is the toal Q1 value of violin Luxury Villa and Triplex?",
            "A": "The total Q1 value of violin Luxury Villa and Bungalow is {921.00} thousand USD."
        },
        {
            "Q": "What is the average Q1 value of violin Luxury Villa and Mobile Home?",
            "A": "The average Q1 value of violin Luxury Villa and Mobile Home is {446.75} thousand USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 579.25 thousand USD? Please list the violins and corresponding values.",
            "A": "{Luxury Villa} has {584.50} thousand USD , {Loft} has {612.50} thousand USD "
        },
        {
            "Q": "Which violins have median values below 541.25 thousand USD? Please list the violins and corresponding values.",
            "A": "{Mobile Home} has {535.00} thousand USD , {Triplex} has {535.50} thousand USD "
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 585.43 thousand USD?",
            "A": "Violin {Luxury Villa} has {606.56} thousand USD ,{Loft} has {597.11} thousand USD have their highest density peak exceed 585.43 thousand USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 534.63 thousand USD?",
            "A": "Violin {Triplex} has {515.66} thousand USD have their highest density peak below 534.63 thousand USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Triplex or Mobile Home ",
            "A": "The median value of the {Triplex} is larger."
        },
        {
            "Q": "Which is larger, the median value of Duplex, Luxury Villa or Mobile Home ",
            "A": "The median value of the {Luxury Villa} is larger."
        },
        {
            "Q": "Which is larger, the median value of Luxury Villa, Duplex, Bungalow or Triplex ",
            "A": "The median value of the {Luxury Villa} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Loft}."
        }
    ],
    "VA": []
}