{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {5} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Farmhouse}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Mansion}."
        },
        {
            "Q": "Which violin is the second position to the right of the violin Townhouse?",
            "A": "The second position to the right of the violin Townhouse is {Mansion}."
        },
        {
            "Q": "What is the spatial relationship of violin Mansion relative to the violin Townhouse in terms of horizontal (left/right) direction?",
            "A": "violin Mansion is to the {right} of the violin Townhouse."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Mansion}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Townhouse}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Townhouse?",
            "A": "The density distribution pattern of the Townhouse shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Luxury Villa in the violin plot?",
            "A": "The median of Luxury Villa is {606.00} thousand USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Farmhouse in the violin plot?",
            "A": "The lower quartile (Q1) of Farmhouse is {455.00} thousand USD."
        },
        {
            "Q": "What is the upper whisker limit of Luxury Villa in the violin plot?",
            "A": "The upper whisker limit of Luxury Villa is {1188.00} thousand USD."
        },
        {
            "Q": "What is the largest upper outlier value in Farmhouse in the violin plot?",
            "A": "The largest upper outlier value in Farmhouse is {1517.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum thousand USD value in the violin plot?",
            "A": "The global maximum thousand USD value in the violin plot is {1538.00} thousand USD."
        },
        {
            "Q": "What is the global minimum thousand USD value in the violin plot?",
            "A": "The global minimum thousand USD value in the violin plot is {292.00} thousand USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Cottage and Luxury Villa?",
            "A": "The Q3 difference between violin Cottage and Luxury Villa is {53.50} thousand USD."
        },
        {
            "Q": "What is the toal Median value of violin Mansion and Luxury Villa?",
            "A": "The total Median value of violin Mansion and Mansion is {1222.50} thousand USD."
        },
        {
            "Q": "What is the average Median value of violin Mansion and Townhouse?",
            "A": "The average Median value of violin Mansion and Townhouse is {605.25} thousand USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 603.50 thousand USD? Please list the violins and corresponding values.",
            "A": "{Farmhouse} has {606.00} thousand USD , {Luxury Villa} has {606.00} thousand USD , {Mansion} has {616.50} thousand USD "
        },
        {
            "Q": "Which violins have median values below 603.50 thousand USD? Please list the violins and corresponding values.",
            "A": "{Townhouse} has {594.00} thousand USD , {Cottage} has {601.00} thousand USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 458.38 thousand USD and the upper quartile (Q3) below 805.88 thousand USD?",
            "A": "Violin {Luxury Villa},{Cottage} has the Q1 above 458.38 thousand USD and the Q3 below 805.875 thousand USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 512.98 thousand USD?",
            "A": "Violin {Luxury Villa} has {540.54} thousand USD ,{Townhouse} has {515.26} thousand USD have their highest density peak exceed 512.98 thousand USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 512.98 thousand USD?",
            "A": "Violin {Farmhouse} has {475.18} thousand USD ,{Cottage} has {510.70} thousand USD ,{Mansion} has {503.32} thousand USD have their highest density peak below 512.98 thousand USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Townhouse or Luxury Villa ",
            "A": "The median value of the {Luxury Villa} is larger."
        },
        {
            "Q": "Which is larger, the median value of Townhouse, Farmhouse or Mansion ",
            "A": "The median value of the {Mansion} is larger."
        },
        {
            "Q": "Which is larger, the median value of Luxury Villa, Mansion, Townhouse or Farmhouse ",
            "A": "The median value of the {Mansion} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Mansion}."
        }
    ],
    "VA": []
}