{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {violin plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many violins are in this violin plot?",
            "A": "There are {3} violins."
        }
    ],
    "SRP": [
        {
            "Q": "Which violin does the leftmost violin represent?",
            "A": "The leftmost violin represents {Electronics}."
        },
        {
            "Q": "Which violin does the rightmost violin represent?",
            "A": "The rightmost violin represents {Sports}."
        },
        {
            "Q": "Which violin is the first position to the right of the violin Electronics?",
            "A": "The first position to the right of the violin Electronics is {Music}."
        },
        {
            "Q": "What is the spatial relationship of violin Sports relative to the violin Electronics in terms of horizontal (left/right) direction?",
            "A": "violin Sports is to the {right} of the violin Electronics."
        }
    ],
    "VPR": [
        {
            "Q": "Which violin has the largest median in this violin plot?",
            "A": "The violin with the largest median is {Sports}."
        },
        {
            "Q": "Which violin has the highest upper quartile (Q3) in this violin plot?",
            "A": "The violin with the highest Q3 is {Sports}."
        },
        {
            "Q": "What is the density distribution pattern of the violin representing Electronics?",
            "A": "The density distribution pattern of the Electronics shows a {skewed} distribution."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Music in the violin plot?",
            "A": "The median of Music is {189.50} thousand USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Sports in the violin plot?",
            "A": "The upper quartile (Q3) of Sports is {333.25} thousand USD."
        },
        {
            "Q": "What is the upper whisker limit of Electronics in the violin plot?",
            "A": "The upper whisker limit of Electronics is {314.00} thousand USD."
        },
        {
            "Q": "What is the largest upper outlier value in Sports in the violin plot?",
            "A": "The largest upper outlier value in Sports is {609.00}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum thousand USD value in the violin plot?",
            "A": "The global maximum thousand USD value in the violin plot is {609.00} thousand USD."
        },
        {
            "Q": "What is the global minimum thousand USD value in the violin plot?",
            "A": "The global minimum thousand USD value in the violin plot is {54.00} thousand USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between violin Sports and Electronics?",
            "A": "The Q3 difference between violin Sports and Electronics is {137.00} thousand USD."
        },
        {
            "Q": "What is the toal Q1 value of violin Sports and Electronics?",
            "A": "The total Q1 value of violin Sports and Sports is {282.75} thousand USD."
        },
        {
            "Q": "What is the average Q3 value of violin Music and Electronics?",
            "A": "The average Q3 value of violin Music and Electronics is {231.88} thousand USD."
        }
    ],
    "NF": [
        {
            "Q": "Which violins have median values exceed 168.25 thousand USD? Please list the violins and corresponding values.",
            "A": "{Music} has {189.50} thousand USD , {Sports} has {252.50} thousand USD "
        },
        {
            "Q": "Which violins have median values below 168.25 thousand USD? Please list the violins and corresponding values.",
            "A": "{Electronics} has {147.00} thousand USD "
        },
        {
            "Q": "Which violins in the violin plot have both the lower quartile (Q1) above 129.12 thousand USD and the upper quartile (Q3) below 300.38 thousand USD?",
            "A": "Violin {Music} has the Q1 above 129.12 thousand USD and the Q3 below 300.375 thousand USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak exceed 146.09 thousand USD?",
            "A": "Violin {Music} has {166.54} thousand USD ,{Sports} has {204.56} thousand USD have their highest density peak exceed 146.09 thousand USD."
        },
        {
            "Q": "Which violins in the violin plot have their highest density peak below 185.55 thousand USD?",
            "A": "Violin {Electronics} has {125.64} thousand USD ,{Music} has {166.54} thousand USD have their highest density peak below 185.55 thousand USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Electronics or Sports ",
            "A": "The median value of the {Sports} is larger."
        },
        {
            "Q": "Which is larger, the median value of Music, Sports or Electronics ",
            "A": "The median value of the {Sports} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the violin plot, which group has the widest range of data distribution (from minimum to maximum)?",
            "A": "The group with the widest range of data distribution is {Sports}."
        }
    ],
    "VA": []
}