{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Elmhurst}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Oakridge}."
        },
        {
            "Q": "Which box is the first position to the left of the box Creston?",
            "A": "The first position to the left of the box Creston is {Elmhurst}."
        },
        {
            "Q": "What is the spatial relationship of box Oakridge relative to the box Brookfield in terms of horizontal (left/right) direction?",
            "A": "Box Oakridge is to the {right} of the box Brookfield."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Creston}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Brookfield}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Creston}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Fairmont in the box plot?",
            "A": "The median of Fairmont is {534.5} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Elmhurst in the box plot?",
            "A": "The lower quartile (Q1) of Elmhurst is {491.75} million USD."
        },
        {
            "Q": "What is the lower whisker limit of Ashford in the box plot?",
            "A": "The lower whisker limit of Ashford is {22} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Oakridge in the box plot?",
            "A": "The largest upper outlier value in Oakridge is {817} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {1018.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {22.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Oakridge and Elmhurst?",
            "A": "The Median difference between box Oakridge and Elmhurst is {203.5} million USD."
        },
        {
            "Q": "What is the toal Median value of box Creston and Ashford?",
            "A": "The total Median value of box Creston and Ashford is {1094.0} million USD."
        },
        {
            "Q": "What is the average Q1 value of box Oakridge and Creston?",
            "A": "The average Q1 value of box Oakridge and Creston is {460.125} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 735.3000000000001 million USD?",
            "A": "Box{Oakridge} have the outliers exceed 735.3000000000001 million USD."
        },
        {
            "Q": "Which boxes have median values exceed 646.25 million USD? Please list the boxes and corresponding values.",
            "A": "{Creston} has {673.5} million USD , {Brookfield} has {653.0} million USD "
        },
        {
            "Q": "Which boxes have median values below 477.50 million USD? Please list the boxes and corresponding values.",
            "A": "{Ashford} has {420.5} million USD , {Oakridge} has {415.5} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Creston or Brookfield ",
            "A": "The median value of the {Creston} is larger."
        },
        {
            "Q": "Which is larger, the median value of Creston, Fairmont or Elmhurst ",
            "A": "The median value of the {Creston} is larger."
        },
        {
            "Q": "Which is larger, the median value of Oakridge, Creston, Ironwood or Ashford ",
            "A": "The median value of the {Creston} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Fairmont}."
        }
    ],
    "VA": []
}