{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {4} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Brookfield}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Quarryville}."
        },
        {
            "Q": "Which box is the first position to the left of the box Westport?",
            "A": "The first position to the left of the box Westport is {Northgate}."
        },
        {
            "Q": "What is the spatial relationship of box Northgate relative to the box Brookfield in terms of horizontal (left/right) direction?",
            "A": "Box Northgate is to the {right} of the box Brookfield."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Northgate}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Quarryville}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Westport}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Westport in the box plot?",
            "A": "The median of Westport is {439.0} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Brookfield in the box plot?",
            "A": "The lower quartile (Q1) of Brookfield is {440.75} million USD."
        },
        {
            "Q": "What is the lower whisker limit of Northgate in the box plot?",
            "A": "The lower whisker limit of Northgate is {209} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Brookfield in the box plot?",
            "A": "The largest upper outlier value in Brookfield is {1539} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {1765.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {139.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Brookfield and Westport?",
            "A": "The Q3 difference between box Brookfield and Westport is {273.0} million USD."
        },
        {
            "Q": "What is the toal Median value of box Northgate and Brookfield?",
            "A": "The total Median value of box Northgate and Brookfield is {1285.5} million USD."
        },
        {
            "Q": "What is the average Median value of box Westport and Quarryville?",
            "A": "The average Median value of box Westport and Quarryville is {548.25} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 999.9 million USD?",
            "A": "Box{Brookfield},{Northgate},{Westport} have the outliers exceed 999.9 million USD."
        },
        {
            "Q": "Which boxes have median values exceed 530.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Brookfield} has {621.0} million USD , {Northgate} has {664.5} million USD , {Quarryville} has {657.5} million USD "
        },
        {
            "Q": "Which boxes have median values below 661.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Brookfield} has {621.0} million USD , {Westport} has {439.0} million USD , {Quarryville} has {657.5} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Northgate or Quarryville ",
            "A": "The median value of the {Northgate} is larger."
        },
        {
            "Q": "Which is larger, the median value of Northgate, Brookfield or Quarryville ",
            "A": "The median value of the {Northgate} is larger."
        },
        {
            "Q": "Which is larger, the median value of Westport, Northgate, Quarryville or Brookfield ",
            "A": "The median value of the {Northgate} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Quarryville}."
        }
    ],
    "VA": []
}