{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {3} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Rosewood}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Springfield}."
        },
        {
            "Q": "Which box is the second position to the left of the box Springfield?",
            "A": "The second position to the left of the box Springfield is {Rosewood}."
        },
        {
            "Q": "What is the spatial relationship of box Springfield relative to the box Mapleton in terms of horizontal (left/right) direction?",
            "A": "Box Springfield is to the {right} of the box Mapleton."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Rosewood}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Rosewood}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Mapleton}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Springfield in the box plot?",
            "A": "The median of Springfield is {566.5} million USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Rosewood in the box plot?",
            "A": "The upper quartile (Q3) of Rosewood is {655.25} million USD."
        },
        {
            "Q": "What is the lower whisker limit of Springfield in the box plot?",
            "A": "The lower whisker limit of Springfield is {352} million USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Springfield in the box plot?",
            "A": "The lowest upper outlier value in Springfield is {140}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {902.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {91.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Rosewood and Mapleton?",
            "A": "The Q3 difference between box Rosewood and Mapleton is {41.75} million USD."
        },
        {
            "Q": "What is the toal Q3 value of box Rosewood and Springfield?",
            "A": "The total Q3 value of box Rosewood and Springfield is {1279.25} million USD."
        },
        {
            "Q": "What is the average Q3 value of box Rosewood and Springfield?",
            "A": "The average Q3 value of box Rosewood and Springfield is {639.625} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 811.8000000000001 million USD?",
            "A": "Box{Rosewood},{Mapleton},{Springfield} have the outliers exceed 811.8000000000001 million USD."
        },
        {
            "Q": "Which boxes have median values exceed 574.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Rosewood} has {580.0} million USD "
        },
        {
            "Q": "Which boxes have median values below 574.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Mapleton} has {568.0} million USD , {Springfield} has {566.5} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Mapleton or Rosewood ",
            "A": "The median value of the {Rosewood} is larger."
        },
        {
            "Q": "Which is larger, the median value of Springfield, Rosewood or Mapleton ",
            "A": "The median value of the {Rosewood} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Springfield}."
        }
    ],
    "VA": []
}