{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {4} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {NovaEdge}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {UrbanFlow}."
        },
        {
            "Q": "Which box is the second position beneath the box EcoCore?",
            "A": "The second position beneath the box EcoCore is {NovaEdge}."
        },
        {
            "Q": "What is the spatial relationship of box UrbanFlow relative to the box EcoCore in terms of vertical (above/below) direction?",
            "A": "Box UrbanFlow is {above} the box EcoCore."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {EcoCore}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {EcoCore}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {NovaEdge}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of UrbanFlow in the box plot?",
            "A": "The median of UrbanFlow is {47103.0} USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of EcoCore in the box plot?",
            "A": "The lower quartile (Q1) of EcoCore is {48975.5} USD."
        },
        {
            "Q": "What is the lower whisker limit of UrbanFlow in the box plot?",
            "A": "The lower whisker limit of UrbanFlow is {7340} USD."
        },
        {
            "Q": "What is the largest upper outlier value in PureSync in the box plot?",
            "A": "The largest upper outlier value in PureSync is {97586} USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the box plot?",
            "A": "The global maximum USD value in the box plot is {97586.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the box plot?",
            "A": "The global minimum USD value in the box plot is {7340.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box NovaEdge and EcoCore?",
            "A": "The Q1 difference between box NovaEdge and EcoCore is {1890.0} USD."
        },
        {
            "Q": "What is the toal Median value of box NovaEdge and EcoCore?",
            "A": "The total Median value of box NovaEdge and EcoCore is {115453.5} USD."
        },
        {
            "Q": "What is the average Median value of box EcoCore and NovaEdge?",
            "A": "The average Median value of box EcoCore and NovaEdge is {57726.75} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 87827.40000000001 USD?",
            "A": "Box{NovaEdge},{PureSync} have the outliers exceed 87827.40000000001 USD."
        },
        {
            "Q": "Which boxes have median values exceed 57726.75 USD? Please list the boxes and corresponding values.",
            "A": "{EcoCore} has {59100.5} USD "
        },
        {
            "Q": "Which boxes have median values below 50744.75 USD? Please list the boxes and corresponding values.",
            "A": "{UrbanFlow} has {47103.0} USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of NovaEdge or EcoCore ",
            "A": "The median value of the {EcoCore} is larger."
        },
        {
            "Q": "Which is larger, the median value of EcoCore, NovaEdge or UrbanFlow ",
            "A": "The median value of the {EcoCore} is larger."
        },
        {
            "Q": "Which is larger, the median value of EcoCore, UrbanFlow, NovaEdge or PureSync ",
            "A": "The median value of the {EcoCore} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {UrbanFlow}."
        }
    ],
    "VA": []
}