{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Zoomo}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Vizzle}."
        },
        {
            "Q": "Which box is the second position to the left of the box Viewly?",
            "A": "The second position to the left of the box Viewly is {Videx}."
        },
        {
            "Q": "What is the spatial relationship of box Clipio relative to the box Vizzle in terms of horizontal (left/right) direction?",
            "A": "Box Clipio is to the {left} of the box Vizzle."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Zoomo}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Vizzle}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Streamo}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Viewly in the box plot?",
            "A": "The median of Viewly is {20031.5} viewers."
        },
        {
            "Q": "What is the upper quartile (Q3) of Vizzle in the box plot?",
            "A": "The upper quartile (Q3) of Vizzle is {30970.5} viewers."
        },
        {
            "Q": "What is the lower whisker limit of SnapPlay in the box plot?",
            "A": "The lower whisker limit of SnapPlay is {18434} viewers."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum viewers value in the box plot?",
            "A": "The global maximum viewers value in the box plot is {36465.00} viewers."
        },
        {
            "Q": "What is the global minimum viewers value in the box plot?",
            "A": "The global minimum viewers value in the box plot is {8576.00} viewers."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Streamo and Zoomo?",
            "A": "The Median difference between box Streamo and Zoomo is {10576.5} viewers."
        },
        {
            "Q": "What is the toal Q1 value of box Vizzle and Videx?",
            "A": "The total Q1 value of box Vizzle and Videx is {48602.5} viewers."
        },
        {
            "Q": "What is the average Median value of box Vizzle and Streamo?",
            "A": "The average Median value of box Vizzle and Streamo is {23149.0} viewers."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 26693.50 viewers? Please list the boxes and corresponding values.",
            "A": "{Zoomo} has {28662.5} viewers , {Vizzle} has {28212.0} viewers "
        },
        {
            "Q": "Which boxes have median values below 17998.25 viewers? Please list the boxes and corresponding values.",
            "A": "{Clipio} has {17910.5} viewers "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of SnapPlay or Clipio ",
            "A": "The median value of the {SnapPlay} is larger."
        },
        {
            "Q": "Which is larger, the median value of Videx, Viewly or Vizzle ",
            "A": "The median value of the {Vizzle} is larger."
        },
        {
            "Q": "Which is larger, the median value of Videx, Streamo, Viewly or SnapPlay ",
            "A": "The median value of the {Videx} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Videx}."
        }
    ],
    "VA": []
}