{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {2} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Castio}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Showio}."
        },
        {
            "Q": "Which box is the first position to the right of the box Castio?",
            "A": "The first position to the right of the box Castio is {Showio}."
        },
        {
            "Q": "What is the spatial relationship of box Castio relative to the box Showio in terms of horizontal (left/right) direction?",
            "A": "Box Castio is to the {left} of the box Showio."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Castio}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Castio}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Showio}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Showio in the box plot?",
            "A": "The median of Showio is {13659.0} viewers."
        },
        {
            "Q": "What is the lower quartile (Q1) of Castio in the box plot?",
            "A": "The lower quartile (Q1) of Castio is {21895.5} viewers."
        },
        {
            "Q": "What is the upper whisker limit of Castio in the box plot?",
            "A": "The upper whisker limit of Castio is {35170} viewers."
        },
        {
            "Q": "What is the largest upper outlier value in Showio in the box plot?",
            "A": "The largest upper outlier value in Showio is {23133} viewers."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum viewers value in the box plot?",
            "A": "The global maximum viewers value in the box plot is {36913.00} viewers."
        },
        {
            "Q": "What is the global minimum viewers value in the box plot?",
            "A": "The global minimum viewers value in the box plot is {10056.00} viewers."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Showio and Castio?",
            "A": "The Q1 difference between box Showio and Castio is {9996.5} viewers."
        },
        {
            "Q": "What is the toal Q1 value of box Showio and Castio?",
            "A": "The total Q1 value of box Showio and Castio is {33794.5} viewers."
        },
        {
            "Q": "What is the average Q1 value of box Showio and Castio?",
            "A": "The average Q1 value of box Showio and Castio is {16897.25} viewers."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 33221.700000000004 viewers?",
            "A": "Box{Castio} have the outliers exceed 33221.700000000004 viewers."
        },
        {
            "Q": "Which boxes have median values exceed 18788.50 viewers? Please list the boxes and corresponding values.",
            "A": "{Castio} has {23918.0} viewers "
        },
        {
            "Q": "Which boxes have median values below 18788.50 viewers? Please list the boxes and corresponding values.",
            "A": "{Showio} has {13659.0} viewers "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Showio or Castio ",
            "A": "The median value of the {Castio} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Castio}."
        }
    ],
    "VA": []
}