{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Zoomo}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Videx}."
        },
        {
            "Q": "Which box is the first position to the right of the box MoviQ?",
            "A": "The first position to the right of the box MoviQ is {Videx}."
        },
        {
            "Q": "What is the spatial relationship of box FlowVid relative to the box SceneX in terms of horizontal (left/right) direction?",
            "A": "Box FlowVid is to the {left} of the box SceneX."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {FlowVid}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Tubeo}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {FlowVid}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Zoomo in the box plot?",
            "A": "The median of Zoomo is {13438.0} viewers."
        },
        {
            "Q": "What is the upper quartile (Q3) of SceneX in the box plot?",
            "A": "The upper quartile (Q3) of SceneX is {8913.0} viewers."
        },
        {
            "Q": "What is the upper whisker limit of FlowVid in the box plot?",
            "A": "The upper whisker limit of FlowVid is {25064} viewers."
        },
        {
            "Q": "What is the lowest upper outlier value in Zoomo in the box plot?",
            "A": "The lowest upper outlier value in Zoomo is {529}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum viewers value in the box plot?",
            "A": "The global maximum viewers value in the box plot is {32375.00} viewers."
        },
        {
            "Q": "What is the global minimum viewers value in the box plot?",
            "A": "The global minimum viewers value in the box plot is {529.00} viewers."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box MoviQ and FlowVid?",
            "A": "The Q1 difference between box MoviQ and FlowVid is {10150.5} viewers."
        },
        {
            "Q": "What is the toal Q3 value of box MoviQ and Tubeo?",
            "A": "The total Q3 value of box MoviQ and Tubeo is {34085.5} viewers."
        },
        {
            "Q": "What is the average Q3 value of box SceneX and Videx?",
            "A": "The average Q3 value of box SceneX and Videx is {15113.25} viewers."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 24609.600000000002 viewers?",
            "A": "Box{Zoomo},{Videx} have the outliers exceed 24609.600000000002 viewers."
        },
        {
            "Q": "Which boxes have median values exceed 19804.00 viewers? Please list the boxes and corresponding values.",
            "A": "{FlowVid} has {20092.0} viewers "
        },
        {
            "Q": "Which boxes have median values below 11972.00 viewers? Please list the boxes and corresponding values.",
            "A": "{SceneX} has {7041.0} viewers , {MoviQ} has {10506.0} viewers "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of FlowVid or MoviQ ",
            "A": "The median value of the {FlowVid} is larger."
        },
        {
            "Q": "Which is larger, the median value of Videx, FlowVid or Tubeo ",
            "A": "The median value of the {FlowVid} is larger."
        },
        {
            "Q": "Which is larger, the median value of Zoomo, MoviQ, SceneX or FlowVid ",
            "A": "The median value of the {FlowVid} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Tubeo}."
        }
    ],
    "VA": []
}