{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {4} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Shadow Line}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Plain Sight}."
        },
        {
            "Q": "Which box is the first position to the left of the box Broken Mirror?",
            "A": "The first position to the left of the box Broken Mirror is {Last Ember}."
        },
        {
            "Q": "What is the spatial relationship of box Broken Mirror relative to the box Plain Sight in terms of horizontal (left/right) direction?",
            "A": "Box Broken Mirror is to the {left} of the box Plain Sight."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Plain Sight}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Plain Sight}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Plain Sight}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Broken Mirror in the box plot?",
            "A": "The median of Broken Mirror is {594.0} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Last Ember in the box plot?",
            "A": "The lower quartile (Q1) of Last Ember is {423.25} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Shadow Line in the box plot?",
            "A": "The upper whisker limit of Shadow Line is {1022} million USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Last Ember in the box plot?",
            "A": "The lowest upper outlier value in Last Ember is {17} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {1077.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {17.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Shadow Line and Broken Mirror?",
            "A": "The Median difference between box Shadow Line and Broken Mirror is {13.5} million USD."
        },
        {
            "Q": "What is the toal Median value of box Broken Mirror and Plain Sight?",
            "A": "The total Median value of box Broken Mirror and Plain Sight is {1200.5} million USD."
        },
        {
            "Q": "What is the average Median value of box Shadow Line and Plain Sight?",
            "A": "The average Median value of box Shadow Line and Plain Sight is {593.5} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 600.25 million USD? Please list the boxes and corresponding values.",
            "A": "{Plain Sight} has {606.5} million USD "
        },
        {
            "Q": "Which boxes have median values below 564.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Last Ember} has {547.5} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Plain Sight or Last Ember ",
            "A": "The median value of the {Plain Sight} is larger."
        },
        {
            "Q": "Which is larger, the median value of Shadow Line, Broken Mirror or Plain Sight ",
            "A": "The median value of the {Plain Sight} is larger."
        },
        {
            "Q": "Which is larger, the median value of Shadow Line, Plain Sight, Broken Mirror or Last Ember ",
            "A": "The median value of the {Plain Sight} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Plain Sight}."
        }
    ],
    "VA": []
}