{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {2} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Fading Light}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Wild Bloom}."
        },
        {
            "Q": "Which box is the first position to the left of the box Wild Bloom?",
            "A": "The first position to the left of the box Wild Bloom is {Fading Light}."
        },
        {
            "Q": "What is the spatial relationship of box Fading Light relative to the box Wild Bloom in terms of horizontal (left/right) direction?",
            "A": "Box Fading Light is to the {left} of the box Wild Bloom."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Fading Light}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Fading Light}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Wild Bloom}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Fading Light in the box plot?",
            "A": "The median of Fading Light is {661.0} million USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Wild Bloom in the box plot?",
            "A": "The upper quartile (Q3) of Wild Bloom is {560.25} million USD."
        },
        {
            "Q": "What is the lower whisker limit of Wild Bloom in the box plot?",
            "A": "The lower whisker limit of Wild Bloom is {337} million USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Fading Light in the box plot?",
            "A": "The lowest upper outlier value in Fading Light is {341}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {884.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {252.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Fading Light and Wild Bloom?",
            "A": "The Median difference between box Fading Light and Wild Bloom is {148.0} million USD."
        },
        {
            "Q": "What is the toal Median value of box Fading Light and Wild Bloom?",
            "A": "The total Median value of box Fading Light and Wild Bloom is {1174.0} million USD."
        },
        {
            "Q": "What is the average Q1 value of box Wild Bloom and Fading Light?",
            "A": "The average Q1 value of box Wild Bloom and Fading Light is {530.375} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 795.6 million USD?",
            "A": "Box{Fading Light} have the outliers exceed 795.6 million USD."
        },
        {
            "Q": "Which boxes have median values exceed 587.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Fading Light} has {661.0} million USD "
        },
        {
            "Q": "Which boxes have median values below 587.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Wild Bloom} has {513.0} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Wild Bloom or Fading Light ",
            "A": "The median value of the {Fading Light} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Fading Light}."
        }
    ],
    "VA": []
}