{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {2} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Broken Mirror}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Echoes}."
        },
        {
            "Q": "Which box is the first position to the left of the box Echoes?",
            "A": "The first position to the left of the box Echoes is {Broken Mirror}."
        },
        {
            "Q": "What is the spatial relationship of box Echoes relative to the box Broken Mirror in terms of horizontal (left/right) direction?",
            "A": "Box Echoes is to the {right} of the box Broken Mirror."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Broken Mirror}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Broken Mirror}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Echoes}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Echoes in the box plot?",
            "A": "The median of Echoes is {515.0} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Broken Mirror in the box plot?",
            "A": "The lower quartile (Q1) of Broken Mirror is {514.5} million USD."
        },
        {
            "Q": "What is the lower whisker limit of Broken Mirror in the box plot?",
            "A": "The lower whisker limit of Broken Mirror is {194} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Broken Mirror in the box plot?",
            "A": "The largest upper outlier value in Broken Mirror is {2142} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {2142.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {149.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Echoes and Broken Mirror?",
            "A": "The Median difference between box Echoes and Broken Mirror is {188.5} million USD."
        },
        {
            "Q": "What is the toal Q3 value of box Broken Mirror and Echoes?",
            "A": "The total Q3 value of box Broken Mirror and Echoes is {1813.75} million USD."
        },
        {
            "Q": "What is the average Q3 value of box Broken Mirror and Echoes?",
            "A": "The average Q3 value of box Broken Mirror and Echoes is {906.875} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 1927.8 million USD?",
            "A": "Box{Broken Mirror} have the outliers exceed 1927.8 million USD."
        },
        {
            "Q": "Which boxes have median values exceed 609.25 million USD? Please list the boxes and corresponding values.",
            "A": "{Broken Mirror} has {703.5} million USD "
        },
        {
            "Q": "Which boxes have median values below 609.25 million USD? Please list the boxes and corresponding values.",
            "A": "{Echoes} has {515.0} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Echoes or Broken Mirror ",
            "A": "The median value of the {Broken Mirror} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Broken Mirror}."
        }
    ],
    "VA": []
}