{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Celestial Arch}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Golden Dunes}."
        },
        {
            "Q": "Which box is the second position beneath the box Golden Dunes?",
            "A": "The second position beneath the box Golden Dunes is {Willow Grove}."
        },
        {
            "Q": "What is the spatial relationship of box Willow Grove relative to the box Dragon Ruins in terms of vertical (above/below) direction?",
            "A": "Box Willow Grove is {below} the box Dragon Ruins."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Crystal Falls}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Dragon Ruins}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Crystal Falls}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Crystal Falls in the box plot?",
            "A": "The median of Crystal Falls is {9059.5} Visitors."
        },
        {
            "Q": "What is the upper quartile (Q3) of Dragon Ruins in the box plot?",
            "A": "The upper quartile (Q3) of Dragon Ruins is {10705.25} Visitors."
        },
        {
            "Q": "What is the lower whisker limit of Dragon Ruins in the box plot?",
            "A": "The lower whisker limit of Dragon Ruins is {575} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Golden Dunes in the box plot?",
            "A": "The largest upper outlier value in Golden Dunes is {17532} Visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {25801.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {276.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Celestial Arch and Golden Dunes?",
            "A": "The Q1 difference between box Celestial Arch and Golden Dunes is {32.5} Visitors."
        },
        {
            "Q": "What is the toal Q1 value of box Willow Grove and Celestial Arch?",
            "A": "The total Q1 value of box Willow Grove and Celestial Arch is {10863.25} Visitors."
        },
        {
            "Q": "What is the average Q1 value of box Celestial Arch and Dragon Ruins?",
            "A": "The average Q1 value of box Celestial Arch and Dragon Ruins is {5968.75} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 15778.800000000001 Visitors?",
            "A": "Box{Crystal Falls},{Willow Grove},{Golden Dunes} have the outliers exceed 15778.800000000001 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 8633.25 Visitors? Please list the boxes and corresponding values.",
            "A": "{Crystal Falls} has {9059.5} Visitors "
        },
        {
            "Q": "Which boxes have median values below 7856.00 Visitors? Please list the boxes and corresponding values.",
            "A": "{Celestial Arch} has {7139.5} Visitors , {Willow Grove} has {7282.5} Visitors , {Golden Dunes} has {7505.0} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Golden Dunes or Willow Grove ",
            "A": "The median value of the {Golden Dunes} is larger."
        },
        {
            "Q": "Which is larger, the median value of Crystal Falls, Golden Dunes or Willow Grove ",
            "A": "The median value of the {Crystal Falls} is larger."
        },
        {
            "Q": "Which is larger, the median value of Golden Dunes, Celestial Arch, Willow Grove or Dragon Ruins ",
            "A": "The median value of the {Dragon Ruins} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Dragon Ruins}."
        }
    ],
    "VA": []
}