{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {3} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Sun Harbor}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Hidden Valley}."
        },
        {
            "Q": "Which box is the second position to the left of the box Hidden Valley?",
            "A": "The second position to the left of the box Hidden Valley is {Sun Harbor}."
        },
        {
            "Q": "What is the spatial relationship of box Hidden Valley relative to the box Willow Grove in terms of horizontal (left/right) direction?",
            "A": "Box Hidden Valley is to the {right} of the box Willow Grove."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Hidden Valley}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Hidden Valley}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Hidden Valley}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Sun Harbor in the box plot?",
            "A": "The median of Sun Harbor is {7265.0} Visitors."
        },
        {
            "Q": "What is the lower quartile (Q1) of Willow Grove in the box plot?",
            "A": "The lower quartile (Q1) of Willow Grove is {5869.75} Visitors."
        },
        {
            "Q": "What is the upper whisker limit of Willow Grove in the box plot?",
            "A": "The upper whisker limit of Willow Grove is {15429} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Sun Harbor in the box plot?",
            "A": "The largest upper outlier value in Sun Harbor is {19839}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {19839.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {861.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Hidden Valley and Sun Harbor?",
            "A": "The Median difference between box Hidden Valley and Sun Harbor is {1663.0} Visitors."
        },
        {
            "Q": "What is the toal Q3 value of box Sun Harbor and Willow Grove?",
            "A": "The total Q3 value of box Sun Harbor and Willow Grove is {20469.5} Visitors."
        },
        {
            "Q": "What is the average Median value of box Willow Grove and Sun Harbor?",
            "A": "The average Median value of box Willow Grove and Sun Harbor is {7842.0} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 16190.1 Visitors?",
            "A": "Box{Sun Harbor},{Hidden Valley} have the outliers exceed 16190.1 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 7842.00 Visitors? Please list the boxes and corresponding values.",
            "A": "{Willow Grove} has {8419.0} Visitors , {Hidden Valley} has {8928.0} Visitors "
        },
        {
            "Q": "Which boxes have median values below 8673.50 Visitors? Please list the boxes and corresponding values.",
            "A": "{Sun Harbor} has {7265.0} Visitors , {Willow Grove} has {8419.0} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Sun Harbor or Willow Grove ",
            "A": "The median value of the {Willow Grove} is larger."
        },
        {
            "Q": "Which is larger, the median value of Willow Grove, Hidden Valley or Sun Harbor ",
            "A": "The median value of the {Hidden Valley} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Hidden Valley}."
        }
    ],
    "VA": []
}