{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Hidden Valley}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Silver Grove}."
        },
        {
            "Q": "Which box is the first position beneath the box Willow Grove?",
            "A": "The first position beneath the box Willow Grove is {Coral Lookout}."
        },
        {
            "Q": "What is the spatial relationship of box Hidden Valley relative to the box Rainbow Gorge in terms of vertical (above/below) direction?",
            "A": "Box Hidden Valley is {below} the box Rainbow Gorge."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Coral Lookout}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Hidden Valley}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Rainbow Gorge}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Willow Grove in the box plot?",
            "A": "The median of Willow Grove is {6606.5} Visitors."
        },
        {
            "Q": "What is the upper quartile (Q3) of Silver Grove in the box plot?",
            "A": "The upper quartile (Q3) of Silver Grove is {8683.25} Visitors."
        },
        {
            "Q": "What is the upper whisker limit of Silver Grove in the box plot?",
            "A": "The upper whisker limit of Silver Grove is {14364} Visitors."
        },
        {
            "Q": "What is the lowest upper outlier value in Rainbow Gorge in the box plot?",
            "A": "The lowest upper outlier value in Rainbow Gorge is {561}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {40720.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {150.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Coral Lookout and Silver Grove?",
            "A": "The Median difference between box Coral Lookout and Silver Grove is {1546.5} Visitors."
        },
        {
            "Q": "What is the toal Q3 value of box Coral Lookout and Silver Grove?",
            "A": "The total Q3 value of box Coral Lookout and Silver Grove is {19185.25} Visitors."
        },
        {
            "Q": "What is the average Q1 value of box Rainbow Gorge and Coral Lookout?",
            "A": "The average Q1 value of box Rainbow Gorge and Coral Lookout is {6098.5} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 36648.0 Visitors?",
            "A": "Box{Hidden Valley},{Silver Grove} have the outliers exceed 36648.0 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 8630.75 Visitors? Please list the boxes and corresponding values.",
            "A": "{Coral Lookout} has {8875.0} Visitors "
        },
        {
            "Q": "Which boxes have median values below 8099.75 Visitors? Please list the boxes and corresponding values.",
            "A": "{Willow Grove} has {6606.5} Visitors , {Rainbow Gorge} has {7813.0} Visitors , {Silver Grove} has {7328.5} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Willow Grove or Hidden Valley ",
            "A": "The median value of the {Hidden Valley} is larger."
        },
        {
            "Q": "Which is larger, the median value of Rainbow Gorge, Hidden Valley or Coral Lookout ",
            "A": "The median value of the {Coral Lookout} is larger."
        },
        {
            "Q": "Which is larger, the median value of Rainbow Gorge, Hidden Valley, Silver Grove or Willow Grove ",
            "A": "The median value of the {Hidden Valley} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Hidden Valley}."
        }
    ],
    "VA": []
}