{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {3} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Dragon Ruins}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Rainbow Gorge}."
        },
        {
            "Q": "Which box is the first position to the right of the box Lotus Temple?",
            "A": "The first position to the right of the box Lotus Temple is {Rainbow Gorge}."
        },
        {
            "Q": "What is the spatial relationship of box Dragon Ruins relative to the box Lotus Temple in terms of horizontal (left/right) direction?",
            "A": "Box Dragon Ruins is to the {left} of the box Lotus Temple."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Rainbow Gorge}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Lotus Temple}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Rainbow Gorge}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Rainbow Gorge in the box plot?",
            "A": "The median of Rainbow Gorge is {7662.0} Visitors."
        },
        {
            "Q": "What is the upper quartile (Q3) of Lotus Temple in the box plot?",
            "A": "The upper quartile (Q3) of Lotus Temple is {9899.0} Visitors."
        },
        {
            "Q": "What is the upper whisker limit of Dragon Ruins in the box plot?",
            "A": "The upper whisker limit of Dragon Ruins is {14541} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Dragon Ruins in the box plot?",
            "A": "The largest upper outlier value in Dragon Ruins is {17244} Visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {18806.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {800.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Dragon Ruins and Lotus Temple?",
            "A": "The Q3 difference between box Dragon Ruins and Lotus Temple is {920.5} Visitors."
        },
        {
            "Q": "What is the toal Q1 value of box Lotus Temple and Dragon Ruins?",
            "A": "The total Q1 value of box Lotus Temple and Dragon Ruins is {10886.0} Visitors."
        },
        {
            "Q": "What is the average Q1 value of box Lotus Temple and Rainbow Gorge?",
            "A": "The average Q1 value of box Lotus Temple and Rainbow Gorge is {5742.75} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 16925.4 Visitors?",
            "A": "Box{Dragon Ruins},{Rainbow Gorge} have the outliers exceed 16925.4 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 7649.00 Visitors? Please list the boxes and corresponding values.",
            "A": "{Rainbow Gorge} has {7662.0} Visitors "
        },
        {
            "Q": "Which boxes have median values below 7324.00 Visitors? Please list the boxes and corresponding values.",
            "A": "{Dragon Ruins} has {7012.0} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Rainbow Gorge or Lotus Temple ",
            "A": "The median value of the {Rainbow Gorge} is larger."
        },
        {
            "Q": "Which is larger, the median value of Dragon Ruins, Rainbow Gorge or Lotus Temple ",
            "A": "The median value of the {Rainbow Gorge} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Lotus Temple}."
        }
    ],
    "VA": []
}