{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Emerald Beach}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Sunset Cliff}."
        },
        {
            "Q": "Which box is the first position to the right of the box Hidden Valley?",
            "A": "The first position to the right of the box Hidden Valley is {Willow Grove}."
        },
        {
            "Q": "What is the spatial relationship of box Spring Spa relative to the box Sunset Cliff in terms of horizontal (left/right) direction?",
            "A": "Box Spring Spa is to the {left} of the box Sunset Cliff."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Spring Spa}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Willow Grove}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Sunset Cliff}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Hidden Valley in the box plot?",
            "A": "The median of Hidden Valley is {8472.0} Visitors."
        },
        {
            "Q": "What is the lower quartile (Q1) of Willow Grove in the box plot?",
            "A": "The lower quartile (Q1) of Willow Grove is {6698.5} Visitors."
        },
        {
            "Q": "What is the lower whisker limit of Hidden Valley in the box plot?",
            "A": "The lower whisker limit of Hidden Valley is {3163} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Sunset Cliff in the box plot?",
            "A": "The largest upper outlier value in Sunset Cliff is {22563}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {37806.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {3163.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Spring Spa and Hidden Valley?",
            "A": "The Q1 difference between box Spring Spa and Hidden Valley is {1471.25} Visitors."
        },
        {
            "Q": "What is the toal Q1 value of box Spring Spa and Hidden Valley?",
            "A": "The total Q1 value of box Spring Spa and Hidden Valley is {13103.25} Visitors."
        },
        {
            "Q": "What is the average Q1 value of box Hidden Valley and Sunset Cliff?",
            "A": "The average Q1 value of box Hidden Valley and Sunset Cliff is {5883.75} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 20306.7 Visitors?",
            "A": "Box{Emerald Beach},{Hidden Valley},{Willow Grove},{Spring Spa},{Sunset Cliff} have the outliers exceed 20306.7 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 9406.75 Visitors? Please list the boxes and corresponding values.",
            "A": "{Willow Grove} has {10032.0} Visitors , {Spring Spa} has {10737.0} Visitors "
        },
        {
            "Q": "Which boxes have median values below 8575.25 Visitors? Please list the boxes and corresponding values.",
            "A": "{Hidden Valley} has {8472.0} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Willow Grove or Sunset Cliff ",
            "A": "The median value of the {Willow Grove} is larger."
        },
        {
            "Q": "Which is larger, the median value of Emerald Beach, Sunset Cliff or Spring Spa ",
            "A": "The median value of the {Spring Spa} is larger."
        },
        {
            "Q": "Which is larger, the median value of Hidden Valley, Spring Spa, Sunset Cliff or Emerald Beach ",
            "A": "The median value of the {Spring Spa} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Willow Grove}."
        }
    ],
    "VA": []
}