{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {3} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Emerald Beach}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Coral Lookout}."
        },
        {
            "Q": "Which box is the first position to the right of the box Emerald Beach?",
            "A": "The first position to the right of the box Emerald Beach is {Maple Arbor}."
        },
        {
            "Q": "What is the spatial relationship of box Emerald Beach relative to the box Coral Lookout in terms of horizontal (left/right) direction?",
            "A": "Box Emerald Beach is to the {left} of the box Coral Lookout."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Maple Arbor}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Maple Arbor}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Emerald Beach}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Emerald Beach in the box plot?",
            "A": "The median of Emerald Beach is {8537.0} Visitors."
        },
        {
            "Q": "What is the lower quartile (Q1) of Emerald Beach in the box plot?",
            "A": "The lower quartile (Q1) of Emerald Beach is {6470.5} Visitors."
        },
        {
            "Q": "What is the lower whisker limit of Maple Arbor in the box plot?",
            "A": "The lower whisker limit of Maple Arbor is {346} Visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {17018.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {346.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Emerald Beach and Coral Lookout?",
            "A": "The Q3 difference between box Emerald Beach and Coral Lookout is {235.5} Visitors."
        },
        {
            "Q": "What is the toal Median value of box Maple Arbor and Emerald Beach?",
            "A": "The total Median value of box Maple Arbor and Emerald Beach is {17131.0} Visitors."
        },
        {
            "Q": "What is the average Median value of box Emerald Beach and Maple Arbor?",
            "A": "The average Median value of box Emerald Beach and Maple Arbor is {8565.5} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 8565.50 Visitors? Please list the boxes and corresponding values.",
            "A": "{Maple Arbor} has {8594.0} Visitors "
        },
        {
            "Q": "Which boxes have median values below 8565.50 Visitors? Please list the boxes and corresponding values.",
            "A": "{Emerald Beach} has {8537.0} Visitors , {Coral Lookout} has {8204.0} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Maple Arbor or Emerald Beach ",
            "A": "The median value of the {Maple Arbor} is larger."
        },
        {
            "Q": "Which is larger, the median value of Coral Lookout, Emerald Beach or Maple Arbor ",
            "A": "The median value of the {Maple Arbor} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Maple Arbor}."
        }
    ],
    "VA": []
}