{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Star Plateau}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Golden Dunes}."
        },
        {
            "Q": "Which box is the third position to the right of the box Star Plateau?",
            "A": "The third position to the right of the box Star Plateau is {Maple Arbor}."
        },
        {
            "Q": "What is the spatial relationship of box Dragon Ruins relative to the box Golden Dunes in terms of horizontal (left/right) direction?",
            "A": "Box Dragon Ruins is to the {left} of the box Golden Dunes."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Silver Grove}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Willow Grove}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Silver Grove}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Silver Grove in the box plot?",
            "A": "The median of Silver Grove is {8832.0} Visitors."
        },
        {
            "Q": "What is the lower quartile (Q1) of Star Plateau in the box plot?",
            "A": "The lower quartile (Q1) of Star Plateau is {5882.25} Visitors."
        },
        {
            "Q": "What is the lower whisker limit of Coral Lookout in the box plot?",
            "A": "The lower whisker limit of Coral Lookout is {24} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Silver Grove in the box plot?",
            "A": "The largest upper outlier value in Silver Grove is {16010} Visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {18138.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {24.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Star Plateau and Willow Grove?",
            "A": "The Median difference between box Star Plateau and Willow Grove is {609.0} Visitors."
        },
        {
            "Q": "What is the toal Median value of box Coral Lookout and Maple Arbor?",
            "A": "The total Median value of box Coral Lookout and Maple Arbor is {15619.5} Visitors."
        },
        {
            "Q": "What is the average Median value of box Dragon Ruins and Coral Lookout?",
            "A": "The average Median value of box Dragon Ruins and Coral Lookout is {7783.75} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 16324.2 Visitors?",
            "A": "Box{Star Plateau},{Maple Arbor} have the outliers exceed 16324.2 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 7884.75 Visitors? Please list the boxes and corresponding values.",
            "A": "{Star Plateau} has {7920.0} Visitors , {Silver Grove} has {8832.0} Visitors , {Willow Grove} has {8529.0} Visitors "
        },
        {
            "Q": "Which boxes have median values below 7783.75 Visitors? Please list the boxes and corresponding values.",
            "A": "{Coral Lookout} has {7770.0} Visitors , {Golden Dunes} has {6583.0} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Golden Dunes or Dragon Ruins ",
            "A": "The median value of the {Dragon Ruins} is larger."
        },
        {
            "Q": "Which is larger, the median value of Willow Grove, Maple Arbor or Coral Lookout ",
            "A": "The median value of the {Willow Grove} is larger."
        },
        {
            "Q": "Which is larger, the median value of Willow Grove, Coral Lookout, Star Plateau or Golden Dunes ",
            "A": "The median value of the {Willow Grove} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Coral Lookout}."
        }
    ],
    "VA": []
}