{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Maple Arbor}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Rainbow Gorge}."
        },
        {
            "Q": "Which box is the second position to the left of the box Spring Spa?",
            "A": "The second position to the left of the box Spring Spa is {Whisper Reef}."
        },
        {
            "Q": "What is the spatial relationship of box Spring Spa relative to the box Whisper Reef in terms of horizontal (left/right) direction?",
            "A": "Box Spring Spa is to the {right} of the box Whisper Reef."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Rainbow Gorge}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Crystal Falls}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Maple Arbor}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Spring Spa in the box plot?",
            "A": "The median of Spring Spa is {8186.5} Visitors."
        },
        {
            "Q": "What is the lower quartile (Q1) of Spring Spa in the box plot?",
            "A": "The lower quartile (Q1) of Spring Spa is {6152.5} Visitors."
        },
        {
            "Q": "What is the upper whisker limit of Emerald Beach in the box plot?",
            "A": "The upper whisker limit of Emerald Beach is {22814} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Whisper Reef in the box plot?",
            "A": "The largest upper outlier value in Whisper Reef is {30300} Visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {32916.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {3034.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Maple Arbor and Rainbow Gorge?",
            "A": "The Median difference between box Maple Arbor and Rainbow Gorge is {1666.5} Visitors."
        },
        {
            "Q": "What is the toal Q1 value of box Emerald Beach and Spring Spa?",
            "A": "The total Q1 value of box Emerald Beach and Spring Spa is {12300.5} Visitors."
        },
        {
            "Q": "What is the average Q1 value of box Crystal Falls and Spring Spa?",
            "A": "The average Q1 value of box Crystal Falls and Spring Spa is {6282.375} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 20979.9 Visitors?",
            "A": "Box{Maple Arbor},{Crystal Falls},{Whisper Reef},{Emerald Beach},{Spring Spa},{Rainbow Gorge} have the outliers exceed 20979.9 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 9392.25 Visitors? Please list the boxes and corresponding values.",
            "A": "{Whisper Reef} has {9498.0} Visitors , {Rainbow Gorge} has {9824.5} Visitors "
        },
        {
            "Q": "Which boxes have median values below 8607.75 Visitors? Please list the boxes and corresponding values.",
            "A": "{Maple Arbor} has {8158.0} Visitors , {Spring Spa} has {8186.5} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Rainbow Gorge or Maple Arbor ",
            "A": "The median value of the {Rainbow Gorge} is larger."
        },
        {
            "Q": "Which is larger, the median value of Crystal Falls, Emerald Beach or Rainbow Gorge ",
            "A": "The median value of the {Rainbow Gorge} is larger."
        },
        {
            "Q": "Which is larger, the median value of Rainbow Gorge, Spring Spa, Crystal Falls or Whisper Reef ",
            "A": "The median value of the {Rainbow Gorge} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Rainbow Gorge}."
        }
    ],
    "VA": []
}