{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Maple Arbor}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Coral Lookout}."
        },
        {
            "Q": "Which box is the third position to the left of the box Coral Lookout?",
            "A": "The third position to the left of the box Coral Lookout is {Sunset Cliff}."
        },
        {
            "Q": "What is the spatial relationship of box Rainbow Gorge relative to the box Sunset Cliff in terms of horizontal (left/right) direction?",
            "A": "Box Rainbow Gorge is to the {left} of the box Sunset Cliff."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Coral Lookout}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Crystal Falls}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Rainbow Gorge}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Crystal Falls in the box plot?",
            "A": "The median of Crystal Falls is {10101.5} Visitors."
        },
        {
            "Q": "What is the upper quartile (Q3) of Coral Lookout in the box plot?",
            "A": "The upper quartile (Q3) of Coral Lookout is {14809.5} Visitors."
        },
        {
            "Q": "What is the lower whisker limit of Rainbow Gorge in the box plot?",
            "A": "The lower whisker limit of Rainbow Gorge is {3773} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Maple Arbor in the box plot?",
            "A": "The largest upper outlier value in Maple Arbor is {23951}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {41062.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {3063.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Crystal Falls and Whisper Reef?",
            "A": "The Median difference between box Crystal Falls and Whisper Reef is {1170.5} Visitors."
        },
        {
            "Q": "What is the toal Q3 value of box Whisper Reef and Rainbow Gorge?",
            "A": "The total Q3 value of box Whisper Reef and Rainbow Gorge is {24159.5} Visitors."
        },
        {
            "Q": "What is the average Q3 value of box Coral Lookout and Rainbow Gorge?",
            "A": "The average Q3 value of box Coral Lookout and Rainbow Gorge is {13396.625} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 36955.8 Visitors?",
            "A": "Box{Sunset Cliff},{Crystal Falls},{Whisper Reef},{Coral Lookout} have the outliers exceed 36955.8 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 9938.25 Visitors? Please list the boxes and corresponding values.",
            "A": "{Crystal Falls} has {10101.5} Visitors , {Coral Lookout} has {10684.5} Visitors "
        },
        {
            "Q": "Which boxes have median values below 9570.75 Visitors? Please list the boxes and corresponding values.",
            "A": "{Rainbow Gorge} has {9366.5} Visitors , {Sunset Cliff} has {9336.0} Visitors , {Whisper Reef} has {8931.0} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Rainbow Gorge or Whisper Reef ",
            "A": "The median value of the {Rainbow Gorge} is larger."
        },
        {
            "Q": "Which is larger, the median value of Sunset Cliff, Coral Lookout or Rainbow Gorge ",
            "A": "The median value of the {Coral Lookout} is larger."
        },
        {
            "Q": "Which is larger, the median value of Sunset Cliff, Whisper Reef, Crystal Falls or Coral Lookout ",
            "A": "The median value of the {Coral Lookout} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Crystal Falls}."
        }
    ],
    "VA": []
}