{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {4} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Star Plateau}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Thunder Canyon}."
        },
        {
            "Q": "Which box is the second position to the right of the box Star Plateau?",
            "A": "The second position to the right of the box Star Plateau is {Sunset Cliff}."
        },
        {
            "Q": "What is the spatial relationship of box Star Plateau relative to the box Sunset Cliff in terms of horizontal (left/right) direction?",
            "A": "Box Star Plateau is to the {left} of the box Sunset Cliff."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Thunder Canyon}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Thunder Canyon}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Star Plateau}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Star Plateau in the box plot?",
            "A": "The median of Star Plateau is {9025.5} Visitors."
        },
        {
            "Q": "What is the upper quartile (Q3) of Star Plateau in the box plot?",
            "A": "The upper quartile (Q3) of Star Plateau is {12311.75} Visitors."
        },
        {
            "Q": "What is the lower whisker limit of Sunset Cliff in the box plot?",
            "A": "The lower whisker limit of Sunset Cliff is {3148} Visitors."
        },
        {
            "Q": "What is the largest upper outlier value in Star Plateau in the box plot?",
            "A": "The largest upper outlier value in Star Plateau is {30368} Visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Visitors value in the box plot?",
            "A": "The global maximum Visitors value in the box plot is {31181.00} Visitors."
        },
        {
            "Q": "What is the global minimum Visitors value in the box plot?",
            "A": "The global minimum Visitors value in the box plot is {3148.00} Visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Sunset Cliff and Silver Grove?",
            "A": "The Q1 difference between box Sunset Cliff and Silver Grove is {596.5} Visitors."
        },
        {
            "Q": "What is the toal Q1 value of box Thunder Canyon and Star Plateau?",
            "A": "The total Q1 value of box Thunder Canyon and Star Plateau is {13729.0} Visitors."
        },
        {
            "Q": "What is the average Q1 value of box Star Plateau and Sunset Cliff?",
            "A": "The average Q1 value of box Star Plateau and Sunset Cliff is {6516.25} Visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 24736.5 Visitors?",
            "A": "Box{Star Plateau},{Silver Grove},{Sunset Cliff},{Thunder Canyon} have the outliers exceed 24736.5 Visitors."
        },
        {
            "Q": "Which boxes have median values exceed 9198.75 Visitors? Please list the boxes and corresponding values.",
            "A": "{Silver Grove} has {9372.0} Visitors , {Sunset Cliff} has {10009.5} Visitors , {Thunder Canyon} has {10349.5} Visitors "
        },
        {
            "Q": "Which boxes have median values below 10179.50 Visitors? Please list the boxes and corresponding values.",
            "A": "{Star Plateau} has {9025.5} Visitors , {Silver Grove} has {9372.0} Visitors , {Sunset Cliff} has {10009.5} Visitors "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Silver Grove or Sunset Cliff ",
            "A": "The median value of the {Sunset Cliff} is larger."
        },
        {
            "Q": "Which is larger, the median value of Sunset Cliff, Thunder Canyon or Silver Grove ",
            "A": "The median value of the {Thunder Canyon} is larger."
        },
        {
            "Q": "Which is larger, the median value of Star Plateau, Silver Grove, Thunder Canyon or Sunset Cliff ",
            "A": "The median value of the {Thunder Canyon} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Thunder Canyon}."
        }
    ],
    "VA": []
}