{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Northgate}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Springfield}."
        },
        {
            "Q": "Which box is the first position to the right of the box Glenhaven?",
            "A": "The first position to the right of the box Glenhaven is {Springfield}."
        },
        {
            "Q": "What is the spatial relationship of box Lakeview relative to the box Springfield in terms of horizontal (left/right) direction?",
            "A": "Box Lakeview is to the {left} of the box Springfield."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Northgate}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Northgate}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Glenhaven}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Glenhaven in the box plot?",
            "A": "The median of Glenhaven is {2374.5} number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Glenhaven in the box plot?",
            "A": "The upper quartile (Q3) of Glenhaven is {2429.5} number."
        },
        {
            "Q": "What is the upper whisker limit of Northgate in the box plot?",
            "A": "The upper whisker limit of Northgate is {3009} number."
        },
        {
            "Q": "What is the lowest upper outlier value in Ashford in the box plot?",
            "A": "The lowest upper outlier value in Ashford is {1050}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the box plot?",
            "A": "The global maximum number value in the box plot is {3145.00} number."
        },
        {
            "Q": "What is the global minimum number value in the box plot?",
            "A": "The global minimum number value in the box plot is {411.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Northgate and Westport?",
            "A": "The Q1 difference between box Northgate and Westport is {2013.5} number."
        },
        {
            "Q": "What is the toal Q3 value of box Northgate and Creston?",
            "A": "The total Q3 value of box Northgate and Creston is {3773.25} number."
        },
        {
            "Q": "What is the average Median value of box Glenhaven and Ashford?",
            "A": "The average Median value of box Glenhaven and Ashford is {1992.0} number."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 2830.5 number?",
            "A": "Box{Northgate} have the outliers exceed 2830.5 number."
        },
        {
            "Q": "Which boxes have median values exceed 1481.75 number? Please list the boxes and corresponding values.",
            "A": "{Northgate} has {2736.0} number , {Ashford} has {1609.5} number , {Glenhaven} has {2374.5} number "
        },
        {
            "Q": "Which boxes have median values below 1054.75 number? Please list the boxes and corresponding values.",
            "A": "{Creston} has {890.0} number , {Westport} has {774.0} number "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Westport or Springfield ",
            "A": "The median value of the {Springfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ashford, Glenhaven or Springfield ",
            "A": "The median value of the {Glenhaven} is larger."
        },
        {
            "Q": "Which is larger, the median value of Springfield, Glenhaven, Ashford or Creston ",
            "A": "The median value of the {Glenhaven} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Ashford}."
        }
    ],
    "VA": []
}