{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Oakridge}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Glenhaven}."
        },
        {
            "Q": "Which box is the third position above the box Rosewood?",
            "A": "The third position above the box Rosewood is {Glenhaven}."
        },
        {
            "Q": "What is the spatial relationship of box Westport relative to the box Glenhaven in terms of vertical (above/below) direction?",
            "A": "Box Westport is {below} the box Glenhaven."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Glenhaven}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Glenhaven}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Oakridge}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Westport in the box plot?",
            "A": "The median of Westport is {940.5} number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Rosewood in the box plot?",
            "A": "The upper quartile (Q3) of Rosewood is {1778.5} number."
        },
        {
            "Q": "What is the upper whisker limit of Oakridge in the box plot?",
            "A": "The upper whisker limit of Oakridge is {760} number."
        },
        {
            "Q": "What is the largest upper outlier value in Rosewood in the box plot?",
            "A": "The largest upper outlier value in Rosewood is {3647}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the box plot?",
            "A": "The global maximum number value in the box plot is {3647.00} number."
        },
        {
            "Q": "What is the global minimum number value in the box plot?",
            "A": "The global minimum number value in the box plot is {335.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Oakridge and Mapleton?",
            "A": "The Median difference between box Oakridge and Mapleton is {657.5} number."
        },
        {
            "Q": "What is the toal Median value of box Glenhaven and Ashford?",
            "A": "The total Median value of box Glenhaven and Ashford is {2493.0} number."
        },
        {
            "Q": "What is the average Q3 value of box Oakridge and Ashford?",
            "A": "The average Q3 value of box Oakridge and Ashford is {808.375} number."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 1666.8 number?",
            "A": "Box{Mapleton},{Rosewood},{Ashford} have the outliers exceed 1666.8 number."
        },
        {
            "Q": "Which boxes have median values exceed 1165.00 number? Please list the boxes and corresponding values.",
            "A": "{Rosewood} has {1189.0} number , {Glenhaven} has {1633.0} number "
        },
        {
            "Q": "Which boxes have median values below 671.75 number? Please list the boxes and corresponding values.",
            "A": "{Oakridge} has {483.5} number "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Ashford or Glenhaven ",
            "A": "The median value of the {Glenhaven} is larger."
        },
        {
            "Q": "Which is larger, the median value of Westport, Ashford or Glenhaven ",
            "A": "The median value of the {Glenhaven} is larger."
        },
        {
            "Q": "Which is larger, the median value of Rosewood, Mapleton, Oakridge or Westport ",
            "A": "The median value of the {Rosewood} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Rosewood}."
        }
    ],
    "VA": []
}