{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {2} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Elmhurst}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Ironwood}."
        },
        {
            "Q": "Which box is the first position to the right of the box Elmhurst?",
            "A": "The first position to the right of the box Elmhurst is {Ironwood}."
        },
        {
            "Q": "What is the spatial relationship of box Elmhurst relative to the box Ironwood in terms of horizontal (left/right) direction?",
            "A": "Box Elmhurst is to the {left} of the box Ironwood."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Elmhurst}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Ironwood}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Elmhurst}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Ironwood in the box plot?",
            "A": "The median of Ironwood is {1957.0} number."
        },
        {
            "Q": "What is the lower quartile (Q1) of Ironwood in the box plot?",
            "A": "The lower quartile (Q1) of Ironwood is {1420.25} number."
        },
        {
            "Q": "What is the upper whisker limit of Ironwood in the box plot?",
            "A": "The upper whisker limit of Ironwood is {3712} number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the box plot?",
            "A": "The global maximum number value in the box plot is {3712.00} number."
        },
        {
            "Q": "What is the global minimum number value in the box plot?",
            "A": "The global minimum number value in the box plot is {125.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Ironwood and Elmhurst?",
            "A": "The Median difference between box Ironwood and Elmhurst is {99.5} number."
        },
        {
            "Q": "What is the toal Median value of box Elmhurst and Ironwood?",
            "A": "The total Median value of box Elmhurst and Ironwood is {4013.5} number."
        },
        {
            "Q": "What is the average Q3 value of box Ironwood and Elmhurst?",
            "A": "The average Q3 value of box Ironwood and Elmhurst is {2380.875} number."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 2006.75 number? Please list the boxes and corresponding values.",
            "A": "{Elmhurst} has {2056.5} number "
        },
        {
            "Q": "Which boxes have median values below 2006.75 number? Please list the boxes and corresponding values.",
            "A": "{Ironwood} has {1957.0} number "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Ironwood or Elmhurst ",
            "A": "The median value of the {Elmhurst} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Ironwood}."
        }
    ],
    "VA": []
}