{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {4} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Creston}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Rosewood}."
        },
        {
            "Q": "Which box is the first position to the left of the box Northgate?",
            "A": "The first position to the left of the box Northgate is {Creston}."
        },
        {
            "Q": "What is the spatial relationship of box Creston relative to the box Northgate in terms of horizontal (left/right) direction?",
            "A": "Box Creston is to the {left} of the box Northgate."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Creston}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Creston}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Northgate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Creston in the box plot?",
            "A": "The median of Creston is {1541.0} number."
        },
        {
            "Q": "What is the lower quartile (Q1) of Rosewood in the box plot?",
            "A": "The lower quartile (Q1) of Rosewood is {1192.25} number."
        },
        {
            "Q": "What is the lower whisker limit of Northgate in the box plot?",
            "A": "The lower whisker limit of Northgate is {524} number."
        },
        {
            "Q": "What is the largest upper outlier value in Northgate in the box plot?",
            "A": "The largest upper outlier value in Northgate is {1662}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the box plot?",
            "A": "The global maximum number value in the box plot is {3609.00} number."
        },
        {
            "Q": "What is the global minimum number value in the box plot?",
            "A": "The global minimum number value in the box plot is {517.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Rosewood and Creston?",
            "A": "The Q1 difference between box Rosewood and Creston is {59.5} number."
        },
        {
            "Q": "What is the toal Q1 value of box Creston and Rosewood?",
            "A": "The total Q1 value of box Creston and Rosewood is {2325.0} number."
        },
        {
            "Q": "What is the average Median value of box Zephyr and Creston?",
            "A": "The average Median value of box Zephyr and Creston is {1318.75} number."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 2596.5 number?",
            "A": "Box{Creston},{Zephyr} have the outliers exceed 2596.5 number."
        },
        {
            "Q": "Which boxes have median values exceed 1452.00 number? Please list the boxes and corresponding values.",
            "A": "{Creston} has {1541.0} number "
        },
        {
            "Q": "Which boxes have median values below 1229.75 number? Please list the boxes and corresponding values.",
            "A": "{Northgate} has {888.0} number , {Zephyr} has {1096.5} number "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Northgate or Zephyr ",
            "A": "The median value of the {Zephyr} is larger."
        },
        {
            "Q": "Which is larger, the median value of Zephyr, Northgate or Creston ",
            "A": "The median value of the {Creston} is larger."
        },
        {
            "Q": "Which is larger, the median value of Zephyr, Rosewood, Creston or Northgate ",
            "A": "The median value of the {Creston} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Creston}."
        }
    ],
    "VA": []
}