{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Rosewood}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Pinehaven}."
        },
        {
            "Q": "Which box is the third position above the box Highvale?",
            "A": "The third position above the box Highvale is {Pinehaven}."
        },
        {
            "Q": "What is the spatial relationship of box Lakeview relative to the box Rosewood in terms of vertical (above/below) direction?",
            "A": "Box Lakeview is {above} the box Rosewood."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Glenhaven}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Glenhaven}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Ironwood}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Lakeview in the box plot?",
            "A": "The median of Lakeview is {1215.5} number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Ironwood in the box plot?",
            "A": "The upper quartile (Q3) of Ironwood is {2121.75} number."
        },
        {
            "Q": "What is the lower whisker limit of Glenhaven in the box plot?",
            "A": "The lower whisker limit of Glenhaven is {1727} number."
        },
        {
            "Q": "What is the lowest upper outlier value in Pinehaven in the box plot?",
            "A": "The lowest upper outlier value in Pinehaven is {1276}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum number value in the box plot?",
            "A": "The global maximum number value in the box plot is {2799.00} number."
        },
        {
            "Q": "What is the global minimum number value in the box plot?",
            "A": "The global minimum number value in the box plot is {44.00} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Highvale and Ironwood?",
            "A": "The Median difference between box Highvale and Ironwood is {1463.5} number."
        },
        {
            "Q": "What is the toal Median value of box Lakeview and Pinehaven?",
            "A": "The total Median value of box Lakeview and Pinehaven is {3107.5} number."
        },
        {
            "Q": "What is the average Q3 value of box Pinehaven and Glenhaven?",
            "A": "The average Q3 value of box Pinehaven and Glenhaven is {2165.125} number."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 2038.5 number?",
            "A": "Box{Glenhaven},{Ironwood} have the outliers exceed 2038.5 number."
        },
        {
            "Q": "Which boxes have median values exceed 2138.50 number? Please list the boxes and corresponding values.",
            "A": "{Glenhaven} has {2196.5} number "
        },
        {
            "Q": "Which boxes have median values below 916.25 number? Please list the boxes and corresponding values.",
            "A": "{Highvale} has {617.0} number "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Glenhaven or Rosewood ",
            "A": "The median value of the {Glenhaven} is larger."
        },
        {
            "Q": "Which is larger, the median value of Pinehaven, Highvale or Rosewood ",
            "A": "The median value of the {Pinehaven} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ironwood, Rosewood, Lakeview or Pinehaven ",
            "A": "The median value of the {Ironwood} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Highvale}."
        }
    ],
    "VA": []
}