{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {2} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Barley}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Rye}."
        },
        {
            "Q": "Which box is the first position to the left of the box Rye?",
            "A": "The first position to the left of the box Rye is {Barley}."
        },
        {
            "Q": "What is the spatial relationship of box Barley relative to the box Rye in terms of horizontal (left/right) direction?",
            "A": "Box Barley is to the {left} of the box Rye."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Barley}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Barley}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Barley}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Rye in the box plot?",
            "A": "The median of Rye is {4356.0} kilograms per hectare."
        },
        {
            "Q": "What is the lower quartile (Q1) of Barley in the box plot?",
            "A": "The lower quartile (Q1) of Barley is {3608.0} kilograms per hectare."
        },
        {
            "Q": "What is the upper whisker limit of Barley in the box plot?",
            "A": "The upper whisker limit of Barley is {9246} kilograms per hectare."
        },
        {
            "Q": "What is the largest upper outlier value in Rye in the box plot?",
            "A": "The largest upper outlier value in Rye is {10579}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum kilograms per hectare value in the box plot?",
            "A": "The global maximum kilograms per hectare value in the box plot is {11032.00} kilograms per hectare."
        },
        {
            "Q": "What is the global minimum kilograms per hectare value in the box plot?",
            "A": "The global minimum kilograms per hectare value in the box plot is {1633.00} kilograms per hectare."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Rye and Barley?",
            "A": "The Q1 difference between box Rye and Barley is {371.5} kilograms per hectare."
        },
        {
            "Q": "What is the toal Median value of box Barley and Rye?",
            "A": "The total Median value of box Barley and Rye is {9268.0} kilograms per hectare."
        },
        {
            "Q": "What is the average Median value of box Rye and Barley?",
            "A": "The average Median value of box Rye and Barley is {4634.0} kilograms per hectare."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 9928.800000000001 kilograms per hectare?",
            "A": "Box{Barley},{Rye} have the outliers exceed 9928.800000000001 kilograms per hectare."
        },
        {
            "Q": "Which boxes have median values exceed 4634.00 kilograms per hectare? Please list the boxes and corresponding values.",
            "A": "{Barley} has {4912.0} kilograms per hectare "
        },
        {
            "Q": "Which boxes have median values below 4634.00 kilograms per hectare? Please list the boxes and corresponding values.",
            "A": "{Rye} has {4356.0} kilograms per hectare "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Barley or Rye ",
            "A": "The median value of the {Barley} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Rye}."
        }
    ],
    "VA": []
}