{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Glenhaven Academy}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Sunnyvale Prep}."
        },
        {
            "Q": "Which box is the first position to the right of the box Pinecrest Institute?",
            "A": "The first position to the right of the box Pinecrest Institute is {Sunnyvale Prep}."
        },
        {
            "Q": "What is the spatial relationship of box Sunnyvale Prep relative to the box Crestview High in terms of horizontal (left/right) direction?",
            "A": "Box Sunnyvale Prep is to the {right} of the box Crestview High."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Sunnyvale Prep}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Pinecrest Institute}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Glenhaven Academy}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Eastwood Prep in the box plot?",
            "A": "The median of Eastwood Prep is {86.56} %."
        },
        {
            "Q": "What is the upper quartile (Q3) of Eastwood Prep in the box plot?",
            "A": "The upper quartile (Q3) of Eastwood Prep is {92.1125} %."
        },
        {
            "Q": "What is the upper whisker limit of Glenhaven Academy in the box plot?",
            "A": "The upper whisker limit of Glenhaven Academy is {97.14} %."
        },
        {
            "Q": "What is the largest upper outlier value in Pinecrest Institute in the box plot?",
            "A": "The largest upper outlier value in Pinecrest Institute is {120.68} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum % value in the box plot?",
            "A": "The global maximum % value in the box plot is {120.68} %."
        },
        {
            "Q": "What is the global minimum % value in the box plot?",
            "A": "The global minimum % value in the box plot is {73.38} %."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Sunnyvale Prep and Glenhaven Academy?",
            "A": "The Q3 difference between box Sunnyvale Prep and Glenhaven Academy is {5.099999999999994} %."
        },
        {
            "Q": "What is the toal Q3 value of box Eastwood Prep and Glenhaven Academy?",
            "A": "The total Q3 value of box Eastwood Prep and Glenhaven Academy is {178.3725} %."
        },
        {
            "Q": "What is the average Q3 value of box Glenhaven Academy and Pinecrest Institute?",
            "A": "The average Q3 value of box Glenhaven Academy and Pinecrest Institute is {89.74875} %."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 98.316 %?",
            "A": "Box{Glenhaven Academy},{Eastwood Prep},{Pinecrest Institute},{Sunnyvale Prep} have the outliers exceed 98.316 %."
        },
        {
            "Q": "Which boxes have median values exceed 86.63 %? Please list the boxes and corresponding values.",
            "A": "{Sunnyvale Prep} has {86.7} % "
        },
        {
            "Q": "Which boxes have median values below 82.42 %? Please list the boxes and corresponding values.",
            "A": "{Crestview High} has {82.38999999999999} % "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Glenhaven Academy or Crestview High ",
            "A": "The median value of the {Glenhaven Academy} is larger."
        },
        {
            "Q": "Which is larger, the median value of Eastwood Prep, Crestview High or Glenhaven Academy ",
            "A": "The median value of the {Eastwood Prep} is larger."
        },
        {
            "Q": "Which is larger, the median value of Glenhaven Academy, Eastwood Prep, Pinecrest Institute or Sunnyvale Prep ",
            "A": "The median value of the {Sunnyvale Prep} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Pinecrest Institute}."
        }
    ],
    "VA": []
}