{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Glenhaven}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Yorkton}."
        },
        {
            "Q": "Which box is the first position above the box Mapleton?",
            "A": "The first position above the box Mapleton is {Elmhurst}."
        },
        {
            "Q": "What is the spatial relationship of box Elmhurst relative to the box Glenhaven in terms of vertical (above/below) direction?",
            "A": "Box Elmhurst is {above} the box Glenhaven."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Yorkton}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Yorkton}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Westport}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Elmhurst in the box plot?",
            "A": "The median of Elmhurst is {2051.5} MWh."
        },
        {
            "Q": "What is the lower quartile (Q1) of Mapleton in the box plot?",
            "A": "The lower quartile (Q1) of Mapleton is {1366.75} MWh."
        },
        {
            "Q": "What is the upper whisker limit of Elmhurst in the box plot?",
            "A": "The upper whisker limit of Elmhurst is {3161} MWh."
        },
        {
            "Q": "What is the largest upper outlier value in Yorkton in the box plot?",
            "A": "The largest upper outlier value in Yorkton is {6468}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the box plot?",
            "A": "The global maximum MWh value in the box plot is {6468.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the box plot?",
            "A": "The global minimum MWh value in the box plot is {924.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Mapleton and Westport?",
            "A": "The Median difference between box Mapleton and Westport is {167.5} MWh."
        },
        {
            "Q": "What is the toal Median value of box Yorkton and Elmhurst?",
            "A": "The total Median value of box Yorkton and Elmhurst is {4393.5} MWh."
        },
        {
            "Q": "What is the average Q3 value of box Yorkton and Glenhaven?",
            "A": "The average Q3 value of box Yorkton and Glenhaven is {2658.875} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 3049.2000000000003 MWh?",
            "A": "Box{Glenhaven},{Elmhurst},{Westport},{Yorkton} have the outliers exceed 3049.2000000000003 MWh."
        },
        {
            "Q": "Which boxes have median values exceed 1835.75 MWh? Please list the boxes and corresponding values.",
            "A": "{Glenhaven} has {1898.0} MWh , {Elmhurst} has {2051.5} MWh , {Yorkton} has {2342.0} MWh "
        },
        {
            "Q": "Which boxes have median values below 1835.75 MWh? Please list the boxes and corresponding values.",
            "A": "{Mapleton} has {1773.5} MWh , {Westport} has {1606.0} MWh "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Westport or Mapleton ",
            "A": "The median value of the {Mapleton} is larger."
        },
        {
            "Q": "Which is larger, the median value of Westport, Mapleton or Glenhaven ",
            "A": "The median value of the {Glenhaven} is larger."
        },
        {
            "Q": "Which is larger, the median value of Yorkton, Westport, Elmhurst or Glenhaven ",
            "A": "The median value of the {Yorkton} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Yorkton}."
        }
    ],
    "VA": []
}