{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Springfield}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Zephyr}."
        },
        {
            "Q": "Which box is the third position to the right of the box Lakeview?",
            "A": "The third position to the right of the box Lakeview is {Zephyr}."
        },
        {
            "Q": "What is the spatial relationship of box Brookfield relative to the box Springfield in terms of horizontal (left/right) direction?",
            "A": "Box Brookfield is to the {right} of the box Springfield."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Fairmont}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Fairmont}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Zephyr}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Fairmont in the box plot?",
            "A": "The median of Fairmont is {5615.0} MWh."
        },
        {
            "Q": "What is the lower quartile (Q1) of Brookfield in the box plot?",
            "A": "The lower quartile (Q1) of Brookfield is {2547.5} MWh."
        },
        {
            "Q": "What is the upper whisker limit of Fairmont in the box plot?",
            "A": "The upper whisker limit of Fairmont is {6260} MWh."
        },
        {
            "Q": "What is the lowest upper outlier value in Zephyr in the box plot?",
            "A": "The lowest upper outlier value in Zephyr is {2954}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the box plot?",
            "A": "The global maximum MWh value in the box plot is {6260.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the box plot?",
            "A": "The global minimum MWh value in the box plot is {1286.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Northgate and Fairmont?",
            "A": "The Q3 difference between box Northgate and Fairmont is {2318.5} MWh."
        },
        {
            "Q": "What is the toal Median value of box Lakeview and Fairmont?",
            "A": "The total Median value of box Lakeview and Fairmont is {7858.5} MWh."
        },
        {
            "Q": "What is the average Median value of box Fairmont and Brookfield?",
            "A": "The average Median value of box Fairmont and Brookfield is {4176.25} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 3335.4 MWh?",
            "A": "Box{Springfield} have the outliers exceed 3335.4 MWh."
        },
        {
            "Q": "Which boxes have median values exceed 4292.75 MWh? Please list the boxes and corresponding values.",
            "A": "{Rosewood} has {5283.0} MWh , {Fairmont} has {5615.0} MWh "
        },
        {
            "Q": "Which boxes have median values below 2490.50 MWh? Please list the boxes and corresponding values.",
            "A": "{Lakeview} has {2243.5} MWh "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Springfield or Brookfield ",
            "A": "The median value of the {Springfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Rosewood, Northgate or Brookfield ",
            "A": "The median value of the {Rosewood} is larger."
        },
        {
            "Q": "Which is larger, the median value of Springfield, Rosewood, Fairmont or Brookfield ",
            "A": "The median value of the {Fairmont} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Fairmont}."
        }
    ],
    "VA": []
}