{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {2} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Oakridge}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Yorkton}."
        },
        {
            "Q": "Which box is the first position to the right of the box Oakridge?",
            "A": "The first position to the right of the box Oakridge is {Yorkton}."
        },
        {
            "Q": "What is the spatial relationship of box Oakridge relative to the box Yorkton in terms of horizontal (left/right) direction?",
            "A": "Box Oakridge is to the {left} of the box Yorkton."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Oakridge}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Oakridge}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Yorkton}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Oakridge in the box plot?",
            "A": "The median of Oakridge is {2718.0} MWh."
        },
        {
            "Q": "What is the upper quartile (Q3) of Oakridge in the box plot?",
            "A": "The upper quartile (Q3) of Oakridge is {3336.75} MWh."
        },
        {
            "Q": "What is the upper whisker limit of Oakridge in the box plot?",
            "A": "The upper whisker limit of Oakridge is {4773} MWh."
        },
        {
            "Q": "What is the largest upper outlier value in Oakridge in the box plot?",
            "A": "The largest upper outlier value in Oakridge is {5150}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the box plot?",
            "A": "The global maximum MWh value in the box plot is {5150.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the box plot?",
            "A": "The global minimum MWh value in the box plot is {1830.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Yorkton and Oakridge?",
            "A": "The Q1 difference between box Yorkton and Oakridge is {137.0} MWh."
        },
        {
            "Q": "What is the toal Q1 value of box Yorkton and Oakridge?",
            "A": "The total Q1 value of box Yorkton and Oakridge is {4609.0} MWh."
        },
        {
            "Q": "What is the average Q3 value of box Oakridge and Yorkton?",
            "A": "The average Q3 value of box Oakridge and Yorkton is {3022.875} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 4635.0 MWh?",
            "A": "Box{Oakridge} have the outliers exceed 4635.0 MWh."
        },
        {
            "Q": "Which boxes have median values exceed 2607.25 MWh? Please list the boxes and corresponding values.",
            "A": "{Oakridge} has {2718.0} MWh "
        },
        {
            "Q": "Which boxes have median values below 2607.25 MWh? Please list the boxes and corresponding values.",
            "A": "{Yorkton} has {2496.5} MWh "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Yorkton or Oakridge ",
            "A": "The median value of the {Oakridge} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Oakridge}."
        }
    ],
    "VA": []
}