{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Oakridge}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Glenhaven}."
        },
        {
            "Q": "Which box is the second position to the right of the box Highvale?",
            "A": "The second position to the right of the box Highvale is {Quarryville}."
        },
        {
            "Q": "What is the spatial relationship of box Pinehaven relative to the box Quarryville in terms of horizontal (left/right) direction?",
            "A": "Box Pinehaven is to the {left} of the box Quarryville."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Oakridge}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Oakridge}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Quarryville}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Zephyr in the box plot?",
            "A": "The median of Zephyr is {2131.0} MWh."
        },
        {
            "Q": "What is the upper quartile (Q3) of Highvale in the box plot?",
            "A": "The upper quartile (Q3) of Highvale is {2697.75} MWh."
        },
        {
            "Q": "What is the lower whisker limit of Pinehaven in the box plot?",
            "A": "The lower whisker limit of Pinehaven is {1120} MWh."
        },
        {
            "Q": "What is the largest upper outlier value in Zephyr in the box plot?",
            "A": "The largest upper outlier value in Zephyr is {3371}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the box plot?",
            "A": "The global maximum MWh value in the box plot is {6946.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the box plot?",
            "A": "The global minimum MWh value in the box plot is {640.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Zephyr and Highvale?",
            "A": "The Median difference between box Zephyr and Highvale is {285.5} MWh."
        },
        {
            "Q": "What is the toal Median value of box Glenhaven and Oakridge?",
            "A": "The total Median value of box Glenhaven and Oakridge is {4423.5} MWh."
        },
        {
            "Q": "What is the average Q1 value of box Quarryville and Highvale?",
            "A": "The average Q1 value of box Quarryville and Highvale is {1599.375} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 3033.9 MWh?",
            "A": "Box{Oakridge},{Zephyr},{Highvale},{Pinehaven} have the outliers exceed 3033.9 MWh."
        },
        {
            "Q": "Which boxes have median values exceed 1952.25 MWh? Please list the boxes and corresponding values.",
            "A": "{Oakridge} has {3033.0} MWh , {Zephyr} has {2131.0} MWh , {Highvale} has {2416.5} MWh "
        },
        {
            "Q": "Which boxes have median values below 1582.00 MWh? Please list the boxes and corresponding values.",
            "A": "{Quarryville} has {1121.0} MWh , {Glenhaven} has {1390.5} MWh "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Highvale or Oakridge ",
            "A": "The median value of the {Oakridge} is larger."
        },
        {
            "Q": "Which is larger, the median value of Glenhaven, Oakridge or Quarryville ",
            "A": "The median value of the {Oakridge} is larger."
        },
        {
            "Q": "Which is larger, the median value of Quarryville, Zephyr, Oakridge or Pinehaven ",
            "A": "The median value of the {Oakridge} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Oakridge}."
        }
    ],
    "VA": []
}