{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {3} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Oakridge}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Ashford}."
        },
        {
            "Q": "Which box is the first position to the left of the box Ashford?",
            "A": "The first position to the left of the box Ashford is {Glenhaven}."
        },
        {
            "Q": "What is the spatial relationship of box Oakridge relative to the box Glenhaven in terms of horizontal (left/right) direction?",
            "A": "Box Oakridge is to the {left} of the box Glenhaven."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Glenhaven}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Oakridge}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Glenhaven}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Oakridge in the box plot?",
            "A": "The median of Oakridge is {2483.0} MWh."
        },
        {
            "Q": "What is the upper quartile (Q3) of Glenhaven in the box plot?",
            "A": "The upper quartile (Q3) of Glenhaven is {3041.25} MWh."
        },
        {
            "Q": "What is the lower whisker limit of Oakridge in the box plot?",
            "A": "The lower whisker limit of Oakridge is {1489} MWh."
        },
        {
            "Q": "What is the largest upper outlier value in Glenhaven in the box plot?",
            "A": "The largest upper outlier value in Glenhaven is {5156} MWh."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum MWh value in the box plot?",
            "A": "The global maximum MWh value in the box plot is {6090.00} MWh."
        },
        {
            "Q": "What is the global minimum MWh value in the box plot?",
            "A": "The global minimum MWh value in the box plot is {956.00} MWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Glenhaven and Oakridge?",
            "A": "The Q3 difference between box Glenhaven and Oakridge is {60.75} MWh."
        },
        {
            "Q": "What is the toal Q3 value of box Oakridge and Ashford?",
            "A": "The total Q3 value of box Oakridge and Ashford is {5941.25} MWh."
        },
        {
            "Q": "What is the average Q1 value of box Glenhaven and Oakridge?",
            "A": "The average Q1 value of box Glenhaven and Oakridge is {2051.25} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 4372.2 MWh?",
            "A": "Box{Oakridge},{Glenhaven},{Ashford} have the outliers exceed 4372.2 MWh."
        },
        {
            "Q": "Which boxes have median values exceed 2320.25 MWh? Please list the boxes and corresponding values.",
            "A": "{Oakridge} has {2483.0} MWh , {Glenhaven} has {2492.0} MWh "
        },
        {
            "Q": "Which boxes have median values below 2487.50 MWh? Please list the boxes and corresponding values.",
            "A": "{Oakridge} has {2483.0} MWh , {Ashford} has {2157.5} MWh "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Glenhaven or Ashford ",
            "A": "The median value of the {Glenhaven} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ashford, Oakridge or Glenhaven ",
            "A": "The median value of the {Glenhaven} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Ashford}."
        }
    ],
    "VA": []
}