{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Coffee Shops}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Steak Houses}."
        },
        {
            "Q": "Which box is the second position beneath the box Steak Houses?",
            "A": "The second position beneath the box Steak Houses is {Bakeries}."
        },
        {
            "Q": "What is the spatial relationship of box Bakeries relative to the box Steak Houses in terms of vertical (above/below) direction?",
            "A": "Box Bakeries is {below} the box Steak Houses."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Bakeries}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Bakeries}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Bakeries}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Cafeterias in the box plot?",
            "A": "The median of Cafeterias is {447.0} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Steak Houses in the box plot?",
            "A": "The lower quartile (Q1) of Steak Houses is {433.0} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Steak Houses in the box plot?",
            "A": "The upper whisker limit of Steak Houses is {707} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Bakeries in the box plot?",
            "A": "The largest upper outlier value in Bakeries is {865} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {865.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {119.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Coffee Shops and Asian Cuisine?",
            "A": "The Q3 difference between box Coffee Shops and Asian Cuisine is {51.0} million USD."
        },
        {
            "Q": "What is the toal Q1 value of box Asian Cuisine and Steak Houses?",
            "A": "The total Q1 value of box Asian Cuisine and Steak Houses is {846.0} million USD."
        },
        {
            "Q": "What is the average Q3 value of box Coffee Shops and Asian Cuisine?",
            "A": "The average Q3 value of box Coffee Shops and Asian Cuisine is {536.5} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 778.5 million USD?",
            "A": "Box{Bakeries},{Asian Cuisine},{Steak Houses} have the outliers exceed 778.5 million USD."
        },
        {
            "Q": "Which boxes have median values exceed 482.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Bakeries} has {593.0} million USD , {Steak Houses} has {489.0} million USD "
        },
        {
            "Q": "Which boxes have median values below 482.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Coffee Shops} has {443.0} million USD , {Cafeterias} has {447.0} million USD , {Asian Cuisine} has {475.0} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Coffee Shops or Asian Cuisine ",
            "A": "The median value of the {Asian Cuisine} is larger."
        },
        {
            "Q": "Which is larger, the median value of Coffee Shops, Cafeterias or Bakeries ",
            "A": "The median value of the {Bakeries} is larger."
        },
        {
            "Q": "Which is larger, the median value of Steak Houses, Bakeries, Asian Cuisine or Coffee Shops ",
            "A": "The median value of the {Bakeries} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Asian Cuisine}."
        }
    ],
    "VA": []
}