{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {3} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Asian Cuisine}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Food Courts}."
        },
        {
            "Q": "Which box is the first position to the left of the box Sushi Restaurants?",
            "A": "The first position to the left of the box Sushi Restaurants is {Asian Cuisine}."
        },
        {
            "Q": "What is the spatial relationship of box Sushi Restaurants relative to the box Asian Cuisine in terms of horizontal (left/right) direction?",
            "A": "Box Sushi Restaurants is to the {right} of the box Asian Cuisine."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Asian Cuisine}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Asian Cuisine}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Asian Cuisine}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Asian Cuisine in the box plot?",
            "A": "The median of Asian Cuisine is {610.5} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Asian Cuisine in the box plot?",
            "A": "The lower quartile (Q1) of Asian Cuisine is {389.5} million USD."
        },
        {
            "Q": "What is the lower whisker limit of Food Courts in the box plot?",
            "A": "The lower whisker limit of Food Courts is {118} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Asian Cuisine in the box plot?",
            "A": "The largest upper outlier value in Asian Cuisine is {1525}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {1525.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {118.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Asian Cuisine and Food Courts?",
            "A": "The Q3 difference between box Asian Cuisine and Food Courts is {37.5} million USD."
        },
        {
            "Q": "What is the toal Q1 value of box Asian Cuisine and Sushi Restaurants?",
            "A": "The total Q1 value of box Asian Cuisine and Sushi Restaurants is {730.0} million USD."
        },
        {
            "Q": "What is the average Q3 value of box Sushi Restaurants and Food Courts?",
            "A": "The average Q3 value of box Sushi Restaurants and Food Courts is {728.75} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 1372.5 million USD?",
            "A": "Box{Asian Cuisine},{Food Courts} have the outliers exceed 1372.5 million USD."
        },
        {
            "Q": "Which boxes have median values exceed 494.50 million USD? Please list the boxes and corresponding values.",
            "A": "{Asian Cuisine} has {610.5} million USD , {Food Courts} has {502.0} million USD "
        },
        {
            "Q": "Which boxes have median values below 494.50 million USD? Please list the boxes and corresponding values.",
            "A": "{Sushi Restaurants} has {487.0} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Food Courts or Sushi Restaurants ",
            "A": "The median value of the {Food Courts} is larger."
        },
        {
            "Q": "Which is larger, the median value of Food Courts, Sushi Restaurants or Asian Cuisine ",
            "A": "The median value of the {Asian Cuisine} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Asian Cuisine}."
        }
    ],
    "VA": []
}