{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Bars & Pubs}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Vegetarian Restaurants}."
        },
        {
            "Q": "Which box is the third position beneath the box Vegetarian Restaurants?",
            "A": "The third position beneath the box Vegetarian Restaurants is {Coffee Shops}."
        },
        {
            "Q": "What is the spatial relationship of box Vegetarian Restaurants relative to the box Asian Cuisine in terms of vertical (above/below) direction?",
            "A": "Box Vegetarian Restaurants is {above} the box Asian Cuisine."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Bars & Pubs}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Coffee Shops}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Asian Cuisine}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Food Trucks in the box plot?",
            "A": "The median of Food Trucks is {526.0} million USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Coffee Shops in the box plot?",
            "A": "The lower quartile (Q1) of Coffee Shops is {368.0} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Coffee Shops in the box plot?",
            "A": "The upper whisker limit of Coffee Shops is {1002} million USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Vegetarian Restaurants in the box plot?",
            "A": "The lowest upper outlier value in Vegetarian Restaurants is {122} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {1002.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {75.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Coffee Shops and Bars & Pubs?",
            "A": "The Q1 difference between box Coffee Shops and Bars & Pubs is {64.0} million USD."
        },
        {
            "Q": "What is the toal Q3 value of box Bars & Pubs and Vegetarian Restaurants?",
            "A": "The total Q3 value of box Bars & Pubs and Vegetarian Restaurants is {1298.0} million USD."
        },
        {
            "Q": "What is the average Q1 value of box Bars & Pubs and Vegetarian Restaurants?",
            "A": "The average Q1 value of box Bars & Pubs and Vegetarian Restaurants is {421.0} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 506.50 million USD? Please list the boxes and corresponding values.",
            "A": "{Bars & Pubs} has {562.0} million USD , {Coffee Shops} has {521.0} million USD , {Food Trucks} has {526.0} million USD "
        },
        {
            "Q": "Which boxes have median values below 506.50 million USD? Please list the boxes and corresponding values.",
            "A": "{Asian Cuisine} has {489.0} million USD , {Vegetarian Restaurants} has {492.0} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Coffee Shops or Food Trucks ",
            "A": "The median value of the {Food Trucks} is larger."
        },
        {
            "Q": "Which is larger, the median value of Vegetarian Restaurants, Food Trucks or Asian Cuisine ",
            "A": "The median value of the {Food Trucks} is larger."
        },
        {
            "Q": "Which is larger, the median value of Coffee Shops, Food Trucks, Asian Cuisine or Bars & Pubs ",
            "A": "The median value of the {Bars & Pubs} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Coffee Shops}."
        }
    ],
    "VA": []
}