{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Dessert Cafes}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Casual Dining}."
        },
        {
            "Q": "Which box is the second position to the right of the box Fine Dining?",
            "A": "The second position to the right of the box Fine Dining is {Cafeterias}."
        },
        {
            "Q": "What is the spatial relationship of box Casual Dining relative to the box Bars & Pubs in terms of horizontal (left/right) direction?",
            "A": "Box Casual Dining is to the {right} of the box Bars & Pubs."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Steak Houses}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Steak Houses}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Casual Dining}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Bars & Pubs in the box plot?",
            "A": "The median of Bars & Pubs is {458.0} million USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Casual Dining in the box plot?",
            "A": "The upper quartile (Q3) of Casual Dining is {646.25} million USD."
        },
        {
            "Q": "What is the lower whisker limit of Dessert Cafes in the box plot?",
            "A": "The lower whisker limit of Dessert Cafes is {86} million USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Casual Dining in the box plot?",
            "A": "The lowest upper outlier value in Casual Dining is {141}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {1221.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {19.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Steak Houses and Bars & Pubs?",
            "A": "The Median difference between box Steak Houses and Bars & Pubs is {170.5} million USD."
        },
        {
            "Q": "What is the toal Median value of box Dessert Cafes and Fine Dining?",
            "A": "The total Median value of box Dessert Cafes and Fine Dining is {1025.0} million USD."
        },
        {
            "Q": "What is the average Q3 value of box Fine Dining and Cafeterias?",
            "A": "The average Q3 value of box Fine Dining and Cafeterias is {692.125} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 575.25 million USD? Please list the boxes and corresponding values.",
            "A": "{Steak Houses} has {628.5} million USD , {Cafeterias} has {589.5} million USD "
        },
        {
            "Q": "Which boxes have median values below 461.00 million USD? Please list the boxes and corresponding values.",
            "A": "{Bars & Pubs} has {458.0} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Cafeterias or Steak Houses ",
            "A": "The median value of the {Steak Houses} is larger."
        },
        {
            "Q": "Which is larger, the median value of Casual Dining, Steak Houses or Fine Dining ",
            "A": "The median value of the {Steak Houses} is larger."
        },
        {
            "Q": "Which is larger, the median value of Cafeterias, Casual Dining, Dessert Cafes or Fine Dining ",
            "A": "The median value of the {Cafeterias} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Steak Houses}."
        }
    ],
    "VA": []
}