{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Mexican Restaurants}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Italian Restaurants}."
        },
        {
            "Q": "Which box is the first position to the left of the box Pizza Restaurants?",
            "A": "The first position to the left of the box Pizza Restaurants is {Ice Cream Parlors}."
        },
        {
            "Q": "What is the spatial relationship of box Italian Restaurants relative to the box Pizza Restaurants in terms of horizontal (left/right) direction?",
            "A": "Box Italian Restaurants is to the {right} of the box Pizza Restaurants."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Italian Restaurants}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Italian Restaurants}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Food Courts}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Mexican Restaurants in the box plot?",
            "A": "The median of Mexican Restaurants is {550.5} million USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Bakeries in the box plot?",
            "A": "The upper quartile (Q3) of Bakeries is {710.0} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Pizza Restaurants in the box plot?",
            "A": "The upper whisker limit of Pizza Restaurants is {1523} million USD."
        },
        {
            "Q": "What is the largest upper outlier value in Mexican Restaurants in the box plot?",
            "A": "The largest upper outlier value in Mexican Restaurants is {1379} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {1789.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {119.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Bakeries and Food Trucks?",
            "A": "The Q3 difference between box Bakeries and Food Trucks is {92.0} million USD."
        },
        {
            "Q": "What is the toal Median value of box Food Courts and Pizza Restaurants?",
            "A": "The total Median value of box Food Courts and Pizza Restaurants is {1155.5} million USD."
        },
        {
            "Q": "What is the average Median value of box Mexican Restaurants and Food Courts?",
            "A": "The average Median value of box Mexican Restaurants and Food Courts is {499.5} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 1413.9 million USD?",
            "A": "Box{Food Trucks} have the outliers exceed 1413.9 million USD."
        },
        {
            "Q": "Which boxes have median values exceed 561.25 million USD? Please list the boxes and corresponding values.",
            "A": "{Food Trucks} has {572.0} million USD , {Pizza Restaurants} has {707.0} million USD , {Italian Restaurants} has {763.5} million USD "
        },
        {
            "Q": "Which boxes have median values below 500.50 million USD? Please list the boxes and corresponding values.",
            "A": "{Bakeries} has {450.5} million USD , {Ice Cream Parlors} has {346.5} million USD , {Food Courts} has {448.5} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Italian Restaurants or Mexican Restaurants ",
            "A": "The median value of the {Italian Restaurants} is larger."
        },
        {
            "Q": "Which is larger, the median value of Pizza Restaurants, Mexican Restaurants or Food Trucks ",
            "A": "The median value of the {Pizza Restaurants} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ice Cream Parlors, Pizza Restaurants, Food Courts or Mexican Restaurants ",
            "A": "The median value of the {Pizza Restaurants} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Italian Restaurants}."
        }
    ],
    "VA": []
}