{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Ice Cream Parlors}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Bakeries}."
        },
        {
            "Q": "Which box is the second position to the left of the box Fine Dining?",
            "A": "The second position to the left of the box Fine Dining is {Asian Cuisine}."
        },
        {
            "Q": "What is the spatial relationship of box Fine Dining relative to the box Asian Cuisine in terms of horizontal (left/right) direction?",
            "A": "Box Fine Dining is to the {right} of the box Asian Cuisine."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Fine Dining}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Fine Dining}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Food Courts}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Fine Dining in the box plot?",
            "A": "The median of Fine Dining is {679.0} million USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Fine Dining in the box plot?",
            "A": "The upper quartile (Q3) of Fine Dining is {809.0} million USD."
        },
        {
            "Q": "What is the upper whisker limit of Bars & Pubs in the box plot?",
            "A": "The upper whisker limit of Bars & Pubs is {932} million USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Food Courts in the box plot?",
            "A": "The lowest upper outlier value in Food Courts is {31}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum million USD value in the box plot?",
            "A": "The global maximum million USD value in the box plot is {1118.00} million USD."
        },
        {
            "Q": "What is the global minimum million USD value in the box plot?",
            "A": "The global minimum million USD value in the box plot is {31.00} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Bars & Pubs and Food Courts?",
            "A": "The Q3 difference between box Bars & Pubs and Food Courts is {188.5} million USD."
        },
        {
            "Q": "What is the toal Q3 value of box Bakeries and Fine Dining?",
            "A": "The total Q3 value of box Bakeries and Fine Dining is {1521.25} million USD."
        },
        {
            "Q": "What is the average Q1 value of box Ice Cream Parlors and Asian Cuisine?",
            "A": "The average Q1 value of box Ice Cream Parlors and Asian Cuisine is {392.25} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 585.75 million USD? Please list the boxes and corresponding values.",
            "A": "{Bars & Pubs} has {619.5} million USD , {Fine Dining} has {679.0} million USD , {Bakeries} has {604.0} million USD "
        },
        {
            "Q": "Which boxes have median values below 585.75 million USD? Please list the boxes and corresponding values.",
            "A": "{Ice Cream Parlors} has {567.5} million USD , {Asian Cuisine} has {479.5} million USD , {Food Courts} has {435.5} million USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Bars & Pubs or Fine Dining ",
            "A": "The median value of the {Fine Dining} is larger."
        },
        {
            "Q": "Which is larger, the median value of Fine Dining, Bakeries or Bars & Pubs ",
            "A": "The median value of the {Fine Dining} is larger."
        },
        {
            "Q": "Which is larger, the median value of Food Courts, Bars & Pubs, Ice Cream Parlors or Asian Cuisine ",
            "A": "The median value of the {Bars & Pubs} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Ice Cream Parlors}."
        }
    ],
    "VA": []
}