{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Sugarcane}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Corn}."
        },
        {
            "Q": "Which box is the second position above the box Sorghum?",
            "A": "The second position above the box Sorghum is {Tea}."
        },
        {
            "Q": "What is the spatial relationship of box Tobacco relative to the box Tea in terms of vertical (above/below) direction?",
            "A": "Box Tobacco is {below} the box Tea."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Flax}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Sorghum}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Sugarcane}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Tea in the box plot?",
            "A": "The median of Tea is {4010.5} kilograms per hectare."
        },
        {
            "Q": "What is the upper quartile (Q3) of Flax in the box plot?",
            "A": "The upper quartile (Q3) of Flax is {8483.25} kilograms per hectare."
        },
        {
            "Q": "What is the lower whisker limit of Cotton in the box plot?",
            "A": "The lower whisker limit of Cotton is {1914} kilograms per hectare."
        },
        {
            "Q": "What is the lowest upper outlier value in Flax in the box plot?",
            "A": "The lowest upper outlier value in Flax is {2950}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum kilograms per hectare value in the box plot?",
            "A": "The global maximum kilograms per hectare value in the box plot is {11767.00} kilograms per hectare."
        },
        {
            "Q": "What is the global minimum kilograms per hectare value in the box plot?",
            "A": "The global minimum kilograms per hectare value in the box plot is {1035.00} kilograms per hectare."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Sugarcane and Tobacco?",
            "A": "The Q3 difference between box Sugarcane and Tobacco is {1804.0} kilograms per hectare."
        },
        {
            "Q": "What is the toal Q1 value of box Corn and Tobacco?",
            "A": "The total Q1 value of box Corn and Tobacco is {8889.5} kilograms per hectare."
        },
        {
            "Q": "What is the average Median value of box Flax and Cotton?",
            "A": "The average Median value of box Flax and Cotton is {6504.25} kilograms per hectare."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 7407.00 kilograms per hectare? Please list the boxes and corresponding values.",
            "A": "{Flax} has {7627.0} kilograms per hectare , {Sorghum} has {7475.0} kilograms per hectare "
        },
        {
            "Q": "Which boxes have median values below 4615.25 kilograms per hectare? Please list the boxes and corresponding values.",
            "A": "{Tea} has {4010.5} kilograms per hectare "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Tea or Tobacco ",
            "A": "The median value of the {Tobacco} is larger."
        },
        {
            "Q": "Which is larger, the median value of Corn, Tobacco or Tea ",
            "A": "The median value of the {Corn} is larger."
        },
        {
            "Q": "Which is larger, the median value of Sorghum, Tea, Cotton or Corn ",
            "A": "The median value of the {Sorghum} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Sorghum}."
        }
    ],
    "VA": []
}