{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Elmhurst}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Creston}."
        },
        {
            "Q": "Which box is the first position to the left of the box Springfield?",
            "A": "The first position to the left of the box Springfield is {Northgate}."
        },
        {
            "Q": "What is the spatial relationship of box Creston relative to the box Highvale in terms of horizontal (left/right) direction?",
            "A": "Box Creston is to the {right} of the box Highvale."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Dunvale}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Dunvale}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Westport}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Dunvale in the box plot?",
            "A": "The median of Dunvale is {1268.0} Number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Dunvale in the box plot?",
            "A": "The upper quartile (Q3) of Dunvale is {1451.75} Number."
        },
        {
            "Q": "What is the lower whisker limit of Dunvale in the box plot?",
            "A": "The lower whisker limit of Dunvale is {908} Number."
        },
        {
            "Q": "What is the largest upper outlier value in Northgate in the box plot?",
            "A": "The largest upper outlier value in Northgate is {1641}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number value in the box plot?",
            "A": "The global maximum Number value in the box plot is {2148.00} Number."
        },
        {
            "Q": "What is the global minimum Number value in the box plot?",
            "A": "The global minimum Number value in the box plot is {772.00} Number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Median difference between box Highvale and Northgate?",
            "A": "The Median difference between box Highvale and Northgate is {85.0} Number."
        },
        {
            "Q": "What is the toal Q3 value of box Creston and Highvale?",
            "A": "The total Q3 value of box Creston and Highvale is {2566.75} Number."
        },
        {
            "Q": "What is the average Q3 value of box Northgate and Westport?",
            "A": "The average Q3 value of box Northgate and Westport is {1185.375} Number."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 1682.1000000000001 Number?",
            "A": "Box{Elmhurst},{Springfield},{Dunvale},{Creston} have the outliers exceed 1682.1000000000001 Number."
        },
        {
            "Q": "Which boxes have median values exceed 1135.00 Number? Please list the boxes and corresponding values.",
            "A": "{Elmhurst} has {1140.0} Number , {Springfield} has {1151.0} Number , {Dunvale} has {1268.0} Number "
        },
        {
            "Q": "Which boxes have median values below 1056.75 Number? Please list the boxes and corresponding values.",
            "A": "{Northgate} has {1045.0} Number , {Westport} has {1041.5} Number "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Westport or Springfield ",
            "A": "The median value of the {Springfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Elmhurst, Northgate or Springfield ",
            "A": "The median value of the {Springfield} is larger."
        },
        {
            "Q": "Which is larger, the median value of Creston, Springfield, Dunvale or Westport ",
            "A": "The median value of the {Dunvale} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Elmhurst}."
        }
    ],
    "VA": []
}