{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {3} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Ashford}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Brookfield}."
        },
        {
            "Q": "Which box is the second position to the left of the box Brookfield?",
            "A": "The second position to the left of the box Brookfield is {Ashford}."
        },
        {
            "Q": "What is the spatial relationship of box Ashford relative to the box Brookfield in terms of horizontal (left/right) direction?",
            "A": "Box Ashford is to the {left} of the box Brookfield."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Ashford}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Ashford}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Highvale}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Highvale in the box plot?",
            "A": "The median of Highvale is {1159.5} Number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Ashford in the box plot?",
            "A": "The upper quartile (Q3) of Ashford is {1494.25} Number."
        },
        {
            "Q": "What is the upper whisker limit of Highvale in the box plot?",
            "A": "The upper whisker limit of Highvale is {1673} Number."
        },
        {
            "Q": "What is the largest upper outlier value in Highvale in the box plot?",
            "A": "The largest upper outlier value in Highvale is {1867} Number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number value in the box plot?",
            "A": "The global maximum Number value in the box plot is {1995.00} Number."
        },
        {
            "Q": "What is the global minimum Number value in the box plot?",
            "A": "The global minimum Number value in the box plot is {753.00} Number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Brookfield and Highvale?",
            "A": "The Q1 difference between box Brookfield and Highvale is {127.25} Number."
        },
        {
            "Q": "What is the toal Median value of box Highvale and Brookfield?",
            "A": "The total Median value of box Highvale and Brookfield is {2186.5} Number."
        },
        {
            "Q": "What is the average Median value of box Ashford and Highvale?",
            "A": "The average Median value of box Ashford and Highvale is {1204.5} Number."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 1651.5 Number?",
            "A": "Box{Highvale},{Brookfield} have the outliers exceed 1651.5 Number."
        },
        {
            "Q": "Which boxes have median values exceed 1093.25 Number? Please list the boxes and corresponding values.",
            "A": "{Ashford} has {1249.5} Number , {Highvale} has {1159.5} Number "
        },
        {
            "Q": "Which boxes have median values below 1093.25 Number? Please list the boxes and corresponding values.",
            "A": "{Brookfield} has {1027.0} Number "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Brookfield or Ashford ",
            "A": "The median value of the {Ashford} is larger."
        },
        {
            "Q": "Which is larger, the median value of Highvale, Brookfield or Ashford ",
            "A": "The median value of the {Ashford} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Ashford}."
        }
    ],
    "VA": []
}