{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Mapleton}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Springfield}."
        },
        {
            "Q": "Which box is the second position to the left of the box Highvale?",
            "A": "The second position to the left of the box Highvale is {Mapleton}."
        },
        {
            "Q": "What is the spatial relationship of box Springfield relative to the box Creston in terms of horizontal (left/right) direction?",
            "A": "Box Springfield is to the {right} of the box Creston."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Mapleton}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Mapleton}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Lakeview}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Highvale in the box plot?",
            "A": "The median of Highvale is {1233.5} Number."
        },
        {
            "Q": "What is the upper quartile (Q3) of Lakeview in the box plot?",
            "A": "The upper quartile (Q3) of Lakeview is {1102.5} Number."
        },
        {
            "Q": "What is the lower whisker limit of Highvale in the box plot?",
            "A": "The lower whisker limit of Highvale is {500} Number."
        },
        {
            "Q": "What is the lowest upper outlier value in Highvale in the box plot?",
            "A": "The lowest upper outlier value in Highvale is {179} Number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number value in the box plot?",
            "A": "The global maximum Number value in the box plot is {2090.00} Number."
        },
        {
            "Q": "What is the global minimum Number value in the box plot?",
            "A": "The global minimum Number value in the box plot is {42.00} Number."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Creston and Springfield?",
            "A": "The Q1 difference between box Creston and Springfield is {53.75} Number."
        },
        {
            "Q": "What is the toal Median value of box Mapleton and Creston?",
            "A": "The total Median value of box Mapleton and Creston is {2201.5} Number."
        },
        {
            "Q": "What is the average Q1 value of box Springfield and Mapleton?",
            "A": "The average Q1 value of box Springfield and Mapleton is {881.625} Number."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 1239.75 Number? Please list the boxes and corresponding values.",
            "A": "{Mapleton} has {1246.0} Number "
        },
        {
            "Q": "Which boxes have median values below 1107.75 Number? Please list the boxes and corresponding values.",
            "A": "{Creston} has {955.5} Number , {Lakeview} has {920.5} Number , {Springfield} has {982.0} Number "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Creston or Highvale ",
            "A": "The median value of the {Highvale} is larger."
        },
        {
            "Q": "Which is larger, the median value of Mapleton, Springfield or Lakeview ",
            "A": "The median value of the {Mapleton} is larger."
        },
        {
            "Q": "Which is larger, the median value of Springfield, Mapleton, Creston or Highvale ",
            "A": "The median value of the {Mapleton} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Creston}."
        }
    ],
    "VA": []
}