{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {3} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Cotton}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Tea}."
        },
        {
            "Q": "Which box is the first position to the left of the box Tea?",
            "A": "The first position to the left of the box Tea is {Rye}."
        },
        {
            "Q": "What is the spatial relationship of box Cotton relative to the box Tea in terms of horizontal (left/right) direction?",
            "A": "Box Cotton is to the {left} of the box Tea."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Tea}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Tea}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Rye}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Cotton in the box plot?",
            "A": "The median of Cotton is {5455.5} kilograms per hectare."
        },
        {
            "Q": "What is the lower quartile (Q1) of Rye in the box plot?",
            "A": "The lower quartile (Q1) of Rye is {3816.75} kilograms per hectare."
        },
        {
            "Q": "What is the upper whisker limit of Tea in the box plot?",
            "A": "The upper whisker limit of Tea is {14380} kilograms per hectare."
        },
        {
            "Q": "What is the largest upper outlier value in Rye in the box plot?",
            "A": "The largest upper outlier value in Rye is {12030}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum kilograms per hectare value in the box plot?",
            "A": "The global maximum kilograms per hectare value in the box plot is {14380.00} kilograms per hectare."
        },
        {
            "Q": "What is the global minimum kilograms per hectare value in the box plot?",
            "A": "The global minimum kilograms per hectare value in the box plot is {2019.00} kilograms per hectare."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Rye and Tea?",
            "A": "The Q3 difference between box Rye and Tea is {2631.0} kilograms per hectare."
        },
        {
            "Q": "What is the toal Q3 value of box Tea and Cotton?",
            "A": "The total Q3 value of box Tea and Cotton is {16732.25} kilograms per hectare."
        },
        {
            "Q": "What is the average Q1 value of box Rye and Tea?",
            "A": "The average Q1 value of box Rye and Tea is {4570.875} kilograms per hectare."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 10827.0 kilograms per hectare?",
            "A": "Box{Rye} have the outliers exceed 10827.0 kilograms per hectare."
        },
        {
            "Q": "Which boxes have median values exceed 5100.25 kilograms per hectare? Please list the boxes and corresponding values.",
            "A": "{Cotton} has {5455.5} kilograms per hectare , {Tea} has {7214.5} kilograms per hectare "
        },
        {
            "Q": "Which boxes have median values below 5100.25 kilograms per hectare? Please list the boxes and corresponding values.",
            "A": "{Rye} has {4745.0} kilograms per hectare "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Tea or Rye ",
            "A": "The median value of the {Tea} is larger."
        },
        {
            "Q": "Which is larger, the median value of Tea, Cotton or Rye ",
            "A": "The median value of the {Tea} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Tea}."
        }
    ],
    "VA": []
}