{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Yorkton}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Westport}."
        },
        {
            "Q": "Which box is the first position to the left of the box Westport?",
            "A": "The first position to the left of the box Westport is {Oakridge}."
        },
        {
            "Q": "What is the spatial relationship of box Ashford relative to the box Oakridge in terms of horizontal (left/right) direction?",
            "A": "Box Ashford is to the {left} of the box Oakridge."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Ashford}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Ashford}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Oakridge}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Ashford in the box plot?",
            "A": "The median of Ashford is {54184.5} USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Elmhurst in the box plot?",
            "A": "The lower quartile (Q1) of Elmhurst is {41642.75} USD."
        },
        {
            "Q": "What is the lower whisker limit of Oakridge in the box plot?",
            "A": "The lower whisker limit of Oakridge is {29306} USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Oakridge in the box plot?",
            "A": "The lowest upper outlier value in Oakridge is {26937} USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the box plot?",
            "A": "The global maximum USD value in the box plot is {79671.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the box plot?",
            "A": "The global minimum USD value in the box plot is {16283.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Elmhurst and Westport?",
            "A": "The Q1 difference between box Elmhurst and Westport is {124.5} USD."
        },
        {
            "Q": "What is the toal Q1 value of box Elmhurst and Oakridge?",
            "A": "The total Q1 value of box Elmhurst and Oakridge is {84789.75} USD."
        },
        {
            "Q": "What is the average Median value of box Oakridge and Elmhurst?",
            "A": "The average Median value of box Oakridge and Elmhurst is {47342.75} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 51163.75 USD? Please list the boxes and corresponding values.",
            "A": "{Ashford} has {54184.5} USD "
        },
        {
            "Q": "Which boxes have median values below 45617.75 USD? Please list the boxes and corresponding values.",
            "A": "{Yorkton} has {44062.0} USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Elmhurst or Ashford ",
            "A": "The median value of the {Ashford} is larger."
        },
        {
            "Q": "Which is larger, the median value of Ashford, Elmhurst or Westport ",
            "A": "The median value of the {Ashford} is larger."
        },
        {
            "Q": "Which is larger, the median value of Oakridge, Yorkton, Ashford or Elmhurst ",
            "A": "The median value of the {Ashford} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Ashford}."
        }
    ],
    "VA": []
}