{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Glenhaven}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Zephyr}."
        },
        {
            "Q": "Which box is the first position to the left of the box Elmhurst?",
            "A": "The first position to the left of the box Elmhurst is {Oakridge}."
        },
        {
            "Q": "What is the spatial relationship of box Oakridge relative to the box Zephyr in terms of horizontal (left/right) direction?",
            "A": "Box Oakridge is to the {left} of the box Zephyr."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Lakeview}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Elmhurst}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Glenhaven}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Springfield in the box plot?",
            "A": "The median of Springfield is {45686.0} USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Lakeview in the box plot?",
            "A": "The lower quartile (Q1) of Lakeview is {43452.25} USD."
        },
        {
            "Q": "What is the lower whisker limit of Elmhurst in the box plot?",
            "A": "The lower whisker limit of Elmhurst is {24391} USD."
        },
        {
            "Q": "What is the largest upper outlier value in Quarryville in the box plot?",
            "A": "The largest upper outlier value in Quarryville is {121053} USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the box plot?",
            "A": "The global maximum USD value in the box plot is {133549.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the box plot?",
            "A": "The global minimum USD value in the box plot is {18306.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Oakridge and Glenhaven?",
            "A": "The Q1 difference between box Oakridge and Glenhaven is {4265.75} USD."
        },
        {
            "Q": "What is the toal Q1 value of box Zephyr and Elmhurst?",
            "A": "The total Q1 value of box Zephyr and Elmhurst is {76075.75} USD."
        },
        {
            "Q": "What is the average Q1 value of box Elmhurst and Glenhaven?",
            "A": "The average Q1 value of box Elmhurst and Glenhaven is {38230.75} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 120194.1 USD?",
            "A": "Box{Quarryville},{Lakeview} have the outliers exceed 120194.1 USD."
        },
        {
            "Q": "Which boxes have median values exceed 53595.50 USD? Please list the boxes and corresponding values.",
            "A": "{Elmhurst} has {54592.5} USD , {Lakeview} has {58388.5} USD "
        },
        {
            "Q": "Which boxes have median values below 42235.25 USD? Please list the boxes and corresponding values.",
            "A": "{Zephyr} has {41915.0} USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Oakridge or Glenhaven ",
            "A": "The median value of the {Oakridge} is larger."
        },
        {
            "Q": "Which is larger, the median value of Elmhurst, Zephyr or Quarryville ",
            "A": "The median value of the {Elmhurst} is larger."
        },
        {
            "Q": "Which is larger, the median value of Elmhurst, Quarryville, Zephyr or Springfield ",
            "A": "The median value of the {Elmhurst} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Elmhurst}."
        }
    ],
    "VA": []
}