{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {7} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Brookfield}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Westport}."
        },
        {
            "Q": "Which box is the first position to the left of the box Fairmont?",
            "A": "The first position to the left of the box Fairmont is {Pinehaven}."
        },
        {
            "Q": "What is the spatial relationship of box Fairmont relative to the box Westport in terms of horizontal (left/right) direction?",
            "A": "Box Fairmont is to the {left} of the box Westport."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Pinehaven}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Pinehaven}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Ashford}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Yorkton in the box plot?",
            "A": "The median of Yorkton is {48039.0} USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Yorkton in the box plot?",
            "A": "The upper quartile (Q3) of Yorkton is {58485.0} USD."
        },
        {
            "Q": "What is the lower whisker limit of Pinehaven in the box plot?",
            "A": "The lower whisker limit of Pinehaven is {36347} USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Brookfield in the box plot?",
            "A": "The lowest upper outlier value in Brookfield is {10790}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the box plot?",
            "A": "The global maximum USD value in the box plot is {95023.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the box plot?",
            "A": "The global minimum USD value in the box plot is {243.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Yorkton and Brookfield?",
            "A": "The Q1 difference between box Yorkton and Brookfield is {5494.5} USD."
        },
        {
            "Q": "What is the toal Median value of box Brookfield and Elmhurst?",
            "A": "The total Median value of box Brookfield and Elmhurst is {101852.5} USD."
        },
        {
            "Q": "What is the average Median value of box Yorkton and Elmhurst?",
            "A": "The average Median value of box Yorkton and Elmhurst is {49335.5} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 73332.90000000001 USD?",
            "A": "Box{Ashford} have the outliers exceed 73332.90000000001 USD."
        },
        {
            "Q": "Which boxes have median values exceed 50926.25 USD? Please list the boxes and corresponding values.",
            "A": "{Brookfield} has {51220.5} USD , {Pinehaven} has {62344.5} USD , {Westport} has {59207.5} USD "
        },
        {
            "Q": "Which boxes have median values below 49335.50 USD? Please list the boxes and corresponding values.",
            "A": "{Ashford} has {47133.5} USD , {Fairmont} has {34170.0} USD , {Yorkton} has {48039.0} USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Ashford or Westport ",
            "A": "The median value of the {Westport} is larger."
        },
        {
            "Q": "Which is larger, the median value of Fairmont, Westport or Ashford ",
            "A": "The median value of the {Westport} is larger."
        },
        {
            "Q": "Which is larger, the median value of Brookfield, Ashford, Yorkton or Fairmont ",
            "A": "The median value of the {Brookfield} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Elmhurst}."
        }
    ],
    "VA": []
}