{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {4} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {horizontal} box plot."
        },
        {
            "Q": "Which box does the bottom box represent?",
            "A": "The bottom box represents {Pinehaven}"
        },
        {
            "Q": "Which box does the topmost box represent?",
            "A": "The topmost box represents {Ashford}."
        },
        {
            "Q": "Which box is the first position above the box Westport?",
            "A": "The first position above the box Westport is {Ashford}."
        },
        {
            "Q": "What is the spatial relationship of box Northgate relative to the box Ashford in terms of vertical (above/below) direction?",
            "A": "Box Northgate is {below} the box Ashford."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Ashford}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Ashford}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Westport}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Ashford in the box plot?",
            "A": "The median of Ashford is {58136.0} USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Ashford in the box plot?",
            "A": "The upper quartile (Q3) of Ashford is {65172.25} USD."
        },
        {
            "Q": "What is the upper whisker limit of Westport in the box plot?",
            "A": "The upper whisker limit of Westport is {63063} USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Northgate in the box plot?",
            "A": "The lowest upper outlier value in Northgate is {21474} USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum USD value in the box plot?",
            "A": "The global maximum USD value in the box plot is {85309.00} USD."
        },
        {
            "Q": "What is the global minimum USD value in the box plot?",
            "A": "The global minimum USD value in the box plot is {19097.00} USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Pinehaven and Northgate?",
            "A": "The Q1 difference between box Pinehaven and Northgate is {953.25} USD."
        },
        {
            "Q": "What is the toal Q3 value of box Northgate and Ashford?",
            "A": "The total Q3 value of box Northgate and Ashford is {112412.75} USD."
        },
        {
            "Q": "What is the average Median value of box Ashford and Pinehaven?",
            "A": "The average Median value of box Ashford and Pinehaven is {52343.25} USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 52386.50 USD? Please list the boxes and corresponding values.",
            "A": "{Ashford} has {58136.0} USD "
        },
        {
            "Q": "Which boxes have median values below 46593.75 USD? Please list the boxes and corresponding values.",
            "A": "{Pinehaven} has {46550.5} USD , {Northgate} has {42879.5} USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Ashford or Northgate ",
            "A": "The median value of the {Ashford} is larger."
        },
        {
            "Q": "Which is larger, the median value of Northgate, Ashford or Pinehaven ",
            "A": "The median value of the {Ashford} is larger."
        },
        {
            "Q": "Which is larger, the median value of Pinehaven, Northgate, Westport or Ashford ",
            "A": "The median value of the {Ashford} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Ashford}."
        }
    ],
    "VA": []
}