{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {5} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Co-op}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Townhouse}."
        },
        {
            "Q": "Which box is the first position to the right of the box Urban Loft?",
            "A": "The first position to the right of the box Urban Loft is {Townhouse}."
        },
        {
            "Q": "What is the spatial relationship of box Duplex relative to the box Co-op in terms of horizontal (left/right) direction?",
            "A": "Box Duplex is to the {right} of the box Co-op."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Duplex}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Duplex}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Urban Loft}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Duplex in the box plot?",
            "A": "The median of Duplex is {673.0} thousand USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Triplex in the box plot?",
            "A": "The upper quartile (Q3) of Triplex is {825.0} thousand USD."
        },
        {
            "Q": "What is the upper whisker limit of Co-op in the box plot?",
            "A": "The upper whisker limit of Co-op is {1327} thousand USD."
        },
        {
            "Q": "What is the largest upper outlier value in Co-op in the box plot?",
            "A": "The largest upper outlier value in Co-op is {1436}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum thousand USD value in the box plot?",
            "A": "The global maximum thousand USD value in the box plot is {1670.00} thousand USD."
        },
        {
            "Q": "What is the global minimum thousand USD value in the box plot?",
            "A": "The global minimum thousand USD value in the box plot is {289.00} thousand USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Urban Loft and Duplex?",
            "A": "The Q1 difference between box Urban Loft and Duplex is {18.0} thousand USD."
        },
        {
            "Q": "What is the toal Q1 value of box Duplex and Urban Loft?",
            "A": "The total Q1 value of box Duplex and Urban Loft is {1005.0} thousand USD."
        },
        {
            "Q": "What is the average Q3 value of box Townhouse and Duplex?",
            "A": "The average Q3 value of box Townhouse and Duplex is {805.625} thousand USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 1219.5 thousand USD?",
            "A": "Box{Co-op},{Duplex},{Triplex},{Urban Loft},{Townhouse} have the outliers exceed 1219.5 thousand USD."
        },
        {
            "Q": "Which boxes have median values exceed 656.25 thousand USD? Please list the boxes and corresponding values.",
            "A": "{Duplex} has {673.0} thousand USD "
        },
        {
            "Q": "Which boxes have median values below 614.00 thousand USD? Please list the boxes and corresponding values.",
            "A": "{Urban Loft} has {590.0} thousand USD , {Townhouse} has {585.0} thousand USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Triplex or Urban Loft ",
            "A": "The median value of the {Triplex} is larger."
        },
        {
            "Q": "Which is larger, the median value of Triplex, Urban Loft or Townhouse ",
            "A": "The median value of the {Triplex} is larger."
        },
        {
            "Q": "Which is larger, the median value of Duplex, Triplex, Townhouse or Urban Loft ",
            "A": "The median value of the {Duplex} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Co-op}."
        }
    ],
    "VA": []
}