{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Music}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Baby}."
        },
        {
            "Q": "Which box is the first position to the left of the box Pet Supplies?",
            "A": "The first position to the left of the box Pet Supplies is {Music}."
        },
        {
            "Q": "What is the spatial relationship of box Baby relative to the box Office Supplies in terms of horizontal (left/right) direction?",
            "A": "Box Baby is to the {right} of the box Office Supplies."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Office Supplies}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Pet Supplies}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Jewelry}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Office Supplies in the box plot?",
            "A": "The median of Office Supplies is {339.5} thousand USD."
        },
        {
            "Q": "What is the lower quartile (Q1) of Office Supplies in the box plot?",
            "A": "The lower quartile (Q1) of Office Supplies is {293.25} thousand USD."
        },
        {
            "Q": "What is the lower whisker limit of Music in the box plot?",
            "A": "The lower whisker limit of Music is {131} thousand USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Pet Supplies in the box plot?",
            "A": "The lowest upper outlier value in Pet Supplies is {164} thousand USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum thousand USD value in the box plot?",
            "A": "The global maximum thousand USD value in the box plot is {462.00} thousand USD."
        },
        {
            "Q": "What is the global minimum thousand USD value in the box plot?",
            "A": "The global minimum thousand USD value in the box plot is {91.00} thousand USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q3 difference between box Baby and Pet Supplies?",
            "A": "The Q3 difference between box Baby and Pet Supplies is {100.25} thousand USD."
        },
        {
            "Q": "What is the toal Q1 value of box Automotive and Pet Supplies?",
            "A": "The total Q1 value of box Automotive and Pet Supplies is {547.0} thousand USD."
        },
        {
            "Q": "What is the average Q3 value of box Pet Supplies and Jewelry?",
            "A": "The average Q3 value of box Pet Supplies and Jewelry is {351.375} thousand USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 320.75 thousand USD? Please list the boxes and corresponding values.",
            "A": "{Pet Supplies} has {338.5} thousand USD , {Office Supplies} has {339.5} thousand USD "
        },
        {
            "Q": "Which boxes have median values below 266.25 thousand USD? Please list the boxes and corresponding values.",
            "A": "{Music} has {225.5} thousand USD , {Baby} has {242.5} thousand USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Baby or Automotive ",
            "A": "The median value of the {Automotive} is larger."
        },
        {
            "Q": "Which is larger, the median value of Music, Automotive or Office Supplies ",
            "A": "The median value of the {Office Supplies} is larger."
        },
        {
            "Q": "Which is larger, the median value of Office Supplies, Baby, Jewelry or Pet Supplies ",
            "A": "The median value of the {Office Supplies} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Automotive}."
        }
    ],
    "VA": []
}