{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {6} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Garden}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Automotive}."
        },
        {
            "Q": "Which box is the second position to the left of the box Art?",
            "A": "The second position to the left of the box Art is {Garden}."
        },
        {
            "Q": "What is the spatial relationship of box Art relative to the box Garden in terms of horizontal (left/right) direction?",
            "A": "Box Art is to the {right} of the box Garden."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Home Decor}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Home Decor}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Automotive}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Automotive in the box plot?",
            "A": "The median of Automotive is {248.0} thousand USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Garden in the box plot?",
            "A": "The upper quartile (Q3) of Garden is {349.0} thousand USD."
        },
        {
            "Q": "What is the upper whisker limit of Pet Supplies in the box plot?",
            "A": "The upper whisker limit of Pet Supplies is {413} thousand USD."
        },
        {
            "Q": "What is the largest upper outlier value in Art in the box plot?",
            "A": "The largest upper outlier value in Art is {415} thousand USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum thousand USD value in the box plot?",
            "A": "The global maximum thousand USD value in the box plot is {471.00} thousand USD."
        },
        {
            "Q": "What is the global minimum thousand USD value in the box plot?",
            "A": "The global minimum thousand USD value in the box plot is {25.00} thousand USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Garden and Art?",
            "A": "The Q1 difference between box Garden and Art is {97.0} thousand USD."
        },
        {
            "Q": "What is the toal Median value of box Garden and Furniture?",
            "A": "The total Median value of box Garden and Furniture is {532.0} thousand USD."
        },
        {
            "Q": "What is the average Q1 value of box Automotive and Garden?",
            "A": "The average Q1 value of box Automotive and Garden is {246.5} thousand USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes in the box plot have outliers that exceed 307.8 thousand USD?",
            "A": "Box{Furniture},{Art} have the outliers exceed 307.8 thousand USD."
        },
        {
            "Q": "Which boxes have median values exceed 264.50 thousand USD? Please list the boxes and corresponding values.",
            "A": "{Garden} has {314.0} thousand USD , {Home Decor} has {317.0} thousand USD , {Pet Supplies} has {281.0} thousand USD "
        },
        {
            "Q": "Which boxes have median values below 233.00 thousand USD? Please list the boxes and corresponding values.",
            "A": "{Furniture} has {218.0} thousand USD , {Art} has {218.0} thousand USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Furniture or Home Decor ",
            "A": "The median value of the {Home Decor} is larger."
        },
        {
            "Q": "Which is larger, the median value of Home Decor, Art or Pet Supplies ",
            "A": "The median value of the {Home Decor} is larger."
        },
        {
            "Q": "Which is larger, the median value of Home Decor, Garden, Pet Supplies or Automotive ",
            "A": "The median value of the {Home Decor} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Home Decor}."
        }
    ],
    "VA": []
}