{
    "CTR": [
        {
            "Q": "What type of plot is this?",
            "A": "This chart is a {box plot}."
        }
    ],
    "VEC": [
        {
            "Q": "How many boxes are in this box plot?",
            "A": "There are {2} boxes."
        }
    ],
    "SRP": [
        {
            "Q": "Is this box chart a horizontal box plot or a vertical box plot?",
            "A": "The box plot is a {vertical} box plot."
        },
        {
            "Q": "Which box does the leftmost box represent?",
            "A": "The leftmost box represents {Movies}"
        },
        {
            "Q": "Which box does the rightmost box represent?",
            "A": "The rightmost box represents {Office Supplies}."
        },
        {
            "Q": "Which box is the first position to the left of the box Office Supplies?",
            "A": "The first position to the left of the box Office Supplies is {Movies}."
        },
        {
            "Q": "What is the spatial relationship of box Movies relative to the box Office Supplies in terms of horizontal (left/right) direction?",
            "A": "Box Movies is to the {left} of the box Office Supplies."
        }
    ],
    "VPR": [
        {
            "Q": "Which box has the largest median in this box plot?",
            "A": "The box with the largest median is {Office Supplies}."
        },
        {
            "Q": "Which box has the highest upper quartile (Q3) in this box plot?",
            "A": "The box with the highest Q3 is {Office Supplies}."
        },
        {
            "Q": "Which box has the Minimum IQR of data?",
            "A": "The box with the Minimum IQR is {Office Supplies}."
        }
    ],
    "VE": [
        {
            "Q": "What is the median of Movies in the box plot?",
            "A": "The median of Movies is {286.0} thousand USD."
        },
        {
            "Q": "What is the upper quartile (Q3) of Movies in the box plot?",
            "A": "The upper quartile (Q3) of Movies is {333.25} thousand USD."
        },
        {
            "Q": "What is the lower whisker limit of Movies in the box plot?",
            "A": "The lower whisker limit of Movies is {167} thousand USD."
        },
        {
            "Q": "What is the lowest upper outlier value in Movies in the box plot?",
            "A": "The lowest upper outlier value in Movies is {36} thousand USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum thousand USD value in the box plot?",
            "A": "The global maximum thousand USD value in the box plot is {448.00} thousand USD."
        },
        {
            "Q": "What is the global minimum thousand USD value in the box plot?",
            "A": "The global minimum thousand USD value in the box plot is {36.00} thousand USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the Q1 difference between box Movies and Office Supplies?",
            "A": "The Q1 difference between box Movies and Office Supplies is {93.75} thousand USD."
        },
        {
            "Q": "What is the toal Q1 value of box Movies and Office Supplies?",
            "A": "The total Q1 value of box Movies and Office Supplies is {550.25} thousand USD."
        },
        {
            "Q": "What is the average Median value of box Office Supplies and Movies?",
            "A": "The average Median value of box Office Supplies and Movies is {318.25} thousand USD."
        }
    ],
    "NF": [
        {
            "Q": "Which boxes have median values exceed 318.25 thousand USD? Please list the boxes and corresponding values.",
            "A": "{Office Supplies} has {350.5} thousand USD "
        },
        {
            "Q": "Which boxes have median values below 318.25 thousand USD? Please list the boxes and corresponding values.",
            "A": "{Movies} has {286.0} thousand USD "
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the median value of Office Supplies or Movies ",
            "A": "The median value of the {Office Supplies} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the box plot, which group has the largest difference between the maximum non-outlier value (upper whisker) and the minimum non-outlier value (lower whisker)?",
            "A": "The group with the largest whisker span is {Movies}."
        }
    ],
    "VA": []
}