{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {2} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On NovaTech Solutions, what is the spatial relationship of the data point in 2005 relative to that in 1994 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On NovaTech Solutions, the data point in 2005 is {below} and to the {right} of the data point in 1994."
        },
        {
            "Q": "In 1998, what is the vertical (above/below) relationship of the line representing Aegis Corp relative to NovaTech Solutions?",
            "A": "In 1998, Aegis Corp is {above} NovaTech Solutions in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Aegis Corp's Debt to Equity Ratio levels?",
            "A": "Aegis Corp's debt to equity ratio levels show a {single peak} trend."
        },
        {
            "Q": "What is the trend of NovaTech Solutions's Debt to Equity Ratio levels?",
            "A": "NovaTech Solutions's debt to equity ratio levels show a {exponential falling} trend."
        },
        {
            "Q": "Which line shows a single peak trend in Debt to Equity Ratio levels?",
            "A": "{Aegis Corp}."
        },
        {
            "Q": "Which line shows a exponential falling trend in Debt to Equity Ratio levels?",
            "A": "{NovaTech Solutions}."
        }
    ],
    "VE": [
        {
            "Q": "What is Aegis Corp's Debt to Equity Ratio in 1989?",
            "A": "Aegis Corp's debt to equity ratio in 1989 is {0.29} ratio."
        },
        {
            "Q": "What is NovaTech Solutions's Debt to Equity Ratio in 2000?",
            "A": "NovaTech Solutions's debt to equity ratio in 2000 is {0.11} ratio."
        },
        {
            "Q": "What is NovaTech Solutions's Debt to Equity Ratio in 2008?",
            "A": "NovaTech Solutions's debt to equity ratio in 2008 is {0.05} ratio."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Debt to Equity Ratio in the line chart?",
            "A": "The global minimum debt to equity ratio is {0.04} ratio."
        },
        {
            "Q": "What is the global maximum Debt to Equity Ratio in the line chart?",
            "A": "The global maximum debt to equity ratio is {0.45} ratio."
        },
        {
            "Q": "What is the highest Debt to Equity Ratio level recorded for Aegis Corp?",
            "A": "Aegis Corp reached approximately {0.45} ratio in {1998}."
        },
        {
            "Q": "What is the lowest Debt to Equity Ratio level recorded for Aegis Corp?",
            "A": "Aegis Corp's lowest recorded level is approximately {0.28} ratio in {1988}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Aegis Corp's Debt to Equity Ratio?",
            "A": "The average value of Aegis Corp's debt to equity ratio is {0.36} ratio."
        },
        {
            "Q": "What is the rate of change in NovaTech Solutions's Debt to Equity Ratio from the starting year to the final year?",
            "A": "The rate of decline in NovaTech Solutions's debt to equity ratio is {-89.47}%."
        },
        {
            "Q": "What is the rate of change in Aegis Corp's Debt to Equity Ratio from the starting year to the final year?",
            "A": "The rate of no change in Aegis Corp's debt to equity ratio is {0.00}%."
        },
        {
            "Q": "What is the average value of NovaTech Solutions's Debt to Equity Ratio?",
            "A": "The average value of NovaTech Solutions's debt to equity ratio is {0.15} ratio."
        }
    ],
    "NF": [
        {
            "Q": "In the year 2009, which lines had Debt to Equity Ratio below 0 ratio? Please list the lines and corresponding values.",
            "A": "{NovaTech Solutions} had {0} ratio."
        },
        {
            "Q": "Which years did NovaTech Solutions's Debt to Equity Ratio between 0 and 0 ratio? Please list the years and corresponding values.",
            "A": "{0.20} ratio in {1994} year, {0.09} ratio in {2002} year, {0.13} ratio in {1998} year."
        },
        {
            "Q": "In the year 2007, which line had Debt to Equity Ratio exceed 0 ratio? Please list the lines and corresponding values.",
            "A": "{Aegis Corp} had {0} ratio."
        },
        {
            "Q": "Which years did NovaTech Solutions's Debt to Equity Ratio exceed 0 ratio? Please list the years and corresponding values.",
            "A": "{0.31} ratio in {1990} year, {0.28} ratio in {1991} year, {0.38} ratio in {1988} year."
        }
    ],
    "NC": [
        {
            "Q": "Between 1989 and 2000, which line had a higher average Debt to Equity Ratio, Aegis Corp or NovaTech Solutions?",
            "A": "{Aegis Corp} had a higher average debt to equity ratio."
        },
        {
            "Q": "Between 2002 and 2008, which line experienced a larger change in Debt to Equity Ratio, Aegis Corp or NovaTech Solutions?",
            "A": "{Aegis Corp} experienced a larger change in debt to equity ratio."
        },
        {
            "Q": "Was NovaTech Solutions's Debt to Equity Ratio in 2005 higher or lower than in 2010?",
            "A": "The debt to equity ratio in 2005 was {higher} than in 2010."
        },
        {
            "Q": "In 2004, which line had a higher Debt to Equity Ratio, {Aegis Corp} or {NovaTech Solutions}?",
            "A": "In 2004, {Aegis Corp} had a higher debt to equity ratio."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {NovaTech Solutions}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1990 and 2004?",
            "A": "{Aegis Corp} has the fastest average growth rate between 1990 and 2004."
        },
        {
            "Q": "In which year did Aegis Corp first surpass NovaTech Solutions?",
            "A": "Aegis Corp first surpassed NovaTech Solutions in the year {1991}."
        },
        {
            "Q": "Which label had the leading debt to equity ratio since 2000?",
            "A": "Since 2000, {Aegis Corp} had the leading debt to equity ratio."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the NovaTech Solutions. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1988, 2010}."
        }
    ]
}