{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {3} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 2010, what is the vertical (above/below) relationship of the line representing NovaTech Solutions relative to Vanguard Dynamics?",
            "A": "In 2010, NovaTech Solutions is {above} Vanguard Dynamics in the vertical direction."
        },
        {
            "Q": "On Vanguard Dynamics, what is the spatial relationship of the data point in 2004 relative to that in 1999 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Vanguard Dynamics, the data point in 2004 is {below} and to the {right} of the data point in 1999."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Vanguard Dynamics's Revenue Growth levels?",
            "A": "Vanguard Dynamics's revenue growth levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of NovaTech Solutions's Revenue Growth levels?",
            "A": "NovaTech Solutions's revenue growth levels show a {single peak} trend."
        },
        {
            "Q": "What is the trend of Starlight Innovations's Revenue Growth levels?",
            "A": "Starlight Innovations's revenue growth levels show a {stable falling} trend."
        },
        {
            "Q": "Which line shows a volatile falling trend in Revenue Growth levels?",
            "A": "{Vanguard Dynamics}."
        }
    ],
    "VE": [
        {
            "Q": "What is NovaTech Solutions's Revenue Growth in 2003?",
            "A": "NovaTech Solutions's revenue growth in 2003 is {24679955.63} $."
        },
        {
            "Q": "What is Vanguard Dynamics's Revenue Growth in 2003?",
            "A": "Vanguard Dynamics's revenue growth in 2003 is {4538328.19} $."
        },
        {
            "Q": "What is NovaTech Solutions's Revenue Growth in 1998?",
            "A": "NovaTech Solutions's revenue growth in 1998 is {20599128.58} $."
        },
        {
            "Q": "What are the revenue growth of Starlight Innovations, Vanguard Dynamics, and NovaTech Solutions in 2012?",
            "A": "Starlight Innovations's revenue growth is {13563803.42} $, Vanguard Dynamics's revenue growth is {83891.77} $, NovaTech Solutions's revenue growth is {16331440.30} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Revenue Growth in the line chart?",
            "A": "The global minimum revenue growth is {83891.77} $."
        },
        {
            "Q": "What is the global maximum Revenue Growth in the line chart?",
            "A": "The global maximum revenue growth is {24679955.63} $."
        },
        {
            "Q": "What is the highest Revenue Growth level recorded for NovaTech Solutions?",
            "A": "NovaTech Solutions reached approximately {24679955.63} $ in {2003}."
        },
        {
            "Q": "What is the lowest Revenue Growth level recorded for NovaTech Solutions?",
            "A": "NovaTech Solutions's lowest recorded level is approximately {16331440.30} $ in {2012}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Vanguard Dynamics's Revenue Growth from the starting year to the final year?",
            "A": "The rate of decline in Vanguard Dynamics's revenue growth is {-98.98}%."
        },
        {
            "Q": "What is the rate of change in NovaTech Solutions's Revenue Growth from the starting year to the final year?",
            "A": "The rate of decline in NovaTech Solutions's revenue growth is {-5.18}%."
        },
        {
            "Q": "What is the rate of change in Starlight Innovations's Revenue Growth from the starting year to the final year?",
            "A": "The rate of growth in Starlight Innovations's revenue growth is {48.18}%."
        },
        {
            "Q": "What is the average value of Vanguard Dynamics's Revenue Growth?",
            "A": "The average value of Vanguard Dynamics's revenue growth is {4140397.23} $."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Vanguard Dynamics's Revenue Growth exceed 6171468 $? Please list the years and corresponding values.",
            "A": "{7762173.04} $ in {1996} year, {6916887.48} $ in {1998} year, {7477217.07} $ in {1997} year."
        },
        {
            "Q": "In the year 2010, which lines had Revenue Growth below 6854772 $? Please list the lines and corresponding values.",
            "A": "{Vanguard Dynamics} had {783054} $."
        },
        {
            "Q": "In the year 2007, which line had Revenue Growth exceed 17075493 $? Please list the lines and corresponding values.",
            "A": "{NovaTech Solutions} had {22086517} $."
        },
        {
            "Q": "Which years did NovaTech Solutions's Revenue Growth between 19012369 and 23153379 $? Please list the years and corresponding values.",
            "A": "{19253154.33} $ in {2009} year, {22086516.58} $ in {2007} year, {21771635.93} $ in {1999} year."
        }
    ],
    "NC": [
        {
            "Q": "Between 1995 and 2005, which line experienced the largest change in Revenue Growth, NovaTech Solutions, Vanguard Dynamics, or Starlight Innovations?",
            "A": "{NovaTech Solutions} experienced the largest change in revenue growth."
        },
        {
            "Q": "Between 2000 and 2004, which line experienced the largest change in Revenue Growth, Vanguard Dynamics, Starlight Innovations, or NovaTech Solutions?",
            "A": "{Vanguard Dynamics} experienced the largest change in revenue growth."
        },
        {
            "Q": "Between 2005 and 2009, which line had the highest average Revenue Growth, NovaTech Solutions, Vanguard Dynamics, or Starlight Innovations?",
            "A": "{NovaTech Solutions} had the highest average revenue growth."
        },
        {
            "Q": "Between 2004 and 2007, which line experienced the largest change in Revenue Growth, NovaTech Solutions, Vanguard Dynamics, or Starlight Innovations?",
            "A": "{NovaTech Solutions} experienced the largest change in revenue growth."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {NovaTech Solutions}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 2007 and 2010?",
            "A": "{Starlight Innovations} has the fastest average growth rate between 2007 and 2010."
        },
        {
            "Q": "Which label had the leading revenue growth since 1997?",
            "A": "Since 1997, {NovaTech Solutions} had the leading revenue growth."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Starlight Innovations. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1995, 2012}."
        }
    ]
}