{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Ironwood Gallery, what is the spatial relationship of the data point in 1951 relative to that in 1955 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Ironwood Gallery, the data point in 1951 is {above} and to the {left} of the data point in 1955."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Ironwood Gallery's Art Gallery Visitors levels?",
            "A": "Ironwood Gallery's art gallery visitors levels show a {bimodal valley} trend."
        },
        {
            "Q": "Which line shows a bimodal valley trend in Art Gallery Visitors levels?",
            "A": "{Ironwood Gallery}."
        }
    ],
    "VE": [
        {
            "Q": "What is Ironwood Gallery's Art Gallery Visitors in 1962?",
            "A": "Ironwood Gallery's art gallery visitors in 1962 is {13234.66} visitors."
        },
        {
            "Q": "What is Ironwood Gallery's Art Gallery Visitors in 1963?",
            "A": "Ironwood Gallery's art gallery visitors in 1963 is {42347.63} visitors."
        },
        {
            "Q": "What is Ironwood Gallery's Art Gallery Visitors in 1959?",
            "A": "Ironwood Gallery's art gallery visitors in 1959 is {3518.10} visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Art Gallery Visitors in the line chart?",
            "A": "The global minimum art gallery visitors is {3518.10} visitors."
        },
        {
            "Q": "What is the global maximum Art Gallery Visitors in the line chart?",
            "A": "The global maximum art gallery visitors is {108498.70} visitors."
        },
        {
            "Q": "What is the highest Art Gallery Visitors level recorded for Ironwood Gallery?",
            "A": "Ironwood Gallery reached approximately {108498.70} visitors in {1965}."
        },
        {
            "Q": "What is the lowest Art Gallery Visitors level recorded for Ironwood Gallery?",
            "A": "Ironwood Gallery's lowest recorded level is approximately {3518.10} visitors in {1955}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Ironwood Gallery's Art Gallery Visitors from the starting year to the final year?",
            "A": "The rate of growth in Ironwood Gallery's art gallery visitors is {1.80}%."
        },
        {
            "Q": "What is the average value of Ironwood Gallery's Art Gallery Visitors?",
            "A": "The average value of Ironwood Gallery's art gallery visitors is {33016.91} visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Ironwood Gallery's Art Gallery Visitors below 3870 visitors? Please list the years and corresponding values.",
            "A": "{3518.10} visitors in {1955} year, {3518.10} visitors in {1961} year, {3518.10} visitors in {1958} year."
        },
        {
            "Q": "Which years did Ironwood Gallery's Art Gallery Visitors exceed 57118 visitors? Please list the years and corresponding values.",
            "A": "{71888.82} visitors in {1952} year, {73804.57} visitors in {1964} year, {106584.95} visitors in {1951} year."
        },
        {
            "Q": "Which years did Ironwood Gallery's Art Gallery Visitors between 8878 and 51758 visitors? Please list the years and corresponding values.",
            "A": "{13234.66} visitors in {1962} year, {41717.60} visitors in {1953} year, {12550.09} visitors in {1954} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Ironwood Gallery's Art Gallery Visitors in 1953 higher or lower than in 1961?",
            "A": "The art gallery visitors in 1953 was {higher} than in 1961."
        },
        {
            "Q": "Was Ironwood Gallery's Art Gallery Visitors in 1956 higher or lower than in 1958?",
            "A": "The art gallery visitors in 1956 was {the same} than in 1958."
        },
        {
            "Q": "Was Ironwood Gallery's Art Gallery Visitors in 1956 higher or lower than in 1959?",
            "A": "The art gallery visitors in 1956 was {the same} than in 1959."
        },
        {
            "Q": "Was Ironwood Gallery's Art Gallery Visitors in 1961 higher or lower than in 1962?",
            "A": "The art gallery visitors in 1961 was {lower} than in 1962."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Ironwood Gallery. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1951, 1961, 1965}."
        }
    ]
}