{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {5} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Azure Sky Symphony, what is the spatial relationship of the data point in 1964 relative to that in 1960 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Azure Sky Symphony, the data point in 1964 is {above} and to the {right} of the data point in 1960."
        },
        {
            "Q": "In 1964, what is the vertical (above/below) relationship of the line representing Starlight Soundwave relative to Terra Tempo Festival?",
            "A": "In 1964, Starlight Soundwave is {below} Terra Tempo Festival in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Azure Sky Symphony's Music Festival Attendance levels?",
            "A": "Azure Sky Symphony's music festival attendance levels show a {stable rising} trend."
        },
        {
            "Q": "What is the trend of Starlight Soundwave's Music Festival Attendance levels?",
            "A": "Starlight Soundwave's music festival attendance levels show a {exponential falling} trend."
        },
        {
            "Q": "What is the trend of Terra Tempo Festival's Music Festival Attendance levels?",
            "A": "Terra Tempo Festival's music festival attendance levels show a {volatile rising} trend."
        },
        {
            "Q": "What is the trend of Echo Bloom Festival's Music Festival Attendance levels?",
            "A": "Echo Bloom Festival's music festival attendance levels show a {exponential rising} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Starlight Soundwave's Music Festival Attendance in 1962?",
            "A": "Starlight Soundwave's music festival attendance in 1962 is {50077.82} attendees."
        },
        {
            "Q": "What is Starlight Soundwave's Music Festival Attendance in 1959?",
            "A": "Starlight Soundwave's music festival attendance in 1959 is {67529.76} attendees."
        },
        {
            "Q": "What is Aethelgard Harmonic Assembly's Music Festival Attendance in 1963?",
            "A": "Aethelgard Harmonic Assembly's music festival attendance in 1963 is {120506.82} attendees."
        },
        {
            "Q": "What are the music festival attendance of Azure Sky Symphony, Aethelgard Harmonic Assembly, and Terra Tempo Festival in 1963?",
            "A": "Azure Sky Symphony's music festival attendance is {142746.90} attendees, Aethelgard Harmonic Assembly's music festival attendance is {120506.82} attendees, Terra Tempo Festival's music festival attendance is {101604.03} attendees."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Music Festival Attendance in the line chart?",
            "A": "The global minimum music festival attendance is {40968.02} attendees."
        },
        {
            "Q": "What is the global maximum Music Festival Attendance in the line chart?",
            "A": "The global maximum music festival attendance is {150504.65} attendees."
        },
        {
            "Q": "What is the highest Music Festival Attendance level recorded for Aethelgard Harmonic Assembly?",
            "A": "Aethelgard Harmonic Assembly reached approximately {123232.37} attendees in {1964}."
        },
        {
            "Q": "What is the lowest Music Festival Attendance level recorded for Aethelgard Harmonic Assembly?",
            "A": "Aethelgard Harmonic Assembly's lowest recorded level is approximately {106893.02} attendees in {1959}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Starlight Soundwave's Music Festival Attendance from the starting year to the final year?",
            "A": "The rate of decline in Starlight Soundwave's music festival attendance is {-39.33}%."
        },
        {
            "Q": "What is the rate of change in Azure Sky Symphony's Music Festival Attendance from the starting year to the final year?",
            "A": "The rate of growth in Azure Sky Symphony's music festival attendance is {24.88}%."
        },
        {
            "Q": "What is the average value of Echo Bloom Festival's Music Festival Attendance?",
            "A": "The average value of Echo Bloom Festival's music festival attendance is {90306.21} attendees."
        },
        {
            "Q": "What is the average value of Terra Tempo Festival's Music Festival Attendance?",
            "A": "The average value of Terra Tempo Festival's music festival attendance is {91996.89} attendees."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1959, which lines had Music Festival Attendance below 74283 attendees? Please list the lines and corresponding values.",
            "A": "{Starlight Soundwave} had {67530} attendees, {Echo Bloom Festival} had {70864} attendees."
        },
        {
            "Q": "In the year 1964, which lines had Music Festival Attendance below 107638 attendees? Please list the lines and corresponding values.",
            "A": "{Starlight Soundwave} had {40968} attendees."
        },
        {
            "Q": "In the year 1959, which lines had Music Festival Attendance between 74467 and 103290 attendees? Please list the lines and corresponding values.",
            "A": "{Terra Tempo Festival} had {79720} attendees."
        },
        {
            "Q": "Which years did Azure Sky Symphony's Music Festival Attendance below 132568 attendees? Please list the years and corresponding values.",
            "A": "{120516.25} attendees in {1959} year, {123696.83} attendees in {1960} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Terra Tempo Festival's Music Festival Attendance in 1959 higher or lower than in 1964?",
            "A": "The music festival attendance in 1959 was {lower} than in 1964."
        },
        {
            "Q": "Between 1961 and 1964, which line had a higher average Music Festival Attendance, Starlight Soundwave or Terra Tempo Festival?",
            "A": "{Terra Tempo Festival} had a higher average music festival attendance."
        },
        {
            "Q": "Between 1959 and 1960, which line had a higher average Music Festival Attendance, Aethelgard Harmonic Assembly or Azure Sky Symphony?",
            "A": "{Azure Sky Symphony} had a higher average music festival attendance."
        },
        {
            "Q": "Between 1960 and 1962, which line had the highest average Music Festival Attendance, Starlight Soundwave, Terra Tempo Festival, or Aethelgard Harmonic Assembly?",
            "A": "{Aethelgard Harmonic Assembly} had the highest average music festival attendance."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Echo Bloom Festival}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1959 and 1963?",
            "A": "{Echo Bloom Festival} has the fastest average growth rate between 1959 and 1963."
        },
        {
            "Q": "In which year did Echo Bloom Festival first surpass Terra Tempo Festival?",
            "A": "Echo Bloom Festival first surpassed Terra Tempo Festival in the year {1963}."
        },
        {
            "Q": "Which label had the leading music festival attendance since 1963?",
            "A": "Since 1963, {Azure Sky Symphony} had the leading music festival attendance."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Azure Sky Symphony. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1959, 1964}."
        }
    ]
}