{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Meridian Drama Circle, what is the spatial relationship of the data point in 1969 relative to that in 1964 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Meridian Drama Circle, the data point in 1969 is {below} and to the {right} of the data point in 1964."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Meridian Drama Circle's Theater Attendance levels?",
            "A": "Meridian Drama Circle's theater attendance levels show a {single valley} trend."
        },
        {
            "Q": "Which line shows a single valley trend in Theater Attendance levels?",
            "A": "{Meridian Drama Circle}."
        }
    ],
    "VE": [
        {
            "Q": "What is Meridian Drama Circle's Theater Attendance in 1964?",
            "A": "Meridian Drama Circle's theater attendance in 1964 is {132657.20} tickets."
        },
        {
            "Q": "What is Meridian Drama Circle's Theater Attendance in 1968?",
            "A": "Meridian Drama Circle's theater attendance in 1968 is {86850.34} tickets."
        },
        {
            "Q": "What is Meridian Drama Circle's Theater Attendance in 1963?",
            "A": "Meridian Drama Circle's theater attendance in 1963 is {159434.39} tickets."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Theater Attendance in the line chart?",
            "A": "The global minimum theater attendance is {81912.80} tickets."
        },
        {
            "Q": "What is the global maximum Theater Attendance in the line chart?",
            "A": "The global maximum theater attendance is {188324.35} tickets."
        },
        {
            "Q": "What is the highest Theater Attendance level recorded for Meridian Drama Circle?",
            "A": "Meridian Drama Circle reached approximately {188324.35} tickets in {1962}."
        },
        {
            "Q": "What is the lowest Theater Attendance level recorded for Meridian Drama Circle?",
            "A": "Meridian Drama Circle's lowest recorded level is approximately {81912.80} tickets in {1967}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Meridian Drama Circle's Theater Attendance from the starting year to the final year?",
            "A": "The rate of decline in Meridian Drama Circle's theater attendance is {-1.09}%."
        },
        {
            "Q": "What is the average value of Meridian Drama Circle's Theater Attendance?",
            "A": "The average value of Meridian Drama Circle's theater attendance is {128338.28} tickets."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Meridian Drama Circle's Theater Attendance exceed 159809 tickets? Please list the years and corresponding values.",
            "A": "{188324.35} tickets in {1962} year, {186268.31} tickets in {1972} year, {160184.18} tickets in {1971} year."
        },
        {
            "Q": "Which years did Meridian Drama Circle's Theater Attendance between 102421 and 153433 tickets? Please list the years and corresponding values.",
            "A": "{132657.20} tickets in {1964} year, {117385.43} tickets in {1970} year, {106615.99} tickets in {1969} year."
        },
        {
            "Q": "Which years did Meridian Drama Circle's Theater Attendance below 96044 tickets? Please list the years and corresponding values.",
            "A": "{90011.10} tickets in {1966} year, {86850.34} tickets in {1968} year, {81912.80} tickets in {1967} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Meridian Drama Circle's Theater Attendance in 1966 higher or lower than in 1970?",
            "A": "The theater attendance in 1966 was {lower} than in 1970."
        },
        {
            "Q": "Was Meridian Drama Circle's Theater Attendance in 1964 higher or lower than in 1965?",
            "A": "The theater attendance in 1964 was {higher} than in 1965."
        },
        {
            "Q": "Was Meridian Drama Circle's Theater Attendance in 1967 higher or lower than in 1968?",
            "A": "The theater attendance in 1967 was {lower} than in 1968."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Meridian Drama Circle. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1962, 1967, 1972}."
        }
    ]
}