{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Azure Curtain Players, what is the spatial relationship of the data point in 2002 relative to that in 1990 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Azure Curtain Players, the data point in 2002 is {above} and to the {right} of the data point in 1990."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Azure Curtain Players's Theater Attendance levels?",
            "A": "Azure Curtain Players's theater attendance levels show a {stable rising} trend."
        },
        {
            "Q": "Which line shows a stable rising trend in Theater Attendance levels?",
            "A": "{Azure Curtain Players}."
        }
    ],
    "VE": [
        {
            "Q": "What is Azure Curtain Players's Theater Attendance in 1996?",
            "A": "Azure Curtain Players's theater attendance in 1996 is {1054408.11} tickets."
        },
        {
            "Q": "What is Azure Curtain Players's Theater Attendance in 1990?",
            "A": "Azure Curtain Players's theater attendance in 1990 is {902371.48} tickets."
        },
        {
            "Q": "What is Azure Curtain Players's Theater Attendance in 1989?",
            "A": "Azure Curtain Players's theater attendance in 1989 is {867772.24} tickets."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Theater Attendance in the line chart?",
            "A": "The global minimum theater attendance is {506391.61} tickets."
        },
        {
            "Q": "What is the global maximum Theater Attendance in the line chart?",
            "A": "The global maximum theater attendance is {1203808.82} tickets."
        },
        {
            "Q": "What is the highest Theater Attendance level recorded for Azure Curtain Players?",
            "A": "Azure Curtain Players reached approximately {1203808.82} tickets in {2002}."
        },
        {
            "Q": "What is the lowest Theater Attendance level recorded for Azure Curtain Players?",
            "A": "Azure Curtain Players's lowest recorded level is approximately {506391.61} tickets in {1974}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Azure Curtain Players's Theater Attendance?",
            "A": "The average value of Azure Curtain Players's theater attendance is {850555.49} tickets."
        },
        {
            "Q": "What is the rate of change in Azure Curtain Players's Theater Attendance from the starting year to the final year?",
            "A": "The rate of growth in Azure Curtain Players's theater attendance is {137.72}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Azure Curtain Players's Theater Attendance below 667705 tickets? Please list the years and corresponding values.",
            "A": "{621150.70} tickets in {1979} year, {567580.45} tickets in {1977} year, {554043.42} tickets in {1976} year."
        },
        {
            "Q": "Which years did Azure Curtain Players's Theater Attendance exceed 1026915 tickets? Please list the years and corresponding values.",
            "A": "{1135088.28} tickets in {1999} year, {1138839.74} tickets in {2000} year, {1068065.47} tickets in {1997} year."
        },
        {
            "Q": "Which years did Azure Curtain Players's Theater Attendance between 703626 and 990994 tickets? Please list the years and corresponding values.",
            "A": "{936072.35} tickets in {1991} year, {752598.15} tickets in {1984} year, {867772.24} tickets in {1989} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Azure Curtain Players's Theater Attendance in 1976 higher or lower than in 1989?",
            "A": "The theater attendance in 1976 was {lower} than in 1989."
        },
        {
            "Q": "Was Azure Curtain Players's Theater Attendance in 1986 higher or lower than in 1992?",
            "A": "The theater attendance in 1986 was {lower} than in 1992."
        },
        {
            "Q": "Was Azure Curtain Players's Theater Attendance in 1974 higher or lower than in 2000?",
            "A": "The theater attendance in 1974 was {lower} than in 2000."
        },
        {
            "Q": "Was Azure Curtain Players's Theater Attendance in 1991 higher or lower than in 2001?",
            "A": "The theater attendance in 1991 was {lower} than in 2001."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Azure Curtain Players. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1974, 2002}."
        }
    ]
}