{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {3} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Silverhaven Polytechnic Fund, what is the spatial relationship of the data point in 2011 relative to that in 1999 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Silverhaven Polytechnic Fund, the data point in 2011 is {above} and to the {right} of the data point in 1999."
        },
        {
            "Q": "In 2012, what is the vertical (above/below) relationship of the line representing Aethelgard Arts Circle relative to Zenith Tech Foundation?",
            "A": "In 2012, Aethelgard Arts Circle is {above} Zenith Tech Foundation in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Silverhaven Polytechnic Fund's Alumni Giving Rate levels?",
            "A": "Silverhaven Polytechnic Fund's alumni giving rate levels show a {bimodal valley} trend."
        },
        {
            "Q": "What is the trend of Zenith Tech Foundation's Alumni Giving Rate levels?",
            "A": "Zenith Tech Foundation's alumni giving rate levels show a {volatile rising} trend."
        },
        {
            "Q": "What is the trend of Aethelgard Arts Circle's Alumni Giving Rate levels?",
            "A": "Aethelgard Arts Circle's alumni giving rate levels show a {exponential rising} trend."
        },
        {
            "Q": "Which line shows a bimodal valley trend in Alumni Giving Rate levels?",
            "A": "{Silverhaven Polytechnic Fund}."
        }
    ],
    "VE": [
        {
            "Q": "What is Aethelgard Arts Circle's Alumni Giving Rate in 2009?",
            "A": "Aethelgard Arts Circle's alumni giving rate in 2009 is {58.67} %."
        },
        {
            "Q": "What is Silverhaven Polytechnic Fund's Alumni Giving Rate in 2018?",
            "A": "Silverhaven Polytechnic Fund's alumni giving rate in 2018 is {2.56} %."
        },
        {
            "Q": "What is Zenith Tech Foundation's Alumni Giving Rate in 1999?",
            "A": "Zenith Tech Foundation's alumni giving rate in 1999 is {11.62} %."
        },
        {
            "Q": "What are the alumni giving rate of Silverhaven Polytechnic Fund, Zenith Tech Foundation, and Aethelgard Arts Circle in 2008?",
            "A": "Silverhaven Polytechnic Fund's alumni giving rate is {2.46} %, Zenith Tech Foundation's alumni giving rate is {17.48} %, Aethelgard Arts Circle's alumni giving rate is {53.46} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Alumni Giving Rate in the line chart?",
            "A": "The global minimum alumni giving rate is {1.33} %."
        },
        {
            "Q": "What is the global maximum Alumni Giving Rate in the line chart?",
            "A": "The global maximum alumni giving rate is {100.00} %."
        },
        {
            "Q": "What is the highest Alumni Giving Rate level recorded for Aethelgard Arts Circle?",
            "A": "Aethelgard Arts Circle reached approximately {100.00} % in {2015}."
        },
        {
            "Q": "What is the lowest Alumni Giving Rate level recorded for Aethelgard Arts Circle?",
            "A": "Aethelgard Arts Circle's lowest recorded level is approximately {14.00} % in {1994}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Zenith Tech Foundation's Alumni Giving Rate from the starting year to the final year?",
            "A": "The rate of growth in Zenith Tech Foundation's alumni giving rate is {210.10}%."
        },
        {
            "Q": "What is the rate of change in Aethelgard Arts Circle's Alumni Giving Rate from the starting year to the final year?",
            "A": "The rate of growth in Aethelgard Arts Circle's alumni giving rate is {614.29}%."
        },
        {
            "Q": "What is the average value of Aethelgard Arts Circle's Alumni Giving Rate?",
            "A": "The average value of Aethelgard Arts Circle's alumni giving rate is {55.59} %."
        },
        {
            "Q": "What is the rate of change in Silverhaven Polytechnic Fund's Alumni Giving Rate from the starting year to the final year?",
            "A": "The rate of decline in Silverhaven Polytechnic Fund's alumni giving rate is {-1.36}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 2013, which line had Alumni Giving Rate exceed 53 %? Please list the lines and corresponding values.",
            "A": "{Aethelgard Arts Circle} had {86} %."
        },
        {
            "Q": "In the year 2013, which lines had Alumni Giving Rate below 11 %? Please list the lines and corresponding values.",
            "A": "{Silverhaven Polytechnic Fund} had {1} %."
        },
        {
            "Q": "Which years did Zenith Tech Foundation's Alumni Giving Rate exceed 21 %? Please list the years and corresponding values.",
            "A": "{24.77} % in {2019} year, {25.49} % in {2020} year, {22.80} % in {2016} year."
        },
        {
            "Q": "In the year 2000, which lines had Alumni Giving Rate below 7 %? Please list the lines and corresponding values.",
            "A": "{Silverhaven Polytechnic Fund} had {1} %."
        }
    ],
    "NC": [
        {
            "Q": "Was Aethelgard Arts Circle's Alumni Giving Rate in 1997 higher or lower than in 1998?",
            "A": "The alumni giving rate in 1997 was {lower} than in 1998."
        },
        {
            "Q": "In 2000, which line had the highest Alumni Giving Rate, Aethelgard Arts Circle, Zenith Tech Foundation, or Silverhaven Polytechnic Fund?",
            "A": "In 2000, {Aethelgard Arts Circle} had the highest alumni giving rate."
        },
        {
            "Q": "Between 2000 and 2012, which line had a higher average Alumni Giving Rate, Silverhaven Polytechnic Fund or Aethelgard Arts Circle?",
            "A": "{Aethelgard Arts Circle} had a higher average alumni giving rate."
        },
        {
            "Q": "In 2012, which line had a higher Alumni Giving Rate, {Zenith Tech Foundation} or {Aethelgard Arts Circle}?",
            "A": "In 2012, {Aethelgard Arts Circle} had a higher alumni giving rate."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Aethelgard Arts Circle}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 2006 and 2020?",
            "A": "{Aethelgard Arts Circle} has the fastest average growth rate between 2006 and 2020."
        },
        {
            "Q": "Which label had the leading alumni giving rate since 2012?",
            "A": "Since 2012, {Aethelgard Arts Circle} had the leading alumni giving rate."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Silverhaven Polytechnic Fund. List the x-coordinates of data points to be preserved.(5 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1994, 1999, 2008, 2014, 2020}."
        }
    ]
}