{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Zenith Institute of Technology, what is the spatial relationship of the data point in 1992 relative to that in 1982 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Zenith Institute of Technology, the data point in 1992 is {above} and to the {right} of the data point in 1982."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Zenith Institute of Technology's Faculty Satisfaction levels?",
            "A": "Zenith Institute of Technology's faculty satisfaction levels show a {stable falling} trend."
        },
        {
            "Q": "Which line shows a stable falling trend in Faculty Satisfaction levels?",
            "A": "{Zenith Institute of Technology}."
        }
    ],
    "VE": [
        {
            "Q": "What is Zenith Institute of Technology's Faculty Satisfaction in 1985?",
            "A": "Zenith Institute of Technology's faculty satisfaction in 1985 is {47.95} %."
        },
        {
            "Q": "What is Zenith Institute of Technology's Faculty Satisfaction in 1984?",
            "A": "Zenith Institute of Technology's faculty satisfaction in 1984 is {46.76} %."
        },
        {
            "Q": "What is Zenith Institute of Technology's Faculty Satisfaction in 1982?",
            "A": "Zenith Institute of Technology's faculty satisfaction in 1982 is {44.34} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Faculty Satisfaction in the line chart?",
            "A": "The global minimum faculty satisfaction is {42.03} %."
        },
        {
            "Q": "What is the global maximum Faculty Satisfaction in the line chart?",
            "A": "The global maximum faculty satisfaction is {58.02} %."
        },
        {
            "Q": "What is the highest Faculty Satisfaction level recorded for Zenith Institute of Technology?",
            "A": "Zenith Institute of Technology reached approximately {58.02} % in {1993}."
        },
        {
            "Q": "What is the lowest Faculty Satisfaction level recorded for Zenith Institute of Technology?",
            "A": "Zenith Institute of Technology's lowest recorded level is approximately {42.03} % in {1980}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Zenith Institute of Technology's Faculty Satisfaction from the starting year to the final year?",
            "A": "The rate of growth in Zenith Institute of Technology's faculty satisfaction is {38.04}%."
        },
        {
            "Q": "What is the average value of Zenith Institute of Technology's Faculty Satisfaction?",
            "A": "The average value of Zenith Institute of Technology's faculty satisfaction is {49.85} %."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Zenith Institute of Technology's Faculty Satisfaction below 46 %? Please list the years and corresponding values.",
            "A": "{42.03} % in {1980} year, {42.84} % in {1981} year, {44.34} % in {1982} year."
        },
        {
            "Q": "Which years did Zenith Institute of Technology's Faculty Satisfaction exceed 52 %? Please list the years and corresponding values.",
            "A": "{58.02} % in {1993} year, {56.59} % in {1992} year, {55.33} % in {1991} year."
        },
        {
            "Q": "Which years did Zenith Institute of Technology's Faculty Satisfaction between 47 and 53 %? Please list the years and corresponding values.",
            "A": "{53.03} % in {1989} year, {49.26} % in {1986} year, {50.42} % in {1987} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Zenith Institute of Technology's Faculty Satisfaction in 1983 higher or lower than in 1988?",
            "A": "The faculty satisfaction in 1983 was {lower} than in 1988."
        },
        {
            "Q": "Was Zenith Institute of Technology's Faculty Satisfaction in 1980 higher or lower than in 1984?",
            "A": "The faculty satisfaction in 1980 was {lower} than in 1984."
        },
        {
            "Q": "Was Zenith Institute of Technology's Faculty Satisfaction in 1984 higher or lower than in 1991?",
            "A": "The faculty satisfaction in 1984 was {lower} than in 1991."
        },
        {
            "Q": "Was Zenith Institute of Technology's Faculty Satisfaction in 1982 higher or lower than in 1992?",
            "A": "The faculty satisfaction in 1982 was {lower} than in 1992."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Zenith Institute of Technology. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1980, 1993}."
        }
    ]
}