{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {5} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Borealis Graduate School, what is the spatial relationship of the data point in 1992 relative to that in 2006 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Borealis Graduate School, the data point in 1992 is {above} and to the {left} of the data point in 2006."
        },
        {
            "Q": "In 1991, what is the vertical (above/below) relationship of the line representing Silverhaven Polytechnic relative to Aethelgard School of Arts?",
            "A": "In 1991, Silverhaven Polytechnic is {below} Aethelgard School of Arts in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Silverhaven Polytechnic's Student Enrollment levels?",
            "A": "Silverhaven Polytechnic's student enrollment levels show a {bimodal valley} trend."
        },
        {
            "Q": "What is the trend of Aethelgard School of Arts's Student Enrollment levels?",
            "A": "Aethelgard School of Arts's student enrollment levels show a {exponential rising} trend."
        },
        {
            "Q": "What is the trend of Celestial College's Student Enrollment levels?",
            "A": "Celestial College's student enrollment levels show a {volatile rising} trend."
        },
        {
            "Q": "What is the trend of Borealis Graduate School's Student Enrollment levels?",
            "A": "Borealis Graduate School's student enrollment levels show a {single peak} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Borealis Graduate School's Student Enrollment in 2005?",
            "A": "Borealis Graduate School's student enrollment in 2005 is {15065.60} students."
        },
        {
            "Q": "What is Celestial College's Student Enrollment in 2002?",
            "A": "Celestial College's student enrollment in 2002 is {20838.53} students."
        },
        {
            "Q": "What is Meridian Academy's Student Enrollment in 1996?",
            "A": "Meridian Academy's student enrollment in 1996 is {3322.38} students."
        },
        {
            "Q": "What are the student enrollment of Meridian Academy, Borealis Graduate School, and Aethelgard School of Arts in 2005?",
            "A": "Meridian Academy's student enrollment is {7489.69} students, Borealis Graduate School's student enrollment is {15065.60} students, Aethelgard School of Arts's student enrollment is {61756.27} students."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Student Enrollment in the line chart?",
            "A": "The global minimum student enrollment is {69.42} students."
        },
        {
            "Q": "What is the global maximum Student Enrollment in the line chart?",
            "A": "The global maximum student enrollment is {68134.58} students."
        },
        {
            "Q": "What is the highest Student Enrollment level recorded for Aethelgard School of Arts?",
            "A": "Aethelgard School of Arts reached approximately {68134.58} students in {2006}."
        },
        {
            "Q": "What is the lowest Student Enrollment level recorded for Aethelgard School of Arts?",
            "A": "Aethelgard School of Arts's lowest recorded level is approximately {14843.06} students in {1990}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Celestial College's Student Enrollment?",
            "A": "The average value of Celestial College's student enrollment is {17472.37} students."
        },
        {
            "Q": "What is the average value of Meridian Academy's Student Enrollment?",
            "A": "The average value of Meridian Academy's student enrollment is {5176.20} students."
        },
        {
            "Q": "What is the average value of Aethelgard School of Arts's Student Enrollment?",
            "A": "The average value of Aethelgard School of Arts's student enrollment is {35350.60} students."
        },
        {
            "Q": "What is the rate of change in Borealis Graduate School's Student Enrollment from the starting year to the final year?",
            "A": "The rate of decline in Borealis Graduate School's student enrollment is {-0.02}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 2002, which lines had Student Enrollment between 6415 and 19236 students? Please list the lines and corresponding values.",
            "A": "{Borealis Graduate School} had {18175} students."
        },
        {
            "Q": "In the year 1995, which line had Student Enrollment exceed 19070 students? Please list the lines and corresponding values.",
            "A": "{Aethelgard School of Arts} had {23800} students."
        },
        {
            "Q": "Which years did Aethelgard School of Arts's Student Enrollment below 21753 students? Please list the years and corresponding values.",
            "A": "{19867.30} students in {1993} year, {18063.46} students in {1992} year, {16251.69} students in {1991} year."
        },
        {
            "Q": "Which years did Silverhaven Polytechnic's Student Enrollment below 76 students? Please list the years and corresponding values.",
            "A": "{69.42} students in {1996} year, {69.42} students in {1997} year, {69.42} students in {1998} year."
        }
    ],
    "NC": [
        {
            "Q": "Between 2004 and 2005, which line had a higher average Student Enrollment, Aethelgard School of Arts or Meridian Academy?",
            "A": "{Aethelgard School of Arts} had a higher average student enrollment."
        },
        {
            "Q": "Between 2003 and 2005, which line had the highest average Student Enrollment, Meridian Academy, Celestial College, or Borealis Graduate School?",
            "A": "{Celestial College} had the highest average student enrollment."
        },
        {
            "Q": "In 2006, which line had the highest Student Enrollment, Aethelgard School of Arts, Borealis Graduate School, or Meridian Academy?",
            "A": "In 2006, {Aethelgard School of Arts} had the highest student enrollment."
        },
        {
            "Q": "Between 2000 and 2003, which line experienced a larger change in Student Enrollment, Borealis Graduate School or Silverhaven Polytechnic?",
            "A": "{Borealis Graduate School} experienced a larger change in student enrollment."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Aethelgard School of Arts}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1997 and 1999?",
            "A": "{Aethelgard School of Arts} has the fastest average growth rate between 1997 and 1999."
        },
        {
            "Q": "In which year did Celestial College first surpass Borealis Graduate School?",
            "A": "Celestial College first surpassed Borealis Graduate School in the year {2001}."
        },
        {
            "Q": "Which label had the leading student enrollment since 2003?",
            "A": "Since 2003, {Aethelgard School of Arts} had the leading student enrollment."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Silverhaven Polytechnic. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1990, 1995, 2006}."
        }
    ]
}