{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Sunstone Solar Farm, what is the spatial relationship of the data point in 1998 relative to that in 1997 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Sunstone Solar Farm, the data point in 1998 is {below} and to the {right} of the data point in 1997."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Sunstone Solar Farm's Renewable Energy Production levels?",
            "A": "Sunstone Solar Farm's renewable energy production levels show a {volatile falling} trend."
        },
        {
            "Q": "Which line shows a volatile falling trend in Renewable Energy Production levels?",
            "A": "{Sunstone Solar Farm}."
        }
    ],
    "VE": [
        {
            "Q": "What is Sunstone Solar Farm's Renewable Energy Production in 2002?",
            "A": "Sunstone Solar Farm's renewable energy production in 2002 is {23154404.48} MWh."
        },
        {
            "Q": "What is Sunstone Solar Farm's Renewable Energy Production in 1990?",
            "A": "Sunstone Solar Farm's renewable energy production in 1990 is {112179495.32} MWh."
        },
        {
            "Q": "What is Sunstone Solar Farm's Renewable Energy Production in 1995?",
            "A": "Sunstone Solar Farm's renewable energy production in 1995 is {73906568.41} MWh."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Renewable Energy Production in the line chart?",
            "A": "The global minimum renewable energy production is {23154404.48} MWh."
        },
        {
            "Q": "What is the global maximum Renewable Energy Production in the line chart?",
            "A": "The global maximum renewable energy production is {126434880.98} MWh."
        },
        {
            "Q": "What is the highest Renewable Energy Production level recorded for Sunstone Solar Farm?",
            "A": "Sunstone Solar Farm reached approximately {126434880.98} MWh in {1988}."
        },
        {
            "Q": "What is the lowest Renewable Energy Production level recorded for Sunstone Solar Farm?",
            "A": "Sunstone Solar Farm's lowest recorded level is approximately {23154404.48} MWh in {2002}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Sunstone Solar Farm's Renewable Energy Production from the starting year to the final year?",
            "A": "The rate of decline in Sunstone Solar Farm's renewable energy production is {-81.69}%."
        },
        {
            "Q": "What is the average value of Sunstone Solar Farm's Renewable Energy Production?",
            "A": "The average value of Sunstone Solar Farm's renewable energy production is {74662843.57} MWh."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Sunstone Solar Farm's Renewable Energy Production below 48316308 MWh? Please list the years and corresponding values.",
            "A": "{44331731.42} MWh in {1999} year, {28647941.86} MWh in {2001} year, {23154404.48} MWh in {2002} year."
        },
        {
            "Q": "Which years did Sunstone Solar Farm's Renewable Energy Production between 53736764 and 97100408 MWh? Please list the years and corresponding values.",
            "A": "{66717541.08} MWh in {1996} year, {88791319.14} MWh in {1993} year, {81498302.28} MWh in {1994} year."
        },
        {
            "Q": "Which years did Sunstone Solar Farm's Renewable Energy Production exceed 102520863 MWh? Please list the years and corresponding values.",
            "A": "{106679449.03} MWh in {1991} year, {121886826.66} MWh in {1989} year, {112179495.32} MWh in {1990} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Sunstone Solar Farm's Renewable Energy Production in 1991 higher or lower than in 1999?",
            "A": "The renewable energy production in 1991 was {higher} than in 1999."
        },
        {
            "Q": "Was Sunstone Solar Farm's Renewable Energy Production in 1995 higher or lower than in 2001?",
            "A": "The renewable energy production in 1995 was {higher} than in 2001."
        },
        {
            "Q": "Was Sunstone Solar Farm's Renewable Energy Production in 1993 higher or lower than in 2000?",
            "A": "The renewable energy production in 1993 was {higher} than in 2000."
        },
        {
            "Q": "Was Sunstone Solar Farm's Renewable Energy Production in 1991 higher or lower than in 1992?",
            "A": "The renewable energy production in 1991 was {higher} than in 1992."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Sunstone Solar Farm. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1988, 2002}."
        }
    ]
}