{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {4} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Riverbend Plantation, what is the spatial relationship of the data point in 1996 relative to that in 1986 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Riverbend Plantation, the data point in 1996 is {below} and to the {right} of the data point in 1986."
        },
        {
            "Q": "In 1991, what is the vertical (above/below) relationship of the line representing Starfall Organics relative to Whispering Willows Estate?",
            "A": "In 1991, Starfall Organics is {above} Whispering Willows Estate in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Starfall Organics's Water Usage levels?",
            "A": "Starfall Organics's water usage levels show a {single peak} trend."
        },
        {
            "Q": "What is the trend of Whispering Willows Estate's Water Usage levels?",
            "A": "Whispering Willows Estate's water usage levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Riverbend Plantation's Water Usage levels?",
            "A": "Riverbend Plantation's water usage levels show a {single valley} trend."
        },
        {
            "Q": "What is the trend of Ironwood Ranch's Water Usage levels?",
            "A": "Ironwood Ranch's water usage levels show a {bimodal valley} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Ironwood Ranch's Water Usage in 1995?",
            "A": "Ironwood Ranch's water usage in 1995 is {18720.02} cubic meters."
        },
        {
            "Q": "What is Ironwood Ranch's Water Usage in 1988?",
            "A": "Ironwood Ranch's water usage in 1988 is {18720.02} cubic meters."
        },
        {
            "Q": "What is Starfall Organics's Water Usage in 1989?",
            "A": "Starfall Organics's water usage in 1989 is {3701829.77} cubic meters."
        },
        {
            "Q": "What are the water usage of Riverbend Plantation, Whispering Willows Estate, and Starfall Organics in 1991?",
            "A": "Riverbend Plantation's water usage is {606493.11} cubic meters, Whispering Willows Estate's water usage is {1895716.04} cubic meters, Starfall Organics's water usage is {3827793.45} cubic meters."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Water Usage in the line chart?",
            "A": "The global minimum water usage is {18720.02} cubic meters."
        },
        {
            "Q": "What is the global maximum Water Usage in the line chart?",
            "A": "The global maximum water usage is {3827793.45} cubic meters."
        },
        {
            "Q": "What is the highest Water Usage level recorded for Ironwood Ranch?",
            "A": "Ironwood Ranch reached approximately {192746.92} cubic meters in {1986}."
        },
        {
            "Q": "What is the lowest Water Usage level recorded for Ironwood Ranch?",
            "A": "Ironwood Ranch's lowest recorded level is approximately {18720.02} cubic meters in {1987}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Riverbend Plantation's Water Usage from the starting year to the final year?",
            "A": "The rate of decline in Riverbend Plantation's water usage is {-0.04}%."
        },
        {
            "Q": "What is the average value of Ironwood Ranch's Water Usage?",
            "A": "The average value of Ironwood Ranch's water usage is {49224.04} cubic meters."
        },
        {
            "Q": "What is the rate of change in Ironwood Ranch's Water Usage from the starting year to the final year?",
            "A": "The rate of decline in Ironwood Ranch's water usage is {-6.49}%."
        },
        {
            "Q": "What is the average value of Riverbend Plantation's Water Usage?",
            "A": "The average value of Riverbend Plantation's water usage is {920728.64} cubic meters."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1988, which lines had Water Usage between 884246 and 2475622 cubic meters? Please list the lines and corresponding values.",
            "A": "{Riverbend Plantation} had {907526} cubic meters, {Whispering Willows Estate} had {2384450} cubic meters."
        },
        {
            "Q": "Which years did Whispering Willows Estate's Water Usage exceed 2304084 cubic meters? Please list the years and corresponding values.",
            "A": "{2708604.92} cubic meters in {1986} year, {2384450.07} cubic meters in {1988} year, {2550045.80} cubic meters in {1987} year."
        },
        {
            "Q": "In the year 1992, which lines had Water Usage below 496925 cubic meters? Please list the lines and corresponding values.",
            "A": "{Ironwood Ranch} had {18720} cubic meters."
        },
        {
            "Q": "In the year 1992, which line had Water Usage exceed 2240641 cubic meters? Please list the lines and corresponding values.",
            "A": "{Starfall Organics} had {3801605} cubic meters."
        }
    ],
    "NC": [
        {
            "Q": "Between 1986 and 1996, which line experienced the largest change in Water Usage, Riverbend Plantation, Whispering Willows Estate, Ironwood Ranch, or Starfall Organics?",
            "A": "{Whispering Willows Estate} experienced the largest change in water usage."
        },
        {
            "Q": "In 1987, which line had a higher Water Usage, {Whispering Willows Estate} or {Riverbend Plantation}?",
            "A": "In 1987, {Whispering Willows Estate} had a higher water usage."
        },
        {
            "Q": "Between 1987 and 1996, which line had a higher average Water Usage, Ironwood Ranch or Riverbend Plantation?",
            "A": "{Riverbend Plantation} had a higher average water usage."
        },
        {
            "Q": "Between 1986 and 1996, which line experienced a larger change in Water Usage, Ironwood Ranch or Riverbend Plantation?",
            "A": "{Ironwood Ranch} experienced a larger change in water usage."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Whispering Willows Estate}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1994 and 1995?",
            "A": "{Riverbend Plantation} has the fastest average growth rate between 1994 and 1995."
        },
        {
            "Q": "In which year did Riverbend Plantation first surpass Whispering Willows Estate?",
            "A": "Riverbend Plantation first surpassed Whispering Willows Estate in the year {1996}."
        },
        {
            "Q": "Which label had the leading water usage since 1990?",
            "A": "Since 1990, {Starfall Organics} had the leading water usage."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Ironwood Ranch. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1986, 1987, 1996}."
        }
    ]
}