{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {3} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 2018, what is the vertical (above/below) relationship of the line representing Aethelgard City Waste Services relative to Borealis Township Cleanup?",
            "A": "In 2018, Aethelgard City Waste Services is {below} Borealis Township Cleanup in the vertical direction."
        },
        {
            "Q": "On Aethelgard City Waste Services, what is the spatial relationship of the data point in 1993 relative to that in 1997 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Aethelgard City Waste Services, the data point in 1993 is {above} and to the {left} of the data point in 1997."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Aethelgard City Waste Services's Waste Recycled levels?",
            "A": "Aethelgard City Waste Services's waste recycled levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Borealis Township Cleanup's Waste Recycled levels?",
            "A": "Borealis Township Cleanup's waste recycled levels show a {single valley} trend."
        },
        {
            "Q": "What is the trend of Silverhaven District Recycling's Waste Recycled levels?",
            "A": "Silverhaven District Recycling's waste recycled levels show a {stable falling} trend."
        },
        {
            "Q": "Which line shows a volatile falling trend in Waste Recycled levels?",
            "A": "{Aethelgard City Waste Services}."
        }
    ],
    "VE": [
        {
            "Q": "What is Aethelgard City Waste Services's Waste Recycled in 2015?",
            "A": "Aethelgard City Waste Services's waste recycled in 2015 is {513} tons."
        },
        {
            "Q": "What is Silverhaven District Recycling's Waste Recycled in 2000?",
            "A": "Silverhaven District Recycling's waste recycled in 2000 is {37764.33} tons."
        },
        {
            "Q": "What is Silverhaven District Recycling's Waste Recycled in 1996?",
            "A": "Silverhaven District Recycling's waste recycled in 1996 is {34182.30} tons."
        },
        {
            "Q": "What are the waste recycled of Aethelgard City Waste Services, Silverhaven District Recycling, and Borealis Township Cleanup in 2016?",
            "A": "Aethelgard City Waste Services's waste recycled is {513} tons, Silverhaven District Recycling's waste recycled is {52628.30} tons, Borealis Township Cleanup's waste recycled is {29846.68} tons."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Waste Recycled in the line chart?",
            "A": "The global minimum waste recycled is {513.00} tons."
        },
        {
            "Q": "What is the global maximum Waste Recycled in the line chart?",
            "A": "The global maximum waste recycled is {57331.40} tons."
        },
        {
            "Q": "What is the highest Waste Recycled level recorded for Aethelgard City Waste Services?",
            "A": "Aethelgard City Waste Services reached approximately {51240.67} tons in {1993}."
        },
        {
            "Q": "What is the lowest Waste Recycled level recorded for Aethelgard City Waste Services?",
            "A": "Aethelgard City Waste Services's lowest recorded level is approximately {513.00} tons in {2010}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Silverhaven District Recycling's Waste Recycled?",
            "A": "The average value of Silverhaven District Recycling's waste recycled is {44614.86} tons."
        },
        {
            "Q": "What is the rate of change in Aethelgard City Waste Services's Waste Recycled from the starting year to the final year?",
            "A": "The rate of decline in Aethelgard City Waste Services's waste recycled is {-99.00}%."
        },
        {
            "Q": "What is the rate of change in Borealis Township Cleanup's Waste Recycled from the starting year to the final year?",
            "A": "The rate of decline in Borealis Township Cleanup's waste recycled is {-1.96}%."
        },
        {
            "Q": "What is the average value of Borealis Township Cleanup's Waste Recycled?",
            "A": "The average value of Borealis Township Cleanup's waste recycled is {24074.54} tons."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1997, which line had Waste Recycled exceed 35097 tons? Please list the lines and corresponding values.",
            "A": "{Aethelgard City Waste Services} had {38997} tons."
        },
        {
            "Q": "In the year 2022, which lines had Waste Recycled between 19991 and 42719 tons? Please list the lines and corresponding values.",
            "A": "{Borealis Township Cleanup} had {33788} tons."
        },
        {
            "Q": "In the year 2019, which lines had Waste Recycled between 19669 and 41267 tons? Please list the lines and corresponding values.",
            "A": "{Borealis Township Cleanup} had {33426} tons."
        },
        {
            "Q": "Which years did Borealis Township Cleanup's Waste Recycled exceed 31478 tons? Please list the years and corresponding values.",
            "A": "{34461.99} tons in {1993} year, {34975.34} tons in {2021} year, {32251.46} tons in {2018} year."
        }
    ],
    "NC": [
        {
            "Q": "Between 2016 and 2022, which line experienced the largest change in Waste Recycled, Silverhaven District Recycling, Aethelgard City Waste Services, or Borealis Township Cleanup?",
            "A": "{Silverhaven District Recycling} experienced the largest change in waste recycled."
        },
        {
            "Q": "Between 1993 and 2004, which line had the highest average Waste Recycled, Silverhaven District Recycling, Borealis Township Cleanup, or Aethelgard City Waste Services?",
            "A": "{Silverhaven District Recycling} had the highest average waste recycled."
        },
        {
            "Q": "Between 1995 and 2016, which line experienced a larger change in Waste Recycled, Borealis Township Cleanup or Silverhaven District Recycling?",
            "A": "{Silverhaven District Recycling} experienced a larger change in waste recycled."
        },
        {
            "Q": "In 2014, which line had a higher Waste Recycled, {Aethelgard City Waste Services} or {Silverhaven District Recycling}?",
            "A": "In 2014, {Silverhaven District Recycling} had a higher waste recycled."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Aethelgard City Waste Services}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 2009 and 2014?",
            "A": "{Borealis Township Cleanup} has the fastest average growth rate between 2009 and 2014."
        },
        {
            "Q": "In which year did Silverhaven District Recycling first surpass Borealis Township Cleanup?",
            "A": "Silverhaven District Recycling first surpassed Borealis Township Cleanup in the year {1996}."
        },
        {
            "Q": "Which label had the leading waste recycled since 2018?",
            "A": "Since 2018, {Silverhaven District Recycling} had the leading waste recycled."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Borealis Township Cleanup. List the x-coordinates of data points to be preserved.(4 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1993, 2007, 2021, 2022}."
        }
    ]
}