{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {4} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1965, what is the vertical (above/below) relationship of the line representing GeoThermal Bloom Plant relative to Verdant Biomass Facility?",
            "A": "In 1965, GeoThermal Bloom Plant is {below} Verdant Biomass Facility in the vertical direction."
        },
        {
            "Q": "On Verdant Biomass Facility, what is the spatial relationship of the data point in 1957 relative to that in 1964 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Verdant Biomass Facility, the data point in 1957 is {below} and to the {left} of the data point in 1964."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Stellar Wind Array's Renewable Energy Production levels?",
            "A": "Stellar Wind Array's renewable energy production levels show a {single peak} trend."
        },
        {
            "Q": "What is the trend of Verdant Biomass Facility's Renewable Energy Production levels?",
            "A": "Verdant Biomass Facility's renewable energy production levels show a {exponential rising} trend."
        },
        {
            "Q": "What is the trend of GeoThermal Bloom Plant's Renewable Energy Production levels?",
            "A": "GeoThermal Bloom Plant's renewable energy production levels show a {stable falling} trend."
        },
        {
            "Q": "What is the trend of Azure Tide Energy's Renewable Energy Production levels?",
            "A": "Azure Tide Energy's renewable energy production levels show a {volatile falling} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Stellar Wind Array's Renewable Energy Production in 1964?",
            "A": "Stellar Wind Array's renewable energy production in 1964 is {110422729.81} MWh."
        },
        {
            "Q": "What is Azure Tide Energy's Renewable Energy Production in 1960?",
            "A": "Azure Tide Energy's renewable energy production in 1960 is {101900670.04} MWh."
        },
        {
            "Q": "What is Azure Tide Energy's Renewable Energy Production in 1957?",
            "A": "Azure Tide Energy's renewable energy production in 1957 is {126401319.26} MWh."
        },
        {
            "Q": "What are the renewable energy production of GeoThermal Bloom Plant, Stellar Wind Array, and Azure Tide Energy in 1957?",
            "A": "GeoThermal Bloom Plant's renewable energy production is {96243123.37} MWh, Stellar Wind Array's renewable energy production is {80228595.99} MWh, Azure Tide Energy's renewable energy production is {126401319.26} MWh."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Renewable Energy Production in the line chart?",
            "A": "The global minimum renewable energy production is {1440742.04} MWh."
        },
        {
            "Q": "What is the global maximum Renewable Energy Production in the line chart?",
            "A": "The global maximum renewable energy production is {893403278.43} MWh."
        },
        {
            "Q": "What is the highest Renewable Energy Production level recorded for Azure Tide Energy?",
            "A": "Azure Tide Energy reached approximately {145441591.12} MWh in {1955}."
        },
        {
            "Q": "What is the lowest Renewable Energy Production level recorded for Azure Tide Energy?",
            "A": "Azure Tide Energy's lowest recorded level is approximately {1440742.04} MWh in {1972}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Stellar Wind Array's Renewable Energy Production from the starting year to the final year?",
            "A": "The rate of decline in Stellar Wind Array's renewable energy production is {-3.62}%."
        },
        {
            "Q": "What is the average value of GeoThermal Bloom Plant's Renewable Energy Production?",
            "A": "The average value of GeoThermal Bloom Plant's renewable energy production is {116141876.92} MWh."
        },
        {
            "Q": "What is the average value of Verdant Biomass Facility's Renewable Energy Production?",
            "A": "The average value of Verdant Biomass Facility's renewable energy production is {416691867.73} MWh."
        },
        {
            "Q": "What is the rate of change in Azure Tide Energy's Renewable Energy Production from the starting year to the final year?",
            "A": "The rate of decline in Azure Tide Energy's renewable energy production is {-99.01}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Stellar Wind Array's Renewable Energy Production between 81596165 and 100982430 MWh? Please list the years and corresponding values.",
            "A": "{96752726.60} MWh in {1968} year, {90092974.12} MWh in {1959} year, {86031297.40} MWh in {1970} year."
        },
        {
            "Q": "Which years did GeoThermal Bloom Plant's Renewable Energy Production exceed 128210446 MWh? Please list the years and corresponding values.",
            "A": "{129317634.90} MWh in {1969} year, {142456051.59} MWh in {1974} year, {139062405.23} MWh in {1973} year."
        },
        {
            "Q": "Which years did GeoThermal Bloom Plant's Renewable Energy Production below 102642924 MWh? Please list the years and corresponding values.",
            "A": "{91258003.52} MWh in {1956} year, {96243123.37} MWh in {1957} year, {98555282.69} MWh in {1958} year."
        },
        {
            "Q": "In the year 1967, which lines had Renewable Energy Production between 98652483 and 193721200 MWh? Please list the lines and corresponding values.",
            "A": "{GeoThermal Bloom Plant} had {122316210} MWh, {Stellar Wind Array} had {102420372} MWh."
        }
    ],
    "NC": [
        {
            "Q": "Between 1958 and 1966, which line experienced the largest change in Renewable Energy Production, Stellar Wind Array, Azure Tide Energy, GeoThermal Bloom Plant, or Verdant Biomass Facility?",
            "A": "{Verdant Biomass Facility} experienced the largest change in renewable energy production."
        },
        {
            "Q": "In 1973, which line had the highest Renewable Energy Production, GeoThermal Bloom Plant, Azure Tide Energy, or Verdant Biomass Facility?",
            "A": "In 1973, {Verdant Biomass Facility} had the highest renewable energy production."
        },
        {
            "Q": "In 1974, which line had a higher Renewable Energy Production, {Verdant Biomass Facility} or {Azure Tide Energy}?",
            "A": "In 1974, {Verdant Biomass Facility} had a higher renewable energy production."
        },
        {
            "Q": "In 1972, which line had the highest Renewable Energy Production, Verdant Biomass Facility, Azure Tide Energy, or GeoThermal Bloom Plant?",
            "A": "In 1972, {Verdant Biomass Facility} had the highest renewable energy production."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Verdant Biomass Facility}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1960 and 1961?",
            "A": "{Verdant Biomass Facility} has the fastest average growth rate between 1960 and 1961."
        },
        {
            "Q": "In which year did GeoThermal Bloom Plant first surpass Azure Tide Energy?",
            "A": "GeoThermal Bloom Plant first surpassed Azure Tide Energy in the year {1960}."
        },
        {
            "Q": "Which label had the leading renewable energy production since 1958?",
            "A": "Since 1958, {Verdant Biomass Facility} had the leading renewable energy production."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Verdant Biomass Facility. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1955, 1974}."
        }
    ]
}