{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Stellar Bistro, what is the spatial relationship of the data point in 1972 relative to that in 1963 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Stellar Bistro, the data point in 1972 is {above} and to the {right} of the data point in 1963."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Stellar Bistro's Food Cost Percentage levels?",
            "A": "Stellar Bistro's food cost percentage levels show a {exponential rising} trend."
        },
        {
            "Q": "Which line shows a exponential rising trend in Food Cost Percentage levels?",
            "A": "{Stellar Bistro}."
        }
    ],
    "VE": [
        {
            "Q": "What is Stellar Bistro's Food Cost Percentage in 1961?",
            "A": "Stellar Bistro's food cost percentage in 1961 is {40.27} %."
        },
        {
            "Q": "What is Stellar Bistro's Food Cost Percentage in 1972?",
            "A": "Stellar Bistro's food cost percentage in 1972 is {100} %."
        },
        {
            "Q": "What is Stellar Bistro's Food Cost Percentage in 1980?",
            "A": "Stellar Bistro's food cost percentage in 1980 is {100} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Food Cost Percentage in the line chart?",
            "A": "The global minimum food cost percentage is {25.04} %."
        },
        {
            "Q": "What is the global maximum Food Cost Percentage in the line chart?",
            "A": "The global maximum food cost percentage is {100.00} %."
        },
        {
            "Q": "What is the highest Food Cost Percentage level recorded for Stellar Bistro?",
            "A": "Stellar Bistro reached approximately {100.00} % in {1971}."
        },
        {
            "Q": "What is the lowest Food Cost Percentage level recorded for Stellar Bistro?",
            "A": "Stellar Bistro's lowest recorded level is approximately {25.04} % in {1956}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Stellar Bistro's Food Cost Percentage?",
            "A": "The average value of Stellar Bistro's food cost percentage is {74.78} %."
        },
        {
            "Q": "What is the rate of change in Stellar Bistro's Food Cost Percentage from the starting year to the final year?",
            "A": "The rate of growth in Stellar Bistro's food cost percentage is {299.36}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Stellar Bistro's Food Cost Percentage below 48 %? Please list the years and corresponding values.",
            "A": "{44.18} % in {1962} year, {33.29} % in {1959} year, {36.46} % in {1960} year."
        },
        {
            "Q": "Which years did Stellar Bistro's Food Cost Percentage exceed 90 %? Please list the years and corresponding values.",
            "A": "{100} % in {1978} year, {100} % in {1975} year, {100} % in {1980} year."
        },
        {
            "Q": "Which years did Stellar Bistro's Food Cost Percentage between 53 and 95 %? Please list the years and corresponding values.",
            "A": "{78.44} % in {1968} year, {58.96} % in {1965} year, {64.73} % in {1966} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Stellar Bistro's Food Cost Percentage in 1973 higher or lower than in 1983?",
            "A": "The food cost percentage in 1973 was {the same} than in 1983."
        },
        {
            "Q": "Was Stellar Bistro's Food Cost Percentage in 1957 higher or lower than in 1968?",
            "A": "The food cost percentage in 1957 was {lower} than in 1968."
        },
        {
            "Q": "Was Stellar Bistro's Food Cost Percentage in 1956 higher or lower than in 1958?",
            "A": "The food cost percentage in 1956 was {lower} than in 1958."
        },
        {
            "Q": "Was Stellar Bistro's Food Cost Percentage in 1965 higher or lower than in 1981?",
            "A": "The food cost percentage in 1965 was {lower} than in 1981."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Stellar Bistro. List the x-coordinates of data points to be preserved.(4 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1956, 1964, 1971, 1983}."
        }
    ]
}