{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {4} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1950, what is the vertical (above/below) relationship of the line representing Emerald Diner relative to The Rusty Kettle?",
            "A": "In 1950, Emerald Diner is {above} The Rusty Kettle in the vertical direction."
        },
        {
            "Q": "On The Rusty Kettle, what is the spatial relationship of the data point in 1956 relative to that in 1957 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On The Rusty Kettle, the data point in 1956 is {below} and to the {left} of the data point in 1957."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Emerald Diner's Customer Traffic levels?",
            "A": "Emerald Diner's customer traffic levels show a {stable falling} trend."
        },
        {
            "Q": "What is the trend of Crimson Plate's Customer Traffic levels?",
            "A": "Crimson Plate's customer traffic levels show a {stable rising} trend."
        },
        {
            "Q": "What is the trend of The Rusty Kettle's Customer Traffic levels?",
            "A": "The Rusty Kettle's customer traffic levels show a {stable falling} trend."
        },
        {
            "Q": "What is the trend of Stellar Bistro's Customer Traffic levels?",
            "A": "Stellar Bistro's customer traffic levels show a {volatile rising} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is The Rusty Kettle's Customer Traffic in 1955?",
            "A": "The Rusty Kettle's customer traffic in 1955 is {517.43} customers/day."
        },
        {
            "Q": "What is Emerald Diner's Customer Traffic in 1956?",
            "A": "Emerald Diner's customer traffic in 1956 is {730.64} customers/day."
        },
        {
            "Q": "What is The Rusty Kettle's Customer Traffic in 1965?",
            "A": "The Rusty Kettle's customer traffic in 1965 is {644.79} customers/day."
        },
        {
            "Q": "What are the customer traffic of Crimson Plate, Stellar Bistro, and Emerald Diner in 1952?",
            "A": "Crimson Plate's customer traffic is {484.54} customers/day, Stellar Bistro's customer traffic is {493.97} customers/day, Emerald Diner's customer traffic is {647.24} customers/day."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Customer Traffic in the line chart?",
            "A": "The global minimum customer traffic is {436.47} customers/day."
        },
        {
            "Q": "What is the global maximum Customer Traffic in the line chart?",
            "A": "The global maximum customer traffic is {948.25} customers/day."
        },
        {
            "Q": "What is the highest Customer Traffic level recorded for Crimson Plate?",
            "A": "Crimson Plate reached approximately {797.88} customers/day in {1966}."
        },
        {
            "Q": "What is the lowest Customer Traffic level recorded for Crimson Plate?",
            "A": "Crimson Plate's lowest recorded level is approximately {440.28} customers/day in {1950}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Crimson Plate's Customer Traffic?",
            "A": "The average value of Crimson Plate's customer traffic is {617.12} customers/day."
        },
        {
            "Q": "What is the average value of The Rusty Kettle's Customer Traffic?",
            "A": "The average value of The Rusty Kettle's customer traffic is {556.07} customers/day."
        },
        {
            "Q": "What is the rate of change in Stellar Bistro's Customer Traffic from the starting year to the final year?",
            "A": "The rate of growth in Stellar Bistro's customer traffic is {117.25}%."
        },
        {
            "Q": "What is the average value of Stellar Bistro's Customer Traffic?",
            "A": "The average value of Stellar Bistro's customer traffic is {691.73} customers/day."
        }
    ],
    "NF": [
        {
            "Q": "Which years did The Rusty Kettle's Customer Traffic below 510 customers/day? Please list the years and corresponding values.",
            "A": "{473.13} customers/day in {1951} year, {476.72} customers/day in {1952} year, {458.54} customers/day in {1950} year."
        },
        {
            "Q": "Which years did Emerald Diner's Customer Traffic below 696 customers/day? Please list the years and corresponding values.",
            "A": "{647.24} customers/day in {1952} year, {622.29} customers/day in {1950} year, {633.43} customers/day in {1951} year."
        },
        {
            "Q": "In the year 1950, which lines had Customer Traffic between 445 and 493 customers/day? Please list the lines and corresponding values.",
            "A": "{The Rusty Kettle} had {459} customers/day."
        },
        {
            "Q": "Which years did Emerald Diner's Customer Traffic exceed 813 customers/day? Please list the years and corresponding values.",
            "A": "{898.95} customers/day in {1965} year, {852.49} customers/day in {1963} year, {837.69} customers/day in {1962} year."
        }
    ],
    "NC": [
        {
            "Q": "Was The Rusty Kettle's Customer Traffic in 1953 higher or lower than in 1965?",
            "A": "The customer traffic in 1953 was {lower} than in 1965."
        },
        {
            "Q": "Was Emerald Diner's Customer Traffic in 1959 higher or lower than in 1962?",
            "A": "The customer traffic in 1959 was {lower} than in 1962."
        },
        {
            "Q": "In 1950, which line had the highest Customer Traffic, Crimson Plate, Emerald Diner, or The Rusty Kettle?",
            "A": "In 1950, {Emerald Diner} had the highest customer traffic."
        },
        {
            "Q": "Between 1952 and 1954, which line experienced the largest change in Customer Traffic, Crimson Plate, Stellar Bistro, The Rusty Kettle, or Emerald Diner?",
            "A": "{Stellar Bistro} experienced the largest change in customer traffic."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Stellar Bistro}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1955 and 1960?",
            "A": "{Stellar Bistro} has the fastest average growth rate between 1955 and 1960."
        },
        {
            "Q": "In which year did Stellar Bistro first surpass Crimson Plate?",
            "A": "Stellar Bistro first surpassed Crimson Plate in the year {1951}."
        },
        {
            "Q": "Which label had the leading customer traffic since 1959?",
            "A": "Since 1959, {Emerald Diner} had the leading customer traffic."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the The Rusty Kettle. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1950, 1966}."
        }
    ]
}