{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {3} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 2012, what is the vertical (above/below) relationship of the line representing Stellar Bistro relative to The Golden Spoon?",
            "A": "In 2012, Stellar Bistro is {below} The Golden Spoon in the vertical direction."
        },
        {
            "Q": "On The Golden Spoon, what is the spatial relationship of the data point in 2006 relative to that in 2003 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On The Golden Spoon, the data point in 2006 is {above} and to the {right} of the data point in 2003."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Stellar Bistro's Food Safety Index levels?",
            "A": "Stellar Bistro's food safety index levels show a {volatile rising} trend."
        },
        {
            "Q": "What is the trend of Emerald Diner's Food Safety Index levels?",
            "A": "Emerald Diner's food safety index levels show a {stable rising} trend."
        },
        {
            "Q": "What is the trend of The Golden Spoon's Food Safety Index levels?",
            "A": "The Golden Spoon's food safety index levels show a {volatile rising} trend."
        },
        {
            "Q": "Which line shows a volatile rising trend in Food Safety Index levels?",
            "A": "{Stellar Bistro}, {The Golden Spoon}."
        }
    ],
    "VE": [
        {
            "Q": "What is The Golden Spoon's Food Safety Index in 2013?",
            "A": "The Golden Spoon's food safety index in 2013 is {236.95} index."
        },
        {
            "Q": "What is Stellar Bistro's Food Safety Index in 2015?",
            "A": "Stellar Bistro's food safety index in 2015 is {163.29} index."
        },
        {
            "Q": "What is The Golden Spoon's Food Safety Index in 2001?",
            "A": "The Golden Spoon's food safety index in 2001 is {121.05} index."
        },
        {
            "Q": "What are the food safety index of The Golden Spoon, Emerald Diner, and Stellar Bistro in 2011?",
            "A": "The Golden Spoon's food safety index is {218.21} index, Emerald Diner's food safety index is {162.73} index, Stellar Bistro's food safety index is {138.28} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Food Safety Index in the line chart?",
            "A": "The global minimum food safety index is {77.05} index."
        },
        {
            "Q": "What is the global maximum Food Safety Index in the line chart?",
            "A": "The global maximum food safety index is {314.61} index."
        },
        {
            "Q": "What is the highest Food Safety Index level recorded for Emerald Diner?",
            "A": "Emerald Diner reached approximately {217.42} index in {2021}."
        },
        {
            "Q": "What is the lowest Food Safety Index level recorded for Emerald Diner?",
            "A": "Emerald Diner's lowest recorded level is approximately {108.43} index in {2001}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in The Golden Spoon's Food Safety Index from the starting year to the final year?",
            "A": "The rate of growth in The Golden Spoon's food safety index is {159.90}%."
        },
        {
            "Q": "What is the rate of change in Stellar Bistro's Food Safety Index from the starting year to the final year?",
            "A": "The rate of growth in Stellar Bistro's food safety index is {159.20}%."
        },
        {
            "Q": "What is the average value of The Golden Spoon's Food Safety Index?",
            "A": "The average value of The Golden Spoon's food safety index is {217.63} index."
        },
        {
            "Q": "What is the average value of Emerald Diner's Food Safety Index?",
            "A": "The average value of Emerald Diner's food safety index is {162.81} index."
        }
    ],
    "NF": [
        {
            "Q": "Which years did The Golden Spoon's Food Safety Index between 179 and 257 index? Please list the years and corresponding values.",
            "A": "{227.22} index in {2012} year, {236.95} index in {2013} year, {197.78} index in {2009} year."
        },
        {
            "Q": "Which years did Emerald Diner's Food Safety Index exceed 190 index? Please list the years and corresponding values.",
            "A": "{206.28} index in {2019} year, {195.35} index in {2017} year, {200.52} index in {2018} year."
        },
        {
            "Q": "In the year 2006, which line had Food Safety Index exceed 153 index? Please list the lines and corresponding values.",
            "A": "{The Golden Spoon} had {170} index."
        },
        {
            "Q": "In the year 2017, which lines had Food Safety Index between 190 and 231 index? Please list the lines and corresponding values.",
            "A": "{Emerald Diner} had {195} index."
        }
    ],
    "NC": [
        {
            "Q": "Between 2004 and 2015, which line experienced the largest change in Food Safety Index, The Golden Spoon, Stellar Bistro, or Emerald Diner?",
            "A": "{The Golden Spoon} experienced the largest change in food safety index."
        },
        {
            "Q": "Was Emerald Diner's Food Safety Index in 2002 higher or lower than in 2013?",
            "A": "The food safety index in 2002 was {lower} than in 2013."
        },
        {
            "Q": "Was The Golden Spoon's Food Safety Index in 2003 higher or lower than in 2021?",
            "A": "The food safety index in 2003 was {lower} than in 2021."
        },
        {
            "Q": "Was Emerald Diner's Food Safety Index in 2011 higher or lower than in 2021?",
            "A": "The food safety index in 2011 was {lower} than in 2021."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {The Golden Spoon}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 2015 and 2018?",
            "A": "{The Golden Spoon} has the fastest average growth rate between 2015 and 2018."
        },
        {
            "Q": "Which label had the leading food safety index since 2010?",
            "A": "Since 2010, {The Golden Spoon} had the leading food safety index."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the The Golden Spoon. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {2001, 2021}."
        }
    ]
}