{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Stellar Bistro, what is the spatial relationship of the data point in 1976 relative to that in 1981 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Stellar Bistro, the data point in 1976 is {below} and to the {left} of the data point in 1981."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Stellar Bistro's Food Safety Index levels?",
            "A": "Stellar Bistro's food safety index levels show a {exponential rising} trend."
        },
        {
            "Q": "Which line shows a exponential rising trend in Food Safety Index levels?",
            "A": "{Stellar Bistro}."
        }
    ],
    "VE": [
        {
            "Q": "What is Stellar Bistro's Food Safety Index in 1983?",
            "A": "Stellar Bistro's food safety index in 1983 is {464.72} index."
        },
        {
            "Q": "What is Stellar Bistro's Food Safety Index in 1977?",
            "A": "Stellar Bistro's food safety index in 1977 is {262} index."
        },
        {
            "Q": "What is Stellar Bistro's Food Safety Index in 1975?",
            "A": "Stellar Bistro's food safety index in 1975 is {216.73} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Food Safety Index in the line chart?",
            "A": "The global minimum food safety index is {122.13} index."
        },
        {
            "Q": "What is the global maximum Food Safety Index in the line chart?",
            "A": "The global maximum food safety index is {510.17} index."
        },
        {
            "Q": "What is the highest Food Safety Index level recorded for Stellar Bistro?",
            "A": "Stellar Bistro reached approximately {510.17} index in {1984}."
        },
        {
            "Q": "What is the lowest Food Safety Index level recorded for Stellar Bistro?",
            "A": "Stellar Bistro's lowest recorded level is approximately {122.13} index in {1969}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Stellar Bistro's Food Safety Index from the starting year to the final year?",
            "A": "The rate of growth in Stellar Bistro's food safety index is {317.73}%."
        },
        {
            "Q": "What is the average value of Stellar Bistro's Food Safety Index?",
            "A": "The average value of Stellar Bistro's food safety index is {274.65} index."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Stellar Bistro's Food Safety Index exceed 358 index? Please list the years and corresponding values.",
            "A": "{510.17} index in {1984} year, {464.72} index in {1983} year, {422.35} index in {1982} year."
        },
        {
            "Q": "Which years did Stellar Bistro's Food Safety Index below 175 index? Please list the years and corresponding values.",
            "A": "{122.13} index in {1969} year, {134.82} index in {1970} year, {162.82} index in {1972} year."
        },
        {
            "Q": "Which years did Stellar Bistro's Food Safety Index between 193 and 339 index? Please list the years and corresponding values.",
            "A": "{262} index in {1977} year, {196.56} index in {1974} year, {288.61} index in {1978} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Stellar Bistro's Food Safety Index in 1972 higher or lower than in 1981?",
            "A": "The food safety index in 1972 was {lower} than in 1981."
        },
        {
            "Q": "Was Stellar Bistro's Food Safety Index in 1971 higher or lower than in 1974?",
            "A": "The food safety index in 1971 was {lower} than in 1974."
        },
        {
            "Q": "Was Stellar Bistro's Food Safety Index in 1975 higher or lower than in 1981?",
            "A": "The food safety index in 1975 was {lower} than in 1981."
        },
        {
            "Q": "Was Stellar Bistro's Food Safety Index in 1971 higher or lower than in 1982?",
            "A": "The food safety index in 1971 was {lower} than in 1982."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Stellar Bistro. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1969, 1984}."
        }
    ]
}