{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {2} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 2009, what is the vertical (above/below) relationship of the line representing Outer Rim Settlements relative to Crimson Quarter?",
            "A": "In 2009, Outer Rim Settlements is {below} Crimson Quarter in the vertical direction."
        },
        {
            "Q": "On Outer Rim Settlements, what is the spatial relationship of the data point in 2013 relative to that in 2000 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Outer Rim Settlements, the data point in 2013 is {below} and to the {right} of the data point in 2000."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Crimson Quarter's Vaccination Rate levels?",
            "A": "Crimson Quarter's vaccination rate levels show a {exponential falling} trend."
        },
        {
            "Q": "What is the trend of Outer Rim Settlements's Vaccination Rate levels?",
            "A": "Outer Rim Settlements's vaccination rate levels show a {volatile falling} trend."
        },
        {
            "Q": "Which line shows a exponential falling trend in Vaccination Rate levels?",
            "A": "{Crimson Quarter}."
        },
        {
            "Q": "Which line shows a volatile falling trend in Vaccination Rate levels?",
            "A": "{Outer Rim Settlements}."
        }
    ],
    "VE": [
        {
            "Q": "What is Crimson Quarter's Vaccination Rate in 2012?",
            "A": "Crimson Quarter's vaccination rate in 2012 is {12.89} %."
        },
        {
            "Q": "What is Crimson Quarter's Vaccination Rate in 2001?",
            "A": "Crimson Quarter's vaccination rate in 2001 is {40.59} %."
        },
        {
            "Q": "What is Crimson Quarter's Vaccination Rate in 2000?",
            "A": "Crimson Quarter's vaccination rate in 2000 is {45.07} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Vaccination Rate in the line chart?",
            "A": "The global minimum vaccination rate is {1.07} %."
        },
        {
            "Q": "What is the global maximum Vaccination Rate in the line chart?",
            "A": "The global maximum vaccination rate is {100.00} %."
        },
        {
            "Q": "What is the highest Vaccination Rate level recorded for Crimson Quarter?",
            "A": "Crimson Quarter reached approximately {76.38} % in {1995}."
        },
        {
            "Q": "What is the lowest Vaccination Rate level recorded for Crimson Quarter?",
            "A": "Crimson Quarter's lowest recorded level is approximately {6.24} % in {2019}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Crimson Quarter's Vaccination Rate?",
            "A": "The average value of Crimson Quarter's vaccination rate is {28.32} %."
        },
        {
            "Q": "What is the rate of change in Crimson Quarter's Vaccination Rate from the starting year to the final year?",
            "A": "The rate of decline in Crimson Quarter's vaccination rate is {-91.83}%."
        },
        {
            "Q": "What is the average value of Outer Rim Settlements's Vaccination Rate?",
            "A": "The average value of Outer Rim Settlements's vaccination rate is {37.80} %."
        },
        {
            "Q": "What is the rate of change in Outer Rim Settlements's Vaccination Rate from the starting year to the final year?",
            "A": "The rate of decline in Outer Rim Settlements's vaccination rate is {-98.93}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 2013, which lines had Vaccination Rate below 4 %? Please list the lines and corresponding values.",
            "A": "{Outer Rim Settlements} had {1} %."
        },
        {
            "Q": "In the year 2016, which lines had Vaccination Rate below 3 %? Please list the lines and corresponding values.",
            "A": "{Outer Rim Settlements} had {1} %."
        },
        {
            "Q": "Which years did Outer Rim Settlements's Vaccination Rate below 1 %? Please list the years and corresponding values.",
            "A": "{1.07} % in {2017} year, {1.07} % in {2014} year, {1.07} % in {2016} year."
        },
        {
            "Q": "In the year 2000, which lines had Vaccination Rate below 52 %? Please list the lines and corresponding values.",
            "A": "{Crimson Quarter} had {45} %."
        }
    ],
    "NC": [
        {
            "Q": "In 2002, which line had a higher Vaccination Rate, {Outer Rim Settlements} or {Crimson Quarter}?",
            "A": "In 2002, {Outer Rim Settlements} had a higher vaccination rate."
        },
        {
            "Q": "Between 2009 and 2013, which line had a higher average Vaccination Rate, Outer Rim Settlements or Crimson Quarter?",
            "A": "{Crimson Quarter} had a higher average vaccination rate."
        },
        {
            "Q": "Between 1995 and 2006, which line had a higher average Vaccination Rate, Outer Rim Settlements or Crimson Quarter?",
            "A": "{Outer Rim Settlements} had a higher average vaccination rate."
        },
        {
            "Q": "Was Outer Rim Settlements's Vaccination Rate in 1996 higher or lower than in 2017?",
            "A": "The vaccination rate in 1996 was {higher} than in 2017."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Outer Rim Settlements}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 2014 and 2017?",
            "A": "{Outer Rim Settlements} has the fastest average growth rate between 2014 and 2017."
        },
        {
            "Q": "In which year did Crimson Quarter first surpass Outer Rim Settlements?",
            "A": "Crimson Quarter first surpassed Outer Rim Settlements in the year {2009}."
        },
        {
            "Q": "Which label had the leading vaccination rate since 2017?",
            "A": "Since 2017, {Crimson Quarter} had the leading vaccination rate."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Outer Rim Settlements. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1995, 2011, 2019}."
        }
    ]
}