{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {7} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1989, what is the vertical (above/below) relationship of the line representing Silverhaven Community Hospital relative to Borealis Medical Center?",
            "A": "In 1989, Silverhaven Community Hospital is {below} Borealis Medical Center in the vertical direction."
        },
        {
            "Q": "On Zenith Care Hospital, what is the spatial relationship of the data point in 1978 relative to that in 1982 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Zenith Care Hospital, the data point in 1978 is {above} and to the {left} of the data point in 1982."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Meridian Teaching Hospital's Hospital Bed Occupancy levels?",
            "A": "Meridian Teaching Hospital's hospital bed occupancy levels show a {stable rising} trend."
        },
        {
            "Q": "What is the trend of Stellar Memorial Hospital's Hospital Bed Occupancy levels?",
            "A": "Stellar Memorial Hospital's hospital bed occupancy levels show a {exponential rising} trend."
        },
        {
            "Q": "What is the trend of Zenith Care Hospital's Hospital Bed Occupancy levels?",
            "A": "Zenith Care Hospital's hospital bed occupancy levels show a {exponential falling} trend."
        },
        {
            "Q": "What is the trend of Silverhaven Community Hospital's Hospital Bed Occupancy levels?",
            "A": "Silverhaven Community Hospital's hospital bed occupancy levels show a {periodic stable} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Azure Coast Hospital's Hospital Bed Occupancy in 1983?",
            "A": "Azure Coast Hospital's hospital bed occupancy in 1983 is {100} %."
        },
        {
            "Q": "What is Borealis Medical Center's Hospital Bed Occupancy in 1983?",
            "A": "Borealis Medical Center's hospital bed occupancy in 1983 is {100} %."
        },
        {
            "Q": "What is Stellar Memorial Hospital's Hospital Bed Occupancy in 1995?",
            "A": "Stellar Memorial Hospital's hospital bed occupancy in 1995 is {100} %."
        },
        {
            "Q": "What are the hospital bed occupancy of Zenith Care Hospital, Borealis Medical Center, and Azure Coast Hospital in 1978?",
            "A": "Zenith Care Hospital's hospital bed occupancy is {52.46} %, Borealis Medical Center's hospital bed occupancy is {83.99} %, Azure Coast Hospital's hospital bed occupancy is {100} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Hospital Bed Occupancy in the line chart?",
            "A": "The global minimum hospital bed occupancy is {6.23} %."
        },
        {
            "Q": "What is the global maximum Hospital Bed Occupancy in the line chart?",
            "A": "The global maximum hospital bed occupancy is {100.00} %."
        },
        {
            "Q": "What is the highest Hospital Bed Occupancy level recorded for Aethelgard General Hospital?",
            "A": "Aethelgard General Hospital reached approximately {100.00} % in {1973}."
        },
        {
            "Q": "What is the lowest Hospital Bed Occupancy level recorded for Aethelgard General Hospital?",
            "A": "Aethelgard General Hospital's lowest recorded level is approximately {100.00} % in {1973}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Azure Coast Hospital's Hospital Bed Occupancy from the starting year to the final year?",
            "A": "The rate of growth in Azure Coast Hospital's hospital bed occupancy is {18.40}%."
        },
        {
            "Q": "What is the rate of change in Aethelgard General Hospital's Hospital Bed Occupancy from the starting year to the final year?",
            "A": "The rate of no change in Aethelgard General Hospital's hospital bed occupancy is {0.00}%."
        },
        {
            "Q": "What is the average value of Azure Coast Hospital's Hospital Bed Occupancy?",
            "A": "The average value of Azure Coast Hospital's hospital bed occupancy is {98.53} %."
        },
        {
            "Q": "What is the rate of change in Meridian Teaching Hospital's Hospital Bed Occupancy from the starting year to the final year?",
            "A": "The rate of growth in Meridian Teaching Hospital's hospital bed occupancy is {101.05}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1990, which lines had Hospital Bed Occupancy below 85 %? Please list the lines and corresponding values.",
            "A": "{Zenith Care Hospital} had {15} %, {Silverhaven Community Hospital} had {78} %."
        },
        {
            "Q": "Which years did Zenith Care Hospital's Hospital Bed Occupancy between 16 and 43 %? Please list the years and corresponding values.",
            "A": "{38.69} % in {1981} year, {28.26} % in {1984} year, {23.37} % in {1986} year."
        },
        {
            "Q": "Which years did Borealis Medical Center's Hospital Bed Occupancy below 88 %? Please list the years and corresponding values.",
            "A": "{70.36} % in {1974} year, {80.27} % in {1977} year, {83.99} % in {1978} year."
        },
        {
            "Q": "In the year 1989, which line had Hospital Bed Occupancy exceed 90 %? Please list the lines and corresponding values.",
            "A": "{Aethelgard General Hospital} had {100} %, {Stellar Memorial Hospital} had {100} %, {Borealis Medical Center} had {100} %."
        }
    ],
    "NC": [
        {
            "Q": "Between 1987 and 1996, which line had the highest average Hospital Bed Occupancy, Meridian Teaching Hospital, Aethelgard General Hospital, Azure Coast Hospital, or Zenith Care Hospital?",
            "A": "{Aethelgard General Hospital} had the highest average hospital bed occupancy."
        },
        {
            "Q": "Was Aethelgard General Hospital's Hospital Bed Occupancy in 1978 higher or lower than in 1998?",
            "A": "The hospital bed occupancy in 1978 was {the same} than in 1998."
        },
        {
            "Q": "Between 1984 and 1990, which line had the highest average Hospital Bed Occupancy, Silverhaven Community Hospital, Aethelgard General Hospital, Zenith Care Hospital, or Borealis Medical Center?",
            "A": "{Aethelgard General Hospital} had the highest average hospital bed occupancy."
        },
        {
            "Q": "Between 1982 and 1986, which line experienced a larger change in Hospital Bed Occupancy, Azure Coast Hospital or Zenith Care Hospital?",
            "A": "{Zenith Care Hospital} experienced a larger change in hospital bed occupancy."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Zenith Care Hospital}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1974 and 1980?",
            "A": "{Stellar Memorial Hospital} has the fastest average growth rate between 1974 and 1980."
        },
        {
            "Q": "In which year did Stellar Memorial Hospital first surpass Zenith Care Hospital?",
            "A": "Stellar Memorial Hospital first surpassed Zenith Care Hospital in the year {1976}."
        },
        {
            "Q": "Which label had the leading hospital bed occupancy since 1995?",
            "A": "Since 1995, {Aethelgard General Hospital} had the leading hospital bed occupancy."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Aethelgard General Hospital. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1973, 1998}."
        }
    ]
}