{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {7} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1986, what is the vertical (above/below) relationship of the line representing Outer Rim Settlements relative to Sector Beta?",
            "A": "In 1986, Outer Rim Settlements is {below} Sector Beta in the vertical direction."
        },
        {
            "Q": "On Crimson Quarter, what is the spatial relationship of the data point in 2003 relative to that in 1984 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Crimson Quarter, the data point in 2003 is {above} and to the {right} of the data point in 1984."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Outer Rim Settlements's Vaccination Rate levels?",
            "A": "Outer Rim Settlements's vaccination rate levels show a {bimodal valley} trend."
        },
        {
            "Q": "What is the trend of District Alpha's Vaccination Rate levels?",
            "A": "District Alpha's vaccination rate levels show a {volatile rising} trend."
        },
        {
            "Q": "What is the trend of Verdant Ward's Vaccination Rate levels?",
            "A": "Verdant Ward's vaccination rate levels show a {exponential rising} trend."
        },
        {
            "Q": "What is the trend of Crimson Quarter's Vaccination Rate levels?",
            "A": "Crimson Quarter's vaccination rate levels show a {bimodal valley} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Stellar City Core's Vaccination Rate in 1978?",
            "A": "Stellar City Core's vaccination rate in 1978 is {78.57} %."
        },
        {
            "Q": "What is Azure Enclave's Vaccination Rate in 1987?",
            "A": "Azure Enclave's vaccination rate in 1987 is {100} %."
        },
        {
            "Q": "What is Stellar City Core's Vaccination Rate in 1998?",
            "A": "Stellar City Core's vaccination rate in 1998 is {0.84} %."
        },
        {
            "Q": "What are the vaccination rate of Sector Beta, Stellar City Core, and Azure Enclave in 2002?",
            "A": "Sector Beta's vaccination rate is {1.02} %, Stellar City Core's vaccination rate is {0.84} %, Azure Enclave's vaccination rate is {100} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Vaccination Rate in the line chart?",
            "A": "The global minimum vaccination rate is {0.84} %."
        },
        {
            "Q": "What is the global maximum Vaccination Rate in the line chart?",
            "A": "The global maximum vaccination rate is {100.00} %."
        },
        {
            "Q": "What is the highest Vaccination Rate level recorded for Azure Enclave?",
            "A": "Azure Enclave reached approximately {100.00} % in {1983}."
        },
        {
            "Q": "What is the lowest Vaccination Rate level recorded for Azure Enclave?",
            "A": "Azure Enclave's lowest recorded level is approximately {79.64} % in {1977}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Azure Enclave's Vaccination Rate from the starting year to the final year?",
            "A": "The rate of growth in Azure Enclave's vaccination rate is {25.57}%."
        },
        {
            "Q": "What is the average value of Azure Enclave's Vaccination Rate?",
            "A": "The average value of Azure Enclave's vaccination rate is {97.61} %."
        },
        {
            "Q": "What is the average value of Crimson Quarter's Vaccination Rate?",
            "A": "The average value of Crimson Quarter's vaccination rate is {36.37} %."
        },
        {
            "Q": "What is the rate of change in Outer Rim Settlements's Vaccination Rate from the starting year to the final year?",
            "A": "The rate of decline in Outer Rim Settlements's vaccination rate is {-1.18}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1995, which line had Vaccination Rate exceed 90 %? Please list the lines and corresponding values.",
            "A": "{District Alpha} had {100} %, {Azure Enclave} had {100} %, {Verdant Ward} had {100} %."
        },
        {
            "Q": "In the year 1980, which line had Vaccination Rate exceed 82 %? Please list the lines and corresponding values.",
            "A": "{Verdant Ward} had {85} %, {Sector Beta} had {84} %, {Azure Enclave} had {91} %."
        },
        {
            "Q": "In the year 1980, which lines had Vaccination Rate below 48 %? Please list the lines and corresponding values.",
            "A": "{Crimson Quarter} had {37} %, {Outer Rim Settlements} had {31} %."
        },
        {
            "Q": "In the year 1991, which line had Vaccination Rate exceed 90 %? Please list the lines and corresponding values.",
            "A": "{Verdant Ward} had {100} %, {District Alpha} had {100} %, {Azure Enclave} had {100} %."
        }
    ],
    "NC": [
        {
            "Q": "Was Verdant Ward's Vaccination Rate in 2001 higher or lower than in 2002?",
            "A": "The vaccination rate in 2001 was {the same} than in 2002."
        },
        {
            "Q": "In 1993, which line had a higher Vaccination Rate, {Outer Rim Settlements} or {District Alpha}?",
            "A": "In 1993, {District Alpha} had a higher vaccination rate."
        },
        {
            "Q": "Was Sector Beta's Vaccination Rate in 1979 higher or lower than in 1998?",
            "A": "The vaccination rate in 1979 was {higher} than in 1998."
        },
        {
            "Q": "In 1989, which line had a higher Vaccination Rate, {Sector Beta} or {Azure Enclave}?",
            "A": "In 1989, {Azure Enclave} had a higher vaccination rate."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Sector Beta}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1980 and 1990?",
            "A": "{District Alpha} has the fastest average growth rate between 1980 and 1990."
        },
        {
            "Q": "In which year did Verdant Ward first surpass Azure Enclave?",
            "A": "Verdant Ward first surpassed Azure Enclave in the year {1982}."
        },
        {
            "Q": "Which label had the leading vaccination rate since 1982?",
            "A": "Since 1982, {Verdant Ward} had the leading vaccination rate."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the District Alpha. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1977, 1991, 2003}."
        }
    ]
}