{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {6} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1998, what is the vertical (above/below) relationship of the line representing FarmGate Transit relative to CropConnect Logistics?",
            "A": "In 1998, FarmGate Transit is {below} CropConnect Logistics in the vertical direction."
        },
        {
            "Q": "On HarvestLink Systems, what is the spatial relationship of the data point in 1999 relative to that in 1997 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On HarvestLink Systems, the data point in 1999 is {above} and to the {right} of the data point in 1997."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of FarmGate Transit's Food Waste levels?",
            "A": "FarmGate Transit's food waste levels show a {exponential falling} trend."
        },
        {
            "Q": "What is the trend of CropConnect Logistics's Food Waste levels?",
            "A": "CropConnect Logistics's food waste levels show a {stable rising} trend."
        },
        {
            "Q": "What is the trend of Verdant Distribution's Food Waste levels?",
            "A": "Verdant Distribution's food waste levels show a {stable falling} trend."
        },
        {
            "Q": "What is the trend of HarvestLink Systems's Food Waste levels?",
            "A": "HarvestLink Systems's food waste levels show a {stable rising} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is FarmGate Transit's Food Waste in 1997?",
            "A": "FarmGate Transit's food waste in 1997 is {5288.38} tons."
        },
        {
            "Q": "What is Verdant Distribution's Food Waste in 1997?",
            "A": "Verdant Distribution's food waste in 1997 is {8431.21} tons."
        },
        {
            "Q": "What is Verdant Distribution's Food Waste in 1999?",
            "A": "Verdant Distribution's food waste in 1999 is {8900.33} tons."
        },
        {
            "Q": "What are the food waste of HarvestLink Systems, Verdant Distribution, and CropConnect Logistics in 2001?",
            "A": "HarvestLink Systems's food waste is {7917.43} tons, Verdant Distribution's food waste is {9430.76} tons, CropConnect Logistics's food waste is {7784.96} tons."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Food Waste in the line chart?",
            "A": "The global minimum food waste is {3140.56} tons."
        },
        {
            "Q": "What is the global maximum Food Waste in the line chart?",
            "A": "The global maximum food waste is {14079.83} tons."
        },
        {
            "Q": "What is the highest Food Waste level recorded for AgriFlow Solutions?",
            "A": "AgriFlow Solutions reached approximately {14079.83} tons in {2002}."
        },
        {
            "Q": "What is the lowest Food Waste level recorded for AgriFlow Solutions?",
            "A": "AgriFlow Solutions's lowest recorded level is approximately {8651.04} tons in {2000}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of AgroChain Management's Food Waste?",
            "A": "The average value of AgroChain Management's food waste is {4253.32} tons."
        },
        {
            "Q": "What is the average value of CropConnect Logistics's Food Waste?",
            "A": "The average value of CropConnect Logistics's food waste is {7201.68} tons."
        },
        {
            "Q": "What is the average value of Verdant Distribution's Food Waste?",
            "A": "The average value of Verdant Distribution's food waste is {8911.72} tons."
        },
        {
            "Q": "What is the rate of change in HarvestLink Systems's Food Waste from the starting year to the final year?",
            "A": "The rate of growth in HarvestLink Systems's food waste is {27.95}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1999, which lines had Food Waste below 5039 tons? Please list the lines and corresponding values.",
            "A": "{FarmGate Transit} had {4330} tons, {AgroChain Management} had {3440} tons."
        },
        {
            "Q": "In the year 2000, which line had Food Waste exceed 8229 tons? Please list the lines and corresponding values.",
            "A": "{AgriFlow Solutions} had {8651} tons, {Verdant Distribution} had {9143} tons."
        },
        {
            "Q": "Which years did AgriFlow Solutions's Food Waste between 10792 and 13205 tons? Please list the years and corresponding values.",
            "A": "{11344.03} tons in {2001} year, {12999.97} tons in {1998} year, {11326.66} tons in {1996} year."
        },
        {
            "Q": "In the year 1996, which lines had Food Waste below 5982 tons? Please list the lines and corresponding values.",
            "A": "{FarmGate Transit} had {5879} tons, {AgroChain Management} had {5267} tons."
        }
    ],
    "NC": [
        {
            "Q": "Between 2000 and 2001, which line experienced the largest change in Food Waste, Verdant Distribution, FarmGate Transit, or HarvestLink Systems?",
            "A": "{FarmGate Transit} experienced the largest change in food waste."
        },
        {
            "Q": "Was FarmGate Transit's Food Waste in 1998 higher or lower than in 2000?",
            "A": "The food waste in 1998 was {higher} than in 2000."
        },
        {
            "Q": "Between 1997 and 2000, which line had the highest average Food Waste, AgroChain Management, AgriFlow Solutions, or CropConnect Logistics?",
            "A": "{AgriFlow Solutions} had the highest average food waste."
        },
        {
            "Q": "Between 2001 and 2002, which line had the highest average Food Waste, Verdant Distribution, AgriFlow Solutions, FarmGate Transit, or AgroChain Management?",
            "A": "{AgriFlow Solutions} had the highest average food waste."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {AgriFlow Solutions}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 2000 and 2001?",
            "A": "{AgriFlow Solutions} has the fastest average growth rate between 2000 and 2001."
        },
        {
            "Q": "In which year did AgroChain Management first surpass FarmGate Transit?",
            "A": "AgroChain Management first surpassed FarmGate Transit in the year {2001}."
        },
        {
            "Q": "Which label had the leading food waste since 1999?",
            "A": "Since 1999, {AgriFlow Solutions} had the leading food waste."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the AgroChain Management. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1996, 1999, 2002}."
        }
    ]
}