{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {3} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1964, what is the vertical (above/below) relationship of the line representing Zenith Care Hospital relative to Azure Coast Hospital?",
            "A": "In 1964, Zenith Care Hospital is {below} Azure Coast Hospital in the vertical direction."
        },
        {
            "Q": "On Silverhaven Community Hospital, what is the spatial relationship of the data point in 1963 relative to that in 1967 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Silverhaven Community Hospital, the data point in 1963 is {below} and to the {left} of the data point in 1967."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Zenith Care Hospital's Hospital Bed Occupancy levels?",
            "A": "Zenith Care Hospital's hospital bed occupancy levels show a {bimodal valley} trend."
        },
        {
            "Q": "What is the trend of Azure Coast Hospital's Hospital Bed Occupancy levels?",
            "A": "Azure Coast Hospital's hospital bed occupancy levels show a {bimodal peak} trend."
        },
        {
            "Q": "What is the trend of Silverhaven Community Hospital's Hospital Bed Occupancy levels?",
            "A": "Silverhaven Community Hospital's hospital bed occupancy levels show a {exponential rising} trend."
        },
        {
            "Q": "Which line shows a bimodal valley trend in Hospital Bed Occupancy levels?",
            "A": "{Zenith Care Hospital}."
        }
    ],
    "VE": [
        {
            "Q": "What is Silverhaven Community Hospital's Hospital Bed Occupancy in 1966?",
            "A": "Silverhaven Community Hospital's hospital bed occupancy in 1966 is {100} %."
        },
        {
            "Q": "What is Zenith Care Hospital's Hospital Bed Occupancy in 1966?",
            "A": "Zenith Care Hospital's hospital bed occupancy in 1966 is {0.43} %."
        },
        {
            "Q": "What is Zenith Care Hospital's Hospital Bed Occupancy in 1969?",
            "A": "Zenith Care Hospital's hospital bed occupancy in 1969 is {0.43} %."
        },
        {
            "Q": "What are the hospital bed occupancy of Silverhaven Community Hospital, Zenith Care Hospital, and Azure Coast Hospital in 1969?",
            "A": "Silverhaven Community Hospital's hospital bed occupancy is {100} %, Zenith Care Hospital's hospital bed occupancy is {0.43} %, Azure Coast Hospital's hospital bed occupancy is {100} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Hospital Bed Occupancy in the line chart?",
            "A": "The global minimum hospital bed occupancy is {0.43} %."
        },
        {
            "Q": "What is the global maximum Hospital Bed Occupancy in the line chart?",
            "A": "The global maximum hospital bed occupancy is {100.00} %."
        },
        {
            "Q": "What is the highest Hospital Bed Occupancy level recorded for Azure Coast Hospital?",
            "A": "Azure Coast Hospital reached approximately {100.00} % in {1963}."
        },
        {
            "Q": "What is the lowest Hospital Bed Occupancy level recorded for Azure Coast Hospital?",
            "A": "Azure Coast Hospital's lowest recorded level is approximately {100.00} % in {1963}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Silverhaven Community Hospital's Hospital Bed Occupancy from the starting year to the final year?",
            "A": "The rate of growth in Silverhaven Community Hospital's hospital bed occupancy is {20.70}%."
        },
        {
            "Q": "What is the rate of change in Azure Coast Hospital's Hospital Bed Occupancy from the starting year to the final year?",
            "A": "The rate of no change in Azure Coast Hospital's hospital bed occupancy is {0.00}%."
        },
        {
            "Q": "What is the average value of Zenith Care Hospital's Hospital Bed Occupancy?",
            "A": "The average value of Zenith Care Hospital's hospital bed occupancy is {0.43} %."
        },
        {
            "Q": "What is the average value of Silverhaven Community Hospital's Hospital Bed Occupancy?",
            "A": "The average value of Silverhaven Community Hospital's hospital bed occupancy is {96.68} %."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1963, which lines had Hospital Bed Occupancy below 42 %? Please list the lines and corresponding values.",
            "A": "{Zenith Care Hospital} had {0} %."
        },
        {
            "Q": "In the year 1967, which lines had Hospital Bed Occupancy below 50 %? Please list the lines and corresponding values.",
            "A": "{Zenith Care Hospital} had {0} %."
        },
        {
            "Q": "Which years did Silverhaven Community Hospital's Hospital Bed Occupancy exceed 90 %? Please list the years and corresponding values.",
            "A": "{100} % in {1967} year, {100} % in {1968} year, {100} % in {1969} year."
        },
        {
            "Q": "In the year 1966, which lines had Hospital Bed Occupancy below 50 %? Please list the lines and corresponding values.",
            "A": "{Zenith Care Hospital} had {0} %."
        }
    ],
    "NC": [
        {
            "Q": "Was Silverhaven Community Hospital's Hospital Bed Occupancy in 1967 higher or lower than in 1968?",
            "A": "The hospital bed occupancy in 1967 was {the same} than in 1968."
        },
        {
            "Q": "Between 1963 and 1969, which line experienced the largest change in Hospital Bed Occupancy, Silverhaven Community Hospital, Azure Coast Hospital, or Zenith Care Hospital?",
            "A": "{Silverhaven Community Hospital} experienced the largest change in hospital bed occupancy."
        },
        {
            "Q": "Between 1965 and 1968, which line had the highest average Hospital Bed Occupancy, Azure Coast Hospital, Silverhaven Community Hospital, or Zenith Care Hospital?",
            "A": "{Azure Coast Hospital} had the highest average hospital bed occupancy."
        },
        {
            "Q": "Between 1967 and 1968, which line had a higher average Hospital Bed Occupancy, Azure Coast Hospital or Silverhaven Community Hospital?",
            "A": "{Azure Coast Hospital} had a higher average hospital bed occupancy."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Silverhaven Community Hospital}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1963 and 1964?",
            "A": "{Silverhaven Community Hospital} has the fastest average growth rate between 1963 and 1964."
        },
        {
            "Q": "Which label had the leading hospital bed occupancy since 1968?",
            "A": "Since 1968, {Azure Coast Hospital} had the leading hospital bed occupancy."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Azure Coast Hospital. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1963, 1970}."
        }
    ]
}