{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {4} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1960, what is the vertical (above/below) relationship of the line representing Azure Enclave relative to Sector Beta?",
            "A": "In 1960, Azure Enclave is {below} Sector Beta in the vertical direction."
        },
        {
            "Q": "On Stellar City Core, what is the spatial relationship of the data point in 1960 relative to that in 1962 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Stellar City Core, the data point in 1960 is {below} and to the {left} of the data point in 1962."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Outer Rim Settlements's Life Expectancy levels?",
            "A": "Outer Rim Settlements's life expectancy levels show a {stable falling} trend."
        },
        {
            "Q": "What is the trend of Azure Enclave's Life Expectancy levels?",
            "A": "Azure Enclave's life expectancy levels show a {exponential rising} trend."
        },
        {
            "Q": "What is the trend of Sector Beta's Life Expectancy levels?",
            "A": "Sector Beta's life expectancy levels show a {single peak} trend."
        },
        {
            "Q": "What is the trend of Stellar City Core's Life Expectancy levels?",
            "A": "Stellar City Core's life expectancy levels show a {stable falling} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Stellar City Core's Life Expectancy in 1960?",
            "A": "Stellar City Core's life expectancy in 1960 is {117.11} years."
        },
        {
            "Q": "What is Azure Enclave's Life Expectancy in 1963?",
            "A": "Azure Enclave's life expectancy in 1963 is {105.24} years."
        },
        {
            "Q": "What is Sector Beta's Life Expectancy in 1963?",
            "A": "Sector Beta's life expectancy in 1963 is {112.99} years."
        },
        {
            "Q": "What are the life expectancy of Outer Rim Settlements, Sector Beta, and Stellar City Core in 1962?",
            "A": "Outer Rim Settlements's life expectancy is {108.60} years, Sector Beta's life expectancy is {114.01} years, Stellar City Core's life expectancy is {124.23} years."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Life Expectancy in the line chart?",
            "A": "The global minimum life expectancy is {79.16} years."
        },
        {
            "Q": "What is the global maximum Life Expectancy in the line chart?",
            "A": "The global maximum life expectancy is {131.28} years."
        },
        {
            "Q": "What is the highest Life Expectancy level recorded for Azure Enclave?",
            "A": "Azure Enclave reached approximately {115.72} years in {1964}."
        },
        {
            "Q": "What is the lowest Life Expectancy level recorded for Azure Enclave?",
            "A": "Azure Enclave's lowest recorded level is approximately {79.16} years in {1960}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Outer Rim Settlements's Life Expectancy from the starting year to the final year?",
            "A": "The rate of growth in Outer Rim Settlements's life expectancy is {12.08}%."
        },
        {
            "Q": "What is the average value of Stellar City Core's Life Expectancy?",
            "A": "The average value of Stellar City Core's life expectancy is {124.21} years."
        },
        {
            "Q": "What is the average value of Outer Rim Settlements's Life Expectancy?",
            "A": "The average value of Outer Rim Settlements's life expectancy is {108.54} years."
        },
        {
            "Q": "What is the average value of Sector Beta's Life Expectancy?",
            "A": "The average value of Sector Beta's life expectancy is {112.18} years."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1961, which line had Life Expectancy exceed 109 years? Please list the lines and corresponding values.",
            "A": "{Sector Beta} had {113} years, {Stellar City Core} had {121} years."
        },
        {
            "Q": "In the year 1964, which lines had Life Expectancy between 114 and 119 years? Please list the lines and corresponding values.",
            "A": "{Outer Rim Settlements} had {115} years, {Azure Enclave} had {116} years."
        },
        {
            "Q": "Which years did Outer Rim Settlements's Life Expectancy between 106 and 111 years? Please list the years and corresponding values.",
            "A": "{108.60} years in {1962} year."
        },
        {
            "Q": "In the year 1960, which line had Life Expectancy exceed 105 years? Please list the lines and corresponding values.",
            "A": "{Sector Beta} had {110} years, {Stellar City Core} had {117} years."
        }
    ],
    "NC": [
        {
            "Q": "In 1964, which line had the highest Life Expectancy, Outer Rim Settlements, Sector Beta, or Azure Enclave?",
            "A": "In 1964, {Azure Enclave} had the highest life expectancy."
        },
        {
            "Q": "Between 1960 and 1962, which line had a higher average Life Expectancy, Outer Rim Settlements or Azure Enclave?",
            "A": "{Outer Rim Settlements} had a higher average life expectancy."
        },
        {
            "Q": "Between 1962 and 1963, which line experienced the largest change in Life Expectancy, Sector Beta, Azure Enclave, or Stellar City Core?",
            "A": "{Azure Enclave} experienced the largest change in life expectancy."
        },
        {
            "Q": "In 1962, which line had the highest Life Expectancy, Azure Enclave, Stellar City Core, Outer Rim Settlements, or Sector Beta?",
            "A": "In 1962, {Stellar City Core} had the highest life expectancy."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Azure Enclave}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1963 and 1964?",
            "A": "{Azure Enclave} has the fastest average growth rate between 1963 and 1964."
        },
        {
            "Q": "In which year did Outer Rim Settlements first surpass Sector Beta?",
            "A": "Outer Rim Settlements first surpassed Sector Beta in the year {1964}."
        },
        {
            "Q": "Which label had the leading life expectancy since 1961?",
            "A": "Since 1961, {Stellar City Core} had the leading life expectancy."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Azure Enclave. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1960, 1964}."
        }
    ]
}