{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {7} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1995, what is the vertical (above/below) relationship of the line representing Stellar Commodities Group relative to Zenith Logistics?",
            "A": "In 1995, Stellar Commodities Group is {below} Zenith Logistics in the vertical direction."
        },
        {
            "Q": "On Port of Silverhaven, what is the spatial relationship of the data point in 1989 relative to that in 1997 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Port of Silverhaven, the data point in 1989 is {below} and to the {left} of the data point in 1997."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Meridian Trade Hub's Agricultural Exports levels?",
            "A": "Meridian Trade Hub's agricultural exports levels show a {exponential falling} trend."
        },
        {
            "Q": "What is the trend of Zenith Logistics's Agricultural Exports levels?",
            "A": "Zenith Logistics's agricultural exports levels show a {exponential falling} trend."
        },
        {
            "Q": "What is the trend of Port of Silverhaven's Agricultural Exports levels?",
            "A": "Port of Silverhaven's agricultural exports levels show a {periodic stable} trend."
        },
        {
            "Q": "What is the trend of Borealis Shipping Co.'s Agricultural Exports levels?",
            "A": "Borealis Shipping Co.'s agricultural exports levels show a {bimodal peak} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Port of Aethelgard's Agricultural Exports in 1998?",
            "A": "Port of Aethelgard's agricultural exports in 1998 is {15298019.55} $."
        },
        {
            "Q": "What is Stellar Commodities Group's Agricultural Exports in 1997?",
            "A": "Stellar Commodities Group's agricultural exports in 1997 is {2350590.70} $."
        },
        {
            "Q": "What is Port of Silverhaven's Agricultural Exports in 1993?",
            "A": "Port of Silverhaven's agricultural exports in 1993 is {11304318.73} $."
        },
        {
            "Q": "What are the agricultural exports of Stellar Commodities Group, Port of Aethelgard, and Borealis Shipping Co. in 1989?",
            "A": "Stellar Commodities Group's agricultural exports is {5640257.28} $, Port of Aethelgard's agricultural exports is {9937528.56} $, Borealis Shipping Co.'s agricultural exports is {21999282.10} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Agricultural Exports in the line chart?",
            "A": "The global minimum agricultural exports is {66139.24} $."
        },
        {
            "Q": "What is the global maximum Agricultural Exports in the line chart?",
            "A": "The global maximum agricultural exports is {24389937.19} $."
        },
        {
            "Q": "What is the highest Agricultural Exports level recorded for Azure Port Authority?",
            "A": "Azure Port Authority reached approximately {11756290.91} $ in {1986}."
        },
        {
            "Q": "What is the lowest Agricultural Exports level recorded for Azure Port Authority?",
            "A": "Azure Port Authority's lowest recorded level is approximately {4047443.13} $ in {1998}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Meridian Trade Hub's Agricultural Exports from the starting year to the final year?",
            "A": "The rate of decline in Meridian Trade Hub's agricultural exports is {-91.62}%."
        },
        {
            "Q": "What is the rate of change in Borealis Shipping Co.'s Agricultural Exports from the starting year to the final year?",
            "A": "The rate of growth in Borealis Shipping Co.'s agricultural exports is {2.13}%."
        },
        {
            "Q": "What is the average value of Meridian Trade Hub's Agricultural Exports?",
            "A": "The average value of Meridian Trade Hub's agricultural exports is {4639136.89} $."
        },
        {
            "Q": "What is the average value of Port of Silverhaven's Agricultural Exports?",
            "A": "The average value of Port of Silverhaven's agricultural exports is {9871662.66} $."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Port of Aethelgard's Agricultural Exports between 10358332 and 13724757 $? Please list the years and corresponding values.",
            "A": "{13674087.46} $ in {2002} year, {13399894.90} $ in {1994} year, {11847161.39} $ in {2004} year."
        },
        {
            "Q": "Which years did Zenith Logistics's Agricultural Exports between 2133546 and 5529943 $? Please list the years and corresponding values.",
            "A": "{2609092.72} $ in {2000} year, {3264194.24} $ in {1998} year, {4757003.91} $ in {1994} year."
        },
        {
            "Q": "In the year 1997, which line had Agricultural Exports exceed 13690848 $? Please list the lines and corresponding values.",
            "A": "{Port of Aethelgard} had {15131301} $, {Borealis Shipping Co.} had {23309763} $."
        },
        {
            "Q": "Which years did Azure Port Authority's Agricultural Exports between 5807716 and 9865372 $? Please list the years and corresponding values.",
            "A": "{9202568.78} $ in {1991} year, {8185984.86} $ in {2004} year, {8763257.09} $ in {2005} year."
        }
    ],
    "NC": [
        {
            "Q": "Between 1995 and 2006, which line experienced the largest change in Agricultural Exports, Azure Port Authority, Port of Silverhaven, Port of Aethelgard, or Meridian Trade Hub?",
            "A": "{Azure Port Authority} experienced the largest change in agricultural exports."
        },
        {
            "Q": "Between 1997 and 2009, which line experienced the largest change in Agricultural Exports, Meridian Trade Hub, Borealis Shipping Co., Azure Port Authority, or Stellar Commodities Group?",
            "A": "{Azure Port Authority} experienced the largest change in agricultural exports."
        },
        {
            "Q": "Was Meridian Trade Hub's Agricultural Exports in 1999 higher or lower than in 2009?",
            "A": "The agricultural exports in 1999 was {higher} than in 2009."
        },
        {
            "Q": "Between 1988 and 2001, which line had a higher average Agricultural Exports, Azure Port Authority or Meridian Trade Hub?",
            "A": "{Azure Port Authority} had a higher average agricultural exports."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Meridian Trade Hub}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1995 and 1998?",
            "A": "{Port of Silverhaven} has the fastest average growth rate between 1995 and 1998."
        },
        {
            "Q": "In which year did Port of Aethelgard first surpass Meridian Trade Hub?",
            "A": "Port of Aethelgard first surpassed Meridian Trade Hub in the year {1989}."
        },
        {
            "Q": "Which label had the leading agricultural exports since 1993?",
            "A": "Since 1993, {Borealis Shipping Co.} had the leading agricultural exports."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Azure Port Authority. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1986, 1998, 2010}."
        }
    ]
}