{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {3} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Crimson Peaks, what is the spatial relationship of the data point in 2014 relative to that in 2012 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Crimson Peaks, the data point in 2014 is {below} and to the {right} of the data point in 2012."
        },
        {
            "Q": "In 2012, what is the vertical (above/below) relationship of the line representing Veridian Plains relative to Crimson Peaks?",
            "A": "In 2012, Veridian Plains is {above} Crimson Peaks in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Crimson Peaks's Housing Affordability Index levels?",
            "A": "Crimson Peaks's housing affordability index levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Silverwood Forest's Housing Affordability Index levels?",
            "A": "Silverwood Forest's housing affordability index levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Veridian Plains's Housing Affordability Index levels?",
            "A": "Veridian Plains's housing affordability index levels show a {periodic stable} trend."
        },
        {
            "Q": "Which line shows a volatile falling trend in Housing Affordability Index levels?",
            "A": "{Crimson Peaks}, {Silverwood Forest}."
        }
    ],
    "VE": [
        {
            "Q": "What is Silverwood Forest's Housing Affordability Index in 2014?",
            "A": "Silverwood Forest's housing affordability index in 2014 is {107.65} index."
        },
        {
            "Q": "What is Veridian Plains's Housing Affordability Index in 2013?",
            "A": "Veridian Plains's housing affordability index in 2013 is {87.48} index."
        },
        {
            "Q": "What is Veridian Plains's Housing Affordability Index in 2016?",
            "A": "Veridian Plains's housing affordability index in 2016 is {126.03} index."
        },
        {
            "Q": "What are the housing affordability index of Crimson Peaks, Veridian Plains, and Silverwood Forest in 2015?",
            "A": "Crimson Peaks's housing affordability index is {51.32} index, Veridian Plains's housing affordability index is {102.30} index, Silverwood Forest's housing affordability index is {99.03} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Housing Affordability Index in the line chart?",
            "A": "The global minimum housing affordability index is {43.65} index."
        },
        {
            "Q": "What is the global maximum Housing Affordability Index in the line chart?",
            "A": "The global maximum housing affordability index is {139.88} index."
        },
        {
            "Q": "What is the highest Housing Affordability Index level recorded for Crimson Peaks?",
            "A": "Crimson Peaks reached approximately {72.66} index in {2010}."
        },
        {
            "Q": "What is the lowest Housing Affordability Index level recorded for Crimson Peaks?",
            "A": "Crimson Peaks's lowest recorded level is approximately {43.65} index in {2017}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Veridian Plains's Housing Affordability Index from the starting year to the final year?",
            "A": "The rate of growth in Veridian Plains's housing affordability index is {14.52}%."
        },
        {
            "Q": "What is the average value of Veridian Plains's Housing Affordability Index?",
            "A": "The average value of Veridian Plains's housing affordability index is {107.24} index."
        },
        {
            "Q": "What is the average value of Crimson Peaks's Housing Affordability Index?",
            "A": "The average value of Crimson Peaks's housing affordability index is {57.96} index."
        },
        {
            "Q": "What is the average value of Silverwood Forest's Housing Affordability Index?",
            "A": "The average value of Silverwood Forest's housing affordability index is {111.61} index."
        }
    ],
    "NF": [
        {
            "Q": "In the year 2016, which lines had Housing Affordability Index between 73 and 105 index? Please list the lines and corresponding values.",
            "A": "{Silverwood Forest} had {91} index."
        },
        {
            "Q": "Which years did Veridian Plains's Housing Affordability Index below 99 index? Please list the years and corresponding values.",
            "A": "{87.48} index in {2013} year, {78.28} index in {2014} year."
        },
        {
            "Q": "Which years did Silverwood Forest's Housing Affordability Index exceed 126 index? Please list the years and corresponding values.",
            "A": "{133.28} index in {2011} year, {139.88} index in {2010} year."
        },
        {
            "Q": "In the year 2013, which line had Housing Affordability Index exceed 102 index? Please list the lines and corresponding values.",
            "A": "{Silverwood Forest} had {117} index."
        }
    ],
    "NC": [
        {
            "Q": "Was Silverwood Forest's Housing Affordability Index in 2010 higher or lower than in 2014?",
            "A": "The housing affordability index in 2010 was {higher} than in 2014."
        },
        {
            "Q": "Was Silverwood Forest's Housing Affordability Index in 2016 higher or lower than in 2017?",
            "A": "The housing affordability index in 2016 was {higher} than in 2017."
        },
        {
            "Q": "Between 2013 and 2017, which line had the highest average Housing Affordability Index, Veridian Plains, Crimson Peaks, or Silverwood Forest?",
            "A": "{Veridian Plains} had the highest average housing affordability index."
        },
        {
            "Q": "Between 2010 and 2014, which line experienced the largest change in Housing Affordability Index, Veridian Plains, Silverwood Forest, or Crimson Peaks?",
            "A": "{Silverwood Forest} experienced the largest change in housing affordability index."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Silverwood Forest}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 2011 and 2013?",
            "A": "{Crimson Peaks} has the fastest average growth rate between 2011 and 2013."
        },
        {
            "Q": "In which year did Veridian Plains first surpass Silverwood Forest?",
            "A": "Veridian Plains first surpassed Silverwood Forest in the year {2015}."
        },
        {
            "Q": "Which label had the leading housing affordability index since 2011?",
            "A": "Since 2011, {Veridian Plains} had the leading housing affordability index."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Crimson Peaks. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {2010, 2017}."
        }
    ]
}