{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {2} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Nova Exchange, what is the spatial relationship of the data point in 1974 relative to that in 1959 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Nova Exchange, the data point in 1974 is {above} and to the {right} of the data point in 1959."
        },
        {
            "Q": "In 1966, what is the vertical (above/below) relationship of the line representing Nova Exchange relative to Crimson Bazaar?",
            "A": "In 1966, Nova Exchange is {above} Crimson Bazaar in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Nova Exchange's Home Sales levels?",
            "A": "Nova Exchange's home sales levels show a {stable rising} trend."
        },
        {
            "Q": "What is the trend of Crimson Bazaar's Home Sales levels?",
            "A": "Crimson Bazaar's home sales levels show a {volatile falling} trend."
        },
        {
            "Q": "Which line shows a stable rising trend in Home Sales levels?",
            "A": "{Nova Exchange}."
        },
        {
            "Q": "Which line shows a volatile falling trend in Home Sales levels?",
            "A": "{Crimson Bazaar}."
        }
    ],
    "VE": [
        {
            "Q": "What is Nova Exchange's Home Sales in 1966?",
            "A": "Nova Exchange's home sales in 1966 is {1706.47} units/month."
        },
        {
            "Q": "What is Crimson Bazaar's Home Sales in 1974?",
            "A": "Crimson Bazaar's home sales in 1974 is {11.08} units/month."
        },
        {
            "Q": "What is Nova Exchange's Home Sales in 1975?",
            "A": "Nova Exchange's home sales in 1975 is {2211.73} units/month."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Home Sales in the line chart?",
            "A": "The global minimum home sales is {11.08} units/month."
        },
        {
            "Q": "What is the global maximum Home Sales in the line chart?",
            "A": "The global maximum home sales is {2474.05} units/month."
        },
        {
            "Q": "What is the highest Home Sales level recorded for Crimson Bazaar?",
            "A": "Crimson Bazaar reached approximately {1125.47} units/month in {1955}."
        },
        {
            "Q": "What is the lowest Home Sales level recorded for Crimson Bazaar?",
            "A": "Crimson Bazaar's lowest recorded level is approximately {11.08} units/month in {1972}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Nova Exchange's Home Sales?",
            "A": "The average value of Nova Exchange's home sales is {1794.55} units/month."
        },
        {
            "Q": "What is the rate of change in Nova Exchange's Home Sales from the starting year to the final year?",
            "A": "The rate of growth in Nova Exchange's home sales is {123.40}%."
        },
        {
            "Q": "What is the average value of Crimson Bazaar's Home Sales?",
            "A": "The average value of Crimson Bazaar's home sales is {384.10} units/month."
        },
        {
            "Q": "What is the rate of change in Crimson Bazaar's Home Sales from the starting year to the final year?",
            "A": "The rate of decline in Crimson Bazaar's home sales is {-99.02}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1974, which lines had Home Sales below 546 units/month? Please list the lines and corresponding values.",
            "A": "{Crimson Bazaar} had {11} units/month."
        },
        {
            "Q": "Which years did Nova Exchange's Home Sales below 1447 units/month? Please list the years and corresponding values.",
            "A": "{1159.24} units/month in {1956} year, {1378.34} units/month in {1960} year, {1269.49} units/month in {1958} year."
        },
        {
            "Q": "In the year 1959, which lines had Home Sales below 964 units/month? Please list the lines and corresponding values.",
            "A": "{Crimson Bazaar} had {841} units/month."
        },
        {
            "Q": "Which years did Crimson Bazaar's Home Sales below 12 units/month? Please list the years and corresponding values.",
            "A": "{11.08} units/month in {1980} year, {11.08} units/month in {1972} year, {11.08} units/month in {1976} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Nova Exchange's Home Sales in 1963 higher or lower than in 1980?",
            "A": "The home sales in 1963 was {lower} than in 1980."
        },
        {
            "Q": "Between 1971 and 1974, which line experienced a larger change in Home Sales, Nova Exchange or Crimson Bazaar?",
            "A": "{Nova Exchange} experienced a larger change in home sales."
        },
        {
            "Q": "In 1977, which line had a higher Home Sales, {Nova Exchange} or {Crimson Bazaar}?",
            "A": "In 1977, {Nova Exchange} had a higher home sales."
        },
        {
            "Q": "Between 1956 and 1960, which line experienced a larger change in Home Sales, Crimson Bazaar or Nova Exchange?",
            "A": "{Crimson Bazaar} experienced a larger change in home sales."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Nova Exchange}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1970 and 1977?",
            "A": "{Nova Exchange} has the fastest average growth rate between 1970 and 1977."
        },
        {
            "Q": "In which year did Nova Exchange first surpass Crimson Bazaar?",
            "A": "Nova Exchange first surpassed Crimson Bazaar in the year {1956}."
        },
        {
            "Q": "Which label had the leading home sales since 1964?",
            "A": "Since 1964, {Nova Exchange} had the leading home sales."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Nova Exchange. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1955, 1980}."
        }
    ]
}