{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {4} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Home Essentials, what is the spatial relationship of the data point in 1982 relative to that in 1985 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Home Essentials, the data point in 1982 is {above} and to the {left} of the data point in 1985."
        },
        {
            "Q": "In 1978, what is the vertical (above/below) relationship of the line representing Home Essentials relative to Fashion Boutiques?",
            "A": "In 1978, Home Essentials is {above} Fashion Boutiques in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Home Essentials's In-Store Foot Traffic levels?",
            "A": "Home Essentials's in-store foot traffic levels show a {bimodal peak} trend."
        },
        {
            "Q": "What is the trend of Fashion Boutiques's In-Store Foot Traffic levels?",
            "A": "Fashion Boutiques's in-store foot traffic levels show a {single valley} trend."
        },
        {
            "Q": "What is the trend of Outlet Centers's In-Store Foot Traffic levels?",
            "A": "Outlet Centers's in-store foot traffic levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Neighborhood Stores's In-Store Foot Traffic levels?",
            "A": "Neighborhood Stores's in-store foot traffic levels show a {volatile falling} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Home Essentials's In-Store Foot Traffic in 1978?",
            "A": "Home Essentials's in-store foot traffic in 1978 is {39289.45} visitors/day."
        },
        {
            "Q": "What is Home Essentials's In-Store Foot Traffic in 1989?",
            "A": "Home Essentials's in-store foot traffic in 1989 is {36869.49} visitors/day."
        },
        {
            "Q": "What is Neighborhood Stores's In-Store Foot Traffic in 1987?",
            "A": "Neighborhood Stores's in-store foot traffic in 1987 is {3293.11} visitors/day."
        },
        {
            "Q": "What are the in-store foot traffic of Neighborhood Stores, Home Essentials, and Outlet Centers in 1976?",
            "A": "Neighborhood Stores's in-store foot traffic is {10730.12} visitors/day, Home Essentials's in-store foot traffic is {35320.20} visitors/day, Outlet Centers's in-store foot traffic is {13752.70} visitors/day."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum In-Store Foot Traffic in the line chart?",
            "A": "The global minimum in-store foot traffic is {1024.67} visitors/day."
        },
        {
            "Q": "What is the global maximum In-Store Foot Traffic in the line chart?",
            "A": "The global maximum in-store foot traffic is {43781.43} visitors/day."
        },
        {
            "Q": "What is the highest In-Store Foot Traffic level recorded for Fashion Boutiques?",
            "A": "Fashion Boutiques reached approximately {17389.09} visitors/day in {1990}."
        },
        {
            "Q": "What is the lowest In-Store Foot Traffic level recorded for Fashion Boutiques?",
            "A": "Fashion Boutiques's lowest recorded level is approximately {5159.94} visitors/day in {1984}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Neighborhood Stores's In-Store Foot Traffic?",
            "A": "The average value of Neighborhood Stores's in-store foot traffic is {6308.80} visitors/day."
        },
        {
            "Q": "What is the average value of Fashion Boutiques's In-Store Foot Traffic?",
            "A": "The average value of Fashion Boutiques's in-store foot traffic is {10972.30} visitors/day."
        },
        {
            "Q": "What is the rate of change in Fashion Boutiques's In-Store Foot Traffic from the starting year to the final year?",
            "A": "The rate of growth in Fashion Boutiques's in-store foot traffic is {3.66}%."
        },
        {
            "Q": "What is the rate of change in Outlet Centers's In-Store Foot Traffic from the starting year to the final year?",
            "A": "The rate of decline in Outlet Centers's in-store foot traffic is {-92.56}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Neighborhood Stores's In-Store Foot Traffic exceed 8782 visitors/day? Please list the years and corresponding values.",
            "A": "{9998.34} visitors/day in {1977} year, {11342.35} visitors/day in {1975} year, {9399.68} visitors/day in {1978} year."
        },
        {
            "Q": "Which years did Fashion Boutiques's In-Store Foot Traffic below 6888 visitors/day? Please list the years and corresponding values.",
            "A": "{5159.94} visitors/day in {1984} year, {5998.30} visitors/day in {1982} year, {5169.32} visitors/day in {1983} year."
        },
        {
            "Q": "Which years did Outlet Centers's In-Store Foot Traffic between 5441 and 10650 visitors/day? Please list the years and corresponding values.",
            "A": "{6485.44} visitors/day in {1984} year, {8695.32} visitors/day in {1982} year, {7765} visitors/day in {1983} year."
        },
        {
            "Q": "In the year 1989, which line had In-Store Foot Traffic exceed 21528 visitors/day? Please list the lines and corresponding values.",
            "A": "{Home Essentials} had {36869} visitors/day."
        }
    ],
    "NC": [
        {
            "Q": "Was Outlet Centers's In-Store Foot Traffic in 1979 higher or lower than in 1980?",
            "A": "The in-store foot traffic in 1979 was {higher} than in 1980."
        },
        {
            "Q": "Was Outlet Centers's In-Store Foot Traffic in 1985 higher or lower than in 1986?",
            "A": "The in-store foot traffic in 1985 was {higher} than in 1986."
        },
        {
            "Q": "Between 1977 and 1989, which line experienced the largest change in In-Store Foot Traffic, Neighborhood Stores, Fashion Boutiques, or Home Essentials?",
            "A": "{Neighborhood Stores} experienced the largest change in in-store foot traffic."
        },
        {
            "Q": "In 1980, which line had the highest In-Store Foot Traffic, Outlet Centers, Home Essentials, Fashion Boutiques, or Neighborhood Stores?",
            "A": "In 1980, {Home Essentials} had the highest in-store foot traffic."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Fashion Boutiques}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1981 and 1990?",
            "A": "{Fashion Boutiques} has the fastest average growth rate between 1981 and 1990."
        },
        {
            "Q": "In which year did Outlet Centers first surpass Fashion Boutiques?",
            "A": "Outlet Centers first surpassed Fashion Boutiques in the year {1978}."
        },
        {
            "Q": "In which year did Fashion Boutiques first surpass Outlet Centers?",
            "A": "Fashion Boutiques first surpassed Outlet Centers in the year {1985}."
        },
        {
            "Q": "Which label had the leading in-store foot traffic since 1988?",
            "A": "Since 1988, {Home Essentials} had the leading in-store foot traffic."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Neighborhood Stores. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1975, 1990}."
        }
    ]
}