{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {5} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1961, what is the vertical (above/below) relationship of the line representing Standard Shipping relative to Same-Day Services?",
            "A": "In 1961, Standard Shipping is {above} Same-Day Services in the vertical direction."
        },
        {
            "Q": "On Same-Day Services, what is the spatial relationship of the data point in 1971 relative to that in 1957 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Same-Day Services, the data point in 1971 is {above} and to the {right} of the data point in 1957."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Autonomous Vehicles's Delivery Time levels?",
            "A": "Autonomous Vehicles's delivery time levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Same-Day Services's Delivery Time levels?",
            "A": "Same-Day Services's delivery time levels show a {stable falling} trend."
        },
        {
            "Q": "What is the trend of Standard Shipping's Delivery Time levels?",
            "A": "Standard Shipping's delivery time levels show a {stable rising} trend."
        },
        {
            "Q": "What is the trend of Rural Logistics's Delivery Time levels?",
            "A": "Rural Logistics's delivery time levels show a {exponential falling} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Express Couriers's Delivery Time in 1963?",
            "A": "Express Couriers's delivery time in 1963 is {3.74} days."
        },
        {
            "Q": "What is Autonomous Vehicles's Delivery Time in 1955?",
            "A": "Autonomous Vehicles's delivery time in 1955 is {3.11} days."
        },
        {
            "Q": "What is Same-Day Services's Delivery Time in 1958?",
            "A": "Same-Day Services's delivery time in 1958 is {1.70} days."
        },
        {
            "Q": "What are the delivery time of Autonomous Vehicles, Rural Logistics, and Same-Day Services in 1960?",
            "A": "Autonomous Vehicles's delivery time is {2.21} days, Rural Logistics's delivery time is {2.23} days, Same-Day Services's delivery time is {1.85} days."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Delivery Time in the line chart?",
            "A": "The global minimum delivery time is {0.03} days."
        },
        {
            "Q": "What is the global maximum Delivery Time in the line chart?",
            "A": "The global maximum delivery time is {6.09} days."
        },
        {
            "Q": "What is the highest Delivery Time level recorded for Autonomous Vehicles?",
            "A": "Autonomous Vehicles reached approximately {3.11} days in {1955}."
        },
        {
            "Q": "What is the lowest Delivery Time level recorded for Autonomous Vehicles?",
            "A": "Autonomous Vehicles's lowest recorded level is approximately {0.03} days in {1972}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Standard Shipping's Delivery Time?",
            "A": "The average value of Standard Shipping's delivery time is {4.55} days."
        },
        {
            "Q": "What is the rate of change in Rural Logistics's Delivery Time from the starting year to the final year?",
            "A": "The rate of decline in Rural Logistics's delivery time is {-85.12}%."
        },
        {
            "Q": "What is the average value of Express Couriers's Delivery Time?",
            "A": "The average value of Express Couriers's delivery time is {3.13} days."
        },
        {
            "Q": "What is the rate of change in Autonomous Vehicles's Delivery Time from the starting year to the final year?",
            "A": "The rate of decline in Autonomous Vehicles's delivery time is {-99.04}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Standard Shipping's Delivery Time between 4 and 5 days? Please list the years and corresponding values.",
            "A": "{4.03} days in {1962} year, {4.76} days in {1967} year, {4.65} days in {1966} year."
        },
        {
            "Q": "Which years did Express Couriers's Delivery Time below 3 days? Please list the years and corresponding values.",
            "A": "{2.39} days in {1975} year, {2.57} days in {1974} year, {2.52} days in {1956} year."
        },
        {
            "Q": "Which years did Rural Logistics's Delivery Time exceed 2 days? Please list the years and corresponding values.",
            "A": "{3.63} days in {1955} year, {2.98} days in {1957} year, {3.28} days in {1956} year."
        },
        {
            "Q": "Which years did Rural Logistics's Delivery Time below 1 days? Please list the years and corresponding values.",
            "A": "{0.83} days in {1971} year, {0.64} days in {1974} year, {0.54} days in {1976} year."
        }
    ],
    "NC": [
        {
            "Q": "Between 1955 and 1970, which line experienced the largest change in Delivery Time, Standard Shipping, Rural Logistics, Autonomous Vehicles, or Same-Day Services?",
            "A": "{Autonomous Vehicles} experienced the largest change in delivery time."
        },
        {
            "Q": "In 1965, which line had a higher Delivery Time, {Standard Shipping} or {Rural Logistics}?",
            "A": "In 1965, {Standard Shipping} had a higher delivery time."
        },
        {
            "Q": "Between 1969 and 1975, which line had the highest average Delivery Time, Standard Shipping, Rural Logistics, or Express Couriers?",
            "A": "{Standard Shipping} had the highest average delivery time."
        },
        {
            "Q": "Between 1975 and 1976, which line experienced the largest change in Delivery Time, Standard Shipping, Express Couriers, or Autonomous Vehicles?",
            "A": "{Standard Shipping} experienced the largest change in delivery time."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Autonomous Vehicles}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1958 and 1975?",
            "A": "{Standard Shipping} has the fastest average growth rate between 1958 and 1975."
        },
        {
            "Q": "In which year did Express Couriers first surpass Rural Logistics?",
            "A": "Express Couriers first surpassed Rural Logistics in the year {1958}."
        },
        {
            "Q": "Which label had the leading delivery time since 1970?",
            "A": "Since 1970, {Standard Shipping} had the leading delivery time."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Rural Logistics. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1955, 1966, 1976}."
        }
    ]
}