{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {2} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1962, what is the vertical (above/below) relationship of the line representing Direct-to-Consumer relative to Electronics Retailers?",
            "A": "In 1962, Direct-to-Consumer is {below} Electronics Retailers in the vertical direction."
        },
        {
            "Q": "On Electronics Retailers, what is the spatial relationship of the data point in 1957 relative to that in 1958 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Electronics Retailers, the data point in 1957 is {above} and to the {left} of the data point in 1958."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Direct-to-Consumer's Return Rate levels?",
            "A": "Direct-to-Consumer's return rate levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Electronics Retailers's Return Rate levels?",
            "A": "Electronics Retailers's return rate levels show a {volatile falling} trend."
        },
        {
            "Q": "Which line shows a volatile falling trend in Return Rate levels?",
            "A": "{Direct-to-Consumer}, {Electronics Retailers}."
        }
    ],
    "VE": [
        {
            "Q": "What is Direct-to-Consumer's Return Rate in 1958?",
            "A": "Direct-to-Consumer's return rate in 1958 is {6.65} %."
        },
        {
            "Q": "What is Direct-to-Consumer's Return Rate in 1960?",
            "A": "Direct-to-Consumer's return rate in 1960 is {5.95} %."
        },
        {
            "Q": "What is Direct-to-Consumer's Return Rate in 1963?",
            "A": "Direct-to-Consumer's return rate in 1963 is {4.58} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Return Rate in the line chart?",
            "A": "The global minimum return rate is {4.58} %."
        },
        {
            "Q": "What is the global maximum Return Rate in the line chart?",
            "A": "The global maximum return rate is {8.43} %."
        },
        {
            "Q": "What is the highest Return Rate level recorded for Direct-to-Consumer?",
            "A": "Direct-to-Consumer reached approximately {7.23} % in {1957}."
        },
        {
            "Q": "What is the lowest Return Rate level recorded for Direct-to-Consumer?",
            "A": "Direct-to-Consumer's lowest recorded level is approximately {4.58} % in {1963}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Direct-to-Consumer's Return Rate?",
            "A": "The average value of Direct-to-Consumer's return rate is {5.94} %."
        },
        {
            "Q": "What is the rate of change in Direct-to-Consumer's Return Rate from the starting year to the final year?",
            "A": "The rate of decline in Direct-to-Consumer's return rate is {-36.65}%."
        },
        {
            "Q": "What is the rate of change in Electronics Retailers's Return Rate from the starting year to the final year?",
            "A": "The rate of decline in Electronics Retailers's return rate is {-33.10}%."
        },
        {
            "Q": "What is the average value of Electronics Retailers's Return Rate?",
            "A": "The average value of Electronics Retailers's return rate is {7.17} %."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Electronics Retailers's Return Rate exceed 8 %? Please list the years and corresponding values.",
            "A": "{8.43} % in {1957} year, {7.78} % in {1958} year, {8.37} % in {1959} year."
        },
        {
            "Q": "In the year 1963, which line had Return Rate exceed 5 %? Please list the lines and corresponding values.",
            "A": "{Electronics Retailers} had {6} %."
        },
        {
            "Q": "Which years did Direct-to-Consumer's Return Rate between 6 and 6 %? Please list the years and corresponding values.",
            "A": "{5.95} % in {1960} year, {6.39} % in {1959} year, {5.66} % in {1961} year."
        },
        {
            "Q": "In the year 1962, which lines had Return Rate below 6 %? Please list the lines and corresponding values.",
            "A": "{Direct-to-Consumer} had {5} %."
        }
    ],
    "NC": [
        {
            "Q": "Between 1958 and 1963, which line had a higher average Return Rate, Direct-to-Consumer or Electronics Retailers?",
            "A": "{Electronics Retailers} had a higher average return rate."
        },
        {
            "Q": "Between 1958 and 1960, which line experienced a larger change in Return Rate, Direct-to-Consumer or Electronics Retailers?",
            "A": "{Electronics Retailers} experienced a larger change in return rate."
        },
        {
            "Q": "Between 1961 and 1962, which line experienced a larger change in Return Rate, Direct-to-Consumer or Electronics Retailers?",
            "A": "{Direct-to-Consumer} experienced a larger change in return rate."
        },
        {
            "Q": "Between 1958 and 1963, which line experienced a larger change in Return Rate, Electronics Retailers or Direct-to-Consumer?",
            "A": "{Electronics Retailers} experienced a larger change in return rate."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Electronics Retailers}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1958 and 1960?",
            "A": "{Direct-to-Consumer} has the fastest average growth rate between 1958 and 1960."
        },
        {
            "Q": "Which label had the leading return rate since 1958?",
            "A": "Since 1958, {Electronics Retailers} had the leading return rate."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Electronics Retailers. List the x-coordinates of data points to be preserved.(5 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1957, 1958, 1959, 1960, 1963}."
        }
    ]
}