{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {5} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Oracle Labs, what is the spatial relationship of the data point in 1988 relative to that in 1980 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Oracle Labs, the data point in 1988 is {above} and to the {right} of the data point in 1980."
        },
        {
            "Q": "In 1988, what is the vertical (above/below) relationship of the line representing Aether University relative to Nova Institute?",
            "A": "In 1988, Aether University is {below} Nova Institute in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Aether University's Publication Count levels?",
            "A": "Aether University's publication count levels show a {exponential falling} trend."
        },
        {
            "Q": "What is the trend of Oracle Labs's Publication Count levels?",
            "A": "Oracle Labs's publication count levels show a {single valley} trend."
        },
        {
            "Q": "What is the trend of Nova Institute's Publication Count levels?",
            "A": "Nova Institute's publication count levels show a {bimodal valley} trend."
        },
        {
            "Q": "What is the trend of Crimson Foundation's Publication Count levels?",
            "A": "Crimson Foundation's publication count levels show a {single valley} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Oracle Labs's Publication Count in 1988?",
            "A": "Oracle Labs's publication count in 1988 is {78.05} papers."
        },
        {
            "Q": "What is Echo Research's Publication Count in 1981?",
            "A": "Echo Research's publication count in 1981 is {178.21} papers."
        },
        {
            "Q": "What is Echo Research's Publication Count in 1979?",
            "A": "Echo Research's publication count in 1979 is {190.55} papers."
        },
        {
            "Q": "What are the publication count of Crimson Foundation, Echo Research, and Aether University in 1969?",
            "A": "Crimson Foundation's publication count is {77.75} papers, Echo Research's publication count is {125.86} papers, Aether University's publication count is {141.25} papers."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Publication Count in the line chart?",
            "A": "The global minimum publication count is {6.60} papers."
        },
        {
            "Q": "What is the global maximum Publication Count in the line chart?",
            "A": "The global maximum publication count is {192.01} papers."
        },
        {
            "Q": "What is the highest Publication Count level recorded for Aether University?",
            "A": "Aether University reached approximately {141.25} papers in {1969}."
        },
        {
            "Q": "What is the lowest Publication Count level recorded for Aether University?",
            "A": "Aether University's lowest recorded level is approximately {19.05} papers in {1988}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Oracle Labs's Publication Count from the starting year to the final year?",
            "A": "The rate of growth in Oracle Labs's publication count is {3.80}%."
        },
        {
            "Q": "What is the rate of change in Crimson Foundation's Publication Count from the starting year to the final year?",
            "A": "The rate of growth in Crimson Foundation's publication count is {4.98}%."
        },
        {
            "Q": "What is the rate of change in Nova Institute's Publication Count from the starting year to the final year?",
            "A": "The rate of decline in Nova Institute's publication count is {-15.77}%."
        },
        {
            "Q": "What is the average value of Aether University's Publication Count?",
            "A": "The average value of Aether University's publication count is {62.33} papers."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Nova Institute's Publication Count between 10 and 24 papers? Please list the years and corresponding values.",
            "A": "{15.49} papers in {1985} year, {20.87} papers in {1986} year, {16.85} papers in {1973} year."
        },
        {
            "Q": "Which years did Oracle Labs's Publication Count between 33 and 62 papers? Please list the years and corresponding values.",
            "A": "{56.79} papers in {1984} year, {60.84} papers in {1971} year, {57.71} papers in {1972} year."
        },
        {
            "Q": "Which years did Crimson Foundation's Publication Count between 38 and 65 papers? Please list the years and corresponding values.",
            "A": "{51.80} papers in {1973} year, {58.74} papers in {1972} year, {42.66} papers in {1974} year."
        },
        {
            "Q": "In the year 1971, which lines had Publication Count below 61 papers? Please list the lines and corresponding values.",
            "A": "{Nova Institute} had {30} papers."
        }
    ],
    "NC": [
        {
            "Q": "Between 1971 and 1983, which line had the highest average Publication Count, Nova Institute, Aether University, or Echo Research?",
            "A": "{Echo Research} had the highest average publication count."
        },
        {
            "Q": "Between 1973 and 1984, which line had the highest average Publication Count, Echo Research, Crimson Foundation, Nova Institute, or Oracle Labs?",
            "A": "{Echo Research} had the highest average publication count."
        },
        {
            "Q": "Between 1969 and 1980, which line had the highest average Publication Count, Aether University, Oracle Labs, or Echo Research?",
            "A": "{Echo Research} had the highest average publication count."
        },
        {
            "Q": "Was Aether University's Publication Count in 1983 higher or lower than in 1985?",
            "A": "The publication count in 1983 was {higher} than in 1985."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Aether University}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1972 and 1985?",
            "A": "{Crimson Foundation} has the fastest average growth rate between 1972 and 1985."
        },
        {
            "Q": "In which year did Echo Research first surpass Aether University?",
            "A": "Echo Research first surpassed Aether University in the year {1970}."
        },
        {
            "Q": "Which label had the leading publication count since 1972?",
            "A": "Since 1972, {Echo Research} had the leading publication count."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Aether University. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1969, 1977, 1988}."
        }
    ]
}