{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {2} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Crimson Foundation, what is the spatial relationship of the data point in 1979 relative to that in 1972 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Crimson Foundation, the data point in 1979 is {below} and to the {right} of the data point in 1972."
        },
        {
            "Q": "In 1969, what is the vertical (above/below) relationship of the line representing Oracle Labs relative to Crimson Foundation?",
            "A": "In 1969, Oracle Labs is {above} Crimson Foundation in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Oracle Labs's Engineering Graduates levels?",
            "A": "Oracle Labs's engineering graduates levels show a {bimodal peak} trend."
        },
        {
            "Q": "What is the trend of Crimson Foundation's Engineering Graduates levels?",
            "A": "Crimson Foundation's engineering graduates levels show a {periodic stable} trend."
        },
        {
            "Q": "Which line shows a bimodal peak trend in Engineering Graduates levels?",
            "A": "{Oracle Labs}."
        },
        {
            "Q": "Which line shows a periodic stable trend in Engineering Graduates levels?",
            "A": "{Crimson Foundation}."
        }
    ],
    "VE": [
        {
            "Q": "What is Oracle Labs's Engineering Graduates in 1978?",
            "A": "Oracle Labs's engineering graduates in 1978 is {1439.95} students."
        },
        {
            "Q": "What is Oracle Labs's Engineering Graduates in 1974?",
            "A": "Oracle Labs's engineering graduates in 1974 is {1660.02} students."
        },
        {
            "Q": "What is Oracle Labs's Engineering Graduates in 1969?",
            "A": "Oracle Labs's engineering graduates in 1969 is {1613.94} students."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Engineering Graduates in the line chart?",
            "A": "The global minimum engineering graduates is {1100.28} students."
        },
        {
            "Q": "What is the global maximum Engineering Graduates in the line chart?",
            "A": "The global maximum engineering graduates is {1822.52} students."
        },
        {
            "Q": "What is the highest Engineering Graduates level recorded for Crimson Foundation?",
            "A": "Crimson Foundation reached approximately {1822.52} students in {1976}."
        },
        {
            "Q": "What is the lowest Engineering Graduates level recorded for Crimson Foundation?",
            "A": "Crimson Foundation's lowest recorded level is approximately {1100.28} students in {1969}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Oracle Labs's Engineering Graduates from the starting year to the final year?",
            "A": "The rate of growth in Oracle Labs's engineering graduates is {0.39}%."
        },
        {
            "Q": "What is the rate of change in Crimson Foundation's Engineering Graduates from the starting year to the final year?",
            "A": "The rate of decline in Crimson Foundation's engineering graduates is {-24.52}%."
        },
        {
            "Q": "What is the average value of Crimson Foundation's Engineering Graduates?",
            "A": "The average value of Crimson Foundation's engineering graduates is {1465.78} students."
        },
        {
            "Q": "What is the average value of Oracle Labs's Engineering Graduates?",
            "A": "The average value of Oracle Labs's engineering graduates is {1550.77} students."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1978, which line had Engineering Graduates exceed 1296 students? Please list the lines and corresponding values.",
            "A": "{Oracle Labs} had {1440} students."
        },
        {
            "Q": "In the year 1975, which lines had Engineering Graduates below 1602 students? Please list the lines and corresponding values.",
            "A": "{Crimson Foundation} had {1456} students."
        },
        {
            "Q": "In the year 1977, which lines had Engineering Graduates below 1652 students? Please list the lines and corresponding values.",
            "A": "{Oracle Labs} had {1502} students."
        },
        {
            "Q": "Which years did Oracle Labs's Engineering Graduates below 1489 students? Please list the years and corresponding values.",
            "A": "{1359.27} students in {1979} year, {1420.74} students in {1966} year, {1439.95} students in {1978} year."
        }
    ],
    "NC": [
        {
            "Q": "Between 1975 and 1976, which line experienced a larger change in Engineering Graduates, Oracle Labs or Crimson Foundation?",
            "A": "{Crimson Foundation} experienced a larger change in engineering graduates."
        },
        {
            "Q": "Was Crimson Foundation's Engineering Graduates in 1966 higher or lower than in 1972?",
            "A": "The engineering graduates in 1966 was {higher} than in 1972."
        },
        {
            "Q": "Between 1969 and 1976, which line had a higher average Engineering Graduates, Crimson Foundation or Oracle Labs?",
            "A": "{Oracle Labs} had a higher average engineering graduates."
        },
        {
            "Q": "Between 1968 and 1978, which line experienced a larger change in Engineering Graduates, Oracle Labs or Crimson Foundation?",
            "A": "{Oracle Labs} experienced a larger change in engineering graduates."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Crimson Foundation}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1968 and 1976?",
            "A": "{Crimson Foundation} has the fastest average growth rate between 1968 and 1976."
        },
        {
            "Q": "In which year did Crimson Foundation first surpass Oracle Labs?",
            "A": "Crimson Foundation first surpassed Oracle Labs in the year {1971}."
        },
        {
            "Q": "In which year did Oracle Labs first surpass Crimson Foundation?",
            "A": "Oracle Labs first surpassed Crimson Foundation in the year {1968}."
        },
        {
            "Q": "Which label had the leading engineering graduates since 1971?",
            "A": "Since 1971, {Oracle Labs} had the leading engineering graduates."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Oracle Labs. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1965, 1973, 1979}."
        }
    ]
}