{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {2} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1961, what is the vertical (above/below) relationship of the line representing Rural Communities relative to Elderly Population?",
            "A": "In 1961, Rural Communities is {above} Elderly Population in the vertical direction."
        },
        {
            "Q": "On Rural Communities, what is the spatial relationship of the data point in 1963 relative to that in 1964 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Rural Communities, the data point in 1963 is {below} and to the {left} of the data point in 1964."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Elderly Population's Technology Adoption Rate levels?",
            "A": "Elderly Population's technology adoption rate levels show a {single valley} trend."
        },
        {
            "Q": "What is the trend of Rural Communities's Technology Adoption Rate levels?",
            "A": "Rural Communities's technology adoption rate levels show a {exponential rising} trend."
        },
        {
            "Q": "Which line shows a single valley trend in Technology Adoption Rate levels?",
            "A": "{Elderly Population}."
        },
        {
            "Q": "Which line shows a exponential rising trend in Technology Adoption Rate levels?",
            "A": "{Rural Communities}."
        }
    ],
    "VE": [
        {
            "Q": "What is Elderly Population's Technology Adoption Rate in 1963?",
            "A": "Elderly Population's technology adoption rate in 1963 is {5.46} %."
        },
        {
            "Q": "What is Rural Communities's Technology Adoption Rate in 1962?",
            "A": "Rural Communities's technology adoption rate in 1962 is {10.96} %."
        },
        {
            "Q": "What is Rural Communities's Technology Adoption Rate in 1963?",
            "A": "Rural Communities's technology adoption rate in 1963 is {12.30} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Technology Adoption Rate in the line chart?",
            "A": "The global minimum technology adoption rate is {5.07} %."
        },
        {
            "Q": "What is the global maximum Technology Adoption Rate in the line chart?",
            "A": "The global maximum technology adoption rate is {13.45} %."
        },
        {
            "Q": "What is the highest Technology Adoption Rate level recorded for Elderly Population?",
            "A": "Elderly Population reached approximately {6.35} % in {1964}."
        },
        {
            "Q": "What is the lowest Technology Adoption Rate level recorded for Elderly Population?",
            "A": "Elderly Population's lowest recorded level is approximately {5.07} % in {1962}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Rural Communities's Technology Adoption Rate from the starting year to the final year?",
            "A": "The rate of growth in Rural Communities's technology adoption rate is {33.43}%."
        },
        {
            "Q": "What is the average value of Rural Communities's Technology Adoption Rate?",
            "A": "The average value of Rural Communities's technology adoption rate is {11.70} %."
        },
        {
            "Q": "What is the rate of change in Elderly Population's Technology Adoption Rate from the starting year to the final year?",
            "A": "The rate of growth in Elderly Population's technology adoption rate is {10.82}%."
        },
        {
            "Q": "What is the average value of Elderly Population's Technology Adoption Rate?",
            "A": "The average value of Elderly Population's technology adoption rate is {5.65} %."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1962, which line had Technology Adoption Rate exceed 9 %? Please list the lines and corresponding values.",
            "A": "{Rural Communities} had {11} %."
        },
        {
            "Q": "Which years did Rural Communities's Technology Adoption Rate between 11 and 12 %? Please list the years and corresponding values.",
            "A": "{10.96} % in {1962} year, {12.30} % in {1963} year."
        },
        {
            "Q": "Which years did Elderly Population's Technology Adoption Rate exceed 6 %? Please list the years and corresponding values.",
            "A": "{6.35} % in {1964} year, {5.73} % in {1961} year."
        },
        {
            "Q": "In the year 1964, which line had Technology Adoption Rate exceed 12 %? Please list the lines and corresponding values.",
            "A": "{Rural Communities} had {13} %."
        }
    ],
    "NC": [
        {
            "Q": "Between 1961 and 1964, which line had a higher average Technology Adoption Rate, Elderly Population or Rural Communities?",
            "A": "{Rural Communities} had a higher average technology adoption rate."
        },
        {
            "Q": "Was Rural Communities's Technology Adoption Rate in 1961 higher or lower than in 1963?",
            "A": "The technology adoption rate in 1961 was {lower} than in 1963."
        },
        {
            "Q": "In 1964, which line had a higher Technology Adoption Rate, {Elderly Population} or {Rural Communities}?",
            "A": "In 1964, {Rural Communities} had a higher technology adoption rate."
        },
        {
            "Q": "In 1961, which line had a higher Technology Adoption Rate, {Elderly Population} or {Rural Communities}?",
            "A": "In 1961, {Rural Communities} had a higher technology adoption rate."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Rural Communities}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1963 and 1964?",
            "A": "{Rural Communities} has the fastest average growth rate between 1963 and 1964."
        },
        {
            "Q": "Which label had the leading technology adoption rate since 1962?",
            "A": "Since 1962, {Rural Communities} had the leading technology adoption rate."
        }
    ],
    "VA": []
}