{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {3} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Aether University, what is the spatial relationship of the data point in 2007 relative to that in 2008 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Aether University, the data point in 2007 is {above} and to the {left} of the data point in 2008."
        },
        {
            "Q": "In 2012, what is the vertical (above/below) relationship of the line representing Starburst College relative to Nova Institute?",
            "A": "In 2012, Starburst College is {above} Nova Institute in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Nova Institute's Research Grants Awarded levels?",
            "A": "Nova Institute's research grants awarded levels show a {volatile rising} trend."
        },
        {
            "Q": "What is the trend of Starburst College's Research Grants Awarded levels?",
            "A": "Starburst College's research grants awarded levels show a {stable rising} trend."
        },
        {
            "Q": "What is the trend of Aether University's Research Grants Awarded levels?",
            "A": "Aether University's research grants awarded levels show a {single valley} trend."
        },
        {
            "Q": "Which line shows a volatile rising trend in Research Grants Awarded levels?",
            "A": "{Nova Institute}."
        }
    ],
    "VE": [
        {
            "Q": "What is Aether University's Research Grants Awarded in 2009?",
            "A": "Aether University's research grants awarded in 2009 is {1358772.86} $."
        },
        {
            "Q": "What is Aether University's Research Grants Awarded in 2004?",
            "A": "Aether University's research grants awarded in 2004 is {2503388.17} $."
        },
        {
            "Q": "What is Aether University's Research Grants Awarded in 2013?",
            "A": "Aether University's research grants awarded in 2013 is {816431.01} $."
        },
        {
            "Q": "What are the research grants awarded of Starburst College, Nova Institute, and Aether University in 2018?",
            "A": "Starburst College's research grants awarded is {3897007.96} $, Nova Institute's research grants awarded is {2290322.15} $, Aether University's research grants awarded is {1619912.53} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Research Grants Awarded in the line chart?",
            "A": "The global minimum research grants awarded is {748094.86} $."
        },
        {
            "Q": "What is the global maximum Research Grants Awarded in the line chart?",
            "A": "The global maximum research grants awarded is {4524486.70} $."
        },
        {
            "Q": "What is the highest Research Grants Awarded level recorded for Aether University?",
            "A": "Aether University reached approximately {2666398.11} $ in {2023}."
        },
        {
            "Q": "What is the lowest Research Grants Awarded level recorded for Aether University?",
            "A": "Aether University's lowest recorded level is approximately {748094.86} $ in {2012}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Aether University's Research Grants Awarded?",
            "A": "The average value of Aether University's research grants awarded is {1632007.63} $."
        },
        {
            "Q": "What is the rate of change in Aether University's Research Grants Awarded from the starting year to the final year?",
            "A": "The rate of growth in Aether University's research grants awarded is {6.51}%."
        },
        {
            "Q": "What is the average value of Nova Institute's Research Grants Awarded?",
            "A": "The average value of Nova Institute's research grants awarded is {1908789.99} $."
        },
        {
            "Q": "What is the rate of change in Nova Institute's Research Grants Awarded from the starting year to the final year?",
            "A": "The rate of growth in Nova Institute's research grants awarded is {147.28}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 2019, which lines had Research Grants Awarded below 2117850 $? Please list the lines and corresponding values.",
            "A": "{Aether University} had {1852969} $."
        },
        {
            "Q": "In the year 2012, which line had Research Grants Awarded exceed 2473585 $? Please list the lines and corresponding values.",
            "A": "{Starburst College} had {3197477} $."
        },
        {
            "Q": "Which years did Nova Institute's Research Grants Awarded below 1500027 $? Please list the years and corresponding values.",
            "A": "{1435857.16} $ in {2008} year, {1341993.64} $ in {2007} year, {1244388.24} $ in {2006} year."
        },
        {
            "Q": "In the year 2007, which lines had Research Grants Awarded between 1674629 and 2194226 $? Please list the lines and corresponding values.",
            "A": "{Aether University} had {1877365} $."
        }
    ],
    "NC": [
        {
            "Q": "Between 2009 and 2017, which line experienced the largest change in Research Grants Awarded, Nova Institute, Aether University, or Starburst College?",
            "A": "{Starburst College} experienced the largest change in research grants awarded."
        },
        {
            "Q": "Between 2011 and 2021, which line had the highest average Research Grants Awarded, Starburst College, Nova Institute, or Aether University?",
            "A": "{Starburst College} had the highest average research grants awarded."
        },
        {
            "Q": "Between 2008 and 2023, which line had a higher average Research Grants Awarded, Starburst College or Nova Institute?",
            "A": "{Starburst College} had a higher average research grants awarded."
        },
        {
            "Q": "Between 2015 and 2017, which line had the highest average Research Grants Awarded, Starburst College, Nova Institute, or Aether University?",
            "A": "{Starburst College} had the highest average research grants awarded."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Starburst College}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 2019 and 2023?",
            "A": "{Aether University} has the fastest average growth rate between 2019 and 2023."
        },
        {
            "Q": "In which year did Starburst College first surpass Aether University?",
            "A": "Starburst College first surpassed Aether University in the year {2005}."
        },
        {
            "Q": "Which label had the leading research grants awarded since 2010?",
            "A": "Since 2010, {Starburst College} had the leading research grants awarded."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Starburst College. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {2004, 2023}."
        }
    ]
}