{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {4} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1967, what is the vertical (above/below) relationship of the line representing Free Users relative to Mobile Users?",
            "A": "In 1967, Free Users is {above} Mobile Users in the vertical direction."
        },
        {
            "Q": "On Desktop Users, what is the spatial relationship of the data point in 1965 relative to that in 1961 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Desktop Users, the data point in 1965 is {above} and to the {right} of the data point in 1961."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of New Users's Average Watch Time levels?",
            "A": "New Users's average watch time levels show a {bimodal peak} trend."
        },
        {
            "Q": "What is the trend of Free Users's Average Watch Time levels?",
            "A": "Free Users's average watch time levels show a {volatile rising} trend."
        },
        {
            "Q": "What is the trend of Mobile Users's Average Watch Time levels?",
            "A": "Mobile Users's average watch time levels show a {stable falling} trend."
        },
        {
            "Q": "What is the trend of Desktop Users's Average Watch Time levels?",
            "A": "Desktop Users's average watch time levels show a {exponential rising} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Desktop Users's Average Watch Time in 1967?",
            "A": "Desktop Users's average watch time in 1967 is {79.75} minutes."
        },
        {
            "Q": "What is New Users's Average Watch Time in 1961?",
            "A": "New Users's average watch time in 1961 is {90.57} minutes."
        },
        {
            "Q": "What is Mobile Users's Average Watch Time in 1966?",
            "A": "Mobile Users's average watch time in 1966 is {20.21} minutes."
        },
        {
            "Q": "What are the average watch time of New Users, Mobile Users, and Desktop Users in 1965?",
            "A": "New Users's average watch time is {97.22} minutes, Mobile Users's average watch time is {19.79} minutes, Desktop Users's average watch time is {65.60} minutes."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Average Watch Time in the line chart?",
            "A": "The global minimum average watch time is {17.86} minutes."
        },
        {
            "Q": "What is the global maximum Average Watch Time in the line chart?",
            "A": "The global maximum average watch time is {98.77} minutes."
        },
        {
            "Q": "What is the highest Average Watch Time level recorded for Desktop Users?",
            "A": "Desktop Users reached approximately {79.75} minutes in {1967}."
        },
        {
            "Q": "What is the lowest Average Watch Time level recorded for Desktop Users?",
            "A": "Desktop Users's lowest recorded level is approximately {44.93} minutes in {1961}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of New Users's Average Watch Time?",
            "A": "The average value of New Users's average watch time is {95.04} minutes."
        },
        {
            "Q": "What is the average value of Mobile Users's Average Watch Time?",
            "A": "The average value of Mobile Users's average watch time is {19.26} minutes."
        },
        {
            "Q": "What is the rate of change in New Users's Average Watch Time from the starting year to the final year?",
            "A": "The rate of growth in New Users's average watch time is {0.14}%."
        },
        {
            "Q": "What is the rate of change in Desktop Users's Average Watch Time from the starting year to the final year?",
            "A": "The rate of growth in Desktop Users's average watch time is {77.50}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Mobile Users's Average Watch Time exceed 19 minutes? Please list the years and corresponding values.",
            "A": "{20.73} minutes in {1967} year, {19.01} minutes in {1963} year, {19.32} minutes in {1964} year."
        },
        {
            "Q": "Which years did New Users's Average Watch Time between 93 and 97 minutes? Please list the years and corresponding values.",
            "A": "{95.25} minutes in {1966} year, {95.21} minutes in {1962} year."
        },
        {
            "Q": "In the year 1961, which lines had Average Watch Time below 27 minutes? Please list the lines and corresponding values.",
            "A": "{Mobile Users} had {18} minutes."
        },
        {
            "Q": "In the year 1966, which lines had Average Watch Time below 36 minutes? Please list the lines and corresponding values.",
            "A": "{Mobile Users} had {20} minutes."
        }
    ],
    "NC": [
        {
            "Q": "Between 1963 and 1965, which line had the highest average Average Watch Time, Desktop Users, New Users, or Free Users?",
            "A": "{New Users} had the highest average average watch time."
        },
        {
            "Q": "In 1966, which line had a higher Average Watch Time, {New Users} or {Desktop Users}?",
            "A": "In 1966, {New Users} had a higher average watch time."
        },
        {
            "Q": "Was New Users's Average Watch Time in 1963 higher or lower than in 1966?",
            "A": "The average watch time in 1963 was {higher} than in 1966."
        },
        {
            "Q": "Between 1962 and 1965, which line experienced the largest change in Average Watch Time, Free Users, New Users, or Desktop Users?",
            "A": "{Desktop Users} experienced the largest change in average watch time."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Desktop Users}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1966 and 1967?",
            "A": "{Desktop Users} has the fastest average growth rate between 1966 and 1967."
        },
        {
            "Q": "Which label had the leading average watch time since 1963?",
            "A": "Since 1963, {New Users} had the leading average watch time."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the New Users. List the x-coordinates of data points to be preserved.(5 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1961, 1962, 1964, 1966, 1967}."
        }
    ]
}