{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {2} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Ironwood Fanatics, what is the spatial relationship of the data point in 1978 relative to that in 1980 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Ironwood Fanatics, the data point in 1978 is {below} and to the {left} of the data point in 1980."
        },
        {
            "Q": "In 1978, what is the vertical (above/below) relationship of the line representing Ironwood Fanatics relative to Shadowfen Devotees?",
            "A": "In 1978, Ironwood Fanatics is {above} Shadowfen Devotees in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Ironwood Fanatics's Fan Engagement levels?",
            "A": "Ironwood Fanatics's fan engagement levels show a {single peak} trend."
        },
        {
            "Q": "What is the trend of Shadowfen Devotees's Fan Engagement levels?",
            "A": "Shadowfen Devotees's fan engagement levels show a {bimodal valley} trend."
        },
        {
            "Q": "Which line shows a single peak trend in Fan Engagement levels?",
            "A": "{Ironwood Fanatics}."
        },
        {
            "Q": "Which line shows a bimodal valley trend in Fan Engagement levels?",
            "A": "{Shadowfen Devotees}."
        }
    ],
    "VE": [
        {
            "Q": "What is Ironwood Fanatics's Fan Engagement in 1981?",
            "A": "Ironwood Fanatics's fan engagement in 1981 is {64.06} index."
        },
        {
            "Q": "What is Ironwood Fanatics's Fan Engagement in 1979?",
            "A": "Ironwood Fanatics's fan engagement in 1979 is {59.88} index."
        },
        {
            "Q": "What is Shadowfen Devotees's Fan Engagement in 1982?",
            "A": "Shadowfen Devotees's fan engagement in 1982 is {0.58} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Fan Engagement in the line chart?",
            "A": "The global minimum fan engagement is {0.58} index."
        },
        {
            "Q": "What is the global maximum Fan Engagement in the line chart?",
            "A": "The global maximum fan engagement is {64.73} index."
        },
        {
            "Q": "What is the highest Fan Engagement level recorded for Ironwood Fanatics?",
            "A": "Ironwood Fanatics reached approximately {64.73} index in {1982}."
        },
        {
            "Q": "What is the lowest Fan Engagement level recorded for Ironwood Fanatics?",
            "A": "Ironwood Fanatics's lowest recorded level is approximately {50.35} index in {1988}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Shadowfen Devotees's Fan Engagement?",
            "A": "The average value of Shadowfen Devotees's fan engagement is {2.47} index."
        },
        {
            "Q": "What is the average value of Ironwood Fanatics's Fan Engagement?",
            "A": "The average value of Ironwood Fanatics's fan engagement is {58.91} index."
        },
        {
            "Q": "What is the rate of change in Ironwood Fanatics's Fan Engagement from the starting year to the final year?",
            "A": "The rate of decline in Ironwood Fanatics's fan engagement is {-5.50}%."
        },
        {
            "Q": "What is the rate of change in Shadowfen Devotees's Fan Engagement from the starting year to the final year?",
            "A": "The rate of decline in Shadowfen Devotees's fan engagement is {-50.89}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Shadowfen Devotees's Fan Engagement exceed 2 index? Please list the years and corresponding values.",
            "A": "{6.33} index in {1988} year, {12.89} index in {1977} year, {5.24} index in {1978} year."
        },
        {
            "Q": "In the year 1978, which line had Fan Engagement exceed 44 index? Please list the lines and corresponding values.",
            "A": "{Ironwood Fanatics} had {57} index."
        },
        {
            "Q": "In the year 1981, which line had Fan Engagement exceed 48 index? Please list the lines and corresponding values.",
            "A": "{Ironwood Fanatics} had {64} index."
        },
        {
            "Q": "Which years did Ironwood Fanatics's Fan Engagement between 56 and 62 index? Please list the years and corresponding values.",
            "A": "{59.88} index in {1979} year, {56.86} index in {1978} year, {60} index in {1985} year."
        }
    ],
    "NC": [
        {
            "Q": "In 1985, which line had a higher Fan Engagement, {Ironwood Fanatics} or {Shadowfen Devotees}?",
            "A": "In 1985, {Ironwood Fanatics} had a higher fan engagement."
        },
        {
            "Q": "Between 1977 and 1986, which line had a higher average Fan Engagement, Ironwood Fanatics or Shadowfen Devotees?",
            "A": "{Ironwood Fanatics} had a higher average fan engagement."
        },
        {
            "Q": "Was Shadowfen Devotees's Fan Engagement in 1982 higher or lower than in 1983?",
            "A": "The fan engagement in 1982 was {the same} than in 1983."
        },
        {
            "Q": "Was Shadowfen Devotees's Fan Engagement in 1978 higher or lower than in 1983?",
            "A": "The fan engagement in 1978 was {higher} than in 1983."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Ironwood Fanatics}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1983 and 1984?",
            "A": "{Shadowfen Devotees} has the fastest average growth rate between 1983 and 1984."
        },
        {
            "Q": "Which label had the leading fan engagement since 1987?",
            "A": "Since 1987, {Ironwood Fanatics} had the leading fan engagement."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Ironwood Fanatics. List the x-coordinates of data points to be preserved.(5 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1977, 1979, 1982, 1985, 1988}."
        }
    ]
}