{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Desert Camps, what is the spatial relationship of the data point in 2018 relative to that in 2023 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Desert Camps, the data point in 2018 is {below} and to the {left} of the data point in 2023."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Desert Camps's Average Room Price levels?",
            "A": "Desert Camps's average room price levels show a {volatile rising} trend."
        },
        {
            "Q": "Which line shows a volatile rising trend in Average Room Price levels?",
            "A": "{Desert Camps}."
        }
    ],
    "VE": [
        {
            "Q": "What is Desert Camps's Average Room Price in 2020?",
            "A": "Desert Camps's average room price in 2020 is {181.53} $."
        },
        {
            "Q": "What is Desert Camps's Average Room Price in 2023?",
            "A": "Desert Camps's average room price in 2023 is {216.47} $."
        },
        {
            "Q": "What is Desert Camps's Average Room Price in 2021?",
            "A": "Desert Camps's average room price in 2021 is {193.28} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Average Room Price in the line chart?",
            "A": "The global minimum average room price is {156.77} $."
        },
        {
            "Q": "What is the global maximum Average Room Price in the line chart?",
            "A": "The global maximum average room price is {227.38} $."
        },
        {
            "Q": "What is the highest Average Room Price level recorded for Desert Camps?",
            "A": "Desert Camps reached approximately {227.38} $ in {2024}."
        },
        {
            "Q": "What is the lowest Average Room Price level recorded for Desert Camps?",
            "A": "Desert Camps's lowest recorded level is approximately {156.77} $ in {2018}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Desert Camps's Average Room Price?",
            "A": "The average value of Desert Camps's average room price is {193.04} $."
        },
        {
            "Q": "What is the rate of change in Desert Camps's Average Room Price from the starting year to the final year?",
            "A": "The rate of growth in Desert Camps's average room price is {45.04}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Desert Camps's Average Room Price between 180 and 207 $? Please list the years and corresponding values.",
            "A": "{204.98} $ in {2022} year, {193.28} $ in {2021} year, {181.53} $ in {2020} year."
        },
        {
            "Q": "Which years did Desert Camps's Average Room Price exceed 205 $? Please list the years and corresponding values.",
            "A": "{204.98} $ in {2022} year, {216.47} $ in {2023} year, {227.38} $ in {2024} year."
        },
        {
            "Q": "Which years did Desert Camps's Average Room Price below 176 $? Please list the years and corresponding values.",
            "A": "{156.77} $ in {2018} year, {170.88} $ in {2019} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Desert Camps's Average Room Price in 2019 higher or lower than in 2023?",
            "A": "The average room price in 2019 was {lower} than in 2023."
        },
        {
            "Q": "Was Desert Camps's Average Room Price in 2023 higher or lower than in 2024?",
            "A": "The average room price in 2023 was {lower} than in 2024."
        },
        {
            "Q": "Was Desert Camps's Average Room Price in 2021 higher or lower than in 2024?",
            "A": "The average room price in 2021 was {lower} than in 2024."
        },
        {
            "Q": "Was Desert Camps's Average Room Price in 2018 higher or lower than in 2020?",
            "A": "The average room price in 2018 was {lower} than in 2020."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Desert Camps. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {2018, 2024}."
        }
    ]
}