{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {4} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1990, what is the vertical (above/below) relationship of the line representing Treehouse Retreats relative to City Center Hotels?",
            "A": "In 1990, Treehouse Retreats is {above} City Center Hotels in the vertical direction."
        },
        {
            "Q": "On Treehouse Retreats, what is the spatial relationship of the data point in 1991 relative to that in 1999 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Treehouse Retreats, the data point in 1991 is {below} and to the {left} of the data point in 1999."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Ski Lodges's Average Room Price levels?",
            "A": "Ski Lodges's average room price levels show a {bimodal valley} trend."
        },
        {
            "Q": "What is the trend of City Center Hotels's Average Room Price levels?",
            "A": "City Center Hotels's average room price levels show a {stable falling} trend."
        },
        {
            "Q": "What is the trend of Beachfront Villas's Average Room Price levels?",
            "A": "Beachfront Villas's average room price levels show a {periodic stable} trend."
        },
        {
            "Q": "What is the trend of Treehouse Retreats's Average Room Price levels?",
            "A": "Treehouse Retreats's average room price levels show a {volatile rising} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is City Center Hotels's Average Room Price in 1999?",
            "A": "City Center Hotels's average room price in 1999 is {410.66} $."
        },
        {
            "Q": "What is City Center Hotels's Average Room Price in 1990?",
            "A": "City Center Hotels's average room price in 1990 is {337.71} $."
        },
        {
            "Q": "What is City Center Hotels's Average Room Price in 1996?",
            "A": "City Center Hotels's average room price in 1996 is {385.87} $."
        },
        {
            "Q": "What are the average room price of Treehouse Retreats, Ski Lodges, and Beachfront Villas in 1985?",
            "A": "Treehouse Retreats's average room price is {335.88} $, Ski Lodges's average room price is {40.08} $, Beachfront Villas's average room price is {315.47} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Average Room Price in the line chart?",
            "A": "The global minimum average room price is {37.62} $."
        },
        {
            "Q": "What is the global maximum Average Room Price in the line chart?",
            "A": "The global maximum average room price is {590.50} $."
        },
        {
            "Q": "What is the highest Average Room Price level recorded for Beachfront Villas?",
            "A": "Beachfront Villas reached approximately {315.47} $ in {1985}."
        },
        {
            "Q": "What is the lowest Average Room Price level recorded for Beachfront Villas?",
            "A": "Beachfront Villas's lowest recorded level is approximately {190.47} $ in {1993}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Beachfront Villas's Average Room Price from the starting year to the final year?",
            "A": "The rate of growth in Beachfront Villas's average room price is {19.53}%."
        },
        {
            "Q": "What is the rate of change in Ski Lodges's Average Room Price from the starting year to the final year?",
            "A": "The rate of decline in Ski Lodges's average room price is {-1.22}%."
        },
        {
            "Q": "What is the average value of Ski Lodges's Average Room Price?",
            "A": "The average value of Ski Lodges's average room price is {65.19} $."
        },
        {
            "Q": "What is the rate of change in City Center Hotels's Average Room Price from the starting year to the final year?",
            "A": "The rate of growth in City Center Hotels's average room price is {60.38}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did City Center Hotels's Average Room Price exceed 374 $? Please list the years and corresponding values.",
            "A": "{402.88} $ in {1998} year, {379.26} $ in {1995} year, {385.87} $ in {1996} year."
        },
        {
            "Q": "Which years did Beachfront Villas's Average Room Price below 214 $? Please list the years and corresponding values.",
            "A": "{190.47} $ in {1993} year, {211.19} $ in {1987} year, {214.24} $ in {1982} year."
        },
        {
            "Q": "Which years did Beachfront Villas's Average Room Price between 222 and 281 $? Please list the years and corresponding values.",
            "A": "{260.77} $ in {1979} year, {256.12} $ in {1999} year, {252.79} $ in {1989} year."
        },
        {
            "Q": "In the year 2000, which line had Average Room Price exceed 459 $? Please list the lines and corresponding values.",
            "A": "{Treehouse Retreats} had {590} $."
        }
    ],
    "NC": [
        {
            "Q": "Was City Center Hotels's Average Room Price in 1996 higher or lower than in 1997?",
            "A": "The average room price in 1996 was {lower} than in 1997."
        },
        {
            "Q": "In 1979, which line had the highest Average Room Price, Beachfront Villas, Ski Lodges, or Treehouse Retreats?",
            "A": "In 1979, {Beachfront Villas} had the highest average room price."
        },
        {
            "Q": "Between 1986 and 1993, which line experienced the largest change in Average Room Price, Treehouse Retreats, City Center Hotels, or Ski Lodges?",
            "A": "{Treehouse Retreats} experienced the largest change in average room price."
        },
        {
            "Q": "In 1987, which line had the highest Average Room Price, Treehouse Retreats, Ski Lodges, Beachfront Villas, or City Center Hotels?",
            "A": "In 1987, {Treehouse Retreats} had the highest average room price."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Treehouse Retreats}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1999 and 2000?",
            "A": "{Beachfront Villas} has the fastest average growth rate between 1999 and 2000."
        },
        {
            "Q": "In which year did Treehouse Retreats first surpass City Center Hotels?",
            "A": "Treehouse Retreats first surpassed City Center Hotels in the year {1982}."
        },
        {
            "Q": "Which label had the leading average room price since 1993?",
            "A": "Since 1993, {Treehouse Retreats} had the leading average room price."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Treehouse Retreats. List the x-coordinates of data points to be preserved.(2 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1979, 2000}."
        }
    ]
}