{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {2} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 1976, what is the vertical (above/below) relationship of the line representing Long-Haul Operators relative to Freight Train?",
            "A": "In 1976, Long-Haul Operators is {above} Freight Train in the vertical direction."
        },
        {
            "Q": "On Long-Haul Operators, what is the spatial relationship of the data point in 1979 relative to that in 1978 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Long-Haul Operators, the data point in 1979 is {above} and to the {right} of the data point in 1978."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Freight Train's Driver Satisfaction levels?",
            "A": "Freight Train's driver satisfaction levels show a {single valley} trend."
        },
        {
            "Q": "What is the trend of Long-Haul Operators's Driver Satisfaction levels?",
            "A": "Long-Haul Operators's driver satisfaction levels show a {stable rising} trend."
        },
        {
            "Q": "Which line shows a single valley trend in Driver Satisfaction levels?",
            "A": "{Freight Train}."
        },
        {
            "Q": "Which line shows a stable rising trend in Driver Satisfaction levels?",
            "A": "{Long-Haul Operators}."
        }
    ],
    "VE": [
        {
            "Q": "What is Freight Train's Driver Satisfaction in 1976?",
            "A": "Freight Train's driver satisfaction in 1976 is {46.47} index."
        },
        {
            "Q": "What is Long-Haul Operators's Driver Satisfaction in 1987?",
            "A": "Long-Haul Operators's driver satisfaction in 1987 is {117.60} index."
        },
        {
            "Q": "What is Freight Train's Driver Satisfaction in 1986?",
            "A": "Freight Train's driver satisfaction in 1986 is {48.52} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Driver Satisfaction in the line chart?",
            "A": "The global minimum driver satisfaction is {20.67} index."
        },
        {
            "Q": "What is the global maximum Driver Satisfaction in the line chart?",
            "A": "The global maximum driver satisfaction is {127.79} index."
        },
        {
            "Q": "What is the highest Driver Satisfaction level recorded for Freight Train?",
            "A": "Freight Train reached approximately {75.67} index in {1990}."
        },
        {
            "Q": "What is the lowest Driver Satisfaction level recorded for Freight Train?",
            "A": "Freight Train's lowest recorded level is approximately {20.67} index in {1981}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Long-Haul Operators's Driver Satisfaction from the starting year to the final year?",
            "A": "The rate of growth in Long-Haul Operators's driver satisfaction is {86.12}%."
        },
        {
            "Q": "What is the average value of Long-Haul Operators's Driver Satisfaction?",
            "A": "The average value of Long-Haul Operators's driver satisfaction is {98.36} index."
        },
        {
            "Q": "What is the average value of Freight Train's Driver Satisfaction?",
            "A": "The average value of Freight Train's driver satisfaction is {45.50} index."
        },
        {
            "Q": "What is the rate of change in Freight Train's Driver Satisfaction from the starting year to the final year?",
            "A": "The rate of growth in Freight Train's driver satisfaction is {6.61}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1984, which line had Driver Satisfaction exceed 88 index? Please list the lines and corresponding values.",
            "A": "{Long-Haul Operators} had {107} index."
        },
        {
            "Q": "Which years did Long-Haul Operators's Driver Satisfaction below 84 index? Please list the years and corresponding values.",
            "A": "{72.07} index in {1974} year, {75.60} index in {1975} year, {83.02} index in {1977} year."
        },
        {
            "Q": "Which years did Long-Haul Operators's Driver Satisfaction between 87 and 110 index? Please list the years and corresponding values.",
            "A": "{93.14} index in {1980} year, {96.04} index in {1981} year, {100.18} index in {1982} year."
        },
        {
            "Q": "In the year 1982, which line had Driver Satisfaction exceed 81 index? Please list the lines and corresponding values.",
            "A": "{Long-Haul Operators} had {100} index."
        }
    ],
    "NC": [
        {
            "Q": "Was Freight Train's Driver Satisfaction in 1983 higher or lower than in 1987?",
            "A": "The driver satisfaction in 1983 was {lower} than in 1987."
        },
        {
            "Q": "Was Long-Haul Operators's Driver Satisfaction in 1979 higher or lower than in 1980?",
            "A": "The driver satisfaction in 1979 was {lower} than in 1980."
        },
        {
            "Q": "Between 1975 and 1990, which line experienced a larger change in Driver Satisfaction, Freight Train or Long-Haul Operators?",
            "A": "{Long-Haul Operators} experienced a larger change in driver satisfaction."
        },
        {
            "Q": "In 1973, which line had a higher Driver Satisfaction, {Freight Train} or {Long-Haul Operators}?",
            "A": "In 1973, {Freight Train} had a higher driver satisfaction."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Long-Haul Operators}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1988 and 1989?",
            "A": "{Freight Train} has the fastest average growth rate between 1988 and 1989."
        },
        {
            "Q": "In which year did Long-Haul Operators first surpass Freight Train?",
            "A": "Long-Haul Operators first surpassed Freight Train in the year {1974}."
        },
        {
            "Q": "Which label had the leading driver satisfaction since 1984?",
            "A": "Since 1984, {Long-Haul Operators} had the leading driver satisfaction."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Freight Train. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1973, 1981, 1990}."
        }
    ]
}