{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Aircraft Engines, what is the spatial relationship of the data point in 1995 relative to that in 1993 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Aircraft Engines, the data point in 1995 is {above} and to the {right} of the data point in 1993."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Aircraft Engines's Vehicle Maintenance Cost levels?",
            "A": "Aircraft Engines's vehicle maintenance cost levels show a {bimodal peak} trend."
        },
        {
            "Q": "Which line shows a bimodal peak trend in Vehicle Maintenance Cost levels?",
            "A": "{Aircraft Engines}."
        }
    ],
    "VE": [
        {
            "Q": "What is Aircraft Engines's Vehicle Maintenance Cost in 1993?",
            "A": "Aircraft Engines's vehicle maintenance cost in 1993 is {1997.02} $/month."
        },
        {
            "Q": "What is Aircraft Engines's Vehicle Maintenance Cost in 1996?",
            "A": "Aircraft Engines's vehicle maintenance cost in 1996 is {2290.04} $/month."
        },
        {
            "Q": "What is Aircraft Engines's Vehicle Maintenance Cost in 1998?",
            "A": "Aircraft Engines's vehicle maintenance cost in 1998 is {2379.59} $/month."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Vehicle Maintenance Cost in the line chart?",
            "A": "The global minimum vehicle maintenance cost is {1885.81} $/month."
        },
        {
            "Q": "What is the global maximum Vehicle Maintenance Cost in the line chart?",
            "A": "The global maximum vehicle maintenance cost is {2409.67} $/month."
        },
        {
            "Q": "What is the highest Vehicle Maintenance Cost level recorded for Aircraft Engines?",
            "A": "Aircraft Engines reached approximately {2409.67} $/month in {2000}."
        },
        {
            "Q": "What is the lowest Vehicle Maintenance Cost level recorded for Aircraft Engines?",
            "A": "Aircraft Engines's lowest recorded level is approximately {1885.81} $/month in {1992}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Aircraft Engines's Vehicle Maintenance Cost?",
            "A": "The average value of Aircraft Engines's vehicle maintenance cost is {2226.83} $/month."
        },
        {
            "Q": "What is the rate of change in Aircraft Engines's Vehicle Maintenance Cost from the starting year to the final year?",
            "A": "The rate of growth in Aircraft Engines's vehicle maintenance cost is {0.47}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Aircraft Engines's Vehicle Maintenance Cost below 2122 $/month? Please list the years and corresponding values.",
            "A": "{2010.67} $/month in {2008} year, {1894.68} $/month in {2009} year, {2119.70} $/month in {2007} year."
        },
        {
            "Q": "Which years did Aircraft Engines's Vehicle Maintenance Cost exceed 2169 $/month? Please list the years and corresponding values.",
            "A": "{2215.08} $/month in {1995} year, {2404.24} $/month in {2001} year, {2290.04} $/month in {1996} year."
        },
        {
            "Q": "Which years did Aircraft Engines's Vehicle Maintenance Cost between 2148 and 2354 $/month? Please list the years and corresponding values.",
            "A": "{2340.14} $/month in {1997} year, {2204.45} $/month in {2006} year, {2296.06} $/month in {2005} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Aircraft Engines's Vehicle Maintenance Cost in 1994 higher or lower than in 2000?",
            "A": "The vehicle maintenance cost in 1994 was {lower} than in 2000."
        },
        {
            "Q": "Was Aircraft Engines's Vehicle Maintenance Cost in 1994 higher or lower than in 2006?",
            "A": "The vehicle maintenance cost in 1994 was {lower} than in 2006."
        },
        {
            "Q": "Was Aircraft Engines's Vehicle Maintenance Cost in 2004 higher or lower than in 2005?",
            "A": "The vehicle maintenance cost in 2004 was {higher} than in 2005."
        },
        {
            "Q": "Was Aircraft Engines's Vehicle Maintenance Cost in 1995 higher or lower than in 2007?",
            "A": "The vehicle maintenance cost in 1995 was {higher} than in 2007."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Aircraft Engines. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1992, 2000, 2009}."
        }
    ]
}