{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {1} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Hazardous Material, what is the spatial relationship of the data point in 2008 relative to that in 2009 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Hazardous Material, the data point in 2008 is {below} and to the {left} of the data point in 2009."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Hazardous Material's Driver Satisfaction levels?",
            "A": "Hazardous Material's driver satisfaction levels show a {single valley} trend."
        },
        {
            "Q": "Which line shows a single valley trend in Driver Satisfaction levels?",
            "A": "{Hazardous Material}."
        }
    ],
    "VE": [
        {
            "Q": "What is Hazardous Material's Driver Satisfaction in 1998?",
            "A": "Hazardous Material's driver satisfaction in 1998 is {24.91} index."
        },
        {
            "Q": "What is Hazardous Material's Driver Satisfaction in 1986?",
            "A": "Hazardous Material's driver satisfaction in 1986 is {74.66} index."
        },
        {
            "Q": "What is Hazardous Material's Driver Satisfaction in 2009?",
            "A": "Hazardous Material's driver satisfaction in 2009 is {80.24} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Driver Satisfaction in the line chart?",
            "A": "The global minimum driver satisfaction is {20.96} index."
        },
        {
            "Q": "What is the global maximum Driver Satisfaction in the line chart?",
            "A": "The global maximum driver satisfaction is {80.59} index."
        },
        {
            "Q": "What is the highest Driver Satisfaction level recorded for Hazardous Material?",
            "A": "Hazardous Material reached approximately {80.59} index in {1983}."
        },
        {
            "Q": "What is the lowest Driver Satisfaction level recorded for Hazardous Material?",
            "A": "Hazardous Material's lowest recorded level is approximately {20.96} index in {1996}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Hazardous Material's Driver Satisfaction?",
            "A": "The average value of Hazardous Material's driver satisfaction is {54.21} index."
        },
        {
            "Q": "What is the rate of change in Hazardous Material's Driver Satisfaction from the starting year to the final year?",
            "A": "The rate of decline in Hazardous Material's driver satisfaction is {-0.43}%."
        }
    ],
    "NF": [
        {
            "Q": "Which years did Hazardous Material's Driver Satisfaction between 39 and 70 index? Please list the years and corresponding values.",
            "A": "{59.87} index in {1989} year, {59.77} index in {2003} year, {65.41} index in {2004} year."
        },
        {
            "Q": "Which years did Hazardous Material's Driver Satisfaction below 35 index? Please list the years and corresponding values.",
            "A": "{21.27} index in {1995} year, {24.91} index in {1998} year, {25.98} index in {1994} year."
        },
        {
            "Q": "Which years did Hazardous Material's Driver Satisfaction exceed 73 index? Please list the years and corresponding values.",
            "A": "{79.59} index in {2008} year, {77.16} index in {2007} year, {80.17} index in {1984} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Hazardous Material's Driver Satisfaction in 1989 higher or lower than in 2009?",
            "A": "The driver satisfaction in 1989 was {lower} than in 2009."
        },
        {
            "Q": "Was Hazardous Material's Driver Satisfaction in 2000 higher or lower than in 2004?",
            "A": "The driver satisfaction in 2000 was {lower} than in 2004."
        },
        {
            "Q": "Was Hazardous Material's Driver Satisfaction in 1991 higher or lower than in 1992?",
            "A": "The driver satisfaction in 1991 was {higher} than in 1992."
        },
        {
            "Q": "Was Hazardous Material's Driver Satisfaction in 1997 higher or lower than in 2009?",
            "A": "The driver satisfaction in 1997 was {lower} than in 2009."
        }
    ],
    "MSR": [],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Hazardous Material. List the x-coordinates of data points to be preserved.(3 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1983, 1996, 2009}."
        }
    ]
}