{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {6} lines."
        }
    ],
    "SRP": [
        {
            "Q": "In 2003, what is the vertical (above/below) relationship of the line representing Delivery Vans relative to Hybrid Fleets?",
            "A": "In 2003, Delivery Vans is {below} Hybrid Fleets in the vertical direction."
        },
        {
            "Q": "On Hybrid Fleets, what is the spatial relationship of the data point in 1990 relative to that in 2008 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Hybrid Fleets, the data point in 1990 is {below} and to the {left} of the data point in 2008."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Drone Swarms's Fuel Consumption levels?",
            "A": "Drone Swarms's fuel consumption levels show a {bimodal peak} trend."
        },
        {
            "Q": "What is the trend of Freight Trains's Fuel Consumption levels?",
            "A": "Freight Trains's fuel consumption levels show a {periodic stable} trend."
        },
        {
            "Q": "What is the trend of Hybrid Fleets's Fuel Consumption levels?",
            "A": "Hybrid Fleets's fuel consumption levels show a {bimodal peak} trend."
        },
        {
            "Q": "What is the trend of Cargo Planes's Fuel Consumption levels?",
            "A": "Cargo Planes's fuel consumption levels show a {volatile falling} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Drone Swarms's Fuel Consumption in 1994?",
            "A": "Drone Swarms's fuel consumption in 1994 is {22.52} L/100km."
        },
        {
            "Q": "What is Drone Swarms's Fuel Consumption in 2003?",
            "A": "Drone Swarms's fuel consumption in 2003 is {22.83} L/100km."
        },
        {
            "Q": "What is Long-Haul Trucks's Fuel Consumption in 1999?",
            "A": "Long-Haul Trucks's fuel consumption in 1999 is {7.95} L/100km."
        },
        {
            "Q": "What are the fuel consumption of Freight Trains, Hybrid Fleets, and Long-Haul Trucks in 2003?",
            "A": "Freight Trains's fuel consumption is {7.45} L/100km, Hybrid Fleets's fuel consumption is {19.19} L/100km, Long-Haul Trucks's fuel consumption is {8.82} L/100km."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Fuel Consumption in the line chart?",
            "A": "The global minimum fuel consumption is {0.07} L/100km."
        },
        {
            "Q": "What is the global maximum Fuel Consumption in the line chart?",
            "A": "The global maximum fuel consumption is {23.51} L/100km."
        },
        {
            "Q": "What is the highest Fuel Consumption level recorded for Cargo Planes?",
            "A": "Cargo Planes reached approximately {6.94} L/100km in {1990}."
        },
        {
            "Q": "What is the lowest Fuel Consumption level recorded for Cargo Planes?",
            "A": "Cargo Planes's lowest recorded level is approximately {0.07} L/100km in {2007}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Delivery Vans's Fuel Consumption?",
            "A": "The average value of Delivery Vans's fuel consumption is {13.33} L/100km."
        },
        {
            "Q": "What is the average value of Drone Swarms's Fuel Consumption?",
            "A": "The average value of Drone Swarms's fuel consumption is {22.05} L/100km."
        },
        {
            "Q": "What is the rate of change in Hybrid Fleets's Fuel Consumption from the starting year to the final year?",
            "A": "The rate of growth in Hybrid Fleets's fuel consumption is {0.76}%."
        },
        {
            "Q": "What is the rate of change in Long-Haul Trucks's Fuel Consumption from the starting year to the final year?",
            "A": "The rate of decline in Long-Haul Trucks's fuel consumption is {-14.80}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 2005, which lines had Fuel Consumption below 9 L/100km? Please list the lines and corresponding values.",
            "A": "{Cargo Planes} had {1} L/100km, {Freight Trains} had {8} L/100km."
        },
        {
            "Q": "Which years did Long-Haul Trucks's Fuel Consumption below 9 L/100km? Please list the years and corresponding values.",
            "A": "{7.89} L/100km in {1994} year, {8.75} L/100km in {2008} year, {7.82} L/100km in {2004} year."
        },
        {
            "Q": "Which years did Delivery Vans's Fuel Consumption below 12 L/100km? Please list the years and corresponding values.",
            "A": "{10.09} L/100km in {1990} year, {11.66} L/100km in {2006} year, {10.82} L/100km in {1991} year."
        },
        {
            "Q": "In the year 2006, which lines had Fuel Consumption below 11 L/100km? Please list the lines and corresponding values.",
            "A": "{Freight Trains} had {11} L/100km, {Cargo Planes} had {0} L/100km."
        }
    ],
    "NC": [
        {
            "Q": "Between 1992 and 2007, which line experienced the largest change in Fuel Consumption, Long-Haul Trucks, Drone Swarms, Hybrid Fleets, or Cargo Planes?",
            "A": "{Cargo Planes} experienced the largest change in fuel consumption."
        },
        {
            "Q": "Between 1995 and 2001, which line experienced a larger change in Fuel Consumption, Long-Haul Trucks or Drone Swarms?",
            "A": "{Long-Haul Trucks} experienced a larger change in fuel consumption."
        },
        {
            "Q": "Between 1993 and 1994, which line had the highest average Fuel Consumption, Hybrid Fleets, Long-Haul Trucks, or Freight Trains?",
            "A": "{Hybrid Fleets} had the highest average fuel consumption."
        },
        {
            "Q": "Between 1996 and 2002, which line experienced a larger change in Fuel Consumption, Hybrid Fleets or Drone Swarms?",
            "A": "{Drone Swarms} experienced a larger change in fuel consumption."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Cargo Planes}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1993 and 2008?",
            "A": "{Freight Trains} has the fastest average growth rate between 1993 and 2008."
        },
        {
            "Q": "In which year did Delivery Vans first surpass Long-Haul Trucks?",
            "A": "Delivery Vans first surpassed Long-Haul Trucks in the year {1992}."
        },
        {
            "Q": "In which year did Long-Haul Trucks first surpass Delivery Vans?",
            "A": "Long-Haul Trucks first surpassed Delivery Vans in the year {2006}."
        },
        {
            "Q": "Which label had the leading fuel consumption since 2004?",
            "A": "Since 2004, {Drone Swarms} had the leading fuel consumption."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Delivery Vans. List the x-coordinates of data points to be preserved.(4 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1990, 1998, 2001, 2008}."
        }
    ]
}