{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {6} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Long-Haul Trucks, what is the spatial relationship of the data point in 1978 relative to that in 1970 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Long-Haul Trucks, the data point in 1978 is {below} and to the {right} of the data point in 1970."
        },
        {
            "Q": "In 1976, what is the vertical (above/below) relationship of the line representing Freight Trains relative to Drone Swarms?",
            "A": "In 1976, Freight Trains is {below} Drone Swarms in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Cargo Planes's Fuel Consumption levels?",
            "A": "Cargo Planes's fuel consumption levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Freight Trains's Fuel Consumption levels?",
            "A": "Freight Trains's fuel consumption levels show a {single valley} trend."
        },
        {
            "Q": "What is the trend of Long-Haul Trucks's Fuel Consumption levels?",
            "A": "Long-Haul Trucks's fuel consumption levels show a {single peak} trend."
        },
        {
            "Q": "What is the trend of Cargo Ships's Fuel Consumption levels?",
            "A": "Cargo Ships's fuel consumption levels show a {single valley} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Freight Trains's Fuel Consumption in 1959?",
            "A": "Freight Trains's fuel consumption in 1959 is {5.80} L/100km."
        },
        {
            "Q": "What is Cargo Planes's Fuel Consumption in 1963?",
            "A": "Cargo Planes's fuel consumption in 1963 is {4.20} L/100km."
        },
        {
            "Q": "What is Drone Swarms's Fuel Consumption in 1963?",
            "A": "Drone Swarms's fuel consumption in 1963 is {21.53} L/100km."
        },
        {
            "Q": "What are the fuel consumption of Drone Swarms, Freight Trains, and Cargo Planes in 1966?",
            "A": "Drone Swarms's fuel consumption is {22.35} L/100km, Freight Trains's fuel consumption is {2.87} L/100km, Cargo Planes's fuel consumption is {3.31} L/100km."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum Fuel Consumption in the line chart?",
            "A": "The global minimum fuel consumption is {0.05} L/100km."
        },
        {
            "Q": "What is the global maximum Fuel Consumption in the line chart?",
            "A": "The global maximum fuel consumption is {22.73} L/100km."
        },
        {
            "Q": "What is the highest Fuel Consumption level recorded for Cargo Planes?",
            "A": "Cargo Planes reached approximately {5.30} L/100km in {1959}."
        },
        {
            "Q": "What is the lowest Fuel Consumption level recorded for Cargo Planes?",
            "A": "Cargo Planes's lowest recorded level is approximately {0.05} L/100km in {1976}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Cargo Planes's Fuel Consumption from the starting year to the final year?",
            "A": "The rate of decline in Cargo Planes's fuel consumption is {-99.06}%."
        },
        {
            "Q": "What is the rate of change in Freight Trains's Fuel Consumption from the starting year to the final year?",
            "A": "The rate of growth in Freight Trains's fuel consumption is {5.86}%."
        },
        {
            "Q": "What is the average value of Hybrid Fleets's Fuel Consumption?",
            "A": "The average value of Hybrid Fleets's fuel consumption is {4.72} L/100km."
        },
        {
            "Q": "What is the rate of change in Hybrid Fleets's Fuel Consumption from the starting year to the final year?",
            "A": "The rate of decline in Hybrid Fleets's fuel consumption is {-98.97}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1960, which lines had Fuel Consumption below 7 L/100km? Please list the lines and corresponding values.",
            "A": "{Cargo Planes} had {5} L/100km, {Freight Trains} had {6} L/100km."
        },
        {
            "Q": "In the year 1974, which lines had Fuel Consumption below 2 L/100km? Please list the lines and corresponding values.",
            "A": "{Cargo Planes} had {1} L/100km, {Hybrid Fleets} had {1} L/100km."
        },
        {
            "Q": "Which years did Cargo Planes's Fuel Consumption between 1 and 3 L/100km? Please list the years and corresponding values.",
            "A": "{0.67} L/100km in {1974} year, {0.83} L/100km in {1973} year, {1.36} L/100km in {1972} year."
        },
        {
            "Q": "Which years did Hybrid Fleets's Fuel Consumption between 2 and 7 L/100km? Please list the years and corresponding values.",
            "A": "{3.38} L/100km in {1971} year, {5.89} L/100km in {1967} year, {1.96} L/100km in {1973} year."
        }
    ],
    "NC": [
        {
            "Q": "Was Long-Haul Trucks's Fuel Consumption in 1960 higher or lower than in 1962?",
            "A": "The fuel consumption in 1960 was {lower} than in 1962."
        },
        {
            "Q": "Was Cargo Ships's Fuel Consumption in 1971 higher or lower than in 1978?",
            "A": "The fuel consumption in 1971 was {lower} than in 1978."
        },
        {
            "Q": "In 1963, which line had the highest Fuel Consumption, Drone Swarms, Cargo Ships, Freight Trains, or Long-Haul Trucks?",
            "A": "In 1963, {Drone Swarms} had the highest fuel consumption."
        },
        {
            "Q": "Was Hybrid Fleets's Fuel Consumption in 1959 higher or lower than in 1970?",
            "A": "The fuel consumption in 1959 was {higher} than in 1970."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {Hybrid Fleets}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1975 and 1980?",
            "A": "{Cargo Ships} has the fastest average growth rate between 1975 and 1980."
        },
        {
            "Q": "In which year did Cargo Ships first surpass Hybrid Fleets?",
            "A": "Cargo Ships first surpassed Hybrid Fleets in the year {1972}."
        },
        {
            "Q": "Which label had the leading fuel consumption since 1969?",
            "A": "Since 1969, {Drone Swarms} had the leading fuel consumption."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Hybrid Fleets. List the x-coordinates of data points to be preserved.(4 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1959, 1974, 1976, 1980}."
        }
    ]
}