{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {line chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many lines are in this lines chart?",
            "A": "There are {6} lines."
        }
    ],
    "SRP": [
        {
            "Q": "On Refrigerated Transport, what is the spatial relationship of the data point in 1969 relative to that in 1971 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "On Refrigerated Transport, the data point in 1969 is {above} and to the {left} of the data point in 1971."
        },
        {
            "Q": "In 1970, what is the vertical (above/below) relationship of the line representing Refrigerated Transport relative to Same-Day Couriers?",
            "A": "In 1970, Refrigerated Transport is {below} Same-Day Couriers in the vertical direction."
        }
    ],
    "VPR": [
        {
            "Q": "What is the trend of Refrigerated Transport's On-Time Delivery Rate levels?",
            "A": "Refrigerated Transport's on-time delivery rate levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of E-Commerce Parcels's On-Time Delivery Rate levels?",
            "A": "E-Commerce Parcels's on-time delivery rate levels show a {exponential rising} trend."
        },
        {
            "Q": "What is the trend of Same-Day Couriers's On-Time Delivery Rate levels?",
            "A": "Same-Day Couriers's on-time delivery rate levels show a {volatile falling} trend."
        },
        {
            "Q": "What is the trend of Oversized Loads's On-Time Delivery Rate levels?",
            "A": "Oversized Loads's on-time delivery rate levels show a {bimodal peak} trend."
        }
    ],
    "VE": [
        {
            "Q": "What is Refrigerated Transport's On-Time Delivery Rate in 1971?",
            "A": "Refrigerated Transport's on-time delivery rate in 1971 is {25.38} %."
        },
        {
            "Q": "What is Refrigerated Transport's On-Time Delivery Rate in 1968?",
            "A": "Refrigerated Transport's on-time delivery rate in 1968 is {35.67} %."
        },
        {
            "Q": "What is Same-Day Couriers's On-Time Delivery Rate in 1965?",
            "A": "Same-Day Couriers's on-time delivery rate in 1965 is {53.68} %."
        },
        {
            "Q": "What are the on-time delivery rate of Oversized Loads, Emergency Shipments, and Pharmaceuticals in 1968?",
            "A": "Oversized Loads's on-time delivery rate is {100} %, Emergency Shipments's on-time delivery rate is {100} %, Pharmaceuticals's on-time delivery rate is {100} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global minimum On-Time Delivery Rate in the line chart?",
            "A": "The global minimum on-time delivery rate is {25.38} %."
        },
        {
            "Q": "What is the global maximum On-Time Delivery Rate in the line chart?",
            "A": "The global maximum on-time delivery rate is {100.00} %."
        },
        {
            "Q": "What is the highest On-Time Delivery Rate level recorded for E-Commerce Parcels?",
            "A": "E-Commerce Parcels reached approximately {100.00} % in {1970}."
        },
        {
            "Q": "What is the lowest On-Time Delivery Rate level recorded for E-Commerce Parcels?",
            "A": "E-Commerce Parcels's lowest recorded level is approximately {50.49} % in {1962}."
        }
    ],
    "SC": [
        {
            "Q": "What is the rate of change in Pharmaceuticals's On-Time Delivery Rate from the starting year to the final year?",
            "A": "The rate of no change in Pharmaceuticals's on-time delivery rate is {0.00}%."
        },
        {
            "Q": "What is the rate of change in Refrigerated Transport's On-Time Delivery Rate from the starting year to the final year?",
            "A": "The rate of decline in Refrigerated Transport's on-time delivery rate is {-54.15}%."
        },
        {
            "Q": "What is the rate of change in Oversized Loads's On-Time Delivery Rate from the starting year to the final year?",
            "A": "The rate of no change in Oversized Loads's on-time delivery rate is {0.00}%."
        },
        {
            "Q": "What is the rate of change in Same-Day Couriers's On-Time Delivery Rate from the starting year to the final year?",
            "A": "The rate of decline in Same-Day Couriers's on-time delivery rate is {-44.93}%."
        }
    ],
    "NF": [
        {
            "Q": "In the year 1971, which lines had On-Time Delivery Rate below 51 %? Please list the lines and corresponding values.",
            "A": "{Refrigerated Transport} had {25} %, {Same-Day Couriers} had {35} %."
        },
        {
            "Q": "Which years did Same-Day Couriers's On-Time Delivery Rate between 42 and 55 %? Please list the years and corresponding values.",
            "A": "{48.81} % in {1967} year, {53.68} % in {1965} year, {49.56} % in {1966} year."
        },
        {
            "Q": "Which years did E-Commerce Parcels's On-Time Delivery Rate exceed 90 %? Please list the years and corresponding values.",
            "A": "{100} % in {1970} year, {97.84} % in {1969} year, {100} % in {1971} year."
        },
        {
            "Q": "Which years did Refrigerated Transport's On-Time Delivery Rate between 35 and 47 %? Please list the years and corresponding values.",
            "A": "{39.78} % in {1967} year, {42.25} % in {1966} year, {45.52} % in {1965} year."
        }
    ],
    "NC": [
        {
            "Q": "Between 1962 and 1969, which line had the highest average On-Time Delivery Rate, Same-Day Couriers, E-Commerce Parcels, or Emergency Shipments?",
            "A": "{Emergency Shipments} had the highest average on-time delivery rate."
        },
        {
            "Q": "In 1963, which line had the highest On-Time Delivery Rate, Emergency Shipments, Refrigerated Transport, or Oversized Loads?",
            "A": "In 1963, {Emergency Shipments} had the highest on-time delivery rate."
        },
        {
            "Q": "Was E-Commerce Parcels's On-Time Delivery Rate in 1962 higher or lower than in 1964?",
            "A": "The on-time delivery rate in 1962 was {lower} than in 1964."
        },
        {
            "Q": "Between 1962 and 1971, which line experienced the largest change in On-Time Delivery Rate, Emergency Shipments, E-Commerce Parcels, or Same-Day Couriers?",
            "A": "{E-Commerce Parcels} experienced the largest change in on-time delivery rate."
        }
    ],
    "MSR": [
        {
            "Q": "Which label shows the largest fluctuation in the line chart?",
            "A": "The label with the largest fluctuation is {E-Commerce Parcels}."
        },
        {
            "Q": "Which line shows the fastest average growth rate between 1966 and 1968?",
            "A": "{E-Commerce Parcels} has the fastest average growth rate between 1966 and 1968."
        },
        {
            "Q": "In which year did Pharmaceuticals first surpass Emergency Shipments?",
            "A": "Pharmaceuticals first surpassed Emergency Shipments in the year {1966}."
        },
        {
            "Q": "Which label had the leading on-time delivery rate since 1966?",
            "A": "Since 1966, {Oversized Loads} had the leading on-time delivery rate."
        }
    ],
    "VA": [
        {
            "Q": "Perform the Douglas-Peucker algorithm to simplify the line representing the Emergency Shipments. List the x-coordinates of data points to be preserved.(5 points need to be provided)",
            "A": "The x-coordinates of the data points to be preserved are: {1962, 1965, 1966, 1967, 1971}."
        }
    ]
}