{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of column Funding Sources of this sankey chart?",
            "A": "There are {20} links flow out of column Funding Sources."
        },
        {
            "Q": "How many links flow into column Institution Types of this sankey chart?",
            "A": "There are {20} links flow into column Institution Types."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Funding Sources}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Institution Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Private Investment} and {Government Agencies}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Corporate Sponsorship} and {Research Universities}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Federal Grants to the node Research Universities?",
            "A": "The flow value from the node Federal Grants to the node Research Universities is {10}."
        },
        {
            "Q": "What is the flow value from the node Corporate Sponsorship to the node Non-profit Organizations?",
            "A": "The flow value from the node Corporate Sponsorship to the node Non-profit Organizations is {13}."
        },
        {
            "Q": "What is the flow value from the node Federal Grants to the node Corporate Labs?",
            "A": "The flow value from the node Federal Grants to the node Corporate Labs is {10}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Corporate Sponsorship to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Corporate Sponsorship to the next stage is {25}."
        },
        {
            "Q": "What is the minimum flow value from the node Federal Grants to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Federal Grants to the next stage is {10}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Private Investment?",
            "A": "The total flow output from node Private Investment is {254}."
        },
        {
            "Q": "What is the total flow input by node Corporate Labs?",
            "A": "The total flow input by node Corporate Labs is {137}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Funding Sources of the sankey chart, which nodes have an outflow exceeded 76? Please list the node labels and their corresponding outflow values.",
            "A": "{Private Investment} has an outflow of {86}, {Private Investment} has an outflow of {82}, {Federal Grants} has an outflow of {85}."
        },
        {
            "Q": "Between which pairs of nodes in column Funding Sources and column Institution Types is the flow between 22 and 32? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {25} from node {Corporate Sponsorship} to {Government Agencies}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 22 and 32? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {25} from node {Corporate Sponsorship} to {Government Agencies}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Corporate Sponsorship to node Government Agencies and from node Federal Grants to node Corporate Labs, which path has a larger flow?",
            "A": "The flow from node {Corporate Sponsorship} to node {Government Agencies} is larger."
        },
        {
            "Q": "Among the flows from node Private Investment to node Research Universities, from node Private Investment to node Non-profit Organizations, and from node Federal Grants to node Research Universities, which path has the largest flow?",
            "A": "The flow from node {Private Investment} to node {Non-profit Organizations} is the largest."
        },
        {
            "Q": "Among the flows from node Crowdfunding to node Government Agencies, from node Private Investment to node Corporate Labs, and from node Corporate Sponsorship to node Corporate Labs, which path has the largest flow?",
            "A": "The flow from node {Private Investment} to node {Corporate Labs} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Institution Types of the sankey chart is the most critical?",
            "A": "The most critical node in the column Institution Types is {Government Agencies}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Corporate Sponsorship to target node Corporate Labs? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Corporate Sponsorship to node Corporate Labs is: {Corporate Sponsorship, Corporate Labs}."
        }
    ],
    "VA": []
}