{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into column Returns of this sankey chart?",
            "A": "There are {6} links flow into column Returns."
        },
        {
            "Q": "How many nodes are in the column Returns of this sankey chart?",
            "A": "There are {2} nodes in the column Returns."
        },
        {
            "Q": "How many links flow into the node Pension Funds in this sankey chart?",
            "A": "There are {2} links flowing into the node Pension Funds."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Investment Types}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Market Segments}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Real Estate} and {Index Fund Investing}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Low Risk} and {Negative Return}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Negative Return to the node Pension Funds?",
            "A": "The flow value from the node Negative Return to the node Pension Funds is {23440}."
        },
        {
            "Q": "What is the flow value from the node Negative Return to the node Retail Investors?",
            "A": "The flow value from the node Negative Return to the node Retail Investors is {20248}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Moderate Return to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Moderate Return to the next stage is {21708}."
        },
        {
            "Q": "What is the minimum flow value from the node Commodities to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Commodities to the next stage is {2835}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Growth Investing?",
            "A": "The total flow output from node Growth Investing is {25520}."
        },
        {
            "Q": "What is the total flow input by node Growth Investing?",
            "A": "The total flow input by node Growth Investing is {25520}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Returns of the sankey chart, which nodes have an outflow exceeded 22574? Please list the node labels and their corresponding outflow values.",
            "A": "{Negative Return} has an outflow of {23440}."
        },
        {
            "Q": "Between which pairs of nodes in column Investment Types and column Investment Strategies is the flow between 9311 and 14549? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {13986} from node {Real Estate} to {Growth Investing}, a flow of {9924} from node {Stocks} to {Index Fund Investing}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 9796 and 14549? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {13986} from node {Real Estate} to {Growth Investing}, a flow of {9924} from node {Stocks} to {Index Fund Investing}, a flow of {11119} from node {Moderate Return} to {Pension Funds}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Negative Return to node Institutional Investors and from node Stocks to node Growth Investing, which path has a larger flow?",
            "A": "The flow from node {Negative Return} to node {Institutional Investors} is larger."
        },
        {
            "Q": "Among the flows from node Moderate Risk to node Moderate Return, from node Commodities to node Index Fund Investing, and from node High Risk to node Negative Return, which path has the largest flow?",
            "A": "The flow from node {High Risk} to node {Negative Return} is the largest."
        },
        {
            "Q": "Among the flows from node Low Risk to node Moderate Return, from node Index Fund Investing to node Moderate Risk, and from node Growth Investing to node Low Risk, which path has the largest flow?",
            "A": "The flow from node {Index Fund Investing} to node {Moderate Risk} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Market Segments of the sankey chart is the most critical?",
            "A": "The most critical node in the column Market Segments is {Retail Investors}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Commodities to target node Retail Investors? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Commodities to node Retail Investors is: {Commodities, Index Fund Investing, High Risk, Negative Return, Retail Investors}."
        }
    ],
    "VA": []
}