{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into the node Video Sharing in this sankey chart?",
            "A": "There are {5} links flowing into the node Video Sharing."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {30} links."
        },
        {
            "Q": "How many nodes are in the column Engagement Methods of this sankey chart?",
            "A": "There are {5} nodes in the column Engagement Methods."
        },
        {
            "Q": "How many links flow out of column Engagement Methods of this sankey chart?",
            "A": "There are {30} links flow out of column Engagement Methods."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Engagement Methods}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Platform Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Shares} and {Music Streaming}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Donations} and {Video Sharing}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Shares to the node Video Sharing?",
            "A": "The flow value from the node Shares to the node Video Sharing is {37565}."
        },
        {
            "Q": "What is the flow value from the node Live Chats to the node Music Streaming?",
            "A": "The flow value from the node Live Chats to the node Music Streaming is {14982}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Donations to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Donations to the next stage is {6264}."
        },
        {
            "Q": "What is the minimum flow value from the node Donations to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Donations to the next stage is {953}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Comments?",
            "A": "The total flow output from node Comments is {20467}."
        },
        {
            "Q": "What is the total flow input by node News Aggregators?",
            "A": "The total flow input by node News Aggregators is {25780}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Engagement Methods of the sankey chart, which nodes have an outflow exceeded 39118? Please list the node labels and their corresponding outflow values.",
            "A": "{Shares} has an outflow of {40671}, {Shares} has an outflow of {50446}."
        },
        {
            "Q": "Between which pairs of nodes in column Engagement Methods and column Platform Types is the flow between 6507 and 6980? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {6751} from node {Live Chats} to {News Aggregators}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 6112 and 7265? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {6751} from node {Live Chats} to {News Aggregators}, a flow of {6264} from node {Donations} to {News Aggregators}, a flow of {7209} from node {Shares} to {News Aggregators}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Shares to node Social Networks and from node Comments to node Live Streaming, which path has a larger flow?",
            "A": "The flow from node {Shares} to node {Social Networks} is larger."
        },
        {
            "Q": "Among the flows from node Shares to node Music Streaming, from node Comments to node News Aggregators, and from node Donations to node Podcast Platforms, which path has the largest flow?",
            "A": "The flow from node {Shares} to node {Music Streaming} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Engagement Methods of the sankey chart is the most critical?",
            "A": "The most critical node in the column Engagement Methods is {Shares}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Comments to target node Music Streaming? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Comments to node Music Streaming is: {Comments, Music Streaming}."
        }
    ],
    "VA": []
}