{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {16} nodes."
        },
        {
            "Q": "How many links flow out of the node Podcasts in this sankey chart?",
            "A": "There are {2} links flowing out of the node Podcasts."
        },
        {
            "Q": "How many links flow into column Content Formats of this sankey chart?",
            "A": "There are {20} links flow into column Content Formats."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Monetization Models}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Platform Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Music Tracks} and {Likes}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Pay-Per-View} and {Reels}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Virtual Gifts to the node Podcasts?",
            "A": "The flow value from the node Virtual Gifts to the node Podcasts is {32197}."
        },
        {
            "Q": "What is the flow value from the node Sponsorships to the node Livestreams?",
            "A": "The flow value from the node Sponsorships to the node Livestreams is {341374}."
        },
        {
            "Q": "What is the flow value from the node Sponsorships to the node Short Videos?",
            "A": "The flow value from the node Sponsorships to the node Short Videos is {151535}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Shares to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Shares to the next stage is {380116}."
        },
        {
            "Q": "What is the minimum flow value from the node Pay-Per-View to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Pay-Per-View to the next stage is {16966}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Livestreams?",
            "A": "The total flow output from node Livestreams is {688513}."
        },
        {
            "Q": "What is the total flow input by node Shares?",
            "A": "The total flow input by node Shares is {1325279}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Monetization Models of the sankey chart, which nodes have an outflow exceeded 307872? Please list the node labels and their corresponding outflow values.",
            "A": "{Sponsorships} has an outflow of {341374}."
        },
        {
            "Q": "Between which pairs of nodes in column Content Formats and column Engagement Methods is the flow between 173291 and 251368? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {226381} from node {Reels} to {Shares}, a flow of {224686} from node {Podcasts} to {Shares}, a flow of {192381} from node {Podcasts} to {Likes}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 151690 and 153023? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {151846} from node {Likes} to {News Aggregators}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Livestreams to node Shares and from node Merch Sales to node Short Videos, which path has a larger flow?",
            "A": "The flow from node {Livestreams} to node {Shares} is larger."
        },
        {
            "Q": "Among the flows from node Sponsorships to node Music Tracks, from node Shares to node News Aggregators, and from node Merch Sales to node Podcasts, which path has the largest flow?",
            "A": "The flow from node {Shares} to node {News Aggregators} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Content Formats of the sankey chart is the most critical?",
            "A": "The most critical node in the column Content Formats is {Livestreams}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Merch Sales to target node Social Networks? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Merch Sales to node Social Networks is: {Merch Sales, Music Tracks, Likes, Social Networks}."
        }
    ],
    "VA": []
}