{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {13} nodes."
        },
        {
            "Q": "How many links flow into the node Basketball in this sankey chart?",
            "A": "There are {2} links flowing into the node Basketball."
        },
        {
            "Q": "How many links flow out of column Revenue Streams of this sankey chart?",
            "A": "There are {6} links flow out of column Revenue Streams."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {30} links."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Event Types}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Engagement Channels}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Finals} and {Basketball}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Golf} and {Concessions}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Cricket to the node Concessions?",
            "A": "The flow value from the node Cricket to the node Concessions is {740}."
        },
        {
            "Q": "What is the flow value from the node Finals to the node Tennis?",
            "A": "The flow value from the node Finals to the node Tennis is {1310}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Finals to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Finals to the next stage is {6747}."
        },
        {
            "Q": "What is the minimum flow value from the node Finals to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Finals to the next stage is {1310}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Tournament?",
            "A": "The total flow output from node Tournament is {3583}."
        },
        {
            "Q": "What is the total flow input by node Golf?",
            "A": "The total flow input by node Golf is {1596}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Sports Types of the sankey chart, which nodes have an outflow exceeded 3675? Please list the node labels and their corresponding outflow values.",
            "A": "{Cricket} has an outflow of {4831}, {Basketball} has an outflow of {4333}."
        },
        {
            "Q": "Between which pairs of nodes in column Revenue Streams and column Engagement Channels is the flow between 2938 and 3667? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {3069} from node {Concessions} to {Live Streaming}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 1430 and 1452? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {1441} from node {Golf} to {Sponsorships}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Tournament to node Golf and from node Finals to node Hockey, which path has a larger flow?",
            "A": "The flow from node {Finals} to node {Hockey} is larger."
        },
        {
            "Q": "Between the flows from node Finals to node Hockey and from node Golf to node Concessions, which path has a larger flow?",
            "A": "The flow from node {Finals} to node {Hockey} is larger."
        },
        {
            "Q": "Among the flows from node Tournament to node Baseball, from node Finals to node Hockey, and from node Finals to node Cricket, which path has the largest flow?",
            "A": "The flow from node {Finals} to node {Cricket} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Engagement Channels of the sankey chart is the most critical?",
            "A": "The most critical node in the column Engagement Channels is {Social Media}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Tournament to target node Social Media? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Tournament to node Social Media is: {Tournament, Cricket, Sponsorships, Social Media}."
        }
    ],
    "VA": []
}