{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of the node Cricket in this sankey chart?",
            "A": "There are {3} links flowing out of the node Cricket."
        },
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {15} nodes."
        },
        {
            "Q": "How many links flow into column Event Types of this sankey chart?",
            "A": "There are {9} links flow into column Event Types."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Sports Types}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Audience Segments}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Basketball} and {Finals}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Mobile Apps} and {Corporate Groups}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Cricket to the node Tournament?",
            "A": "The flow value from the node Cricket to the node Tournament is {958}."
        },
        {
            "Q": "What is the flow value from the node Playoffs to the node Fantasy Leagues?",
            "A": "The flow value from the node Playoffs to the node Fantasy Leagues is {681}."
        },
        {
            "Q": "What is the flow value from the node Fan Meetups to the node Families?",
            "A": "The flow value from the node Fan Meetups to the node Families is {2277}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Social Media to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Social Media to the next stage is {3680}."
        },
        {
            "Q": "What is the minimum flow value from the node Fantasy Leagues to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Fantasy Leagues to the next stage is {231}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Cricket?",
            "A": "The total flow output from node Cricket is {3002}."
        },
        {
            "Q": "What is the total flow input by node Playoffs?",
            "A": "The total flow input by node Playoffs is {7185}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Engagement Channels of the sankey chart, which nodes have an outflow exceeded 3424? Please list the node labels and their corresponding outflow values.",
            "A": "{Social Media} has an outflow of {3680}."
        },
        {
            "Q": "Between which pairs of nodes in column Engagement Channels and column Audience Segments is the flow between 801 and 1408? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1393} from node {Mobile Apps} to {Families}, a flow of {820} from node {Fan Meetups} to {VIP Guests}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 1147 and 1474? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {1162} from node {Cricket} to {Playoffs}, a flow of {1424} from node {Fantasy Leagues} to {Corporate Groups}, a flow of {1393} from node {Mobile Apps} to {Families}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Social Media to node Corporate Groups and from node Mobile Apps to node International Fans, which path has a larger flow?",
            "A": "The flow from node {Social Media} to node {Corporate Groups} is larger."
        },
        {
            "Q": "Between the flows from node Mobile Apps to node International Fans and from node Playoffs to node Mobile Apps, which path has a larger flow?",
            "A": "The flow from node {Playoffs} to node {Mobile Apps} is larger."
        },
        {
            "Q": "Among the flows from node Cricket to node Playoffs, from node Baseball to node Finals, and from node Baseball to node Playoffs, which path has the largest flow?",
            "A": "The flow from node {Baseball} to node {Playoffs} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Event Types of the sankey chart is the most critical?",
            "A": "The most critical node in the column Event Types is {Finals}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Basketball to target node Families? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Basketball to node Families is: {Basketball, Finals, Fan Meetups, Families}."
        }
    ],
    "VA": []
}