{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {66} links."
        },
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {17} nodes."
        },
        {
            "Q": "How many nodes are in the column Sports Types of this sankey chart?",
            "A": "There are {6} nodes in the column Sports Types."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Engagement Channels}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Event Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Basketball} and {Friendly Match}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Live Streaming} and {Football}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Cricket to the node League Match?",
            "A": "The flow value from the node Cricket to the node League Match is {1216}."
        },
        {
            "Q": "What is the flow value from the node Fantasy Leagues to the node Baseball?",
            "A": "The flow value from the node Fantasy Leagues to the node Baseball is {8685}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Mobile Apps to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Mobile Apps to the next stage is {18565}."
        },
        {
            "Q": "What is the minimum flow value from the node Live Streaming to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Live Streaming to the next stage is {352}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Mobile Apps?",
            "A": "The total flow output from node Mobile Apps is {54601}."
        },
        {
            "Q": "What is the total flow input by node Hockey?",
            "A": "The total flow input by node Hockey is {34036}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Engagement Channels of the sankey chart, which nodes have an outflow exceeded 11535? Please list the node labels and their corresponding outflow values.",
            "A": "{Fan Meetups} has an outflow of {11556}, {Mobile Apps} has an outflow of {18565}."
        },
        {
            "Q": "Between which pairs of nodes in column Sports Types and column Event Types is the flow between 4407 and 4483? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {4411} from node {Golf} to {Playoffs}, a flow of {4441} from node {Golf} to {Tournament}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 4483 and 4801? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {4526} from node {Basketball} to {Finals}, a flow of {4684} from node {Baseball} to {League Match}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Social Media to node Cricket and from node Baseball to node Exhibition, which path has a larger flow?",
            "A": "The flow from node {Baseball} to node {Exhibition} is larger."
        },
        {
            "Q": "Among the flows from node Cricket to node Finals, from node Football to node Playoffs, and from node Fan Meetups to node Hockey, which path has the largest flow?",
            "A": "The flow from node {Fan Meetups} to node {Hockey} is the largest."
        },
        {
            "Q": "Among the flows from node Cricket to node Tournament, from node Social Media to node Football, and from node Social Media to node Baseball, which path has the largest flow?",
            "A": "The flow from node {Social Media} to node {Baseball} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Event Types of the sankey chart is the most critical?",
            "A": "The most critical node in the column Event Types is {Friendly Match}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Social Media to target node Friendly Match? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Social Media to node Friendly Match is: {Social Media, Basketball, Friendly Match}."
        }
    ],
    "VA": []
}