{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {16} nodes."
        },
        {
            "Q": "How many nodes are in the column Travel Purposes of this sankey chart?",
            "A": "There are {5} nodes in the column Travel Purposes."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {28} links."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Travel Purposes}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Attractions}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {North America} and {Transportation}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Medical} and {Europe}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Accommodation to the node Cultural Festival?",
            "A": "The flow value from the node Accommodation to the node Cultural Festival is {2340}."
        },
        {
            "Q": "What is the flow value from the node North America to the node Accommodation?",
            "A": "The flow value from the node North America to the node Accommodation is {3147}."
        },
        {
            "Q": "What is the flow value from the node Religious Pilgrimage to the node North America?",
            "A": "The flow value from the node Religious Pilgrimage to the node North America is {6061}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Accommodation to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Accommodation to the next stage is {6475}."
        },
        {
            "Q": "What is the minimum flow value from the node North America to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node North America to the next stage is {3147}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Adventure?",
            "A": "The total flow output from node Adventure is {10770}."
        },
        {
            "Q": "What is the total flow input by node Theme Park?",
            "A": "The total flow input by node Theme Park is {2611}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Source Continents of the sankey chart, which nodes have an outflow exceeded 10769? Please list the node labels and their corresponding outflow values.",
            "A": "{North America} has an outflow of {20952}, {Europe} has an outflow of {16410}."
        },
        {
            "Q": "Between which pairs of nodes in column Travel Purposes and column Source Continents is the flow between 2203 and 5227? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {4515} from node {Medical} to {North America}, a flow of {2436} from node {Leisure} to {North America}, a flow of {3656} from node {Leisure} to {Europe}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 2797 and 3418? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {3147} from node {North America} to {Accommodation}, a flow of {3202} from node {Accommodation} to {Historical Site}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Adventure to node North America and from node Religious Pilgrimage to node North America, which path has a larger flow?",
            "A": "The flow from node {Religious Pilgrimage} to node {North America} is larger."
        },
        {
            "Q": "Among the flows from node Accommodation to node Historical Site, from node Accommodation to node Hiking Trail, and from node Education to node North America, which path has the largest flow?",
            "A": "The flow from node {Education} to node {North America} is the largest."
        },
        {
            "Q": "Among the flows from node Medical to node North America, from node Accommodation to node Shopping District, and from node Adventure to node Europe, which path has the largest flow?",
            "A": "The flow from node {Adventure} to node {Europe} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Travel Purposes of the sankey chart is the most critical?",
            "A": "The most critical node in the column Travel Purposes is {Religious Pilgrimage}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Education to target node Cultural Festival? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Education to node Cultural Festival is: {Education, North America, Transportation, Cultural Festival}."
        }
    ],
    "VA": []
}