{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into column Assembly of this sankey chart?",
            "A": "There are {16} links flow into column Assembly."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {62} links."
        },
        {
            "Q": "How many nodes are in the column Assembly of this sankey chart?",
            "A": "There are {4} nodes in the column Assembly."
        },
        {
            "Q": "How many links flow out of column Factory of this sankey chart?",
            "A": "There are {10} links flow out of column Factory."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Factory}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Assembly}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Auto Factory} and {West Hub}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Express Sorting Center} and {Convenience Store}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Regional Warehouse A to the node Component Assembly?",
            "A": "The flow value from the node Regional Warehouse A to the node Component Assembly is {344}."
        },
        {
            "Q": "What is the flow value from the node Outlet Mall to the node Regional Warehouse A?",
            "A": "The flow value from the node Outlet Mall to the node Regional Warehouse A is {224}."
        },
        {
            "Q": "What is the flow value from the node Express Sorting Center to the node Outlet Mall?",
            "A": "The flow value from the node Express Sorting Center to the node Outlet Mall is {152}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Auto Factory to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Auto Factory to the next stage is {593}."
        },
        {
            "Q": "What is the minimum flow value from the node West Hub to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node West Hub to the next stage is {88}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Spare Parts Depot?",
            "A": "The total flow output from node Spare Parts Depot is {579}."
        },
        {
            "Q": "What is the total flow input by node Test Facility?",
            "A": "The total flow input by node Test Facility is {908}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Retail of the sankey chart, which nodes have an outflow exceeded 272? Please list the node labels and their corresponding outflow values.",
            "A": "{Convenience Store} has an outflow of {290}."
        },
        {
            "Q": "Between which pairs of nodes in column Distribution Center and column Retail is the flow between 99 and 118? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {110} from node {West Hub} to {Online Fulfillment}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 143 and 145? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {143} from node {Chemical Plant} to {Express Sorting Center}, a flow of {144} from node {Online Fulfillment} to {Cold Storage}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Auto Factory to node East Hub and from node Express Sorting Center to node City Supermarket, which path has a larger flow?",
            "A": "The flow from node {Auto Factory} to node {East Hub} is larger."
        },
        {
            "Q": "Among the flows from node Online Fulfillment to node Cold Storage, from node Cold Storage to node Quality Check, and from node Bulk Storage to node Labeling, which path has the largest flow?",
            "A": "The flow from node {Online Fulfillment} to node {Cold Storage} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Warehouse of the sankey chart is the most critical?",
            "A": "The most critical node in the column Warehouse is {Regional Warehouse A}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Chemical Plant to target node Labeling? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Chemical Plant to node Labeling is: {Chemical Plant, East Hub, City Supermarket, Spare Parts Depot, Labeling}."
        }
    ],
    "VA": []
}