{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into column Retail of this sankey chart?",
            "A": "There are {6} links flow into column Retail."
        },
        {
            "Q": "How many links flow out of the node Spare Parts Depot in this sankey chart?",
            "A": "There are {3} links flowing out of the node Spare Parts Depot."
        },
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {9} nodes."
        },
        {
            "Q": "How many nodes are in the column Distribution Center of this sankey chart?",
            "A": "There are {3} nodes in the column Distribution Center."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Warehouse}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Retail}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Express Sorting Center} and {Neighborhood Store}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Spare Parts Depot} and {Express Sorting Center}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Regional Warehouse A to the node East Hub?",
            "A": "The flow value from the node Regional Warehouse A to the node East Hub is {204}."
        },
        {
            "Q": "What is the flow value from the node Bulk Storage to the node West Hub?",
            "A": "The flow value from the node Bulk Storage to the node West Hub is {79}."
        },
        {
            "Q": "What is the flow value from the node Spare Parts Depot to the node East Hub?",
            "A": "The flow value from the node Spare Parts Depot to the node East Hub is {37}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Express Sorting Center to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Express Sorting Center to the next stage is {319}."
        },
        {
            "Q": "What is the minimum flow value from the node East Hub to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node East Hub to the next stage is {144}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Spare Parts Depot?",
            "A": "The total flow output from node Spare Parts Depot is {98}."
        },
        {
            "Q": "What is the total flow input by node West Hub?",
            "A": "The total flow input by node West Hub is {390}."
        }
    ],
    "NF": [
        {
            "Q": "Between which pairs of nodes in column Warehouse and column Distribution Center is the flow between 53 and 69? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {59} from node {Regional Warehouse A} to {West Hub}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 88 and 105? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {98} from node {Central Warehouse} to {Express Sorting Center}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Bulk Storage to node East Hub and from node Central Warehouse to node Express Sorting Center, which path has a larger flow?",
            "A": "The flow from node {Central Warehouse} to node {Express Sorting Center} is larger."
        },
        {
            "Q": "Among the flows from node Express Sorting Center to node Outlet Mall, from node East Hub to node Neighborhood Store, and from node Spare Parts Depot to node East Hub, which path has the largest flow?",
            "A": "The flow from node {East Hub} to node {Neighborhood Store} is the largest."
        },
        {
            "Q": "Among the flows from node Central Warehouse to node East Hub, from node Regional Warehouse A to node East Hub, and from node Express Sorting Center to node Neighborhood Store, which path has the largest flow?",
            "A": "The flow from node {Express Sorting Center} to node {Neighborhood Store} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Distribution Center of the sankey chart is the most critical?",
            "A": "The most critical node in the column Distribution Center is {Express Sorting Center}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Central Warehouse to target node Neighborhood Store? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Central Warehouse to node Neighborhood Store is: {Central Warehouse, Express Sorting Center, Neighborhood Store}."
        }
    ],
    "VA": []
}