{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of the node Regional Warehouse A in this sankey chart?",
            "A": "There are {5} links flowing out of the node Regional Warehouse A."
        },
        {
            "Q": "How many links flow out of column Retail of this sankey chart?",
            "A": "There are {8} links flow out of column Retail."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {53} links."
        },
        {
            "Q": "How many links flow into column Factory of this sankey chart?",
            "A": "There are {25} links flow into column Factory."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Retail}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Factory}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Neighborhood Store} and {Cold Storage}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Spare Parts Depot} and {North Hub}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Express Sorting Center to the node Textile Mill?",
            "A": "The flow value from the node Express Sorting Center to the node Textile Mill is {405}."
        },
        {
            "Q": "What is the flow value from the node Express Sorting Center to the node Food Processing Plant?",
            "A": "The flow value from the node Express Sorting Center to the node Food Processing Plant is {54}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Neighborhood Store to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Neighborhood Store to the next stage is {839}."
        },
        {
            "Q": "What is the minimum flow value from the node North Hub to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node North Hub to the next stage is {135}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Express Sorting Center?",
            "A": "The total flow output from node Express Sorting Center is {967}."
        },
        {
            "Q": "What is the total flow input by node Chemical Plant?",
            "A": "The total flow input by node Chemical Plant is {640}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Warehouse of the sankey chart, which nodes have an outflow exceeded 486? Please list the node labels and their corresponding outflow values.",
            "A": "{Central Warehouse} has an outflow of {543}."
        },
        {
            "Q": "Between which pairs of nodes in column Retail and column Warehouse is the flow between 214 and 591? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {585} from node {Outlet Mall} to {Regional Warehouse A}, a flow of {324} from node {Outlet Mall} to {Spare Parts Depot}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 108 and 121? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {111} from node {Spare Parts Depot} to {West Hub}, a flow of {116} from node {South Hub} to {Auto Factory}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node East Hub to node Electronics Plant and from node Central Warehouse to node Express Sorting Center, which path has a larger flow?",
            "A": "The flow from node {Central Warehouse} to node {Express Sorting Center} is larger."
        },
        {
            "Q": "Between the flows from node East Hub to node Electronics Plant and from node East Hub to node Textile Mill, which path has a larger flow?",
            "A": "The flow from node {East Hub} to node {Electronics Plant} is equal to the flow from node {East Hub} to node {Textile Mill}."
        },
        {
            "Q": "Among the flows from node Cold Storage to node Express Sorting Center, from node West Hub to node Auto Factory, and from node North Hub to node Chemical Plant, which path has the largest flow?",
            "A": "The flow from node {Cold Storage} to node {Express Sorting Center} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Warehouse of the sankey chart is the most critical?",
            "A": "The most critical node in the column Warehouse is {Central Warehouse}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Outlet Mall to target node Auto Factory? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Outlet Mall to node Auto Factory is: {Outlet Mall, Central Warehouse, North Hub, Auto Factory}."
        }
    ],
    "VA": []
}