{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many nodes are in the column Market Segments of this sankey chart?",
            "A": "There are {3} nodes in the column Market Segments."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {24} links."
        },
        {
            "Q": "How many links flow into column Risk Levels of this sankey chart?",
            "A": "There are {12} links flow into column Risk Levels."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Market Segments}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Risk Levels}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Pension Funds} and {Index Fund Investing}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Hedge Funds} and {Day Trading}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Retail Investors to the node Value Investing?",
            "A": "The flow value from the node Retail Investors to the node Value Investing is {13353}."
        },
        {
            "Q": "What is the flow value from the node Value Investing to the node Low Risk?",
            "A": "The flow value from the node Value Investing to the node Low Risk is {9930}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Pension Funds to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Pension Funds to the next stage is {24340}."
        },
        {
            "Q": "What is the minimum flow value from the node Value Investing to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Value Investing to the next stage is {2746}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Retail Investors?",
            "A": "The total flow output from node Retail Investors is {30362}."
        },
        {
            "Q": "What is the total flow input by node Value Investing?",
            "A": "The total flow input by node Value Investing is {21754}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Investment Strategies of the sankey chart, which nodes have an outflow exceeded 10367? Please list the node labels and their corresponding outflow values.",
            "A": "{Index Fund Investing} has an outflow of {10805}, {Index Fund Investing} has an outflow of {13772}."
        },
        {
            "Q": "Between which pairs of nodes in column Investment Strategies and column Risk Levels is the flow between 5275 and 6324? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {5418} from node {Growth Investing} to {Moderate Risk}, a flow of {5286} from node {Day Trading} to {High Risk}, a flow of {5904} from node {Index Fund Investing} to {Moderate Risk}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 4967 and 5333? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {5281} from node {Retail Investors} to {Day Trading}, a flow of {5286} from node {Day Trading} to {High Risk}, a flow of {5264} from node {Day Trading} to {Low Risk}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Hedge Funds to node Growth Investing and from node Retail Investors to node Value Investing, which path has a larger flow?",
            "A": "The flow from node {Retail Investors} to node {Value Investing} is larger."
        },
        {
            "Q": "Among the flows from node Pension Funds to node Value Investing, from node Growth Investing to node High Risk, and from node Hedge Funds to node Index Fund Investing, which path has the largest flow?",
            "A": "The flow from node {Hedge Funds} to node {Index Fund Investing} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Risk Levels of the sankey chart is the most critical?",
            "A": "The most critical node in the column Risk Levels is {Low Risk}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Hedge Funds to target node Low Risk? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Hedge Funds to node Low Risk is: {Hedge Funds, Index Fund Investing, Low Risk}."
        }
    ],
    "VA": []
}