{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into column Import & Export of this sankey chart?",
            "A": "There are {6} links flow into column Import & Export."
        },
        {
            "Q": "How many links flow out of the node Storage in this sankey chart?",
            "A": "There are {4} links flowing out of the node Storage."
        },
        {
            "Q": "How many links flow into the node Fertilization in this sankey chart?",
            "A": "There are {4} links flowing into the node Fertilization."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Distribution}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Import & Export}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Seeding} and {Import Inspection}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Transportation} and {Grinding}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Canning to the node Fertilization?",
            "A": "The flow value from the node Canning to the node Fertilization is {7602}."
        },
        {
            "Q": "What is the flow value from the node Seeding to the node Import Inspection?",
            "A": "The flow value from the node Seeding to the node Import Inspection is {12190}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Packaging to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Packaging to the next stage is {6740}."
        },
        {
            "Q": "What is the minimum flow value from the node Seeding to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Seeding to the next stage is {2102}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Grinding?",
            "A": "The total flow output from node Grinding is {7595}."
        },
        {
            "Q": "What is the total flow input by node Import Inspection?",
            "A": "The total flow input by node Import Inspection is {16125}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Farming of the sankey chart, which nodes have an outflow exceeded 6680? Please list the node labels and their corresponding outflow values.",
            "A": "{Seeding} has an outflow of {9179}, {Seeding} has an outflow of {12190}, {Fertilization} has an outflow of {7386}."
        },
        {
            "Q": "Between which pairs of nodes in column Farming and column Import & Export is the flow between 3018 and 8282? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {7386} from node {Fertilization} to {Export Certification}, a flow of {3935} from node {Fertilization} to {Import Inspection}, a flow of {5975} from node {Fertilization} to {International Shipping}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 4101 and 4443? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {4240} from node {Wholesale} to {Packaging}, a flow of {4107} from node {Transportation} to {Packaging}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Packaging to node Fertilization and from node Storage to node Packaging, which path has a larger flow?",
            "A": "The flow from node {Packaging} to node {Fertilization} is larger."
        },
        {
            "Q": "Among the flows from node Transportation to node Cleaning, from node Cleaning to node Seeding, and from node Fertilization to node Import Inspection, which path has the largest flow?",
            "A": "The flow from node {Cleaning} to node {Seeding} is the largest."
        },
        {
            "Q": "Among the flows from node Wholesale to node Canning, from node Storage to node Cleaning, and from node Seeding to node International Shipping, which path has the largest flow?",
            "A": "The flow from node {Seeding} to node {International Shipping} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Distribution of the sankey chart is the most critical?",
            "A": "The most critical node in the column Distribution is {Storage}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Transportation to target node Export Certification? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Transportation to node Export Certification is: {Transportation, Packaging, Seeding, Export Certification}."
        }
    ],
    "VA": []
}