{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of column Cultural Origins of this sankey chart?",
            "A": "There are {20} links flow out of column Cultural Origins."
        },
        {
            "Q": "How many links flow out of the node Asia in this sankey chart?",
            "A": "There are {5} links flowing out of the node Asia."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {52} links."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Art Forms}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Audience Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Asia} and {Innovation}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Economy} and {Local Communities}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Americas to the node Social Integration?",
            "A": "The flow value from the node Americas to the node Social Integration is {141}."
        },
        {
            "Q": "What is the flow value from the node Social Integration to the node General Public?",
            "A": "The flow value from the node Social Integration to the node General Public is {353}."
        },
        {
            "Q": "What is the flow value from the node Economy to the node General Public?",
            "A": "The flow value from the node Economy to the node General Public is {182}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Literature to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Literature to the next stage is {520}."
        },
        {
            "Q": "What is the minimum flow value from the node Education to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Education to the next stage is {148}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Americas?",
            "A": "The total flow output from node Americas is {833}."
        },
        {
            "Q": "What is the total flow input by node Social Integration?",
            "A": "The total flow input by node Social Integration is {805}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Impact Areas of the sankey chart, which nodes have an outflow exceeded 278? Please list the node labels and their corresponding outflow values.",
            "A": "{Tourism} has an outflow of {342}, {Social Integration} has an outflow of {353}, {Innovation} has an outflow of {585}."
        },
        {
            "Q": "Between which pairs of nodes in column Impact Areas and column Audience Types is the flow between 149 and 172? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {164} from node {Tourism} to {Tourists}, a flow of {150} from node {Social Integration} to {Local Communities}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 155 and 172? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {164} from node {Dance} to {Oceania}, a flow of {159} from node {Oceania} to {Social Integration}, a flow of {164} from node {Tourism} to {Tourists}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Music to node Asia and from node Innovation to node Artists, which path has a larger flow?",
            "A": "The flow from node {Music} to node {Asia} is larger."
        },
        {
            "Q": "Between the flows from node Innovation to node Artists and from node Education to node Tourists, which path has a larger flow?",
            "A": "The flow from node {Education} to node {Tourists} is larger."
        },
        {
            "Q": "Among the flows from node Music to node Oceania, from node Innovation to node General Public, and from node Dance to node Oceania, which path has the largest flow?",
            "A": "The flow from node {Music} to node {Oceania} is the largest."
        },
        {
            "Q": "Among the flows from node Economy to node Artists, from node Literature to node Americas, and from node Education to node Local Communities, which path has the largest flow?",
            "A": "The flow from node {Education} to node {Local Communities} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Art Forms of the sankey chart is the most critical?",
            "A": "The most critical node in the column Art Forms is {Dance}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Dance to target node Artists? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Dance to node Artists is: {Dance, Asia, Innovation, Artists}."
        }
    ],
    "VA": []
}