{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of the node Public School in this sankey chart?",
            "A": "There are {3} links flowing out of the node Public School."
        },
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {10} nodes."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Institution Types}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Student Backgrounds}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Employment} and {International}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Community College} and {Entrepreneurship}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Employment to the node International?",
            "A": "The flow value from the node Employment to the node International is {3220}."
        },
        {
            "Q": "What is the flow value from the node Gap Year to the node International?",
            "A": "The flow value from the node Gap Year to the node International is {1415}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node University to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node University to the next stage is {1771}."
        },
        {
            "Q": "What is the minimum flow value from the node Gap Year to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Gap Year to the next stage is {1414}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Gap Year?",
            "A": "The total flow output from node Gap Year is {2829}."
        },
        {
            "Q": "What is the total flow input by node Gap Year?",
            "A": "The total flow input by node Gap Year is {2829}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Institution Types of the sankey chart, which nodes have an outflow exceeded 2061? Please list the node labels and their corresponding outflow values.",
            "A": "{Online Institution} has an outflow of {2352}."
        },
        {
            "Q": "Between which pairs of nodes in column Post-Education Paths and column Student Backgrounds is the flow between 1414 and 2735? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {2591} from node {Entrepreneurship} to {First-Generation}, a flow of {1973} from node {Employment} to {First-Generation}, a flow of {1415} from node {Gap Year} to {International}, a flow of {1414} from node {Gap Year} to {First-Generation}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 974 and 1213? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {1011} from node {Private School} to {Entrepreneurship}, a flow of {1013} from node {Private School} to {Gap Year}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Private School to node Entrepreneurship and from node Online Institution to node Entrepreneurship, which path has a larger flow?",
            "A": "The flow from node {Online Institution} to node {Entrepreneurship} is larger."
        },
        {
            "Q": "Between the flows from node Private School to node Entrepreneurship and from node Community College to node Gap Year, which path has a larger flow?",
            "A": "The flow from node {Private School} to node {Entrepreneurship} is larger."
        },
        {
            "Q": "Among the flows from node Private School to node Entrepreneurship, from node University to node Employment, and from node Online Institution to node Employment, which path has the largest flow?",
            "A": "The flow from node {University} to node {Employment} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Institution Types of the sankey chart is the most critical?",
            "A": "The most critical node in the column Institution Types is {University}."
        },
        {
            "Q": "What is the path with the highest total flow from source node University to target node International? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node University to node International is: {University, Employment, International}."
        }
    ],
    "VA": []
}