{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of the node Counseling in this sankey chart?",
            "A": "There are {5} links flowing out of the node Counseling."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {63} links."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Post-Education Paths}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Institution Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Financial Aid} and {Private School}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Employment} and {Urban}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Scholarships to the node Counseling?",
            "A": "The flow value from the node Scholarships to the node Counseling is {3583}."
        },
        {
            "Q": "What is the flow value from the node Graduate Studies to the node Low-Income?",
            "A": "The flow value from the node Graduate Studies to the node Low-Income is {3952}."
        },
        {
            "Q": "What is the flow value from the node Certification Programs to the node Transfer Students?",
            "A": "The flow value from the node Certification Programs to the node Transfer Students is {347}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Online Applications to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Online Applications to the next stage is {10290}."
        },
        {
            "Q": "What is the minimum flow value from the node Rural to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Rural to the next stage is {719}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Employment?",
            "A": "The total flow output from node Employment is {3920}."
        },
        {
            "Q": "What is the total flow input by node University?",
            "A": "The total flow input by node University is {11971}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Enrollment Channels of the sankey chart, which nodes have an outflow exceeded 8987? Please list the node labels and their corresponding outflow values.",
            "A": "{Online Applications} has an outflow of {10290}."
        },
        {
            "Q": "Between which pairs of nodes in column Support Services and column Institution Types is the flow between 1946 and 3289? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {2399} from node {Financial Aid} to {Public School}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 2008 and 2155? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {2015} from node {Entrepreneurship} to {Low-Income}, a flow of {2131} from node {Low-Income} to {Direct Admission}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Rural to node Entrance Exams and from node Direct Admission to node Financial Aid, which path has a larger flow?",
            "A": "The flow from node {Rural} to node {Entrance Exams} is larger."
        },
        {
            "Q": "Among the flows from node Graduate Studies to node Low-Income, from node Counseling to node Online Institution, and from node Employment to node Low-Income, which path has the largest flow?",
            "A": "The flow from node {Counseling} to node {Online Institution} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Post-Education Paths of the sankey chart is the most critical?",
            "A": "The most critical node in the column Post-Education Paths is {Entrepreneurship}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Employment to target node Community College? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Employment to node Community College is: {Employment, International, Online Applications, Financial Aid, Community College}."
        }
    ],
    "VA": []
}