{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in the column Mitigation Measures of this sankey chart?",
            "A": "There are {2} nodes in the column Mitigation Measures."
        },
        {
            "Q": "How many links flow into the node Agriculture in this sankey chart?",
            "A": "There are {2} links flowing into the node Agriculture."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {31} links."
        },
        {
            "Q": "How many links flow out of column Transportation Methods of this sankey chart?",
            "A": "There are {6} links flow out of column Transportation Methods."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Mitigation Measures}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Emission Sources}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Energy Efficiency} and {Agriculture}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Carbon Capture} and {Transportation}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Carbon Trading to the node Cement Production?",
            "A": "The flow value from the node Carbon Trading to the node Cement Production is {8562}."
        },
        {
            "Q": "What is the flow value from the node Pipeline to the node Carbon Trading?",
            "A": "The flow value from the node Pipeline to the node Carbon Trading is {49309}."
        },
        {
            "Q": "What is the flow value from the node Manufacturing to the node Road Freight?",
            "A": "The flow value from the node Manufacturing to the node Road Freight is {22116}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Waste Management to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Waste Management to the next stage is {47404}."
        },
        {
            "Q": "What is the minimum flow value from the node Road Freight to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Road Freight to the next stage is {11964}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Carbon Trading?",
            "A": "The total flow output from node Carbon Trading is {76149}."
        },
        {
            "Q": "What is the total flow input by node Waste Management?",
            "A": "The total flow input by node Waste Management is {72421}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Transportation Methods of the sankey chart, which nodes have an outflow exceeded 49401? Please list the node labels and their corresponding outflow values.",
            "A": "{Road Freight} has an outflow of {92285}, {Pipeline} has an outflow of {49493}, {Pipeline} has an outflow of {51686}."
        },
        {
            "Q": "Between which pairs of nodes in column Sector Distribution and column Transportation Methods is the flow between 23566 and 44988? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {43461} from node {Agriculture} to {Pipeline}, a flow of {25017} from node {Waste Management} to {Road Freight}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 25125 and 37395? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {26840} from node {Road Freight} to {Carbon Trading}, a flow of {25233} from node {Carbon Storage} to {Coal Combustion}, a flow of {31329} from node {Carbon Storage} to {Cement Production}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Waste Management to node Pipeline and from node Carbon Storage to node Cement Production, which path has a larger flow?",
            "A": "The flow from node {Waste Management} to node {Pipeline} is larger."
        },
        {
            "Q": "Between the flows from node Energy Efficiency to node Manufacturing and from node Waste Management to node Pipeline, which path has a larger flow?",
            "A": "The flow from node {Energy Efficiency} to node {Manufacturing} is larger."
        },
        {
            "Q": "Among the flows from node Energy Efficiency to node Transportation, from node Road Freight to node Carbon Storage, and from node Carbon Trading to node Coal Combustion, which path has the largest flow?",
            "A": "The flow from node {Energy Efficiency} to node {Transportation} is the largest."
        },
        {
            "Q": "Among the flows from node Manufacturing to node Pipeline, from node Carbon Capture to node Transportation, and from node Pipeline to node Carbon Storage, which path has the largest flow?",
            "A": "The flow from node {Pipeline} to node {Carbon Storage} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Mitigation Measures of the sankey chart is the most critical?",
            "A": "The most critical node in the column Mitigation Measures is {Energy Efficiency}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Energy Efficiency to target node Coal Combustion? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Energy Efficiency to node Coal Combustion is: {Energy Efficiency, Agriculture, Road Freight, Atmosphere, Coal Combustion}."
        }
    ],
    "VA": []
}