{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into the node Retail Purchase in this sankey chart?",
            "A": "There are {2} links flowing into the node Retail Purchase."
        },
        {
            "Q": "How many links flow out of column Distribution of this sankey chart?",
            "A": "There are {8} links flow out of column Distribution."
        },
        {
            "Q": "How many nodes are in the column Distribution of this sankey chart?",
            "A": "There are {4} nodes in the column Distribution."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Distribution}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Consumption}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Soil Preparation} and {Cleaning}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Wholesale} and {Trade Agreements}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Freezing to the node Food Preparation?",
            "A": "The flow value from the node Freezing to the node Food Preparation is {2763}."
        },
        {
            "Q": "What is the flow value from the node Storage to the node Trade Agreements?",
            "A": "The flow value from the node Storage to the node Trade Agreements is {425}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Soil Preparation to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Soil Preparation to the next stage is {9191}."
        },
        {
            "Q": "What is the minimum flow value from the node Pest Control to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Pest Control to the next stage is {702}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Export Certification?",
            "A": "The total flow output from node Export Certification is {8271}."
        },
        {
            "Q": "What is the total flow input by node Cleaning?",
            "A": "The total flow input by node Cleaning is {9893}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Farming of the sankey chart, which nodes have an outflow exceeded 2845? Please list the node labels and their corresponding outflow values.",
            "A": "{Pest Control} has an outflow of {4380}, {Soil Preparation} has an outflow of {9191}."
        },
        {
            "Q": "Between which pairs of nodes in column Processing and column Consumption is the flow between 1381 and 4946? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {3487} from node {Cleaning} to {Food Preparation}, a flow of {2928} from node {Freezing} to {Retail Purchase}, a flow of {2763} from node {Freezing} to {Food Preparation}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 2838 and 2920? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {2913} from node {Retail Delivery} to {Export Certification}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Transportation to node Export Certification and from node Retail Delivery to node Trade Agreements, which path has a larger flow?",
            "A": "The flow from node {Transportation} to node {Export Certification} is larger."
        },
        {
            "Q": "Among the flows from node Export Certification to node Soil Preparation, from node Transportation to node Export Certification, and from node Storage to node Trade Agreements, which path has the largest flow?",
            "A": "The flow from node {Transportation} to node {Export Certification} is the largest."
        },
        {
            "Q": "Among the flows from node Soil Preparation to node Freezing, from node Retail Delivery to node Export Certification, and from node Cleaning to node Retail Purchase, which path has the largest flow?",
            "A": "The flow from node {Cleaning} to node {Retail Purchase} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Import & Export of the sankey chart is the most critical?",
            "A": "The most critical node in the column Import & Export is {Export Certification}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Retail Delivery to target node Food Preparation? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Retail Delivery to node Food Preparation is: {Retail Delivery, Trade Agreements, Soil Preparation, Cleaning, Food Preparation}."
        }
    ],
    "VA": []
}