{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into the node Wholesalers in this sankey chart?",
            "A": "There are {4} links flowing into the node Wholesalers."
        },
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {16} nodes."
        },
        {
            "Q": "How many links flow out of the node Landfills in this sankey chart?",
            "A": "There are {3} links flowing out of the node Landfills."
        },
        {
            "Q": "How many links flow into column Processing Facilities of this sankey chart?",
            "A": "There are {20} links flow into column Processing Facilities."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Waste Management}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Processing Facilities}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Composting} and {Online Platforms}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Greenhouses} and {Slaughterhouses}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Recycling to the node Online Platforms?",
            "A": "The flow value from the node Recycling to the node Online Platforms is {2730}."
        },
        {
            "Q": "What is the flow value from the node Online Platforms to the node Orchards?",
            "A": "The flow value from the node Online Platforms to the node Orchards is {26937}."
        },
        {
            "Q": "What is the flow value from the node Composting to the node Farmers' Markets?",
            "A": "The flow value from the node Composting to the node Farmers' Markets is {14005}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Orchards to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Orchards to the next stage is {14269}."
        },
        {
            "Q": "What is the minimum flow value from the node Orchards to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Orchards to the next stage is {2922}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Ranches?",
            "A": "The total flow output from node Ranches is {27904}."
        },
        {
            "Q": "What is the total flow input by node Orchards?",
            "A": "The total flow input by node Orchards is {37515}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Waste Management of the sankey chart, which nodes have an outflow exceeded 34586? Please list the node labels and their corresponding outflow values.",
            "A": "{Composting} has an outflow of {37752}."
        },
        {
            "Q": "Between which pairs of nodes in column Distribution Channels and column Food Sources is the flow between 8639 and 9710? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {8699} from node {Wholesalers} to {Greenhouses}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 8639 and 9297? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {8699} from node {Wholesalers} to {Greenhouses}, a flow of {9148} from node {Greenhouses} to {Canneries}, a flow of {8779} from node {Farms} to {Slaughterhouses}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Orchards to node Dairies and from node Fisheries to node Beverage Plants, which path has a larger flow?",
            "A": "The flow from node {Orchards} to node {Dairies} is larger."
        },
        {
            "Q": "Among the flows from node Food Banks to node Farmers' Markets, from node Orchards to node Beverage Plants, and from node Farmers' Markets to node Orchards, which path has the largest flow?",
            "A": "The flow from node {Orchards} to node {Beverage Plants} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Processing Facilities of the sankey chart is the most critical?",
            "A": "The most critical node in the column Processing Facilities is {Canneries}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Landfills to target node Canneries? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Landfills to node Canneries is: {Landfills, Online Platforms, Farms, Canneries}."
        }
    ],
    "VA": []
}