{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {10} nodes."
        },
        {
            "Q": "How many links flow out of the node Sorting in this sankey chart?",
            "A": "There are {2} links flowing out of the node Sorting."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {25} links."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Distribution}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Consumption}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Canning} and {Food Waste}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Sorting} and {Food Preparation}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Wholesale to the node Canning?",
            "A": "The flow value from the node Wholesale to the node Canning is {11907}."
        },
        {
            "Q": "What is the flow value from the node Sorting to the node Food Waste?",
            "A": "The flow value from the node Sorting to the node Food Waste is {11089}."
        },
        {
            "Q": "What is the flow value from the node Storage to the node Packaging?",
            "A": "The flow value from the node Storage to the node Packaging is {4034}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Storage to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Storage to the next stage is {5686}."
        },
        {
            "Q": "What is the minimum flow value from the node Storage to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Storage to the next stage is {2424}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Grinding?",
            "A": "The total flow output from node Grinding is {13731}."
        },
        {
            "Q": "What is the total flow input by node Sorting?",
            "A": "The total flow input by node Sorting is {12206}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Processing of the sankey chart, which nodes have an outflow exceeded 9042? Please list the node labels and their corresponding outflow values.",
            "A": "{Canning} has an outflow of {12866}, {Sorting} has an outflow of {11089}."
        },
        {
            "Q": "Between which pairs of nodes in column Distribution and column Processing is the flow between 3930 and 4893? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {4222} from node {Wholesale} to {Grinding}, a flow of {4458} from node {Storage} to {Freezing}, a flow of {4034} from node {Storage} to {Packaging}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 4893 and 5673? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {5664} from node {Wholesale} to {Packaging}, a flow of {5328} from node {Retail Delivery} to {Sorting}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Packaging to node Food Preparation and from node Packaging to node Food Waste, which path has a larger flow?",
            "A": "The flow from node {Packaging} to node {Food Preparation} is larger."
        },
        {
            "Q": "Among the flows from node Storage to node Packaging, from node Storage to node Grinding, and from node Storage to node Freezing, which path has the largest flow?",
            "A": "The flow from node {Storage} to node {Freezing} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Distribution of the sankey chart is the most critical?",
            "A": "The most critical node in the column Distribution is {Wholesale}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Retail Delivery to target node Food Waste? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Retail Delivery to node Food Waste is: {Retail Delivery, Sorting, Food Waste}."
        }
    ],
    "VA": []
}