{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of column Outcomes of this sankey chart?",
            "A": "There are {16} links flow out of column Outcomes."
        },
        {
            "Q": "How many links flow into column Medical Specialties of this sankey chart?",
            "A": "There are {16} links flow into column Medical Specialties."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {48} links."
        },
        {
            "Q": "How many links flow out of the node Pregnant Women in this sankey chart?",
            "A": "There are {4} links flowing out of the node Pregnant Women."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Outcomes}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Medical Specialties}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Improved Condition} and {Clinics}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Seniors} and {Orthopedics}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Full Recovery to the node Clinics?",
            "A": "The flow value from the node Full Recovery to the node Clinics is {2545}."
        },
        {
            "Q": "What is the flow value from the node Rehabilitation Centers to the node Children?",
            "A": "The flow value from the node Rehabilitation Centers to the node Children is {3119}."
        },
        {
            "Q": "What is the flow value from the node Stable Condition to the node Rehabilitation Centers?",
            "A": "The flow value from the node Stable Condition to the node Rehabilitation Centers is {1128}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Deceased to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Deceased to the next stage is {3401}."
        },
        {
            "Q": "What is the minimum flow value from the node Clinics to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Clinics to the next stage is {471}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Deceased?",
            "A": "The total flow output from node Deceased is {8754}."
        },
        {
            "Q": "What is the total flow input by node Rehabilitation Centers?",
            "A": "The total flow input by node Rehabilitation Centers is {7885}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Healthcare Providers of the sankey chart, which nodes have an outflow exceeded 3708? Please list the node labels and their corresponding outflow values.",
            "A": "{Clinics} has an outflow of {3826}."
        },
        {
            "Q": "Between which pairs of nodes in column Healthcare Providers and column Patient Demographics is the flow between 2611 and 2968? Please list the source node, target node, and the corresponding flow value.",
            "A": "No nodes have an flow between 2611 and 2968."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 2293 and 2514? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {2483} from node {Improved Condition} to {Rehabilitation Centers}, a flow of {2306} from node {Stable Condition} to {Nursing Homes}, a flow of {2314} from node {Seniors} to {Dermatology}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Nursing Homes to node Children and from node Adults to node Dermatology, which path has a larger flow?",
            "A": "The flow from node {Nursing Homes} to node {Children} is larger."
        },
        {
            "Q": "Among the flows from node Improved Condition to node Nursing Homes, from node Rehabilitation Centers to node Children, and from node Improved Condition to node Rehabilitation Centers, which path has the largest flow?",
            "A": "The flow from node {Improved Condition} to node {Nursing Homes} is the largest."
        },
        {
            "Q": "Among the flows from node Children to node Pediatrics, from node Hospitals to node Pregnant Women, and from node Clinics to node Children, which path has the largest flow?",
            "A": "The flow from node {Children} to node {Pediatrics} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Medical Specialties of the sankey chart is the most critical?",
            "A": "The most critical node in the column Medical Specialties is {Pediatrics}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Deceased to target node Dermatology? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Deceased to node Dermatology is: {Deceased, Nursing Homes, Children, Dermatology}."
        }
    ],
    "VA": []
}