{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {16} nodes."
        },
        {
            "Q": "How many links flow into column Treatment Types of this sankey chart?",
            "A": "There are {12} links flow into column Treatment Types."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Outcomes}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Healthcare Providers}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Therapy} and {Seniors}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Chronic Patients} and {Pharmacies}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Worsened Condition to the node Surgery?",
            "A": "The flow value from the node Worsened Condition to the node Surgery is {316}."
        },
        {
            "Q": "What is the flow value from the node Improved Condition to the node Emergency Care?",
            "A": "The flow value from the node Improved Condition to the node Emergency Care is {4271}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Therapy to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Therapy to the next stage is {5319}."
        },
        {
            "Q": "What is the minimum flow value from the node Pregnant Women to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Pregnant Women to the next stage is {787}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Chronic Patients?",
            "A": "The total flow output from node Chronic Patients is {7941}."
        },
        {
            "Q": "What is the total flow input by node Emergency Care?",
            "A": "The total flow input by node Emergency Care is {10168}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Treatment Types of the sankey chart, which nodes have an outflow exceeded 5227? Please list the node labels and their corresponding outflow values.",
            "A": "{Therapy} has an outflow of {5319}."
        },
        {
            "Q": "Between which pairs of nodes in column Outcomes and column Treatment Types is the flow between 1317 and 2994? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {2881} from node {Full Recovery} to {Surgery}, a flow of {1433} from node {Stable Condition} to {Therapy}, a flow of {2755} from node {Stable Condition} to {Surgery}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 1831 and 1949? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {1868} from node {Pregnant Women} to {Hospitals}, a flow of {1938} from node {Chronic Patients} to {Nursing Homes}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Chronic Patients to node Clinics and from node Improved Condition to node Surgery, which path has a larger flow?",
            "A": "The flow from node {Improved Condition} to node {Surgery} is larger."
        },
        {
            "Q": "Among the flows from node Therapy to node Chronic Patients, from node Therapy to node Pregnant Women, and from node Emergency Care to node Children, which path has the largest flow?",
            "A": "The flow from node {Therapy} to node {Pregnant Women} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Healthcare Providers of the sankey chart is the most critical?",
            "A": "The most critical node in the column Healthcare Providers is {Hospitals}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Full Recovery to target node Nursing Homes? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Full Recovery to node Nursing Homes is: {Full Recovery, Therapy, Seniors, Nursing Homes}."
        }
    ],
    "VA": []
}