{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into the node Emergency Care in this sankey chart?",
            "A": "There are {5} links flowing into the node Emergency Care."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {77} links."
        },
        {
            "Q": "How many links flow out of column Outcomes of this sankey chart?",
            "A": "There are {25} links flow out of column Outcomes."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Outcomes}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Healthcare Providers}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Medication} and {Dermatology}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Full Recovery} and {Emergency Care}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Medication to the node Orthopedics?",
            "A": "The flow value from the node Medication to the node Orthopedics is {958}."
        },
        {
            "Q": "What is the flow value from the node Neurology to the node Pregnant Women?",
            "A": "The flow value from the node Neurology to the node Pregnant Women is {2118}."
        },
        {
            "Q": "What is the flow value from the node Deceased to the node Therapy?",
            "A": "The flow value from the node Deceased to the node Therapy is {1176}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Chronic Patients to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Chronic Patients to the next stage is {5825}."
        },
        {
            "Q": "What is the minimum flow value from the node Full Recovery to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Full Recovery to the next stage is {255}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Seniors?",
            "A": "The total flow output from node Seniors is {10888}."
        },
        {
            "Q": "What is the total flow input by node Pharmacies?",
            "A": "The total flow input by node Pharmacies is {13263}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Treatment Types of the sankey chart, which nodes have an outflow exceeded 4692? Please list the node labels and their corresponding outflow values.",
            "A": "{Therapy} has an outflow of {5485}, {Medication} has an outflow of {6798}."
        },
        {
            "Q": "Between which pairs of nodes in column Outcomes and column Treatment Types is the flow between 1032 and 1223? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1176} from node {Deceased} to {Therapy}, a flow of {1159} from node {Worsened Condition} to {Surgery}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 1679 and 2086? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {1768} from node {Medication} to {Cardiology}, a flow of {2075} from node {Orthopedics} to {Pregnant Women}, a flow of {1682} from node {Adults} to {Pharmacies}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Improved Condition to node Surgery and from node Seniors to node Clinics, which path has a larger flow?",
            "A": "The flow from node {Improved Condition} to node {Surgery} is larger."
        },
        {
            "Q": "Between the flows from node Stable Condition to node Surgery and from node Seniors to node Clinics, which path has a larger flow?",
            "A": "The flow from node {Seniors} to node {Clinics} is larger."
        },
        {
            "Q": "Among the flows from node Pregnant Women to node Clinics, from node Seniors to node Clinics, and from node Neurology to node Chronic Patients, which path has the largest flow?",
            "A": "The flow from node {Pregnant Women} to node {Clinics} is the largest."
        },
        {
            "Q": "Among the flows from node Full Recovery to node Preventive Care, from node Worsened Condition to node Preventive Care, and from node Deceased to node Surgery, which path has the largest flow?",
            "A": "The flow from node {Deceased} to node {Surgery} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Healthcare Providers of the sankey chart is the most critical?",
            "A": "The most critical node in the column Healthcare Providers is {Clinics}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Worsened Condition to target node Clinics? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Worsened Condition to node Clinics is: {Worsened Condition, Medication, Dermatology, Chronic Patients, Clinics}."
        }
    ],
    "VA": []
}