{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {18} nodes."
        },
        {
            "Q": "How many links flow into the node Clinics in this sankey chart?",
            "A": "There are {3} links flowing into the node Clinics."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Outcomes}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Healthcare Providers}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Neurology} and {Medication}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Worsened Condition} and {Oncology}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Oncology to the node Surgery?",
            "A": "The flow value from the node Oncology to the node Surgery is {814}."
        },
        {
            "Q": "What is the flow value from the node Stable Condition to the node Neurology?",
            "A": "The flow value from the node Stable Condition to the node Neurology is {1863}."
        },
        {
            "Q": "What is the flow value from the node Neurology to the node Medication?",
            "A": "The flow value from the node Neurology to the node Medication is {4277}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Adults to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Adults to the next stage is {2701}."
        },
        {
            "Q": "What is the minimum flow value from the node Orthopedics to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Orthopedics to the next stage is {319}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Deceased?",
            "A": "The total flow output from node Deceased is {3466}."
        },
        {
            "Q": "What is the total flow input by node Oncology?",
            "A": "The total flow input by node Oncology is {2153}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Medical Specialties of the sankey chart, which nodes have an outflow exceeded 1903? Please list the node labels and their corresponding outflow values.",
            "A": "{Neurology} has an outflow of {4277}, {Orthopedics} has an outflow of {2488}."
        },
        {
            "Q": "Between which pairs of nodes in column Medical Specialties and column Treatment Types is the flow between 546 and 774? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {618} from node {Orthopedics} to {Surgery}, a flow of {734} from node {Oncology} to {Medication}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 715 and 794? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {757} from node {Deceased} to {Orthopedics}, a flow of {734} from node {Oncology} to {Medication}, a flow of {774} from node {Surgery} to {Adults}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Surgery to node Pregnant Women and from node Adults to node Clinics, which path has a larger flow?",
            "A": "The flow from node {Adults} to node {Clinics} is larger."
        },
        {
            "Q": "Among the flows from node Chronic Patients to node Nursing Homes, from node Preventive Care to node Chronic Patients, and from node Surgery to node Chronic Patients, which path has the largest flow?",
            "A": "The flow from node {Surgery} to node {Chronic Patients} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Healthcare Providers of the sankey chart is the most critical?",
            "A": "The most critical node in the column Healthcare Providers is {Nursing Homes}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Worsened Condition to target node Nursing Homes? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Worsened Condition to node Nursing Homes is: {Worsened Condition, Neurology, Medication, Pregnant Women, Nursing Homes}."
        }
    ],
    "VA": []
}