{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into the node Neurology in this sankey chart?",
            "A": "There are {4} links flowing into the node Neurology."
        },
        {
            "Q": "How many nodes are in the column Healthcare Providers of this sankey chart?",
            "A": "There are {2} nodes in the column Healthcare Providers."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Healthcare Providers}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Medical Specialties}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Pharmacies} and {Seniors}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Nursing Homes} and {Chronic Patients}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Adults to the node Dermatology?",
            "A": "The flow value from the node Adults to the node Dermatology is {1566}."
        },
        {
            "Q": "What is the flow value from the node Pharmacies to the node Chronic Patients?",
            "A": "The flow value from the node Pharmacies to the node Chronic Patients is {1841}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Children to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Children to the next stage is {1519}."
        },
        {
            "Q": "What is the minimum flow value from the node Adults to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Adults to the next stage is {1566}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Adults?",
            "A": "The total flow output from node Adults is {3195}."
        },
        {
            "Q": "What is the total flow input by node Chronic Patients?",
            "A": "The total flow input by node Chronic Patients is {2127}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Patient Demographics of the sankey chart, which nodes have an outflow exceeded 1996? Please list the node labels and their corresponding outflow values.",
            "A": "{Seniors} has an outflow of {2105}."
        },
        {
            "Q": "Between which pairs of nodes in column Patient Demographics and column Medical Specialties is the flow between 1413 and 1542? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1519} from node {Children} to {Dermatology}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 1262 and 1413? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {1307} from node {Chronic Patients} to {Dermatology}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Nursing Homes to node Chronic Patients and from node Nursing Homes to node Children, which path has a larger flow?",
            "A": "The flow from node {Nursing Homes} to node {Children} is larger."
        },
        {
            "Q": "Between the flows from node Nursing Homes to node Chronic Patients and from node Children to node Neurology, which path has a larger flow?",
            "A": "The flow from node {Children} to node {Neurology} is larger."
        },
        {
            "Q": "Among the flows from node Chronic Patients to node Neurology, from node Nursing Homes to node Seniors, and from node Chronic Patients to node Dermatology, which path has the largest flow?",
            "A": "The flow from node {Chronic Patients} to node {Dermatology} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Medical Specialties of the sankey chart is the most critical?",
            "A": "The most critical node in the column Medical Specialties is {Dermatology}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Nursing Homes to target node Dermatology? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Nursing Homes to node Dermatology is: {Nursing Homes, Children, Dermatology}."
        }
    ],
    "VA": []
}