{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {24} links."
        },
        {
            "Q": "How many links flow out of column Distribution of this sankey chart?",
            "A": "There are {12} links flow out of column Distribution."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Distribution}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Processing}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Storage} and {Retail Purchase}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Food Preparation} and {Packaging}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Retail Purchase to the node Grinding?",
            "A": "The flow value from the node Retail Purchase to the node Grinding is {3161}."
        },
        {
            "Q": "What is the flow value from the node Transportation to the node Food Preparation?",
            "A": "The flow value from the node Transportation to the node Food Preparation is {7821}."
        },
        {
            "Q": "What is the flow value from the node Food Waste to the node Packaging?",
            "A": "The flow value from the node Food Waste to the node Packaging is {5785}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Retail Purchase to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Retail Purchase to the next stage is {11667}."
        },
        {
            "Q": "What is the minimum flow value from the node Retail Delivery to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Retail Delivery to the next stage is {2259}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Retail Purchase?",
            "A": "The total flow output from node Retail Purchase is {31427}."
        },
        {
            "Q": "What is the total flow input by node Sorting?",
            "A": "The total flow input by node Sorting is {20882}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Distribution of the sankey chart, which nodes have an outflow exceeded 7808? Please list the node labels and their corresponding outflow values.",
            "A": "{Transportation} has an outflow of {7821}, {Storage} has an outflow of {21903}."
        },
        {
            "Q": "Between which pairs of nodes in column Consumption and column Processing is the flow between 4828 and 6176? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {5055} from node {Food Preparation} to {Grinding}, a flow of {5366} from node {Food Preparation} to {Canning}, a flow of {5785} from node {Food Waste} to {Packaging}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 4603 and 4961? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {4867} from node {Wholesale} to {Retail Purchase}, a flow of {4604} from node {Storage} to {Food Preparation}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Transportation to node Food Waste and from node Storage to node Food Waste, which path has a larger flow?",
            "A": "The flow from node {Storage} to node {Food Waste} is larger."
        },
        {
            "Q": "Among the flows from node Transportation to node Food Waste, from node Retail Purchase to node Packaging, and from node Retail Delivery to node Food Waste, which path has the largest flow?",
            "A": "The flow from node {Retail Purchase} to node {Packaging} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Processing of the sankey chart is the most critical?",
            "A": "The most critical node in the column Processing is {Sorting}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Storage to target node Canning? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Storage to node Canning is: {Storage, Retail Purchase, Canning}."
        }
    ],
    "VA": []
}