{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into column Interview Stages of this sankey chart?",
            "A": "There are {12} links flow into column Interview Stages."
        },
        {
            "Q": "How many links flow into the node Contractor in this sankey chart?",
            "A": "There are {3} links flowing into the node Contractor."
        },
        {
            "Q": "How many links flow out of the node Excellent in this sankey chart?",
            "A": "There are {3} links flowing out of the node Excellent."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Onboarding Steps}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Employee Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Final Interview} and {Full-time}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Training Program} and {Below Average}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Orientation to the node Below Average?",
            "A": "The flow value from the node Orientation to the node Below Average is {391}."
        },
        {
            "Q": "What is the flow value from the node Average to the node Phone Screen?",
            "A": "The flow value from the node Average to the node Phone Screen is {793}."
        },
        {
            "Q": "What is the flow value from the node Good to the node Phone Screen?",
            "A": "The flow value from the node Good to the node Phone Screen is {635}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Average to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Average to the next stage is {837}."
        },
        {
            "Q": "What is the minimum flow value from the node Training Program to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Training Program to the next stage is {67}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Below Average?",
            "A": "The total flow output from node Below Average is {1316}."
        },
        {
            "Q": "What is the total flow input by node Below Average?",
            "A": "The total flow input by node Below Average is {1316}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Performance Ratings of the sankey chart, which nodes have an outflow exceeded 1077? Please list the node labels and their corresponding outflow values.",
            "A": "{Good} has an outflow of {1318}."
        },
        {
            "Q": "Between which pairs of nodes in column Performance Ratings and column Interview Stages is the flow between 534 and 682? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {635} from node {Good} to {Phone Screen}, a flow of {622} from node {Below Average} to {Phone Screen}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 415 and 484? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {417} from node {Training Program} to {Excellent}, a flow of {447} from node {Below Average} to {Final Interview}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Training Program to node Excellent and from node Average to node Phone Screen, which path has a larger flow?",
            "A": "The flow from node {Average} to node {Phone Screen} is larger."
        },
        {
            "Q": "Among the flows from node Phone Screen to node Full-time, from node Phone Screen to node Intern, and from node Final Interview to node Part-time, which path has the largest flow?",
            "A": "The flow from node {Phone Screen} to node {Full-time} is the largest."
        },
        {
            "Q": "Among the flows from node Average to node Technical Interview, from node Mentorship Assignment to node Average, and from node Phone Screen to node Contractor, which path has the largest flow?",
            "A": "The flow from node {Phone Screen} to node {Contractor} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Employee Types of the sankey chart is the most critical?",
            "A": "The most critical node in the column Employee Types is {Full-time}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Mentorship Assignment to target node Contractor? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Mentorship Assignment to node Contractor is: {Mentorship Assignment, Average, Phone Screen, Contractor}."
        }
    ],
    "VA": []
}