{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of column Employee Types of this sankey chart?",
            "A": "There are {12} links flow out of column Employee Types."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {37} links."
        },
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {14} nodes."
        },
        {
            "Q": "How many nodes are in the column Interview Stages of this sankey chart?",
            "A": "There are {4} nodes in the column Interview Stages."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Onboarding Steps}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Interview Stages}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Document Verification} and {Part-time}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Good} and {HR Interview}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Full-time to the node Excellent?",
            "A": "The flow value from the node Full-time to the node Excellent is {645}."
        },
        {
            "Q": "What is the flow value from the node Full-time to the node Good?",
            "A": "The flow value from the node Full-time to the node Good is {123}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Full-time to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Full-time to the next stage is {806}."
        },
        {
            "Q": "What is the minimum flow value from the node Excellent to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Excellent to the next stage is {109}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Good?",
            "A": "The total flow output from node Good is {459}."
        },
        {
            "Q": "What is the total flow input by node Intern?",
            "A": "The total flow input by node Intern is {1700}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Onboarding Steps of the sankey chart, which nodes have an outflow exceeded 1216? Please list the node labels and their corresponding outflow values.",
            "A": "{Mentorship Assignment} has an outflow of {1335}, {Document Verification} has an outflow of {1406}."
        },
        {
            "Q": "Between which pairs of nodes in column Performance Ratings and column Interview Stages is the flow between 182 and 393? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {207} from node {Good} to {Phone Screen}, a flow of {300} from node {Excellent} to {Final Interview}, a flow of {317} from node {Excellent} to {HR Interview}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 458 and 565? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {485} from node {Below Average} to {Final Interview}, a flow of {469} from node {Below Average} to {Technical Interview}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Average to node HR Interview and from node Excellent to node Final Interview, which path has a larger flow?",
            "A": "The flow from node {Average} to node {HR Interview} is larger."
        },
        {
            "Q": "Among the flows from node Excellent to node Final Interview, from node Part-time to node Good, and from node Full-time to node Excellent, which path has the largest flow?",
            "A": "The flow from node {Full-time} to node {Excellent} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Onboarding Steps of the sankey chart is the most critical?",
            "A": "The most critical node in the column Onboarding Steps is {Mentorship Assignment}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Orientation to target node Technical Interview? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Orientation to node Technical Interview is: {Orientation, Part-time, Below Average, Technical Interview}."
        }
    ],
    "VA": []
}