{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into column Property Types of this sankey chart?",
            "A": "There are {10} links flow into column Property Types."
        },
        {
            "Q": "How many nodes are in the column Location Types of this sankey chart?",
            "A": "There are {2} nodes in the column Location Types."
        },
        {
            "Q": "How many links flow out of column Location Types of this sankey chart?",
            "A": "There are {4} links flow out of column Location Types."
        },
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {13} nodes."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Financing Options}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Market Conditions}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Lease-to-Own} and {Investor}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Family} and {Single Family Home}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Mortgage to the node Investor?",
            "A": "The flow value from the node Mortgage to the node Investor is {383}."
        },
        {
            "Q": "What is the flow value from the node Lease-to-Own to the node Family?",
            "A": "The flow value from the node Lease-to-Own to the node Family is {384}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Urban to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Urban to the next stage is {596}."
        },
        {
            "Q": "What is the minimum flow value from the node Rural to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Rural to the next stage is {149}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Multi-family Unit?",
            "A": "The total flow output from node Multi-family Unit is {495}."
        },
        {
            "Q": "What is the total flow input by node Rural?",
            "A": "The total flow input by node Rural is {1266}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Financing Options of the sankey chart, which nodes have an outflow exceeded 383? Please list the node labels and their corresponding outflow values.",
            "A": "{Lease-to-Own} has an outflow of {384}, {Lease-to-Own} has an outflow of {1222}."
        },
        {
            "Q": "Between which pairs of nodes in column Property Types and column Location Types is the flow between 209 and 248? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {245} from node {Commercial Property} to {Urban}, a flow of {243} from node {Multi-family Unit} to {Rural}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 248 and 267? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {262} from node {Investor} to {Condo}, a flow of {252} from node {Multi-family Unit} to {Urban}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Lease-to-Own to node Investor and from node Townhouse to node Urban, which path has a larger flow?",
            "A": "The flow from node {Lease-to-Own} to node {Investor} is larger."
        },
        {
            "Q": "Between the flows from node Townhouse to node Urban and from node Family to node Multi-family Unit, which path has a larger flow?",
            "A": "The flow from node {Townhouse} to node {Urban} is larger."
        },
        {
            "Q": "Among the flows from node Investor to node Multi-family Unit, from node Single Family Home to node Rural, and from node Investor to node Townhouse, which path has the largest flow?",
            "A": "The flow from node {Investor} to node {Multi-family Unit} is the largest."
        },
        {
            "Q": "Among the flows from node Investor to node Single Family Home, from node Multi-family Unit to node Rural, and from node Investor to node Condo, which path has the largest flow?",
            "A": "The flow from node {Investor} to node {Condo} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Financing Options of the sankey chart is the most critical?",
            "A": "The most critical node in the column Financing Options is {Lease-to-Own}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Lease-to-Own to target node Seller's Market? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Lease-to-Own to node Seller's Market is: {Lease-to-Own, Investor, Commercial Property, Rural, Seller's Market}."
        }
    ],
    "VA": []
}