{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of column Market Conditions of this sankey chart?",
            "A": "There are {9} links flow out of column Market Conditions."
        },
        {
            "Q": "How many links flow into the node Neutral Market in this sankey chart?",
            "A": "There are {5} links flowing into the node Neutral Market."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Property Types}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Buyer Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Neutral Market} and {Family}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Townhouse} and {Neutral Market}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Neutral Market to the node Investor?",
            "A": "The flow value from the node Neutral Market to the node Investor is {56}."
        },
        {
            "Q": "What is the flow value from the node Multi-family Unit to the node Neutral Market?",
            "A": "The flow value from the node Multi-family Unit to the node Neutral Market is {226}."
        },
        {
            "Q": "What is the flow value from the node Commercial Property to the node Neutral Market?",
            "A": "The flow value from the node Commercial Property to the node Neutral Market is {374}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Buyer's Market to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Buyer's Market to the next stage is {455}."
        },
        {
            "Q": "What is the minimum flow value from the node Neutral Market to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Neutral Market to the next stage is {56}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Buyer's Market?",
            "A": "The total flow output from node Buyer's Market is {885}."
        },
        {
            "Q": "What is the total flow input by node Family?",
            "A": "The total flow input by node Family is {1265}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Property Types of the sankey chart, which nodes have an outflow exceeded 327? Please list the node labels and their corresponding outflow values.",
            "A": "{Commercial Property} has an outflow of {374}."
        },
        {
            "Q": "Between which pairs of nodes in column Market Conditions and column Buyer Types is the flow between 211 and 322? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {318} from node {Seller's Market} to {Family}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 106 and 151? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {120} from node {Condo} to {Buyer's Market}, a flow of {107} from node {Single Family Home} to {Buyer's Market}, a flow of {116} from node {Townhouse} to {Buyer's Market}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Multi-family Unit to node Buyer's Market and from node Condo to node Seller's Market, which path has a larger flow?",
            "A": "The flow from node {Multi-family Unit} to node {Buyer's Market} is larger."
        },
        {
            "Q": "Among the flows from node Single Family Home to node Neutral Market, from node Neutral Market to node Retiree, and from node Commercial Property to node Buyer's Market, which path has the largest flow?",
            "A": "The flow from node {Neutral Market} to node {Retiree} is the largest."
        },
        {
            "Q": "Among the flows from node Seller's Market to node Investor, from node Commercial Property to node Neutral Market, and from node Buyer's Market to node Retiree, which path has the largest flow?",
            "A": "The flow from node {Commercial Property} to node {Neutral Market} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Market Conditions of the sankey chart is the most critical?",
            "A": "The most critical node in the column Market Conditions is {Buyer's Market}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Multi-family Unit to target node Retiree? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Multi-family Unit to node Retiree is: {Multi-family Unit, Buyer's Market, Retiree}."
        }
    ],
    "VA": []
}