{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow out of column Location Types of this sankey chart?",
            "A": "There are {6} links flow out of column Location Types."
        },
        {
            "Q": "How many links flow out of the node Cash Purchase in this sankey chart?",
            "A": "There are {5} links flowing out of the node Cash Purchase."
        },
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {10} nodes."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Location Types}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Property Types}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Rural} and {Lease-to-Own}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Cash Purchase} and {Single Family Home}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Cash Purchase to the node Townhouse?",
            "A": "The flow value from the node Cash Purchase to the node Townhouse is {18}."
        },
        {
            "Q": "What is the flow value from the node Rural to the node Lease-to-Own?",
            "A": "The flow value from the node Rural to the node Lease-to-Own is {573}."
        },
        {
            "Q": "What is the flow value from the node Lease-to-Own to the node Commercial Property?",
            "A": "The flow value from the node Lease-to-Own to the node Commercial Property is {94}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Lease-to-Own to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Lease-to-Own to the next stage is {247}."
        },
        {
            "Q": "What is the minimum flow value from the node Mortgage to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Mortgage to the next stage is {101}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Rural?",
            "A": "The total flow output from node Rural is {1072}."
        },
        {
            "Q": "What is the total flow input by node Cash Purchase?",
            "A": "The total flow input by node Cash Purchase is {197}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Location Types of the sankey chart, which nodes have an outflow exceeded 273? Please list the node labels and their corresponding outflow values.",
            "A": "{Rural} has an outflow of {573}, {Rural} has an outflow of {365}."
        },
        {
            "Q": "Between which pairs of nodes in column Location Types and column Financing Options is the flow between 98 and 273? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {181} from node {Urban} to {Mortgage}, a flow of {134} from node {Rural} to {Cash Purchase}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 97 and 107? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {101} from node {Mortgage} to {Commercial Property}, a flow of {106} from node {Mortgage} to {Multi-family Unit}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Cash Purchase to node Single Family Home and from node Lease-to-Own to node Townhouse, which path has a larger flow?",
            "A": "The flow from node {Lease-to-Own} to node {Townhouse} is larger."
        },
        {
            "Q": "Among the flows from node Cash Purchase to node Condo, from node Cash Purchase to node Multi-family Unit, and from node Urban to node Cash Purchase, which path has the largest flow?",
            "A": "The flow from node {Urban} to node {Cash Purchase} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Property Types of the sankey chart is the most critical?",
            "A": "The most critical node in the column Property Types is {Multi-family Unit}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Rural to target node Single Family Home? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Rural to node Single Family Home is: {Rural, Lease-to-Own, Single Family Home}."
        }
    ],
    "VA": []
}