{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many nodes are in this sankey chart?",
            "A": "There are {7} nodes."
        },
        {
            "Q": "How many links flow out of column Marketing Campaigns of this sankey chart?",
            "A": "There are {10} links flow out of column Marketing Campaigns."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Marketing Campaigns}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Product Categories}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Referral Program} and {Beauty Products}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Email Newsletter} and {Beauty Products}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Email Newsletter to the node Beauty Products?",
            "A": "The flow value from the node Email Newsletter to the node Beauty Products is {1221}."
        },
        {
            "Q": "What is the flow value from the node Holiday Promo to the node Beauty Products?",
            "A": "The flow value from the node Holiday Promo to the node Beauty Products is {4639}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Holiday Promo to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Holiday Promo to the next stage is {7293}."
        },
        {
            "Q": "What is the minimum flow value from the node Flash Sale to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Flash Sale to the next stage is {1325}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Email Newsletter?",
            "A": "The total flow output from node Email Newsletter is {3791}."
        },
        {
            "Q": "What is the total flow input by node Beauty Products?",
            "A": "The total flow input by node Beauty Products is {22946}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Marketing Campaigns of the sankey chart, which nodes have an outflow exceeded 10361? Please list the node labels and their corresponding outflow values.",
            "A": "{Referral Program} has an outflow of {13429}."
        },
        {
            "Q": "Between which pairs of nodes in column Marketing Campaigns and column Product Categories is the flow between 2451 and 5825? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {2570} from node {Email Newsletter} to {Books}, a flow of {4639} from node {Holiday Promo} to {Beauty Products}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 2451 and 5825? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {2570} from node {Email Newsletter} to {Books}, a flow of {4639} from node {Holiday Promo} to {Beauty Products}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Referral Program to node Beauty Products and from node Referral Program to node Books, which path has a larger flow?",
            "A": "The flow from node {Referral Program} to node {Beauty Products} is larger."
        },
        {
            "Q": "Among the flows from node Flash Sale to node Books, from node Social Media Ad to node Beauty Products, and from node Flash Sale to node Beauty Products, which path has the largest flow?",
            "A": "The flow from node {Flash Sale} to node {Books} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Marketing Campaigns of the sankey chart is the most critical?",
            "A": "The most critical node in the column Marketing Campaigns is {Referral Program}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Referral Program to target node Beauty Products? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Referral Program to node Beauty Products is: {Referral Program, Beauty Products}."
        }
    ],
    "VA": []
}