{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sankey} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many links flow into the node Online Store in this sankey chart?",
            "A": "There are {3} links flowing into the node Online Store."
        },
        {
            "Q": "How many links are in this sankey chart?",
            "A": "There are {6} links."
        }
    ],
    "SRP": [
        {
            "Q": "Which category does the leftmost axis represent in this sankey chart?",
            "A": "The leftmost axis represents {Product Categories}."
        },
        {
            "Q": "Which category does the rightmost axis represent in this sankey chart?",
            "A": "The rightmost axis represents {Channels}."
        }
    ],
    "VPR": [
        {
            "Q": "Which pair of nodes shows the largest flow in this sankey chart?",
            "A": "The largest flow is between {Home Appliances} and {Online Store}."
        },
        {
            "Q": "Which pair of nodes shows the smallest flow in this sankey chart?",
            "A": "The smallest flow is between {Toys} and {Online Store}."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from the node Toys to the node Physical Store?",
            "A": "The flow value from the node Toys to the node Physical Store is {5848}."
        },
        {
            "Q": "What is the flow value from the node Home Appliances to the node Physical Store?",
            "A": "The flow value from the node Home Appliances to the node Physical Store is {27470}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value from the node Books to the next stage in the sankey chart?",
            "A": "The maximum flow value from the node Books to the next stage is {14755}."
        },
        {
            "Q": "What is the minimum flow value from the node Books to the next stage in the sankey chart?",
            "A": "The minimum flow value from the node Books to the next stage is {12555}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from node Books?",
            "A": "The total flow output from node Books is {27310}."
        },
        {
            "Q": "What is the total flow input by node Online Store?",
            "A": "The total flow input by node Online Store is {47563}."
        }
    ],
    "NF": [
        {
            "Q": "In the column Product Categories of the sankey chart, which nodes have an outflow exceeded 13655? Please list the node labels and their corresponding outflow values.",
            "A": "{Books} has an outflow of {14755}, {Home Appliances} has an outflow of {27470}, {Home Appliances} has an outflow of {30203}."
        },
        {
            "Q": "Between which pairs of nodes in column Product Categories and column Channels is the flow between 5326 and 21112? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {14755} from node {Books} to {Physical Store}, a flow of {12555} from node {Books} to {Online Store}, a flow of {5848} from node {Toys} to {Physical Store}."
        },
        {
            "Q": "In the sankey chart, which links have a flow between 9201 and 21112? Please list the source node, target node, and their corresponding flow values.",
            "A": "There is a flow of {14755} from node {Books} to {Physical Store}, a flow of {12555} from node {Books} to {Online Store}."
        }
    ],
    "NC": [
        {
            "Q": "Between the flows from node Books to node Online Store and from node Books to node Physical Store, which path has a larger flow?",
            "A": "The flow from node {Books} to node {Physical Store} is larger."
        },
        {
            "Q": "Between the flows from node Books to node Online Store and from node Toys to node Online Store, which path has a larger flow?",
            "A": "The flow from node {Books} to node {Online Store} is larger."
        },
        {
            "Q": "Among the flows from node Toys to node Online Store, from node Books to node Physical Store, and from node Toys to node Physical Store, which path has the largest flow?",
            "A": "The flow from node {Books} to node {Physical Store} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which node in the column Channels of the sankey chart is the most critical?",
            "A": "The most critical node in the column Channels is {Physical Store}."
        },
        {
            "Q": "What is the path with the highest total flow from source node Home Appliances to target node Physical Store? Please list all node labels along this path.",
            "A": "The path with the highest total flow from node Home Appliances to node Physical Store is: {Home Appliances, Physical Store}."
        }
    ],
    "VA": []
}