{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {11} bars."
        },
        {
            "Q": "How many stacked segments are in bar Feb of this stacked bar chart?",
            "A": "There are {2} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Mar}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Aug}."
        },
        {
            "Q": "What is the spatial relationship of bar Aug relative to the bar Nov in terms of horizontal (left/right) direction?",
            "A": "Bar Aug is to the {right} of the bar Nov."
        },
        {
            "Q": "In the stacked bar of Jul, What is the spatial relationship of segment PureSync relative to the segment MarketZen in terms of vertical (above/below) direction?",
            "A": "PureSync segment is positioned {above} the MarketZen segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Month has the highest bar in this stacked bar chart?",
            "A": "The Month with the highest bar is {Aug}."
        },
        {
            "Q": "Which Month has the lowest bar in this stacked bar chart?",
            "A": "The Month with the lowest bar is {Mar}."
        },
        {
            "Q": "In the stacked bar representing Jun, which segment has the highest value?",
            "A": "The segment with the highest value is {PureSync}."
        },
        {
            "Q": "In the stacked bar representing Sep, which segment has the lowest value?",
            "A": "The segment with the lowest value is {MarketZen}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the MarketZen segment within the Jun bar in the stacked bar chart?",
            "A": "The value of the MarketZen segment is {131.00} million USD."
        },
        {
            "Q": "What is the value of the PureSync segment within the May bar in the stacked bar chart?",
            "A": "The value of the PureSync segment is {389.00} million USD."
        },
        {
            "Q": "What is the value of the PureSync segment within the Sep bar in the stacked bar chart?",
            "A": "The value of the PureSync segment is {483.00} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum million USD among the stacked segments of bar Mar?",
            "A": "The maximum million USD among the stacked segments of bar Mar is {226} million USD."
        },
        {
            "Q": "What is the minimum million USD among the stacked segments of bar Apr?",
            "A": "The minimum million USD among the stacked segments of bar Apr is {350} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum million USD of the segment PureSync among the bars?",
            "A": "The maximum million USD among the bars of segment PureSync is {486} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum million USD of the segment MarketZen among the bars?",
            "A": "The minimum million USD among the bars of segment MarketZen is {65} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Nov?",
            "A": "The total value of bar Nov is {499.00} million USD."
        },
        {
            "Q": "What is the total value of the bar Aug?",
            "A": "The total value of bar Aug is {923.00} million USD."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {6696} million USD."
        },
        {
            "Q": "What is the difference between total value of bar Mar and Oct?",
            "A": "The difference between between total value of bar Mar and Oct is {466} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total million USD values exceed 880.00 million USD? Please list the bar and corresponding values.",
            "A": "{Aug} has {923} million USD"
        },
        {
            "Q": "Which bars have total million USD values below 294.50 million USD? Please list the bar and corresponding values.",
            "A": "{Mar} has {291} million USD"
        },
        {
            "Q": "For bar Nov in the stacked bar chart, which segment have million USD value between 84.5 and 499? Please list the segment and corresponding values.",
            "A": "{PureSync} has {169} million USD, {MarketZen} has {330} million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total million USD of Jun or Nov?",
            "A": "The total million USD of the {Nov} is larger."
        },
        {
            "Q": "Which is larger, the total million USD of Jan, Oct or Jul?",
            "A": "The total million USD of the {Oct} is larger."
        },
        {
            "Q": "In the bar Nov, which has a larger million USD value: MarketZen or PureSync?",
            "A": "{MarketZen} has the larger million USD value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment MarketZen in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment MarketZen are: {Apr}, {Aug}, {Oct}."
        }
    ],
    "VA": []
}