{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {10} bars."
        },
        {
            "Q": "How many stacked segments are in bar Westport of this stacked bar chart?",
            "A": "There are {3} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {horizontal} stacked bar chart."
        },
        {
            "Q": "Which category does the bottom bar represent?",
            "A": "The bottom bar represents {Ashford}"
        },
        {
            "Q": "Which category does the topmost bar represent?",
            "A": "The bottom bar represents {Zephyr}."
        },
        {
            "Q": "What is the spatial relationship of bar Springfield relative to the bar Quarryville in terms of vertical (below/above) direction??",
            "A": "Bar Springfield is {above} the bar Quarryville."
        },
        {
            "Q": "In the stacked bar of Westport, What is the spatial relationship of segment Nanotech relative to the segment Photonics in terms of horizontal (left/right) direction?",
            "A": "Nanotech segment is positioned {left} the Photonics segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which City has the highest bar in this stacked bar chart?",
            "A": "The City with the highest bar is {Ashford}."
        },
        {
            "Q": "Which City has the lowest bar in this stacked bar chart?",
            "A": "The City with the lowest bar is {Springfield}."
        },
        {
            "Q": "In the stacked bar representing Springfield, which segment has the highest value?",
            "A": "The segment with the highest value is {Quantum}."
        },
        {
            "Q": "In the stacked bar representing Westport, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Photonics}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Quantum segment within the Quarryville bar in the stacked bar chart?",
            "A": "The value of the Quantum segment is {12.45} billion USD."
        },
        {
            "Q": "What is the value of the Nanotech segment within the Elmhurst bar in the stacked bar chart?",
            "A": "The value of the Nanotech segment is {65.17} billion USD."
        },
        {
            "Q": "What is the value of the Photonics segment within the Zephyr bar in the stacked bar chart?",
            "A": "The value of the Photonics segment is {10.00} billion USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum billion USD among the stacked segments of bar Quarryville?",
            "A": "The maximum billion USD among the stacked segments of bar Quarryville is {72.47} billion USD."
        },
        {
            "Q": "What is the minimum billion USD among the stacked segments of bar Zephyr?",
            "A": "The minimum billion USD among the stacked segments of bar Zephyr is {10.0} billion USD."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum billion USD of the segment Quantum among the bars?",
            "A": "The maximum billion USD among the bars of segment Quantum is {95.0} billion USD."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum billion USD of the segment Quantum among the bars?",
            "A": "The minimum billion USD among the bars of segment Quantum is {10.0} billion USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Highvale?",
            "A": "The total value of bar Highvale is {109.26} billion USD."
        },
        {
            "Q": "What is the total value of the bar Brookfield?",
            "A": "The total value of bar Brookfield is {60.99} billion USD."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {900.52} billion USD."
        },
        {
            "Q": "What is the difference between total value of bar Brookfield and Elmhurst?",
            "A": "The difference between between total value of bar Brookfield and Elmhurst is {36.980000000000004} billion USD."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total billion USD values exceed 119.18 billion USD? Please list the bar and corresponding values.",
            "A": "{Westport} has {120.37} billion USD, {Ashford} has {131.37} billion USD"
        },
        {
            "Q": "Which bars have total billion USD values below 49.21 billion USD? Please list the bar and corresponding values.",
            "A": "{Springfield} has {37.43} billion USD"
        },
        {
            "Q": "For bar Highvale in the stacked bar chart, which segment have billion USD value between 5.79 and 48.84? Please list the segment and corresponding values.",
            "A": "{Photonics} has {11.58} billion USD, {Quantum} has {47.46} billion USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total billion USD of Highvale or Springfield?",
            "A": "The total billion USD of the {Highvale} is larger."
        },
        {
            "Q": "Which is larger, the total billion USD of Westport, Ashford or Zephyr?",
            "A": "The total billion USD of the {Ashford} is larger."
        },
        {
            "Q": "In the bar Highvale, which has a larger billion USD value: Quantum or Photonics?",
            "A": "{Quantum} has the larger billion USD value."
        },
        {
            "Q": "In the bar Elmhurst, which has a larger billion USD value: Nanotech, Quantum or Photonics?",
            "A": "{Nanotech} has the larger billion USD value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Nanotech in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Nanotech are: {Creston}, {Ashford}, {Elmhurst}."
        }
    ],
    "VA": []
}