{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {15} bars."
        },
        {
            "Q": "How many stacked segments are in bar Vimeo of this stacked bar chart?",
            "A": "There are {4} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Twitch}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Vevo}."
        },
        {
            "Q": "What is the spatial relationship of bar Hulu relative to the bar TikTok in terms of horizontal (left/right) direction?",
            "A": "Bar Hulu is to the {left} of the bar TikTok."
        },
        {
            "Q": "In the stacked bar of Hulu, What is the spatial relationship of segment Entertainment relative to the segment Gaming in terms of vertical (above/below) direction?",
            "A": "Entertainment segment is positioned {below} the Gaming segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Video Platform has the highest bar in this stacked bar chart?",
            "A": "The Video Platform with the highest bar is {Crunchyroll}."
        },
        {
            "Q": "Which Video Platform has the lowest bar in this stacked bar chart?",
            "A": "The Video Platform with the lowest bar is {AmazonPrime}."
        },
        {
            "Q": "In the stacked bar representing Hulu, which segment has the highest value?",
            "A": "The segment with the highest value is {Entertainment}."
        },
        {
            "Q": "In the stacked bar representing Facebook, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Gaming}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Gaming segment within the Twitch bar in the stacked bar chart?",
            "A": "The value of the Gaming segment is {87.00} million views."
        },
        {
            "Q": "What is the value of the Comedy segment within the YouTube bar in the stacked bar chart?",
            "A": "The value of the Comedy segment is {93.00} million views."
        },
        {
            "Q": "What is the value of the Entertainment segment within the Twitter bar in the stacked bar chart?",
            "A": "The value of the Entertainment segment is {56.00} million views."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum million views among the stacked segments of bar Instagram?",
            "A": "The maximum million views among the stacked segments of bar Instagram is {52} million views."
        },
        {
            "Q": "What is the minimum million views among the stacked segments of bar Twitter?",
            "A": "The minimum million views among the stacked segments of bar Twitter is {33} million views."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum million views of the segment Comedy among the bars?",
            "A": "The maximum million views among the bars of segment Comedy is {93} million views."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum million views of the segment Comedy among the bars?",
            "A": "The minimum million views among the bars of segment Comedy is {31} million views."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Facebook?",
            "A": "The total value of bar Facebook is {222.00} million views."
        },
        {
            "Q": "What is the total value of the bar Dailymotion?",
            "A": "The total value of bar Dailymotion is {240.00} million views."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {3391} million views."
        },
        {
            "Q": "What is the difference between total value of bar Bilibili and Youku?",
            "A": "The difference between between total value of bar Bilibili and Youku is {25} million views."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total million views values exceed 273.50 million views? Please list the bar and corresponding values.",
            "A": "{Hulu} has {274} million views, {Crunchyroll} has {303} million views"
        },
        {
            "Q": "Which bars have total million views values below 171.00 million views? Please list the bar and corresponding values.",
            "A": "{AmazonPrime} has {154} million views, {Vimeo} has {155} million views"
        },
        {
            "Q": "For bar YouTube in the stacked bar chart, which segment have million views value between 15.5 and 65.5? Please list the segment and corresponding values.",
            "A": "{Gaming} has {31} million views, {Entertainment} has {36} million views, {Music} has {38} million views."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total million views of YouTube or Twitch?",
            "A": "The total million views of the {Twitch} is larger."
        },
        {
            "Q": "Which is larger, the total million views of Netflix, Twitch or Dailymotion?",
            "A": "The total million views of the {Twitch} is larger."
        },
        {
            "Q": "In the bar Instagram, which has a larger million views value: Music or Entertainment?",
            "A": "{Entertainment} has the larger million views value."
        },
        {
            "Q": "In the bar Vevo, which has a larger million views value: Entertainment, Comedy or Gaming?",
            "A": "{Entertainment} has the larger million views value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Comedy in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Comedy are: {YouTube}, {Netflix}, {Hulu}."
        }
    ],
    "VA": []
}