{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {6} bars."
        },
        {
            "Q": "How many stacked segments are in bar Meadowbrook of this stacked bar chart?",
            "A": "There are {4} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Eastwood}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Meadowbrook}."
        },
        {
            "Q": "What is the spatial relationship of bar Glenwood relative to the bar Silverton in terms of horizontal (left/right) direction?",
            "A": "Bar Glenwood is to the {right} of the bar Silverton."
        },
        {
            "Q": "In the stacked bar of Meadowbrook, What is the spatial relationship of segment True Edge relative to the segment Hidden Truth in terms of vertical (above/below) direction?",
            "A": "True Edge segment is positioned {below} the Hidden Truth segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Towns has the highest bar in this stacked bar chart?",
            "A": "The Towns with the highest bar is {Hillcrest}."
        },
        {
            "Q": "Which Towns has the lowest bar in this stacked bar chart?",
            "A": "The Towns with the lowest bar is {Glenwood}."
        },
        {
            "Q": "In the stacked bar representing Meadowbrook, which segment has the highest value?",
            "A": "The segment with the highest value is {True Edge}."
        },
        {
            "Q": "In the stacked bar representing Glenwood, which segment has the lowest value?",
            "A": "The segment with the lowest value is {True Edge}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Plain Sight segment within the Eastwood bar in the stacked bar chart?",
            "A": "The value of the Plain Sight segment is {270.69} million USD."
        },
        {
            "Q": "What is the value of the Echoes segment within the Silverton bar in the stacked bar chart?",
            "A": "The value of the Echoes segment is {90.14} million USD."
        },
        {
            "Q": "What is the value of the Hidden Truth segment within the Oakvale bar in the stacked bar chart?",
            "A": "The value of the Hidden Truth segment is {65.00} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum million USD among the stacked segments of bar Glenwood?",
            "A": "The maximum million USD among the stacked segments of bar Glenwood is {103.27} million USD."
        },
        {
            "Q": "What is the minimum million USD among the stacked segments of bar Oakvale?",
            "A": "The minimum million USD among the stacked segments of bar Oakvale is {65.0} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum million USD of the segment Echoes among the bars?",
            "A": "The maximum million USD among the bars of segment Echoes is {90.14} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum million USD of the segment True Edge among the bars?",
            "A": "The minimum million USD among the bars of segment True Edge is {65.0} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Eastwood?",
            "A": "The total value of bar Eastwood is {518.06} million USD."
        },
        {
            "Q": "What is the total value of the bar Hillcrest?",
            "A": "The total value of bar Hillcrest is {549.25} million USD."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {2587.73} million USD."
        },
        {
            "Q": "What is the difference between total value of bar Hillcrest and Silverton?",
            "A": "The difference between between total value of bar Hillcrest and Silverton is {222.19} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total million USD values exceed 493.74 million USD? Please list the bar and corresponding values.",
            "A": "{Eastwood} has {518.06} million USD, {Hillcrest} has {549.25} million USD"
        },
        {
            "Q": "Which bars have total million USD values below 447.55 million USD? Please list the bar and corresponding values.",
            "A": "{Glenwood} has {298.27} million USD, {Silverton} has {327.06} million USD, {Oakvale} has {425.67} million USD"
        },
        {
            "Q": "For bar Silverton in the stacked bar chart, which segment have million USD value between 32.5 and 98.53? Please list the segment and corresponding values.",
            "A": "{True Edge} has {65.0} million USD, {Hidden Truth} has {65.0} million USD, {Echoes} has {90.14} million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total million USD of Glenwood or Oakvale?",
            "A": "The total million USD of the {Oakvale} is larger."
        },
        {
            "Q": "Which is larger, the total million USD of Meadowbrook, Oakvale or Eastwood?",
            "A": "The total million USD of the {Eastwood} is larger."
        },
        {
            "Q": "In the bar Glenwood, which has a larger million USD value: Hidden Truth or True Edge?",
            "A": "{Hidden Truth} has the larger million USD value."
        },
        {
            "Q": "In the bar Eastwood, which has a larger million USD value: Plain Sight, Hidden Truth or True Edge?",
            "A": "{Plain Sight} has the larger million USD value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Hidden Truth in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Hidden Truth are: {Eastwood}, {Glenwood}, {Oakvale}."
        }
    ],
    "VA": []
}