{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {6} bars."
        },
        {
            "Q": "How many stacked segments are in bar Sep of this stacked bar chart?",
            "A": "There are {4} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {May}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Sep}."
        },
        {
            "Q": "What is the spatial relationship of bar Sep relative to the bar May in terms of horizontal (left/right) direction?",
            "A": "Bar Sep is to the {right} of the bar May."
        },
        {
            "Q": "In the stacked bar of Oct, What is the spatial relationship of segment SmartHub relative to the segment DataPulse in terms of vertical (above/below) direction?",
            "A": "SmartHub segment is positioned {below} the DataPulse segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Month has the highest bar in this stacked bar chart?",
            "A": "The Month with the highest bar is {Sep}."
        },
        {
            "Q": "Which Month has the lowest bar in this stacked bar chart?",
            "A": "The Month with the lowest bar is {Aug}."
        },
        {
            "Q": "In the stacked bar representing Aug, which segment has the highest value?",
            "A": "The segment with the highest value is {DataPulse}."
        },
        {
            "Q": "In the stacked bar representing Dec, which segment has the lowest value?",
            "A": "The segment with the lowest value is {PureSync}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the DataPulse segment within the Jan bar in the stacked bar chart?",
            "A": "The value of the DataPulse segment is {125.00} million USD."
        },
        {
            "Q": "What is the value of the BrightEdge segment within the Sep bar in the stacked bar chart?",
            "A": "The value of the BrightEdge segment is {289.00} million USD."
        },
        {
            "Q": "What is the value of the SmartHub segment within the Dec bar in the stacked bar chart?",
            "A": "The value of the SmartHub segment is {144.00} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum million USD among the stacked segments of bar Jan?",
            "A": "The maximum million USD among the stacked segments of bar Jan is {208} million USD."
        },
        {
            "Q": "What is the minimum million USD among the stacked segments of bar Oct?",
            "A": "The minimum million USD among the stacked segments of bar Oct is {127} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum million USD of the segment SmartHub among the bars?",
            "A": "The maximum million USD among the bars of segment SmartHub is {324} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum million USD of the segment DataPulse among the bars?",
            "A": "The minimum million USD among the bars of segment DataPulse is {109} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Jan?",
            "A": "The total value of bar Jan is {633.00} million USD."
        },
        {
            "Q": "What is the total value of the bar Aug?",
            "A": "The total value of bar Aug is {534.00} million USD."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {4505} million USD."
        },
        {
            "Q": "What is the difference between total value of bar Sep and Dec?",
            "A": "The difference between between total value of bar Sep and Dec is {498} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total million USD values exceed 1055.00 million USD? Please list the bar and corresponding values.",
            "A": "{Sep} has {1114} million USD"
        },
        {
            "Q": "Which bars have total million USD values below 614.00 million USD? Please list the bar and corresponding values.",
            "A": "{Aug} has {534} million USD, {Oct} has {612} million USD"
        },
        {
            "Q": "For bar Jan in the stacked bar chart, which segment have million USD value between 131.0 and 150.0? Please list the segment and corresponding values.",
            "A": "{BrightEdge} has {137} million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total million USD of May or Jan?",
            "A": "The total million USD of the {May} is larger."
        },
        {
            "Q": "Which is larger, the total million USD of Jan, Sep or Aug?",
            "A": "The total million USD of the {Sep} is larger."
        },
        {
            "Q": "In the bar May, which has a larger million USD value: BrightEdge or PureSync?",
            "A": "{BrightEdge} has the larger million USD value."
        },
        {
            "Q": "In the bar May, which has a larger million USD value: PureSync, SmartHub or DataPulse?",
            "A": "{SmartHub} has the larger million USD value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment PureSync in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment PureSync are: {Sep}, {May}, {Jan}."
        }
    ],
    "VA": []
}