{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {7} bars."
        },
        {
            "Q": "How many stacked segments are in bar Dec of this stacked bar chart?",
            "A": "There are {3} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Jul}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Aug}."
        },
        {
            "Q": "What is the spatial relationship of bar Jul relative to the bar Sep in terms of horizontal (left/right) direction?",
            "A": "Bar Jul is to the {left} of the bar Sep."
        },
        {
            "Q": "In the stacked bar of Jan, What is the spatial relationship of segment Moon Cavern relative to the segment Hidden Valley in terms of vertical (above/below) direction?",
            "A": "Moon Cavern segment is positioned {below} the Hidden Valley segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Month has the highest bar in this stacked bar chart?",
            "A": "The Month with the highest bar is {Jul}."
        },
        {
            "Q": "Which Month has the lowest bar in this stacked bar chart?",
            "A": "The Month with the lowest bar is {Oct}."
        },
        {
            "Q": "In the stacked bar representing Jul, which segment has the highest value?",
            "A": "The segment with the highest value is {Silver Grove}."
        },
        {
            "Q": "In the stacked bar representing Aug, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Moon Cavern}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Hidden Valley segment within the Jul bar in the stacked bar chart?",
            "A": "The value of the Hidden Valley segment is {43787.00} thousand visitors."
        },
        {
            "Q": "What is the value of the Silver Grove segment within the Dec bar in the stacked bar chart?",
            "A": "The value of the Silver Grove segment is {41581.00} thousand visitors."
        },
        {
            "Q": "What is the value of the Hidden Valley segment within the Aug bar in the stacked bar chart?",
            "A": "The value of the Hidden Valley segment is {39330.00} thousand visitors."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum thousand visitors among the stacked segments of bar Sep?",
            "A": "The maximum thousand visitors among the stacked segments of bar Sep is {45000} thousand visitors."
        },
        {
            "Q": "What is the minimum thousand visitors among the stacked segments of bar Dec?",
            "A": "The minimum thousand visitors among the stacked segments of bar Dec is {26019} thousand visitors."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum thousand visitors of the segment Hidden Valley among the bars?",
            "A": "The maximum thousand visitors among the bars of segment Hidden Valley is {45000} thousand visitors."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum thousand visitors of the segment Hidden Valley among the bars?",
            "A": "The minimum thousand visitors among the bars of segment Hidden Valley is {18154} thousand visitors."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Jan?",
            "A": "The total value of bar Jan is {97880.00} thousand visitors."
        },
        {
            "Q": "What is the total value of the bar Oct?",
            "A": "The total value of bar Oct is {64358.00} thousand visitors."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {632132} thousand visitors."
        },
        {
            "Q": "What is the difference between total value of bar Dec and Nov?",
            "A": "The difference between between total value of bar Dec and Nov is {20544} thousand visitors."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total thousand visitors values exceed 108057.00 thousand visitors? Please list the bar and corresponding values.",
            "A": "{Jul} has {115658} thousand visitors"
        },
        {
            "Q": "Which bars have total thousand visitors values below 88297.50 thousand visitors? Please list the bar and corresponding values.",
            "A": "{Oct} has {64358} thousand visitors, {Aug} has {75806} thousand visitors, {Nov} has {78715} thousand visitors"
        },
        {
            "Q": "For bar Nov in the stacked bar chart, which segment have thousand visitors value between 9077.0 and 53675? Please list the segment and corresponding values.",
            "A": "{Hidden Valley} has {18154} thousand visitors, {Moon Cavern} has {25040} thousand visitors, {Silver Grove} has {35521} thousand visitors."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total thousand visitors of Dec or Jul?",
            "A": "The total thousand visitors of the {Jul} is larger."
        },
        {
            "Q": "Which is larger, the total thousand visitors of Jul, Aug or Oct?",
            "A": "The total thousand visitors of the {Jul} is larger."
        },
        {
            "Q": "In the bar Jul, which has a larger thousand visitors value: Silver Grove or Moon Cavern?",
            "A": "{Silver Grove} has the larger thousand visitors value."
        },
        {
            "Q": "In the bar Oct, which has a larger thousand visitors value: Moon Cavern, Hidden Valley or Silver Grove?",
            "A": "{Hidden Valley} has the larger thousand visitors value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Silver Grove in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Silver Grove are: {Jul}, {Dec}, {Nov}."
        }
    ],
    "VA": []
}