{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {3} bars."
        },
        {
            "Q": "How many stacked segments are in bar Sep of this stacked bar chart?",
            "A": "There are {5} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Sep}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Aug}."
        },
        {
            "Q": "What is the spatial relationship of bar Aug relative to the bar Jan in terms of horizontal (left/right) direction?",
            "A": "Bar Aug is to the {right} of the bar Jan."
        },
        {
            "Q": "In the stacked bar of Jan, What is the spatial relationship of segment Machinery relative to the segment Apparel in terms of vertical (above/below) direction?",
            "A": "Machinery segment is positioned {below} the Apparel segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Month has the highest bar in this stacked bar chart?",
            "A": "The Month with the highest bar is {Jan}."
        },
        {
            "Q": "Which Month has the lowest bar in this stacked bar chart?",
            "A": "The Month with the lowest bar is {Sep}."
        },
        {
            "Q": "In the stacked bar representing Sep, which segment has the highest value?",
            "A": "The segment with the highest value is {Automotive Parts}."
        },
        {
            "Q": "In the stacked bar representing Aug, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Apparel}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Apparel segment within the Sep bar in the stacked bar chart?",
            "A": "The value of the Apparel segment is {420.00} tonnes."
        },
        {
            "Q": "What is the value of the Apparel segment within the Jan bar in the stacked bar chart?",
            "A": "The value of the Apparel segment is {214.00} tonnes."
        },
        {
            "Q": "What is the value of the Machinery segment within the Aug bar in the stacked bar chart?",
            "A": "The value of the Machinery segment is {755.00} tonnes."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum tonnes among the stacked segments of bar Aug?",
            "A": "The maximum tonnes among the stacked segments of bar Aug is {761} tonnes."
        },
        {
            "Q": "What is the minimum tonnes among the stacked segments of bar Aug?",
            "A": "The minimum tonnes among the stacked segments of bar Aug is {408} tonnes."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum tonnes of the segment Steel among the bars?",
            "A": "The maximum tonnes among the bars of segment Steel is {761} tonnes."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum tonnes of the segment Apparel among the bars?",
            "A": "The minimum tonnes among the bars of segment Apparel is {214} tonnes."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Jan?",
            "A": "The total value of bar Jan is {3106.00} tonnes."
        },
        {
            "Q": "What is the total value of the bar Aug?",
            "A": "The total value of bar Aug is {3065.00} tonnes."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {9151} tonnes."
        },
        {
            "Q": "What is the difference between total value of bar Jan and Sep?",
            "A": "The difference between between total value of bar Jan and Sep is {126} tonnes."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total tonnes values exceed 3085.50 tonnes? Please list the bar and corresponding values.",
            "A": "{Jan} has {3106} tonnes"
        },
        {
            "Q": "Which bars have total tonnes values below 3022.50 tonnes? Please list the bar and corresponding values.",
            "A": "{Sep} has {2980} tonnes"
        },
        {
            "Q": "For bar Aug in the stacked bar chart, which segment have tonnes value between 570.5 and 680.0? Please list the segment and corresponding values.",
            "A": "{Automotive Parts} has {605} tonnes."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total tonnes of Aug or Jan?",
            "A": "The total tonnes of the {Jan} is larger."
        },
        {
            "Q": "Which is larger, the total tonnes of Sep, Jan or Aug?",
            "A": "The total tonnes of the {Jan} is larger."
        },
        {
            "Q": "In the bar Aug, which has a larger tonnes value: Apparel or Steel?",
            "A": "{Steel} has the larger tonnes value."
        },
        {
            "Q": "In the bar Aug, which has a larger tonnes value: Machinery, Apparel or Automotive Parts?",
            "A": "{Machinery} has the larger tonnes value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Steel in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Steel are: {Aug}, {Sep}, {Jan}."
        }
    ],
    "VA": []
}