{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {10} bars."
        },
        {
            "Q": "How many stacked segments are in bar Jan of this stacked bar chart?",
            "A": "There are {7} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Mar}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Oct}."
        },
        {
            "Q": "What is the spatial relationship of bar Jan relative to the bar Dec in terms of horizontal (left/right) direction?",
            "A": "Bar Jan is to the {right} of the bar Dec."
        },
        {
            "Q": "In the stacked bar of Oct, What is the spatial relationship of segment Electronics relative to the segment Steel in terms of vertical (above/below) direction?",
            "A": "Electronics segment is positioned {above} the Steel segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Month has the highest bar in this stacked bar chart?",
            "A": "The Month with the highest bar is {Mar}."
        },
        {
            "Q": "Which Month has the lowest bar in this stacked bar chart?",
            "A": "The Month with the lowest bar is {May}."
        },
        {
            "Q": "In the stacked bar representing Apr, which segment has the highest value?",
            "A": "The segment with the highest value is {Automotive Parts}."
        },
        {
            "Q": "In the stacked bar representing Dec, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Steel}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Oil segment within the Mar bar in the stacked bar chart?",
            "A": "The value of the Oil segment is {580.00} tonnes."
        },
        {
            "Q": "What is the value of the Steel segment within the Dec bar in the stacked bar chart?",
            "A": "The value of the Steel segment is {150.00} tonnes."
        },
        {
            "Q": "What is the value of the Grain segment within the Apr bar in the stacked bar chart?",
            "A": "The value of the Grain segment is {150.00} tonnes."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum tonnes among the stacked segments of bar Mar?",
            "A": "The maximum tonnes among the stacked segments of bar Mar is {1000} tonnes."
        },
        {
            "Q": "What is the minimum tonnes among the stacked segments of bar Apr?",
            "A": "The minimum tonnes among the stacked segments of bar Apr is {150} tonnes."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum tonnes of the segment Paper among the bars?",
            "A": "The maximum tonnes among the bars of segment Paper is {619} tonnes."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum tonnes of the segment Automotive Parts among the bars?",
            "A": "The minimum tonnes among the bars of segment Automotive Parts is {150} tonnes."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar May?",
            "A": "The total value of bar May is {1304.00} tonnes."
        },
        {
            "Q": "What is the total value of the bar Jan?",
            "A": "The total value of bar Jan is {2270.00} tonnes."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {21451} tonnes."
        },
        {
            "Q": "What is the difference between total value of bar Mar and Jan?",
            "A": "The difference between between total value of bar Mar and Jan is {897} tonnes."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total tonnes values exceed 2987.00 tonnes? Please list the bar and corresponding values.",
            "A": "{Mar} has {3167} tonnes"
        },
        {
            "Q": "Which bars have total tonnes values below 1896.00 tonnes? Please list the bar and corresponding values.",
            "A": "{May} has {1304} tonnes, {Aug} has {1640} tonnes, {Nov} has {1873} tonnes"
        },
        {
            "Q": "For bar Apr in the stacked bar chart, which segment have tonnes value between 906.0 and 1150? Please list the segment and corresponding values.",
            "A": "{Automotive Parts} has {1000} tonnes."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total tonnes of Feb or Jan?",
            "A": "The total tonnes of the {Jan} is larger."
        },
        {
            "Q": "Which is larger, the total tonnes of Aug, Jun or Nov?",
            "A": "The total tonnes of the {Jun} is larger."
        },
        {
            "Q": "In the bar Jun, which has a larger tonnes value: Electronics or Textiles?",
            "A": "{Electronics} has the larger tonnes value."
        },
        {
            "Q": "In the bar Dec, which has a larger tonnes value: Oil, Paper or Electronics?",
            "A": "{Oil} has the larger tonnes value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Paper in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Paper are: {Jun}, {Aug}, {Feb}."
        }
    ],
    "VA": []
}