{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {3} bars."
        },
        {
            "Q": "How many stacked segments are in bar Nov of this stacked bar chart?",
            "A": "There are {7} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {May}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Nov}."
        },
        {
            "Q": "What is the spatial relationship of bar Feb relative to the bar May in terms of horizontal (left/right) direction?",
            "A": "Bar Feb is to the {right} of the bar May."
        },
        {
            "Q": "In the stacked bar of Feb, What is the spatial relationship of segment UrbanFlow relative to the segment QuantumX in terms of vertical (above/below) direction?",
            "A": "UrbanFlow segment is positioned {below} the QuantumX segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Month has the highest bar in this stacked bar chart?",
            "A": "The Month with the highest bar is {Nov}."
        },
        {
            "Q": "Which Month has the lowest bar in this stacked bar chart?",
            "A": "The Month with the lowest bar is {May}."
        },
        {
            "Q": "In the stacked bar representing Nov, which segment has the highest value?",
            "A": "The segment with the highest value is {QuantumX}."
        },
        {
            "Q": "In the stacked bar representing May, which segment has the lowest value?",
            "A": "The segment with the lowest value is {PeakPoint}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the PeakPoint segment within the Feb bar in the stacked bar chart?",
            "A": "The value of the PeakPoint segment is {102.00} million USD."
        },
        {
            "Q": "What is the value of the PeakPoint segment within the Nov bar in the stacked bar chart?",
            "A": "The value of the PeakPoint segment is {118.00} million USD."
        },
        {
            "Q": "What is the value of the BrightEdge segment within the May bar in the stacked bar chart?",
            "A": "The value of the BrightEdge segment is {184.00} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum million USD among the stacked segments of bar May?",
            "A": "The maximum million USD among the stacked segments of bar May is {217} million USD."
        },
        {
            "Q": "What is the minimum million USD among the stacked segments of bar Feb?",
            "A": "The minimum million USD among the stacked segments of bar Feb is {102} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum million USD of the segment TechNova among the bars?",
            "A": "The maximum million USD among the bars of segment TechNova is {204} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum million USD of the segment QuantumX among the bars?",
            "A": "The minimum million USD among the bars of segment QuantumX is {124} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Feb?",
            "A": "The total value of bar Feb is {1200.00} million USD."
        },
        {
            "Q": "What is the total value of the bar May?",
            "A": "The total value of bar May is {1077.00} million USD."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {4016} million USD."
        },
        {
            "Q": "What is the difference between total value of bar Nov and May?",
            "A": "The difference between between total value of bar Nov and May is {662} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total million USD values exceed 1138.50 million USD? Please list the bar and corresponding values.",
            "A": "{Feb} has {1200} million USD, {Nov} has {1739} million USD"
        },
        {
            "Q": "Which bars have total million USD values below 1469.50 million USD? Please list the bar and corresponding values.",
            "A": "{May} has {1077} million USD, {Feb} has {1200} million USD"
        },
        {
            "Q": "For bar Nov in the stacked bar chart, which segment have million USD value between 112.0 and 183.0? Please list the segment and corresponding values.",
            "A": "{PeakPoint} has {118} million USD, {UrbanFlow} has {149} million USD, {TechNova} has {182} million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total million USD of Feb or May?",
            "A": "The total million USD of the {Feb} is larger."
        },
        {
            "Q": "Which is larger, the total million USD of May, Nov or Feb?",
            "A": "The total million USD of the {Nov} is larger."
        },
        {
            "Q": "In the bar Nov, which has a larger million USD value: UrbanFlow or BrightEdge?",
            "A": "{BrightEdge} has the larger million USD value."
        },
        {
            "Q": "In the bar Nov, which has a larger million USD value: TechNova, PeakPoint or QuantumX?",
            "A": "{QuantumX} has the larger million USD value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment BrightWave in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment BrightWave are: {Feb}, {May}, {Nov}."
        }
    ],
    "VA": []
}