{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {8} bars."
        },
        {
            "Q": "How many stacked segments are in bar Jun of this stacked bar chart?",
            "A": "There are {5} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Apr}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Sep}."
        },
        {
            "Q": "What is the spatial relationship of bar Jun relative to the bar Oct in terms of horizontal (left/right) direction?",
            "A": "Bar Jun is to the {left} of the bar Oct."
        },
        {
            "Q": "In the stacked bar of Mar, What is the spatial relationship of segment PureSync relative to the segment NovaEdge in terms of vertical (above/below) direction?",
            "A": "PureSync segment is positioned {above} the NovaEdge segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Month has the highest bar in this stacked bar chart?",
            "A": "The Month with the highest bar is {Oct}."
        },
        {
            "Q": "Which Month has the lowest bar in this stacked bar chart?",
            "A": "The Month with the lowest bar is {Apr}."
        },
        {
            "Q": "In the stacked bar representing Feb, which segment has the highest value?",
            "A": "The segment with the highest value is {SwiftLink}."
        },
        {
            "Q": "In the stacked bar representing Apr, which segment has the lowest value?",
            "A": "The segment with the lowest value is {QuantumX}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the QuantumX segment within the Jun bar in the stacked bar chart?",
            "A": "The value of the QuantumX segment is {109.00} million USD."
        },
        {
            "Q": "What is the value of the QuantumX segment within the Sep bar in the stacked bar chart?",
            "A": "The value of the QuantumX segment is {218.00} million USD."
        },
        {
            "Q": "What is the value of the QuantumX segment within the May bar in the stacked bar chart?",
            "A": "The value of the QuantumX segment is {226.00} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum million USD among the stacked segments of bar Apr?",
            "A": "The maximum million USD among the stacked segments of bar Apr is {145} million USD."
        },
        {
            "Q": "What is the minimum million USD among the stacked segments of bar Sep?",
            "A": "The minimum million USD among the stacked segments of bar Sep is {110} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum million USD of the segment SwiftLink among the bars?",
            "A": "The maximum million USD among the bars of segment SwiftLink is {500} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum million USD of the segment SwiftLink among the bars?",
            "A": "The minimum million USD among the bars of segment SwiftLink is {125} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Sep?",
            "A": "The total value of bar Sep is {835.00} million USD."
        },
        {
            "Q": "What is the total value of the bar Feb?",
            "A": "The total value of bar Feb is {1026.00} million USD."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {7195} million USD."
        },
        {
            "Q": "What is the difference between total value of bar Mar and Sep?",
            "A": "The difference between between total value of bar Mar and Sep is {229} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total million USD values exceed 1087.00 million USD? Please list the bar and corresponding values.",
            "A": "{Oct} has {1110} million USD"
        },
        {
            "Q": "Which bars have total million USD values below 823.50 million USD? Please list the bar and corresponding values.",
            "A": "{Apr} has {630} million USD, {Jan} has {752} million USD, {Jun} has {812} million USD"
        },
        {
            "Q": "For bar Oct in the stacked bar chart, which segment have million USD value between 137.5 and 254.0? Please list the segment and corresponding values.",
            "A": "{PureSync} has {143} million USD, {BrightEdge} has {219} million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total million USD of Jan or Apr?",
            "A": "The total million USD of the {Jan} is larger."
        },
        {
            "Q": "Which is larger, the total million USD of Mar, Jan or Sep?",
            "A": "The total million USD of the {Mar} is larger."
        },
        {
            "Q": "In the bar Feb, which has a larger million USD value: BrightEdge or SwiftLink?",
            "A": "{SwiftLink} has the larger million USD value."
        },
        {
            "Q": "In the bar Sep, which has a larger million USD value: QuantumX, BrightEdge or NovaEdge?",
            "A": "{QuantumX} has the larger million USD value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment PureSync in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment PureSync are: {May}, {Jun}, {Feb}."
        }
    ],
    "VA": []
}