{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {5} bars."
        },
        {
            "Q": "How many stacked segments are in bar Quarryville of this stacked bar chart?",
            "A": "There are {6} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {horizontal} stacked bar chart."
        },
        {
            "Q": "Which category does the bottom bar represent?",
            "A": "The bottom bar represents {Dunvale}"
        },
        {
            "Q": "Which category does the topmost bar represent?",
            "A": "The bottom bar represents {Creston}."
        },
        {
            "Q": "What is the spatial relationship of bar Creston relative to the bar Dunvale in terms of vertical (below/above) direction??",
            "A": "Bar Creston is {above} the bar Dunvale."
        },
        {
            "Q": "In the stacked bar of Dunvale, What is the spatial relationship of segment Photography relative to the segment Painting in terms of horizontal (left/right) direction?",
            "A": "Photography segment is positioned {right} the Painting segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which City has the highest bar in this stacked bar chart?",
            "A": "The City with the highest bar is {Quarryville}."
        },
        {
            "Q": "Which City has the lowest bar in this stacked bar chart?",
            "A": "The City with the lowest bar is {Elmhurst}."
        },
        {
            "Q": "In the stacked bar representing Dunvale, which segment has the highest value?",
            "A": "The segment with the highest value is {Sculpture}."
        },
        {
            "Q": "In the stacked bar representing Quarryville, which segment has the lowest value?",
            "A": "The segment with the lowest value is {DigitalArt}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the DigitalArt segment within the Dunvale bar in the stacked bar chart?",
            "A": "The value of the DigitalArt segment is {178.00} number."
        },
        {
            "Q": "What is the value of the Mural segment within the Elmhurst bar in the stacked bar chart?",
            "A": "The value of the Mural segment is {225.00} number."
        },
        {
            "Q": "What is the value of the Textile segment within the Quarryville bar in the stacked bar chart?",
            "A": "The value of the Textile segment is {251.00} number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum number among the stacked segments of bar Elmhurst?",
            "A": "The maximum number among the stacked segments of bar Elmhurst is {239} number."
        },
        {
            "Q": "What is the minimum number among the stacked segments of bar Quarryville?",
            "A": "The minimum number among the stacked segments of bar Quarryville is {237} number."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum number of the segment DigitalArt among the bars?",
            "A": "The maximum number among the bars of segment DigitalArt is {295} number."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum number of the segment Sculpture among the bars?",
            "A": "The minimum number among the bars of segment Sculpture is {187} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Creston?",
            "A": "The total value of bar Creston is {1659.00} number."
        },
        {
            "Q": "What is the total value of the bar Elmhurst?",
            "A": "The total value of bar Elmhurst is {1242.00} number."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {7468} number."
        },
        {
            "Q": "What is the difference between total value of bar Creston and Elmhurst?",
            "A": "The difference between between total value of bar Creston and Elmhurst is {417} number."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total number values exceed 1721.50 number? Please list the bar and corresponding values.",
            "A": "{Quarryville} has {1784} number"
        },
        {
            "Q": "Which bars have total number values below 1315.00 number? Please list the bar and corresponding values.",
            "A": "{Elmhurst} has {1242} number"
        },
        {
            "Q": "For bar Oakridge in the stacked bar chart, which segment have number value between 222.5 and 464? Please list the segment and corresponding values.",
            "A": "{Photography} has {240} number, {Mural} has {292} number, {Painting} has {303} number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total number of Creston or Oakridge?",
            "A": "The total number of the {Creston} is larger."
        },
        {
            "Q": "Which is larger, the total number of Elmhurst, Quarryville or Dunvale?",
            "A": "The total number of the {Quarryville} is larger."
        },
        {
            "Q": "In the bar Quarryville, which has a larger number value: Textile or DigitalArt?",
            "A": "{Textile} has the larger number value."
        },
        {
            "Q": "In the bar Quarryville, which has a larger number value: Mural, Photography or Sculpture?",
            "A": "{Mural} has the larger number value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Textile in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Textile are: {Creston}, {Quarryville}, {Elmhurst}."
        }
    ],
    "VA": []
}