{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {12} bars."
        },
        {
            "Q": "How many stacked segments are in bar Westport of this stacked bar chart?",
            "A": "There are {7} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Pinehaven}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Zephyr}."
        },
        {
            "Q": "What is the spatial relationship of bar Dunvale relative to the bar Rosewood in terms of horizontal (left/right) direction?",
            "A": "Bar Dunvale is to the {left} of the bar Rosewood."
        },
        {
            "Q": "In the stacked bar of Glenhaven, What is the spatial relationship of segment Photography relative to the segment Glassware in terms of vertical (above/below) direction?",
            "A": "Photography segment is positioned {below} the Glassware segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which City has the highest bar in this stacked bar chart?",
            "A": "The City with the highest bar is {Westport}."
        },
        {
            "Q": "Which City has the lowest bar in this stacked bar chart?",
            "A": "The City with the lowest bar is {Ashford}."
        },
        {
            "Q": "In the stacked bar representing Yorkton, which segment has the highest value?",
            "A": "The segment with the highest value is {Glassware}."
        },
        {
            "Q": "In the stacked bar representing Creston, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Installation}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Photography segment within the Glenhaven bar in the stacked bar chart?",
            "A": "The value of the Photography segment is {302.00} number."
        },
        {
            "Q": "What is the value of the Textile segment within the Lakeview bar in the stacked bar chart?",
            "A": "The value of the Textile segment is {200.00} number."
        },
        {
            "Q": "What is the value of the Photography segment within the Westport bar in the stacked bar chart?",
            "A": "The value of the Photography segment is {353.00} number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum number among the stacked segments of bar Rosewood?",
            "A": "The maximum number among the stacked segments of bar Rosewood is {312} number."
        },
        {
            "Q": "What is the minimum number among the stacked segments of bar Yorkton?",
            "A": "The minimum number among the stacked segments of bar Yorkton is {207} number."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum number of the segment Textile among the bars?",
            "A": "The maximum number among the bars of segment Textile is {308} number."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum number of the segment Installation among the bars?",
            "A": "The minimum number among the bars of segment Installation is {99} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Ashford?",
            "A": "The total value of bar Ashford is {1400.00} number."
        },
        {
            "Q": "What is the total value of the bar Yorkton?",
            "A": "The total value of bar Yorkton is {1969.00} number."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {21984} number."
        },
        {
            "Q": "What is the difference between total value of bar Springfield and Creston?",
            "A": "The difference between between total value of bar Springfield and Creston is {49} number."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total number values exceed 1952.00 number? Please list the bar and corresponding values.",
            "A": "{Yorkton} has {1969} number, {Westport} has {2033} number"
        },
        {
            "Q": "Which bars have total number values below 1565.50 number? Please list the bar and corresponding values.",
            "A": "{Ashford} has {1400} number"
        },
        {
            "Q": "For bar Springfield in the stacked bar chart, which segment have number value between 238.5 and 262.0? Please list the segment and corresponding values.",
            "A": "{Textile} has {245} number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total number of Ashford or Elmhurst?",
            "A": "The total number of the {Elmhurst} is larger."
        },
        {
            "Q": "Which is larger, the total number of Glenhaven, Westport or Zephyr?",
            "A": "The total number of the {Westport} is larger."
        },
        {
            "Q": "In the bar Pinehaven, which has a larger number value: Sculpture or Photography?",
            "A": "{Sculpture} has the larger number value."
        },
        {
            "Q": "In the bar Dunvale, which has a larger number value: Glassware, Installation or Textile?",
            "A": "{Installation} has the larger number value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Glassware in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Glassware are: {Yorkton}, {Pinehaven}, {Zephyr}."
        }
    ],
    "VA": []
}