{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {15} bars."
        },
        {
            "Q": "How many stacked segments are in bar 2019 of this stacked bar chart?",
            "A": "There are {7} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {2007}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {2025}."
        },
        {
            "Q": "What is the spatial relationship of bar 2009 relative to the bar 2018 in terms of horizontal (left/right) direction?",
            "A": "Bar 2009 is to the {left} of the bar 2018."
        },
        {
            "Q": "In the stacked bar of 2015, What is the spatial relationship of segment Lakewood Institute relative to the segment Crestview High in terms of vertical (above/below) direction?",
            "A": "Lakewood Institute segment is positioned {below} the Crestview High segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Year has the highest bar in this stacked bar chart?",
            "A": "The Year with the highest bar is {2011}."
        },
        {
            "Q": "Which Year has the lowest bar in this stacked bar chart?",
            "A": "The Year with the lowest bar is {2021}."
        },
        {
            "Q": "In the stacked bar representing 2007, which segment has the highest value?",
            "A": "The segment with the highest value is {Brookfield Academy}."
        },
        {
            "Q": "In the stacked bar representing 2025, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Redwood Prep}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Westport Academy segment within the 2011 bar in the stacked bar chart?",
            "A": "The value of the Westport Academy segment is {719.00} students."
        },
        {
            "Q": "What is the value of the Hillcrest High segment within the 2017 bar in the stacked bar chart?",
            "A": "The value of the Hillcrest High segment is {650.00} students."
        },
        {
            "Q": "What is the value of the Eastwood Prep segment within the 2019 bar in the stacked bar chart?",
            "A": "The value of the Eastwood Prep segment is {650.00} students."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum students among the stacked segments of bar 2021?",
            "A": "The maximum students among the stacked segments of bar 2021 is {2376} students."
        },
        {
            "Q": "What is the minimum students among the stacked segments of bar 2010?",
            "A": "The minimum students among the stacked segments of bar 2010 is {702} students."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum students of the segment Hillcrest High among the bars?",
            "A": "The maximum students among the bars of segment Hillcrest High is {4900} students."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum students of the segment Redwood Prep among the bars?",
            "A": "The minimum students among the bars of segment Redwood Prep is {650} students."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar 2009?",
            "A": "The total value of bar 2009 is {18780.00} students."
        },
        {
            "Q": "What is the total value of the bar 2016?",
            "A": "The total value of bar 2016 is {16859.00} students."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {228858} students."
        },
        {
            "Q": "What is the difference between total value of bar 2025 and 2016?",
            "A": "The difference between between total value of bar 2025 and 2016 is {4072} students."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total students values exceed 18901.00 students? Please list the bar and corresponding values.",
            "A": "{2013} has {19022} students, {2011} has {19884} students"
        },
        {
            "Q": "Which bars have total students values below 8706.00 students? Please list the bar and corresponding values.",
            "A": "{2021} has {7898} students"
        },
        {
            "Q": "For bar 2018 in the stacked bar chart, which segment have students value between 2640.0 and 3307.0? Please list the segment and corresponding values.",
            "A": "{Lakewood Institute} has {2650} students, {Hillcrest High} has {3229} students."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total students of 2009 or 2021?",
            "A": "The total students of the {2009} is larger."
        },
        {
            "Q": "Which is larger, the total students of 2017, 2019 or 2010?",
            "A": "The total students of the {2010} is larger."
        },
        {
            "Q": "In the bar 2008, which has a larger students value: Hillcrest High or Westport Academy?",
            "A": "{Hillcrest High} has the larger students value."
        },
        {
            "Q": "In the bar 2007, which has a larger students value: Hillcrest High, Crestview High or Westport Academy?",
            "A": "{Westport Academy} has the larger students value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Lakewood Institute in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Lakewood Institute are: {2012}, {2011}, {2016}."
        }
    ],
    "VA": []
}