{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {14} bars."
        },
        {
            "Q": "How many stacked segments are in bar Ironwood of this stacked bar chart?",
            "A": "There are {6} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Mapleton}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Westport}."
        },
        {
            "Q": "What is the spatial relationship of bar Pinehaven relative to the bar Creston in terms of horizontal (left/right) direction?",
            "A": "Bar Pinehaven is to the {right} of the bar Creston."
        },
        {
            "Q": "In the stacked bar of Brookfield, What is the spatial relationship of segment Potato relative to the segment Sugarcane in terms of vertical (above/below) direction?",
            "A": "Potato segment is positioned {below} the Sugarcane segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Cities has the highest bar in this stacked bar chart?",
            "A": "The Cities with the highest bar is {Pinehaven}."
        },
        {
            "Q": "Which Cities has the lowest bar in this stacked bar chart?",
            "A": "The Cities with the lowest bar is {Mapleton}."
        },
        {
            "Q": "In the stacked bar representing Brookfield, which segment has the highest value?",
            "A": "The segment with the highest value is {Wheat}."
        },
        {
            "Q": "In the stacked bar representing Pinehaven, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Wheat}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Potato segment within the Springfield bar in the stacked bar chart?",
            "A": "The value of the Potato segment is {75.00} thousand tonnes."
        },
        {
            "Q": "What is the value of the Cotton segment within the Mapleton bar in the stacked bar chart?",
            "A": "The value of the Cotton segment is {110.00} thousand tonnes."
        },
        {
            "Q": "What is the value of the Oats segment within the Creston bar in the stacked bar chart?",
            "A": "The value of the Oats segment is {75.00} thousand tonnes."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum thousand tonnes among the stacked segments of bar Ironwood?",
            "A": "The maximum thousand tonnes among the stacked segments of bar Ironwood is {129} thousand tonnes."
        },
        {
            "Q": "What is the minimum thousand tonnes among the stacked segments of bar Lakeview?",
            "A": "The minimum thousand tonnes among the stacked segments of bar Lakeview is {50} thousand tonnes."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum thousand tonnes of the segment Corn among the bars?",
            "A": "The maximum thousand tonnes among the bars of segment Corn is {199} thousand tonnes."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum thousand tonnes of the segment Corn among the bars?",
            "A": "The minimum thousand tonnes among the bars of segment Corn is {53} thousand tonnes."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Ironwood?",
            "A": "The total value of bar Ironwood is {513.00} thousand tonnes."
        },
        {
            "Q": "What is the total value of the bar Lakeview?",
            "A": "The total value of bar Lakeview is {524.00} thousand tonnes."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {7922} thousand tonnes."
        },
        {
            "Q": "What is the difference between total value of bar Pinehaven and Yorkton?",
            "A": "The difference between between total value of bar Pinehaven and Yorkton is {110} thousand tonnes."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total thousand tonnes values exceed 703.00 thousand tonnes? Please list the bar and corresponding values.",
            "A": "{Westport} has {717} thousand tonnes, {Pinehaven} has {756} thousand tonnes"
        },
        {
            "Q": "Which bars have total thousand tonnes values below 393.50 thousand tonnes? Please list the bar and corresponding values.",
            "A": "{Mapleton} has {380} thousand tonnes"
        },
        {
            "Q": "For bar Mapleton in the stacked bar chart, which segment have thousand tonnes value between 54.0 and 83.5? Please list the segment and corresponding values.",
            "A": "{Potato} has {57} thousand tonnes."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total thousand tonnes of Westport or Springfield?",
            "A": "The total thousand tonnes of the {Westport} is larger."
        },
        {
            "Q": "Which is larger, the total thousand tonnes of Dunvale, Lakeview or Ironwood?",
            "A": "The total thousand tonnes of the {Dunvale} is larger."
        },
        {
            "Q": "In the bar Yorkton, which has a larger thousand tonnes value: Oats or Sugarcane?",
            "A": "{Oats} has the larger thousand tonnes value."
        },
        {
            "Q": "In the bar Highvale, which has a larger thousand tonnes value: Potato, Wheat or Corn?",
            "A": "{Wheat} has the larger thousand tonnes value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Cotton in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Cotton are: {Yorkton}, {Highvale}, {Mapleton}."
        }
    ],
    "VA": []
}