{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {6} bars."
        },
        {
            "Q": "How many stacked segments are in bar Rosewood of this stacked bar chart?",
            "A": "There are {7} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Ashford}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Zephyr}."
        },
        {
            "Q": "What is the spatial relationship of bar Ashford relative to the bar Quarryville in terms of horizontal (left/right) direction?",
            "A": "Bar Ashford is to the {left} of the bar Quarryville."
        },
        {
            "Q": "In the stacked bar of Quarryville, What is the spatial relationship of segment Rice relative to the segment Coffee in terms of vertical (above/below) direction?",
            "A": "Rice segment is positioned {above} the Coffee segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Cities has the highest bar in this stacked bar chart?",
            "A": "The Cities with the highest bar is {Zephyr}."
        },
        {
            "Q": "Which Cities has the lowest bar in this stacked bar chart?",
            "A": "The Cities with the lowest bar is {Elmhurst}."
        },
        {
            "Q": "In the stacked bar representing Elmhurst, which segment has the highest value?",
            "A": "The segment with the highest value is {Coffee}."
        },
        {
            "Q": "In the stacked bar representing Ashford, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Potato}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Corn segment within the Quarryville bar in the stacked bar chart?",
            "A": "The value of the Corn segment is {149.00} thousand tonnes."
        },
        {
            "Q": "What is the value of the Potato segment within the Ashford bar in the stacked bar chart?",
            "A": "The value of the Potato segment is {40.00} thousand tonnes."
        },
        {
            "Q": "What is the value of the Barley segment within the Springfield bar in the stacked bar chart?",
            "A": "The value of the Barley segment is {49.00} thousand tonnes."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum thousand tonnes among the stacked segments of bar Quarryville?",
            "A": "The maximum thousand tonnes among the stacked segments of bar Quarryville is {255} thousand tonnes."
        },
        {
            "Q": "What is the minimum thousand tonnes among the stacked segments of bar Ashford?",
            "A": "The minimum thousand tonnes among the stacked segments of bar Ashford is {40} thousand tonnes."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum thousand tonnes of the segment Cotton among the bars?",
            "A": "The maximum thousand tonnes among the bars of segment Cotton is {280} thousand tonnes."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum thousand tonnes of the segment Coffee among the bars?",
            "A": "The minimum thousand tonnes among the bars of segment Coffee is {44} thousand tonnes."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Elmhurst?",
            "A": "The total value of bar Elmhurst is {604.00} thousand tonnes."
        },
        {
            "Q": "What is the total value of the bar Ashford?",
            "A": "The total value of bar Ashford is {805.00} thousand tonnes."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {5266} thousand tonnes."
        },
        {
            "Q": "What is the difference between total value of bar Rosewood and Ashford?",
            "A": "The difference between between total value of bar Rosewood and Ashford is {92} thousand tonnes."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total thousand tonnes values exceed 1113.50 thousand tonnes? Please list the bar and corresponding values.",
            "A": "{Zephyr} has {1203} thousand tonnes"
        },
        {
            "Q": "Which bars have total thousand tonnes values below 668.50 thousand tonnes? Please list the bar and corresponding values.",
            "A": "{Elmhurst} has {604} thousand tonnes"
        },
        {
            "Q": "For bar Elmhurst in the stacked bar chart, which segment have thousand tonnes value between 62.5 and 110.0? Please list the segment and corresponding values.",
            "A": "{Barley} has {70} thousand tonnes, {Rice} has {76} thousand tonnes."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total thousand tonnes of Rosewood or Ashford?",
            "A": "The total thousand tonnes of the {Rosewood} is larger."
        },
        {
            "Q": "Which is larger, the total thousand tonnes of Zephyr, Rosewood or Ashford?",
            "A": "The total thousand tonnes of the {Zephyr} is larger."
        },
        {
            "Q": "In the bar Ashford, which has a larger thousand tonnes value: Coffee or Rice?",
            "A": "{Rice} has the larger thousand tonnes value."
        },
        {
            "Q": "In the bar Quarryville, which has a larger thousand tonnes value: Rice, Barley or Coffee?",
            "A": "{Rice} has the larger thousand tonnes value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Potato in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Potato are: {Springfield}, {Rosewood}, {Elmhurst}."
        }
    ],
    "VA": []
}