{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {6} bars."
        },
        {
            "Q": "How many stacked segments are in bar Yorkton of this stacked bar chart?",
            "A": "There are {5} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Brookfield}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Dunvale}."
        },
        {
            "Q": "What is the spatial relationship of bar Brookfield relative to the bar Elmhurst in terms of horizontal (left/right) direction?",
            "A": "Bar Brookfield is to the {left} of the bar Elmhurst."
        },
        {
            "Q": "In the stacked bar of Dunvale, What is the spatial relationship of segment Biomass relative to the segment NaturalGas in terms of vertical (above/below) direction?",
            "A": "Biomass segment is positioned {above} the NaturalGas segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which City has the highest bar in this stacked bar chart?",
            "A": "The City with the highest bar is {Elmhurst}."
        },
        {
            "Q": "Which City has the lowest bar in this stacked bar chart?",
            "A": "The City with the lowest bar is {Yorkton}."
        },
        {
            "Q": "In the stacked bar representing Yorkton, which segment has the highest value?",
            "A": "The segment with the highest value is {Hydro}."
        },
        {
            "Q": "In the stacked bar representing Brookfield, which segment has the lowest value?",
            "A": "The segment with the lowest value is {NaturalGas}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Hydro segment within the Elmhurst bar in the stacked bar chart?",
            "A": "The value of the Hydro segment is {2450.00} TWh."
        },
        {
            "Q": "What is the value of the Coal segment within the Brookfield bar in the stacked bar chart?",
            "A": "The value of the Coal segment is {3591.00} TWh."
        },
        {
            "Q": "What is the value of the Hydro segment within the Mapleton bar in the stacked bar chart?",
            "A": "The value of the Hydro segment is {1308.00} TWh."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum TWh among the stacked segments of bar Dunvale?",
            "A": "The maximum TWh among the stacked segments of bar Dunvale is {4500} TWh."
        },
        {
            "Q": "What is the minimum TWh among the stacked segments of bar Mapleton?",
            "A": "The minimum TWh among the stacked segments of bar Mapleton is {1256} TWh."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum TWh of the segment Hydro among the bars?",
            "A": "The maximum TWh among the bars of segment Hydro is {3304} TWh."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum TWh of the segment Oil among the bars?",
            "A": "The minimum TWh among the bars of segment Oil is {550} TWh."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Mapleton?",
            "A": "The total value of bar Mapleton is {10172.00} TWh."
        },
        {
            "Q": "What is the total value of the bar Dunvale?",
            "A": "The total value of bar Dunvale is {13577.00} TWh."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {71428} TWh."
        },
        {
            "Q": "What is the difference between total value of bar Brookfield and Glenhaven?",
            "A": "The difference between between total value of bar Brookfield and Glenhaven is {2477} TWh."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total TWh values exceed 13191.00 TWh? Please list the bar and corresponding values.",
            "A": "{Dunvale} has {13577} TWh, {Elmhurst} has {16578} TWh"
        },
        {
            "Q": "Which bars have total TWh values below 10250.00 TWh? Please list the bar and corresponding values.",
            "A": "{Yorkton} has {7968} TWh, {Mapleton} has {10172} TWh"
        },
        {
            "Q": "For bar Dunvale in the stacked bar chart, which segment have TWh value between 2117.0 and 5050? Please list the segment and corresponding values.",
            "A": "{NaturalGas} has {2279} TWh, {Biomass} has {4293} TWh, {Oil} has {4500} TWh."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total TWh of Yorkton or Mapleton?",
            "A": "The total TWh of the {Mapleton} is larger."
        },
        {
            "Q": "Which is larger, the total TWh of Dunvale, Mapleton or Yorkton?",
            "A": "The total TWh of the {Dunvale} is larger."
        },
        {
            "Q": "In the bar Glenhaven, which has a larger TWh value: Hydro or Coal?",
            "A": "{Coal} has the larger TWh value."
        },
        {
            "Q": "In the bar Brookfield, which has a larger TWh value: Hydro, Coal or NaturalGas?",
            "A": "{Coal} has the larger TWh value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Hydro in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Hydro are: {Yorkton}, {Elmhurst}, {Brookfield}."
        }
    ],
    "VA": []
}