{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {13} bars."
        },
        {
            "Q": "How many stacked segments are in bar 2006 of this stacked bar chart?",
            "A": "There are {4} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {2000}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {2019}."
        },
        {
            "Q": "What is the spatial relationship of bar 2017 relative to the bar 2010 in terms of horizontal (left/right) direction?",
            "A": "Bar 2017 is to the {right} of the bar 2010."
        },
        {
            "Q": "In the stacked bar of 2001, What is the spatial relationship of segment Frozen relative to the segment Meat in terms of vertical (above/below) direction?",
            "A": "Frozen segment is positioned {below} the Meat segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Year has the highest bar in this stacked bar chart?",
            "A": "The Year with the highest bar is {2006}."
        },
        {
            "Q": "Which Year has the lowest bar in this stacked bar chart?",
            "A": "The Year with the lowest bar is {2009}."
        },
        {
            "Q": "In the stacked bar representing 2018, which segment has the highest value?",
            "A": "The segment with the highest value is {Meat}."
        },
        {
            "Q": "In the stacked bar representing 2001, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Meat}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Meat segment within the 2001 bar in the stacked bar chart?",
            "A": "The value of the Meat segment is {205.13} million USD."
        },
        {
            "Q": "What is the value of the Fruits segment within the 2015 bar in the stacked bar chart?",
            "A": "The value of the Fruits segment is {500.38} million USD."
        },
        {
            "Q": "What is the value of the Beverages segment within the 2010 bar in the stacked bar chart?",
            "A": "The value of the Beverages segment is {265.92} million USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum million USD among the stacked segments of bar 2017?",
            "A": "The maximum million USD among the stacked segments of bar 2017 is {436.13} million USD."
        },
        {
            "Q": "What is the minimum million USD among the stacked segments of bar 2010?",
            "A": "The minimum million USD among the stacked segments of bar 2010 is {246.36} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum million USD of the segment Frozen among the bars?",
            "A": "The maximum million USD among the bars of segment Frozen is {1000.0} million USD."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum million USD of the segment Frozen among the bars?",
            "A": "The minimum million USD among the bars of segment Frozen is {201.95} million USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar 2000?",
            "A": "The total value of bar 2000 is {2576.00} million USD."
        },
        {
            "Q": "What is the total value of the bar 2019?",
            "A": "The total value of bar 2019 is {1688.20} million USD."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {21387.810000000005} million USD."
        },
        {
            "Q": "What is the difference between total value of bar 2010 and 2007?",
            "A": "The difference between between total value of bar 2010 and 2007 is {193.61000000000035} million USD."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total million USD values exceed 2590.72 million USD? Please list the bar and corresponding values.",
            "A": "{2006.0} has {2605.4300000000003} million USD"
        },
        {
            "Q": "Which bars have total million USD values below 1190.81 million USD? Please list the bar and corresponding values.",
            "A": "{2009.0} has {1131.54} million USD, {2002.0} has {1134.17} million USD, {2018.0} has {1185.97} million USD"
        },
        {
            "Q": "For bar 2015 in the stacked bar chart, which segment have million USD value between 436.515 and 750.19? Please list the segment and corresponding values.",
            "A": "{Fruits} has {500.38} million USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total million USD of 2009 or 2006?",
            "A": "The total million USD of the {2006} is larger."
        },
        {
            "Q": "Which is larger, the total million USD of 2006, 2001 or 2010?",
            "A": "The total million USD of the {2006} is larger."
        },
        {
            "Q": "In the bar 2010, which has a larger million USD value: Fruits or Beverages?",
            "A": "{Beverages} has the larger million USD value."
        },
        {
            "Q": "In the bar 2001, which has a larger million USD value: Meat, Beverages or Frozen?",
            "A": "{Beverages} has the larger million USD value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Frozen in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Frozen are: {2006}, {2000}, {2010}."
        }
    ],
    "VA": []
}