{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {5} bars."
        },
        {
            "Q": "How many stacked segments are in bar 2010 of this stacked bar chart?",
            "A": "There are {3} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {2010}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {2019}."
        },
        {
            "Q": "What is the spatial relationship of bar 2019 relative to the bar 2010 in terms of horizontal (left/right) direction?",
            "A": "Bar 2019 is to the {right} of the bar 2010."
        },
        {
            "Q": "In the stacked bar of 2019, What is the spatial relationship of segment Northfield relative to the segment Glenwood in terms of vertical (above/below) direction?",
            "A": "Northfield segment is positioned {above} the Glenwood segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Year has the highest bar in this stacked bar chart?",
            "A": "The Year with the highest bar is {2013}."
        },
        {
            "Q": "Which Year has the lowest bar in this stacked bar chart?",
            "A": "The Year with the lowest bar is {2014}."
        },
        {
            "Q": "In the stacked bar representing 2016, which segment has the highest value?",
            "A": "The segment with the highest value is {Northfield}."
        },
        {
            "Q": "In the stacked bar representing 2014, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Stonehill}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Stonehill segment within the 2013 bar in the stacked bar chart?",
            "A": "The value of the Stonehill segment is {18860.00} visits."
        },
        {
            "Q": "What is the value of the Glenwood segment within the 2010 bar in the stacked bar chart?",
            "A": "The value of the Glenwood segment is {9632.00} visits."
        },
        {
            "Q": "What is the value of the Northfield segment within the 2014 bar in the stacked bar chart?",
            "A": "The value of the Northfield segment is {14910.00} visits."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum visits among the stacked segments of bar 2016?",
            "A": "The maximum visits among the stacked segments of bar 2016 is {18792} visits."
        },
        {
            "Q": "What is the minimum visits among the stacked segments of bar 2013?",
            "A": "The minimum visits among the stacked segments of bar 2013 is {13079} visits."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum visits of the segment Stonehill among the bars?",
            "A": "The maximum visits among the bars of segment Stonehill is {18860} visits."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum visits of the segment Glenwood among the bars?",
            "A": "The minimum visits among the bars of segment Glenwood is {6331} visits."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar 2014?",
            "A": "The total value of bar 2014 is {27147.00} visits."
        },
        {
            "Q": "What is the total value of the bar 2013?",
            "A": "The total value of bar 2013 is {50760.00} visits."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {182976} visits."
        },
        {
            "Q": "What is the difference between total value of bar 2013 and 2019?",
            "A": "The difference between between total value of bar 2013 and 2019 is {13803} visits."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total visits values exceed 43858.50 visits? Please list the bar and corresponding values.",
            "A": "{2013} has {50760} visits"
        },
        {
            "Q": "Which bars have total visits values below 29164.00 visits? Please list the bar and corresponding values.",
            "A": "{2014} has {27147} visits"
        },
        {
            "Q": "For bar 2013 in the stacked bar chart, which segment have visits value between 18840.5 and 31939? Please list the segment and corresponding values.",
            "A": "{Stonehill} has {18860} visits."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total visits of 2016 or 2014?",
            "A": "The total visits of the {2016} is larger."
        },
        {
            "Q": "Which is larger, the total visits of 2016, 2019 or 2014?",
            "A": "The total visits of the {2019} is larger."
        },
        {
            "Q": "In the bar 2010, which has a larger visits value: Glenwood or Northfield?",
            "A": "{Glenwood} has the larger visits value."
        },
        {
            "Q": "In the bar 2014, which has a larger visits value: Stonehill, Northfield or Glenwood?",
            "A": "{Northfield} has the larger visits value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Northfield in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Northfield are: {2016}, {2019}, {2014}."
        }
    ],
    "VA": []
}