{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {8} bars."
        },
        {
            "Q": "How many stacked segments are in bar 2014 of this stacked bar chart?",
            "A": "There are {3} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {2010}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {2018}."
        },
        {
            "Q": "What is the spatial relationship of bar 2015 relative to the bar 2013 in terms of horizontal (left/right) direction?",
            "A": "Bar 2015 is to the {right} of the bar 2013."
        },
        {
            "Q": "In the stacked bar of 2010, What is the spatial relationship of segment Lakewood relative to the segment Glenwood in terms of vertical (above/below) direction?",
            "A": "Lakewood segment is positioned {above} the Glenwood segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Year has the highest bar in this stacked bar chart?",
            "A": "The Year with the highest bar is {2013}."
        },
        {
            "Q": "Which Year has the lowest bar in this stacked bar chart?",
            "A": "The Year with the lowest bar is {2010}."
        },
        {
            "Q": "In the stacked bar representing 2018, which segment has the highest value?",
            "A": "The segment with the highest value is {Glenwood}."
        },
        {
            "Q": "In the stacked bar representing 2016, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Glenwood}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Glenwood segment within the 2018 bar in the stacked bar chart?",
            "A": "The value of the Glenwood segment is {13137.00} visits."
        },
        {
            "Q": "What is the value of the Lakewood segment within the 2011 bar in the stacked bar chart?",
            "A": "The value of the Lakewood segment is {8823.00} visits."
        },
        {
            "Q": "What is the value of the Glenwood segment within the 2012 bar in the stacked bar chart?",
            "A": "The value of the Glenwood segment is {11160.00} visits."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum visits among the stacked segments of bar 2015?",
            "A": "The maximum visits among the stacked segments of bar 2015 is {10926} visits."
        },
        {
            "Q": "What is the minimum visits among the stacked segments of bar 2010?",
            "A": "The minimum visits among the stacked segments of bar 2010 is {7347} visits."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum visits of the segment Meadowbrook among the bars?",
            "A": "The maximum visits among the bars of segment Meadowbrook is {19777} visits."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum visits of the segment Lakewood among the bars?",
            "A": "The minimum visits among the bars of segment Lakewood is {7347} visits."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar 2010?",
            "A": "The total value of bar 2010 is {29296.00} visits."
        },
        {
            "Q": "What is the total value of the bar 2018?",
            "A": "The total value of bar 2018 is {29642.00} visits."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {284134} visits."
        },
        {
            "Q": "What is the difference between total value of bar 2018 and 2012?",
            "A": "The difference between between total value of bar 2018 and 2012 is {8010} visits."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total visits values exceed 39956.50 visits? Please list the bar and corresponding values.",
            "A": "{2016} has {42261} visits, {2013} has {43725} visits"
        },
        {
            "Q": "Which bars have total visits values below 29469.00 visits? Please list the bar and corresponding values.",
            "A": "{2010} has {29296} visits"
        },
        {
            "Q": "For bar 2014 in the stacked bar chart, which segment have visits value between 3488.5 and 14563.5? Please list the segment and corresponding values.",
            "A": "{Meadowbrook} has {6977} visits, {Glenwood} has {12531} visits."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total visits of 2010 or 2014?",
            "A": "The total visits of the {2014} is larger."
        },
        {
            "Q": "Which is larger, the total visits of 2015, 2014 or 2018?",
            "A": "The total visits of the {2014} is larger."
        },
        {
            "Q": "In the bar 2015, which has a larger visits value: Lakewood or Glenwood?",
            "A": "{Glenwood} has the larger visits value."
        },
        {
            "Q": "In the bar 2018, which has a larger visits value: Glenwood, Lakewood or Meadowbrook?",
            "A": "{Glenwood} has the larger visits value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Lakewood in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Lakewood are: {2014}, {2013}, {2016}."
        }
    ],
    "VA": []
}