{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {10} bars."
        },
        {
            "Q": "How many stacked segments are in bar Hillcrest of this stacked bar chart?",
            "A": "There are {5} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Riverton}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Glenwood}."
        },
        {
            "Q": "What is the spatial relationship of bar Lakewood relative to the bar Silverton in terms of horizontal (left/right) direction?",
            "A": "Bar Lakewood is to the {left} of the bar Silverton."
        },
        {
            "Q": "In the stacked bar of Lakewood, What is the spatial relationship of segment Agriculture relative to the segment Manufacturing in terms of vertical (above/below) direction?",
            "A": "Agriculture segment is positioned {above} the Manufacturing segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Town has the highest bar in this stacked bar chart?",
            "A": "The Town with the highest bar is {Glenwood}."
        },
        {
            "Q": "Which Town has the lowest bar in this stacked bar chart?",
            "A": "The Town with the lowest bar is {Clearview}."
        },
        {
            "Q": "In the stacked bar representing Brookhaven, which segment has the highest value?",
            "A": "The segment with the highest value is {Energy}."
        },
        {
            "Q": "In the stacked bar representing Glenwood, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Manufacturing}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Energy segment within the Silverton bar in the stacked bar chart?",
            "A": "The value of the Energy segment is {4524.00} number."
        },
        {
            "Q": "What is the value of the Technology segment within the Clearview bar in the stacked bar chart?",
            "A": "The value of the Technology segment is {4038.00} number."
        },
        {
            "Q": "What is the value of the Manufacturing segment within the Brookhaven bar in the stacked bar chart?",
            "A": "The value of the Manufacturing segment is {3090.00} number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum number among the stacked segments of bar Brookhaven?",
            "A": "The maximum number among the stacked segments of bar Brookhaven is {5000} number."
        },
        {
            "Q": "What is the minimum number among the stacked segments of bar Westwood?",
            "A": "The minimum number among the stacked segments of bar Westwood is {913} number."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum number of the segment Construction among the bars?",
            "A": "The maximum number among the bars of segment Construction is {5000} number."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum number of the segment Energy among the bars?",
            "A": "The minimum number among the bars of segment Energy is {813} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Westwood?",
            "A": "The total value of bar Westwood is {13479.00} number."
        },
        {
            "Q": "What is the total value of the bar Fairview?",
            "A": "The total value of bar Fairview is {13088.00} number."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {134682} number."
        },
        {
            "Q": "What is the difference between total value of bar Lakewood and Hillcrest?",
            "A": "The difference between between total value of bar Lakewood and Hillcrest is {2062} number."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total number values exceed 14919.50 number? Please list the bar and corresponding values.",
            "A": "{Riverton} has {15063} number, {Glenwood} has {19244} number"
        },
        {
            "Q": "Which bars have total number values below 12143.50 number? Please list the bar and corresponding values.",
            "A": "{Clearview} has {9904} number, {Silverton} has {11565} number, {Pinecrest} has {11573} number"
        },
        {
            "Q": "For bar Silverton in the stacked bar chart, which segment have number value between 2412.0 and 3482.0? Please list the segment and corresponding values.",
            "A": "{Agriculture} has {2440} number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total number of Brookhaven or Westwood?",
            "A": "The total number of the {Westwood} is larger."
        },
        {
            "Q": "Which is larger, the total number of Hillcrest, Fairview or Riverton?",
            "A": "The total number of the {Riverton} is larger."
        },
        {
            "Q": "In the bar Glenwood, which has a larger number value: Construction or Energy?",
            "A": "{Construction} has the larger number value."
        },
        {
            "Q": "In the bar Glenwood, which has a larger number value: Energy, Agriculture or Construction?",
            "A": "{Energy} has the larger number value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Energy in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Energy are: {Lakewood}, {Brookhaven}, {Glenwood}."
        }
    ],
    "VA": []
}