{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {12} bars."
        },
        {
            "Q": "How many stacked segments are in bar Springvale of this stacked bar chart?",
            "A": "There are {3} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Pinecrest}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Glenwood}."
        },
        {
            "Q": "What is the spatial relationship of bar Cedarburg relative to the bar Westwood in terms of horizontal (left/right) direction?",
            "A": "Bar Cedarburg is to the {left} of the bar Westwood."
        },
        {
            "Q": "In the stacked bar of Northfield, What is the spatial relationship of segment Hospitality relative to the segment Agriculture in terms of vertical (above/below) direction?",
            "A": "Hospitality segment is positioned {below} the Agriculture segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Town has the highest bar in this stacked bar chart?",
            "A": "The Town with the highest bar is {Redstone}."
        },
        {
            "Q": "Which Town has the lowest bar in this stacked bar chart?",
            "A": "The Town with the lowest bar is {Westwood}."
        },
        {
            "Q": "In the stacked bar representing Westwood, which segment has the highest value?",
            "A": "The segment with the highest value is {Agriculture}."
        },
        {
            "Q": "In the stacked bar representing Fairview, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Agriculture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Agriculture segment within the Pinecrest bar in the stacked bar chart?",
            "A": "The value of the Agriculture segment is {3450.00} number."
        },
        {
            "Q": "What is the value of the Hospitality segment within the Hillcrest bar in the stacked bar chart?",
            "A": "The value of the Hospitality segment is {866.00} number."
        },
        {
            "Q": "What is the value of the Energy segment within the Cedarburg bar in the stacked bar chart?",
            "A": "The value of the Energy segment is {3924.00} number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum number among the stacked segments of bar Northfield?",
            "A": "The maximum number among the stacked segments of bar Northfield is {3747} number."
        },
        {
            "Q": "What is the minimum number among the stacked segments of bar Northfield?",
            "A": "The minimum number among the stacked segments of bar Northfield is {1476} number."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum number of the segment Hospitality among the bars?",
            "A": "The maximum number among the bars of segment Hospitality is {4897} number."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum number of the segment Hospitality among the bars?",
            "A": "The minimum number among the bars of segment Hospitality is {866} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Pinecrest?",
            "A": "The total value of bar Pinecrest is {8088.00} number."
        },
        {
            "Q": "What is the total value of the bar Springvale?",
            "A": "The total value of bar Springvale is {11394.00} number."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {105071} number."
        },
        {
            "Q": "What is the difference between total value of bar Glenwood and Hillcrest?",
            "A": "The difference between between total value of bar Glenwood and Hillcrest is {632} number."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total number values exceed 10722.00 number? Please list the bar and corresponding values.",
            "A": "{Springvale} has {11394} number, {Redstone} has {11422} number"
        },
        {
            "Q": "Which bars have total number values below 6704.00 number? Please list the bar and corresponding values.",
            "A": "{Westwood} has {6424} number"
        },
        {
            "Q": "For bar Glenwood in the stacked bar chart, which segment have number value between 1322.5 and 6134? Please list the segment and corresponding values.",
            "A": "{Hospitality} has {2645} number, {Energy} has {3115} number, {Agriculture} has {3489} number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total number of Hillcrest or Pinecrest?",
            "A": "The total number of the {Hillcrest} is larger."
        },
        {
            "Q": "Which is larger, the total number of Redstone, Brookhaven or Mapleton?",
            "A": "The total number of the {Redstone} is larger."
        },
        {
            "Q": "In the bar Westwood, which has a larger number value: Energy or Hospitality?",
            "A": "{Hospitality} has the larger number value."
        },
        {
            "Q": "In the bar Brookhaven, which has a larger number value: Agriculture, Energy or Hospitality?",
            "A": "{Hospitality} has the larger number value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Energy in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Energy are: {Springvale}, {Redstone}, {Hillcrest}."
        }
    ],
    "VA": []
}