{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {14} bars."
        },
        {
            "Q": "How many stacked segments are in bar Oakvale of this stacked bar chart?",
            "A": "There are {6} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Oakvale}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Stonehill}."
        },
        {
            "Q": "What is the spatial relationship of bar Cedarburg relative to the bar Riverton in terms of horizontal (left/right) direction?",
            "A": "Bar Cedarburg is to the {right} of the bar Riverton."
        },
        {
            "Q": "In the stacked bar of Elmwood, What is the spatial relationship of segment Manufacturing relative to the segment Transportation in terms of vertical (above/below) direction?",
            "A": "Manufacturing segment is positioned {below} the Transportation segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Town has the highest bar in this stacked bar chart?",
            "A": "The Town with the highest bar is {Fairview}."
        },
        {
            "Q": "Which Town has the lowest bar in this stacked bar chart?",
            "A": "The Town with the lowest bar is {Stonehill}."
        },
        {
            "Q": "In the stacked bar representing Stonehill, which segment has the highest value?",
            "A": "The segment with the highest value is {Manufacturing}."
        },
        {
            "Q": "In the stacked bar representing Oakvale, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Retail}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Technology segment within the Oakvale bar in the stacked bar chart?",
            "A": "The value of the Technology segment is {2489.00} number."
        },
        {
            "Q": "What is the value of the Technology segment within the Northfield bar in the stacked bar chart?",
            "A": "The value of the Technology segment is {3633.00} number."
        },
        {
            "Q": "What is the value of the Technology segment within the Silverton bar in the stacked bar chart?",
            "A": "The value of the Technology segment is {1780.00} number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum number among the stacked segments of bar Eastwood?",
            "A": "The maximum number among the stacked segments of bar Eastwood is {4808} number."
        },
        {
            "Q": "What is the minimum number among the stacked segments of bar Riverton?",
            "A": "The minimum number among the stacked segments of bar Riverton is {550} number."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum number of the segment Finance among the bars?",
            "A": "The maximum number among the bars of segment Finance is {5000} number."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum number of the segment Hospitality among the bars?",
            "A": "The minimum number among the bars of segment Hospitality is {979} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Fairview?",
            "A": "The total value of bar Fairview is {21307.00} number."
        },
        {
            "Q": "What is the total value of the bar Redstone?",
            "A": "The total value of bar Redstone is {10357.00} number."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {194251} number."
        },
        {
            "Q": "What is the difference between total value of bar Stonehill and Lakewood?",
            "A": "The difference between between total value of bar Stonehill and Lakewood is {7668} number."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total number values exceed 20318.00 number? Please list the bar and corresponding values.",
            "A": "{Fairview} has {21307} number"
        },
        {
            "Q": "Which bars have total number values below 9701.00 number? Please list the bar and corresponding values.",
            "A": "{Stonehill} has {7589} number, {Riverton} has {9506} number"
        },
        {
            "Q": "For bar Fairview in the stacked bar chart, which segment have number value between 846.5 and 3915.5? Please list the segment and corresponding values.",
            "A": "{Hospitality} has {1693} number, {Finance} has {1783} number, {Transportation} has {3612} number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total number of Redstone or Cedarburg?",
            "A": "The total number of the {Cedarburg} is larger."
        },
        {
            "Q": "Which is larger, the total number of Oakvale, Northfield or Stonehill?",
            "A": "The total number of the {Northfield} is larger."
        },
        {
            "Q": "In the bar Elmwood, which has a larger number value: Transportation or Manufacturing?",
            "A": "{Manufacturing} has the larger number value."
        },
        {
            "Q": "In the bar Riverton, which has a larger number value: Finance, Retail or Technology?",
            "A": "{Technology} has the larger number value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Hospitality in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Hospitality are: {Silverton}, {Lakewood}, {Redstone}."
        }
    ],
    "VA": []
}