{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {6} bars."
        },
        {
            "Q": "How many stacked segments are in bar Brookhaven of this stacked bar chart?",
            "A": "There are {5} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {vertical} stacked bar chart."
        },
        {
            "Q": "Which category does the leftmost bar represent?",
            "A": "The leftmost bar represents {Oakvale}"
        },
        {
            "Q": "Which category does the rightmost bar represent?",
            "A": "The leftmost bar represents {Glenwood}."
        },
        {
            "Q": "What is the spatial relationship of bar Cedarburg relative to the bar Oakvale in terms of horizontal (left/right) direction?",
            "A": "Bar Cedarburg is to the {right} of the bar Oakvale."
        },
        {
            "Q": "In the stacked bar of Mapleton, What is the spatial relationship of segment Transportation relative to the segment Hospitality in terms of vertical (above/below) direction?",
            "A": "Transportation segment is positioned {above} the Hospitality segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Town has the highest bar in this stacked bar chart?",
            "A": "The Town with the highest bar is {Oakvale}."
        },
        {
            "Q": "Which Town has the lowest bar in this stacked bar chart?",
            "A": "The Town with the lowest bar is {Cedarburg}."
        },
        {
            "Q": "In the stacked bar representing Brookhaven, which segment has the highest value?",
            "A": "The segment with the highest value is {Hospitality}."
        },
        {
            "Q": "In the stacked bar representing Mapleton, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Agriculture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Transportation segment within the Cedarburg bar in the stacked bar chart?",
            "A": "The value of the Transportation segment is {1779.00} number."
        },
        {
            "Q": "What is the value of the Agriculture segment within the Eastwood bar in the stacked bar chart?",
            "A": "The value of the Agriculture segment is {550.00} number."
        },
        {
            "Q": "What is the value of the Manufacturing segment within the Brookhaven bar in the stacked bar chart?",
            "A": "The value of the Manufacturing segment is {1223.00} number."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum number among the stacked segments of bar Eastwood?",
            "A": "The maximum number among the stacked segments of bar Eastwood is {3267} number."
        },
        {
            "Q": "What is the minimum number among the stacked segments of bar Brookhaven?",
            "A": "The minimum number among the stacked segments of bar Brookhaven is {757} number."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum number of the segment Transportation among the bars?",
            "A": "The maximum number among the bars of segment Transportation is {3267} number."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum number of the segment Telecom among the bars?",
            "A": "The minimum number among the bars of segment Telecom is {550} number."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar Oakvale?",
            "A": "The total value of bar Oakvale is {9544.00} number."
        },
        {
            "Q": "What is the total value of the bar Eastwood?",
            "A": "The total value of bar Eastwood is {8340.00} number."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {45429} number."
        },
        {
            "Q": "What is the difference between total value of bar Cedarburg and Oakvale?",
            "A": "The difference between between total value of bar Cedarburg and Oakvale is {5147} number."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total number values exceed 9366.00 number? Please list the bar and corresponding values.",
            "A": "{Oakvale} has {9544} number"
        },
        {
            "Q": "Which bars have total number values below 5126.50 number? Please list the bar and corresponding values.",
            "A": "{Cedarburg} has {4397} number"
        },
        {
            "Q": "For bar Glenwood in the stacked bar chart, which segment have number value between 949.5 and 3191? Please list the segment and corresponding values.",
            "A": "{Telecom} has {956} number, {Manufacturing} has {2641} number."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total number of Brookhaven or Oakvale?",
            "A": "The total number of the {Oakvale} is larger."
        },
        {
            "Q": "Which is larger, the total number of Eastwood, Glenwood or Cedarburg?",
            "A": "The total number of the {Eastwood} is larger."
        },
        {
            "Q": "In the bar Glenwood, which has a larger number value: Telecom or Manufacturing?",
            "A": "{Manufacturing} has the larger number value."
        },
        {
            "Q": "In the bar Brookhaven, which has a larger number value: Agriculture, Hospitality or Transportation?",
            "A": "{Hospitality} has the larger number value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Hospitality in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Hospitality are: {Brookhaven}, {Cedarburg}, {Eastwood}."
        }
    ],
    "VA": []
}