{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {stacked bar chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many bars are in this stacked bar chart?",
            "A": "There are {7} bars."
        },
        {
            "Q": "How many stacked segments are in bar 2024 of this stacked bar chart?",
            "A": "There are {3} stacked bars."
        }
    ],
    "SRP": [
        {
            "Q": "Is this stacked bar chart a horizontal stacked bar chart or a vertical stacked bar chart?",
            "A": "The stacked bar chart is a {horizontal} stacked bar chart."
        },
        {
            "Q": "Which category does the bottom bar represent?",
            "A": "The bottom bar represents {2009}"
        },
        {
            "Q": "Which category does the topmost bar represent?",
            "A": "The bottom bar represents {2024}."
        },
        {
            "Q": "What is the spatial relationship of bar 2020 relative to the bar 2023 in terms of vertical (below/above) direction??",
            "A": "Bar 2020 is {below} the bar 2023."
        },
        {
            "Q": "In the stacked bar of 2017, What is the spatial relationship of segment Semi-Detached House relative to the segment Duplex in terms of horizontal (left/right) direction?",
            "A": "Semi-Detached House segment is positioned {right} the Duplex segment."
        }
    ],
    "VPR": [
        {
            "Q": "Which Year has the highest bar in this stacked bar chart?",
            "A": "The Year with the highest bar is {2009}."
        },
        {
            "Q": "Which Year has the lowest bar in this stacked bar chart?",
            "A": "The Year with the lowest bar is {2024}."
        },
        {
            "Q": "In the stacked bar representing 2019, which segment has the highest value?",
            "A": "The segment with the highest value is {Semi-Detached House}."
        },
        {
            "Q": "In the stacked bar representing 2023, which segment has the lowest value?",
            "A": "The segment with the lowest value is {Cottage}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Duplex segment within the 2023 bar in the stacked bar chart?",
            "A": "The value of the Duplex segment is {234.00} thousand USD."
        },
        {
            "Q": "What is the value of the Semi-Detached House segment within the 2009 bar in the stacked bar chart?",
            "A": "The value of the Semi-Detached House segment is {220.00} thousand USD."
        },
        {
            "Q": "What is the value of the Cottage segment within the 2024 bar in the stacked bar chart?",
            "A": "The value of the Cottage segment is {255.00} thousand USD."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum thousand USD among the stacked segments of bar 2009?",
            "A": "The maximum thousand USD among the stacked segments of bar 2009 is {1000} thousand USD."
        },
        {
            "Q": "What is the minimum thousand USD among the stacked segments of bar 2019?",
            "A": "The minimum thousand USD among the stacked segments of bar 2019 is {248} thousand USD."
        },
        {
            "Q": "In the stacked bar chart, what is the maximum thousand USD of the segment Duplex among the bars?",
            "A": "The maximum thousand USD among the bars of segment Duplex is {1000} thousand USD."
        },
        {
            "Q": "In the stacked bar chart, what is the minimum thousand USD of the segment Semi-Detached House among the bars?",
            "A": "The minimum thousand USD among the bars of segment Semi-Detached House is {206} thousand USD."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the bar 2020?",
            "A": "The total value of bar 2020 is {998.00} thousand USD."
        },
        {
            "Q": "What is the total value of the bar 2017?",
            "A": "The total value of bar 2017 is {1104.00} thousand USD."
        },
        {
            "Q": "What is the total value of all columns?",
            "A": "The total value of columns is {7922} thousand USD."
        },
        {
            "Q": "What is the difference between total value of bar 2024 and 2022?",
            "A": "The difference between between total value of bar 2024 and 2022 is {170} thousand USD."
        }
    ],
    "NF": [
        {
            "Q": "Which bars have total thousand USD values exceed 1412.00 thousand USD? Please list the bar and corresponding values.",
            "A": "{2019} has {1444} thousand USD, {2009} has {1446} thousand USD"
        },
        {
            "Q": "Which bars have total thousand USD values below 1051.00 thousand USD? Please list the bar and corresponding values.",
            "A": "{2024} has {690} thousand USD, {2022} has {860} thousand USD, {2020} has {998} thousand USD"
        },
        {
            "Q": "For bar 2017 in the stacked bar chart, which segment have thousand USD value between 141.0 and 295.5? Please list the segment and corresponding values.",
            "A": "{Duplex} has {282} thousand USD."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the total thousand USD of 2009 or 2022?",
            "A": "The total thousand USD of the {2009} is larger."
        },
        {
            "Q": "Which is larger, the total thousand USD of 2019, 2022 or 2023?",
            "A": "The total thousand USD of the {2019} is larger."
        },
        {
            "Q": "In the bar 2022, which has a larger thousand USD value: Duplex or Semi-Detached House?",
            "A": "{Duplex} has the larger thousand USD value."
        },
        {
            "Q": "In the bar 2009, which has a larger thousand USD value: Semi-Detached House, Duplex or Cottage?",
            "A": "{Duplex} has the larger thousand USD value."
        }
    ],
    "MSR": [
        {
            "Q": "Ranking bar by the value of segment Duplex in descending order, which are the top three countries(if the number of bars is less 3,list the existing bars in descending order)?",
            "A": "The top three bar ranked by the value of segment Duplex are: {2009}, {2022}, {2017}."
        }
    ],
    "VA": []
}