{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Royal Academy?",
            "A": "The next arc clockwise from arc Royal Academy is arc {Alex Laboratory}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc NIT?",
            "A": "The next arc counterclockwise from arc NIT is arc {Alex Laboratory}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Royal Academy} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{NIT} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Alex Laboratory to Royal Academy in the chord chart?",
            "A": "The flow value is {43}."
        },
        {
            "Q": "What is the flow value from Royal Academy to Alex Laboratory in the chord chart?",
            "A": "The flow value is {23}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between NIT and Alex Laboratory in the chord chart?",
            "A": "The maximum flow value between NIT and Alex Laboratory is {22}."
        },
        {
            "Q": "What is the minimum flow value between Royal Academy and Alex Laboratory in the chord chart?",
            "A": "The minimum flow value between Royal Academy and Alex Laboratory is {23}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {52}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {9}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Alex Laboratory?",
            "A": "The total flow output from Alex Laboratory is {52}."
        },
        {
            "Q": "What is the total flow input by Alex Laboratory?",
            "A": "The total flow input by Alex Laboratory is {45}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 47? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {52} from {Royal Academy} to {NIT}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 22? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {9} from {Alex Laboratory} to {NIT}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 22 and 32? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {22} from {NIT} to {Alex Laboratory}, a flow of {23} from {Royal Academy} to {Alex Laboratory}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Royal Academy to Alex Laboratory or from Alex Laboratory to Royal Academy?",
            "A": "The flow from {Alex Laboratory} to {Royal Academy} is larger."
        },
        {
            "Q": "Which flow is the largest: from NIT to Alex Laboratory, from NIT to Royal Academy, or from Royal Academy to NIT?",
            "A": "The flow from {Royal Academy} to {NIT} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Alex Laboratory}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {NIT} and {Royal Academy}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc NIT, Arc Royal Academy, Arc Alex Laboratory}."
        }
    ]
}