{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {6} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {5} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Herman Research Center?",
            "A": "The next arc clockwise from arc Herman Research Center is arc {Fleming-Rosario Academy}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Williams University?",
            "A": "The next arc counterclockwise from arc Williams University is arc {Fleming-Rosario Academy}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Williams University} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Herman Research Center} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Royal Academy to Alex Laboratory in the chord chart?",
            "A": "The flow value is {46}."
        },
        {
            "Q": "What is the flow value from Royal Academy to Fleming-Rosario Academy in the chord chart?",
            "A": "The flow value is {48}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Herman Research Center and Alex Laboratory in the chord chart?",
            "A": "The maximum flow value between Herman Research Center and Alex Laboratory is {54}."
        },
        {
            "Q": "What is the minimum flow value between Alex Laboratory and Herman Research Center in the chord chart?",
            "A": "The minimum flow value between Alex Laboratory and Herman Research Center is {11}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {56}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {6}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Royal Academy?",
            "A": "The total flow output from Royal Academy is {94}."
        },
        {
            "Q": "What is the total flow input by Williams University?",
            "A": "The total flow input by Williams University is {75}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 55? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {56} from {Williams University} to {Herman Research Center}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 10? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {6} from {Alex Laboratory} to {Royal Academy}, a flow of {9} from {Williams University} to {Alex Laboratory}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 25 and 43? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {27} from {Fleming-Rosario Academy} to {Royal Academy}, a flow of {40} from {Fleming-Rosario Academy} to {Alex Laboratory}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Herman Research Center to Williams University or from Fleming-Rosario Academy to Alex Laboratory?",
            "A": "The flow from {Fleming-Rosario Academy} to {Alex Laboratory} is larger."
        },
        {
            "Q": "Which flow is the largest: from Alex Laboratory to Royal Academy, from Alex Laboratory to Williams University, or from Williams University to Alex Laboratory?",
            "A": "The flow from {Alex Laboratory} to {Williams University} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Royal Academy}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Herman Research Center} and {Williams University}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Herman Research Center, Arc Williams University, Arc Alex Laboratory, Arc Fleming-Rosario Academy, Arc Royal Academy}."
        }
    ]
}