{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {6} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {5} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Fleming-Rosario Academy?",
            "A": "The next arc clockwise from arc Fleming-Rosario Academy is arc {Alex Laboratory}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Adriantown College?",
            "A": "The next arc counterclockwise from arc Adriantown College is arc {Odonnell Laboratory}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Odonnell Laboratory} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Adriantown College} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Alex Laboratory to Royal Academy in the chord chart?",
            "A": "The flow value is {10}."
        },
        {
            "Q": "What is the flow value from Alex Laboratory to Adriantown College in the chord chart?",
            "A": "The flow value is {21}."
        },
        {
            "Q": "What is the flow value from Adriantown College to Odonnell Laboratory in the chord chart?",
            "A": "The flow value is {66}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Royal Academy and Adriantown College in the chord chart?",
            "A": "The maximum flow value between Royal Academy and Adriantown College is {19}."
        },
        {
            "Q": "What is the minimum flow value between Royal Academy and Alex Laboratory in the chord chart?",
            "A": "The minimum flow value between Royal Academy and Alex Laboratory is {10}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {130}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {10}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Odonnell Laboratory?",
            "A": "The total flow output from Odonnell Laboratory is {130}."
        },
        {
            "Q": "What is the total flow input by Odonnell Laboratory?",
            "A": "The total flow input by Odonnell Laboratory is {66}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 36? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {130} from {Odonnell Laboratory} to {Adriantown College}, a flow of {66} from {Adriantown College} to {Odonnell Laboratory}, a flow of {40} from {Fleming-Rosario Academy} to {Adriantown College}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 10? Please list the source node, target node, and the corresponding flow value.",
            "A": "No pairs have a flow less than the threshold."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 14 and 22? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {21} from {Alex Laboratory} to {Adriantown College}, a flow of {19} from {Adriantown College} to {Royal Academy}, a flow of {15} from {Royal Academy} to {Adriantown College}, a flow of {14} from {Fleming-Rosario Academy} to {Royal Academy}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Adriantown College to Odonnell Laboratory or from Fleming-Rosario Academy to Adriantown College?",
            "A": "The flow from {Adriantown College} to {Odonnell Laboratory} is larger."
        },
        {
            "Q": "Which flow is the largest: from Adriantown College to Odonnell Laboratory, from Fleming-Rosario Academy to Royal Academy, or from Fleming-Rosario Academy to Adriantown College?",
            "A": "The flow from {Adriantown College} to {Odonnell Laboratory} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Odonnell Laboratory}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Adriantown College} and {Odonnell Laboratory}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Fleming-Rosario Academy, Arc Adriantown College, Arc Odonnell Laboratory, Arc Royal Academy, Arc Alex Laboratory}."
        }
    ]
}