{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc VidVault?",
            "A": "The next arc clockwise from arc VidVault is arc {FlickFlare}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc FlickFlare?",
            "A": "The next arc counterclockwise from arc FlickFlare is arc {VidVault}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{StreamSphere} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{FanConnect} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from VidVault to StreamSphere in the chord chart?",
            "A": "The flow value is {652}."
        },
        {
            "Q": "What is the flow value from FlickFlare to VidVault in the chord chart?",
            "A": "The flow value is {1}."
        },
        {
            "Q": "What is the flow value from VidVault to FlickFlare in the chord chart?",
            "A": "The flow value is {73}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between FanConnect and FlickFlare in the chord chart?",
            "A": "The maximum flow value between FanConnect and FlickFlare is {477}."
        },
        {
            "Q": "What is the minimum flow value between StreamSphere and FanConnect in the chord chart?",
            "A": "The minimum flow value between StreamSphere and FanConnect is {515}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {751}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {1}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from StreamSphere?",
            "A": "The total flow output from StreamSphere is {1272}."
        },
        {
            "Q": "What is the total flow input by FanConnect?",
            "A": "The total flow input by FanConnect is {1417}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 701? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {751} from {StreamSphere} to {FanConnect}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 187? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {184} from {FlickFlare} to {FanConnect}, a flow of {1} from {FlickFlare} to {VidVault}, a flow of {73} from {VidVault} to {FlickFlare}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 187 and 498? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {477} from {FanConnect} to {FlickFlare}, a flow of {190} from {FanConnect} to {VidVault}, a flow of {482} from {VidVault} to {FanConnect}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from StreamSphere to FanConnect or from FlickFlare to VidVault?",
            "A": "The flow from {StreamSphere} to {FanConnect} is larger."
        },
        {
            "Q": "Which flow is the largest: from VidVault to FanConnect, from FanConnect to FlickFlare, or from FanConnect to StreamSphere?",
            "A": "The flow from {FanConnect} to {StreamSphere} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {VidVault}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {FanConnect} and {StreamSphere}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc VidVault, Arc StreamSphere, Arc FanConnect, Arc FlickFlare}."
        }
    ]
}