{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {5} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc GameCast?",
            "A": "The next arc clockwise from arc GameCast is arc {FlickFlare}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc VidVault?",
            "A": "The next arc counterclockwise from arc VidVault is arc {FlickFlare}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{GameCast} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{FlickFlare} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from VidVault to GameCast in the chord chart?",
            "A": "The flow value is {242}."
        },
        {
            "Q": "What is the flow value from StreamSphere to ChirpNet in the chord chart?",
            "A": "The flow value is {163}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between GameCast and FlickFlare in the chord chart?",
            "A": "The maximum flow value between GameCast and FlickFlare is {276}."
        },
        {
            "Q": "What is the minimum flow value between GameCast and StreamSphere in the chord chart?",
            "A": "The minimum flow value between GameCast and StreamSphere is {119}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {276}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {84}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from GameCast?",
            "A": "The total flow output from GameCast is {596}."
        },
        {
            "Q": "What is the total flow input by StreamSphere?",
            "A": "The total flow input by StreamSphere is {395}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 241? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {276} from {GameCast} to {FlickFlare}, a flow of {242} from {VidVault} to {GameCast}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 113? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {107} from {StreamSphere} to {FlickFlare}, a flow of {84} from {FlickFlare} to {StreamSphere}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 132 and 196? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {192} from {ChirpNet} to {StreamSphere}, a flow of {163} from {StreamSphere} to {ChirpNet}, a flow of {146} from {StreamSphere} to {GameCast}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from GameCast to VidVault or from StreamSphere to GameCast?",
            "A": "The flow from {GameCast} to {VidVault} is larger."
        },
        {
            "Q": "Which flow is the largest: from StreamSphere to GameCast, from GameCast to StreamSphere, or from GameCast to VidVault?",
            "A": "The flow from {GameCast} to {VidVault} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {VidVault}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {FlickFlare} and {GameCast}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc FlickFlare, Arc GameCast, Arc StreamSphere, Arc VidVault, Arc ChirpNet}."
        }
    ]
}