{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {4} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc New Chiefs?",
            "A": "The next arc clockwise from arc New Chiefs is arc {Bensonborough Storm}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc South Stars?",
            "A": "The next arc counterclockwise from arc South Stars is arc {Poolechester Dynasty}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Bensonborough Storm} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Poolechester Dynasty} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from South Stars to Bensonborough Storm in the chord chart?",
            "A": "The flow value is {264}."
        },
        {
            "Q": "What is the flow value from South Stars to Poolechester Dynasty in the chord chart?",
            "A": "The flow value is {418}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Poolechester Dynasty and Bensonborough Storm in the chord chart?",
            "A": "The maximum flow value between Poolechester Dynasty and Bensonborough Storm is {672}."
        },
        {
            "Q": "What is the minimum flow value between South Stars and Bensonborough Storm in the chord chart?",
            "A": "The minimum flow value between South Stars and Bensonborough Storm is {199}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {672}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {199}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Bensonborough Storm?",
            "A": "The total flow output from Bensonborough Storm is {871}."
        },
        {
            "Q": "What is the total flow input by New Chiefs?",
            "A": "The total flow input by New Chiefs is {520}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 499? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {672} from {Bensonborough Storm} to {Poolechester Dynasty}, a flow of {631} from {Poolechester Dynasty} to {Bensonborough Storm}, a flow of {520} from {South Stars} to {New Chiefs}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 297? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {264} from {South Stars} to {Bensonborough Storm}, a flow of {199} from {Bensonborough Storm} to {South Stars}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 374 and 499? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {479} from {New Chiefs} to {South Stars}, a flow of {418} from {South Stars} to {Poolechester Dynasty}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Bensonborough Storm to South Stars or from South Stars to Bensonborough Storm?",
            "A": "The flow from {South Stars} to {Bensonborough Storm} is larger."
        },
        {
            "Q": "Which flow is the largest: from Bensonborough Storm to South Stars, from South Stars to New Chiefs, or from New Chiefs to South Stars?",
            "A": "The flow from {South Stars} to {New Chiefs} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {South Stars}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Bensonborough Storm} and {Poolechester Dynasty}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Poolechester Dynasty, Arc Bensonborough Storm, Arc South Stars, Arc New Chiefs}."
        }
    ]
}