{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Hannah?",
            "A": "The next arc clockwise from arc Hannah is arc {Lake Sherry}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Kristenmouth?",
            "A": "The next arc counterclockwise from arc Kristenmouth is arc {Lake Sherry}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Kristenmouth} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Hannah} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Kristenmouth to Lake Sherry in the chord chart?",
            "A": "The flow value is {328}."
        },
        {
            "Q": "What is the flow value from Hannah to Lake Sherry in the chord chart?",
            "A": "The flow value is {118}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Kristenmouth and Lake Sherry in the chord chart?",
            "A": "The maximum flow value between Kristenmouth and Lake Sherry is {672}."
        },
        {
            "Q": "What is the minimum flow value between Lake Sherry and Kristenmouth in the chord chart?",
            "A": "The minimum flow value between Lake Sherry and Kristenmouth is {328}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {808}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {118}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Kristenmouth?",
            "A": "The total flow output from Kristenmouth is {1136}."
        },
        {
            "Q": "What is the total flow input by Lake Sherry?",
            "A": "The total flow input by Lake Sherry is {446}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 740? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {808} from {Kristenmouth} to {Hannah}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 326? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {118} from {Hannah} to {Lake Sherry}, a flow of {324} from {Lake Sherry} to {Hannah}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 221 and 651? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {324} from {Lake Sherry} to {Hannah}, a flow of {630} from {Hannah} to {Kristenmouth}, a flow of {328} from {Kristenmouth} to {Lake Sherry}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Lake Sherry to Hannah or from Hannah to Kristenmouth?",
            "A": "The flow from {Hannah} to {Kristenmouth} is larger."
        },
        {
            "Q": "Which flow is the largest: from Lake Sherry to Hannah, from Lake Sherry to Kristenmouth, or from Hannah to Kristenmouth?",
            "A": "The flow from {Lake Sherry} to {Kristenmouth} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Lake Sherry}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Hannah} and {Kristenmouth}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Hannah, Arc Kristenmouth, Arc Lake Sherry}."
        }
    ]
}