{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Bensonborough Storm?",
            "A": "The next arc clockwise from arc Bensonborough Storm is arc {Eddiehaven Panthers}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Bensonborough Storm?",
            "A": "The next arc counterclockwise from arc Bensonborough Storm is arc {New Chiefs}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Bensonborough Storm} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{New Chiefs} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Eddiehaven Panthers to Bensonborough Storm in the chord chart?",
            "A": "The flow value is {304}."
        },
        {
            "Q": "What is the flow value from Eddiehaven Panthers to New Chiefs in the chord chart?",
            "A": "The flow value is {317}."
        },
        {
            "Q": "What is the flow value from New Chiefs to Bensonborough Storm in the chord chart?",
            "A": "The flow value is {636}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between New Chiefs and Bensonborough Storm in the chord chart?",
            "A": "The maximum flow value between New Chiefs and Bensonborough Storm is {733}."
        },
        {
            "Q": "What is the minimum flow value between New Chiefs and Eddiehaven Panthers in the chord chart?",
            "A": "The minimum flow value between New Chiefs and Eddiehaven Panthers is {317}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {733}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {107}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from New Chiefs?",
            "A": "The total flow output from New Chiefs is {1248}."
        },
        {
            "Q": "What is the total flow input by Eddiehaven Panthers?",
            "A": "The total flow input by Eddiehaven Panthers is {719}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 624? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {636} from {New Chiefs} to {Bensonborough Storm}, a flow of {733} from {Bensonborough Storm} to {New Chiefs}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 310? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {107} from {Bensonborough Storm} to {Eddiehaven Panthers}, a flow of {304} from {Eddiehaven Panthers} to {Bensonborough Storm}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 310 and 464? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {317} from {Eddiehaven Panthers} to {New Chiefs}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Eddiehaven Panthers to Bensonborough Storm or from Eddiehaven Panthers to New Chiefs?",
            "A": "The flow from {Eddiehaven Panthers} to {New Chiefs} is larger."
        },
        {
            "Q": "Which flow is the largest: from Eddiehaven Panthers to Bensonborough Storm, from New Chiefs to Eddiehaven Panthers, or from Bensonborough Storm to Eddiehaven Panthers?",
            "A": "The flow from {New Chiefs} to {Eddiehaven Panthers} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {New Chiefs}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Bensonborough Storm} and {New Chiefs}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Bensonborough Storm, Arc New Chiefs, Arc Eddiehaven Panthers}."
        }
    ]
}