{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Rebeccaview Dolphins?",
            "A": "The next arc clockwise from arc Rebeccaview Dolphins is arc {Cherylberg Sharks}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc South Stars?",
            "A": "The next arc counterclockwise from arc South Stars is arc {Cherylberg Sharks}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Rebeccaview Dolphins} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{South Stars} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from South Stars to Rebeccaview Dolphins in the chord chart?",
            "A": "The flow value is {602}."
        },
        {
            "Q": "What is the flow value from Rebeccaview Dolphins to Cherylberg Sharks in the chord chart?",
            "A": "The flow value is {95}."
        },
        {
            "Q": "What is the flow value from Cherylberg Sharks to Rebeccaview Dolphins in the chord chart?",
            "A": "The flow value is {297}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Rebeccaview Dolphins and Cherylberg Sharks in the chord chart?",
            "A": "The maximum flow value between Rebeccaview Dolphins and Cherylberg Sharks is {297}."
        },
        {
            "Q": "What is the minimum flow value between Rebeccaview Dolphins and South Stars in the chord chart?",
            "A": "The minimum flow value between Rebeccaview Dolphins and South Stars is {602}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {708}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {95}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from South Stars?",
            "A": "The total flow output from South Stars is {1187}."
        },
        {
            "Q": "What is the total flow input by Cherylberg Sharks?",
            "A": "The total flow input by Cherylberg Sharks is {680}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 442? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {602} from {South Stars} to {Rebeccaview Dolphins}, a flow of {708} from {Rebeccaview Dolphins} to {South Stars}, a flow of {585} from {South Stars} to {Cherylberg Sharks}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 298? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {95} from {Rebeccaview Dolphins} to {Cherylberg Sharks}, a flow of {297} from {Cherylberg Sharks} to {Rebeccaview Dolphins}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 298 and 442? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {299} from {Cherylberg Sharks} to {South Stars}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from South Stars to Cherylberg Sharks or from Cherylberg Sharks to South Stars?",
            "A": "The flow from {South Stars} to {Cherylberg Sharks} is larger."
        },
        {
            "Q": "Which flow is the largest: from Rebeccaview Dolphins to Cherylberg Sharks, from South Stars to Cherylberg Sharks, or from South Stars to Rebeccaview Dolphins?",
            "A": "The flow from {South Stars} to {Rebeccaview Dolphins} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {South Stars}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Rebeccaview Dolphins} and {South Stars}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Cherylberg Sharks, Arc South Stars, Arc Rebeccaview Dolphins}."
        }
    ]
}