{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Hunterfort?",
            "A": "The next arc clockwise from arc Hunterfort is arc {Martinstad}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Angelaview?",
            "A": "The next arc counterclockwise from arc Angelaview is arc {Martinstad}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Hunterfort} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Angelaview} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Martinstad to Hunterfort in the chord chart?",
            "A": "The flow value is {465}."
        },
        {
            "Q": "What is the flow value from Martinstad to Angelaview in the chord chart?",
            "A": "The flow value is {80}."
        },
        {
            "Q": "What is the flow value from Angelaview to Hunterfort in the chord chart?",
            "A": "The flow value is {453}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Hunterfort and Angelaview in the chord chart?",
            "A": "The maximum flow value between Hunterfort and Angelaview is {587}."
        },
        {
            "Q": "What is the minimum flow value between Martinstad and Hunterfort in the chord chart?",
            "A": "The minimum flow value between Martinstad and Hunterfort is {226}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {587}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {80}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Martinstad?",
            "A": "The total flow output from Martinstad is {545}."
        },
        {
            "Q": "What is the total flow input by Martinstad?",
            "A": "The total flow input by Martinstad is {460}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 526? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {587} from {Hunterfort} to {Angelaview}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 230? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {80} from {Martinstad} to {Angelaview}, a flow of {226} from {Hunterfort} to {Martinstad}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 230 and 459? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {234} from {Angelaview} to {Martinstad}, a flow of {453} from {Angelaview} to {Hunterfort}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Hunterfort to Martinstad or from Angelaview to Martinstad?",
            "A": "The flow from {Angelaview} to {Martinstad} is larger."
        },
        {
            "Q": "Which flow is the largest: from Martinstad to Angelaview, from Angelaview to Hunterfort, or from Angelaview to Martinstad?",
            "A": "The flow from {Angelaview} to {Hunterfort} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Martinstad}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Angelaview} and {Hunterfort}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Hunterfort, Arc Angelaview, Arc Martinstad}."
        }
    ]
}