{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Christine?",
            "A": "The next arc clockwise from arc Christine is arc {Angelaview}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Brandonburgh?",
            "A": "The next arc counterclockwise from arc Brandonburgh is arc {Angelaview}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Christine} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Brandonburgh} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Christine to Brandonburgh in the chord chart?",
            "A": "The flow value is {740}."
        },
        {
            "Q": "What is the flow value from Angelaview to Brandonburgh in the chord chart?",
            "A": "The flow value is {78}."
        },
        {
            "Q": "What is the flow value from Angelaview to Christine in the chord chart?",
            "A": "The flow value is {51}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Christine and Angelaview in the chord chart?",
            "A": "The maximum flow value between Christine and Angelaview is {593}."
        },
        {
            "Q": "What is the minimum flow value between Angelaview and Christine in the chord chart?",
            "A": "The minimum flow value between Angelaview and Christine is {51}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {740}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {14}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Brandonburgh?",
            "A": "The total flow output from Brandonburgh is {469}."
        },
        {
            "Q": "What is the total flow input by Christine?",
            "A": "The total flow input by Christine is {65}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 666? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {740} from {Christine} to {Brandonburgh}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 266? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {51} from {Angelaview} to {Christine}, a flow of {78} from {Angelaview} to {Brandonburgh}, a flow of {14} from {Brandonburgh} to {Christine}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 64 and 524? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {455} from {Brandonburgh} to {Angelaview}, a flow of {78} from {Angelaview} to {Brandonburgh}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Christine to Brandonburgh or from Brandonburgh to Christine?",
            "A": "The flow from {Christine} to {Brandonburgh} is larger."
        },
        {
            "Q": "Which flow is the largest: from Christine to Angelaview, from Angelaview to Christine, or from Angelaview to Brandonburgh?",
            "A": "The flow from {Christine} to {Angelaview} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Christine}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Brandonburgh} and {Christine}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Brandonburgh, Arc Christine, Arc Angelaview}."
        }
    ]
}