{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {5} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Central Station?",
            "A": "The next arc clockwise from arc Central Station is arc {Skyline Station}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Harbor Point?",
            "A": "The next arc counterclockwise from arc Harbor Point is arc {Skyline Station}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Grand Terminal} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{East Junction} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Skyline Station to Central Station in the chord chart?",
            "A": "The flow value is {29}."
        },
        {
            "Q": "What is the flow value from Central Station to Skyline Station in the chord chart?",
            "A": "The flow value is {30}."
        },
        {
            "Q": "What is the flow value from East Junction to Grand Terminal in the chord chart?",
            "A": "The flow value is {106}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Grand Terminal and Central Station in the chord chart?",
            "A": "The maximum flow value between Grand Terminal and Central Station is {95}."
        },
        {
            "Q": "What is the minimum flow value between East Junction and Grand Terminal in the chord chart?",
            "A": "The minimum flow value between East Junction and Grand Terminal is {106}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {141}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {9}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Skyline Station?",
            "A": "The total flow output from Skyline Station is {194}."
        },
        {
            "Q": "What is the total flow input by Skyline Station?",
            "A": "The total flow input by Skyline Station is {121}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 100? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {141} from {Grand Terminal} to {East Junction}, a flow of {106} from {East Junction} to {Grand Terminal}, a flow of {118} from {Skyline Station} to {East Junction}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 19? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {9} from {East Junction} to {Skyline Station}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 38 and 88? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {47} from {Skyline Station} to {Harbor Point}, a flow of {82} from {Harbor Point} to {Skyline Station}, a flow of {59} from {Grand Terminal} to {Central Station}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Harbor Point to Skyline Station or from Skyline Station to East Junction?",
            "A": "The flow from {Skyline Station} to {East Junction} is larger."
        },
        {
            "Q": "Which flow is the largest: from Skyline Station to Harbor Point, from Skyline Station to Central Station, or from Harbor Point to Skyline Station?",
            "A": "The flow from {Harbor Point} to {Skyline Station} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Harbor Point}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {East Junction} and {Grand Terminal}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc East Junction, Arc Grand Terminal, Arc Central Station, Arc Skyline Station, Arc Harbor Point}."
        }
    ]
}