{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Central Station?",
            "A": "The next arc clockwise from arc Central Station is arc {Grand Terminal}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Grand Terminal?",
            "A": "The next arc counterclockwise from arc Grand Terminal is arc {Central Station}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Skyline Station} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Central Station} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Grand Terminal to Skyline Station in the chord chart?",
            "A": "The flow value is {99}."
        },
        {
            "Q": "What is the flow value from Central Station to Grand Terminal in the chord chart?",
            "A": "The flow value is {33}."
        },
        {
            "Q": "What is the flow value from Skyline Station to Grand Terminal in the chord chart?",
            "A": "The flow value is {69}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Skyline Station and Grand Terminal in the chord chart?",
            "A": "The maximum flow value between Skyline Station and Grand Terminal is {99}."
        },
        {
            "Q": "What is the minimum flow value between Skyline Station and Central Station in the chord chart?",
            "A": "The minimum flow value between Skyline Station and Central Station is {173}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {207}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {33}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Grand Terminal?",
            "A": "The total flow output from Grand Terminal is {229}."
        },
        {
            "Q": "What is the total flow input by Grand Terminal?",
            "A": "The total flow input by Grand Terminal is {102}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 151? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {207} from {Skyline Station} to {Central Station}, a flow of {173} from {Central Station} to {Skyline Station}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 84? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {33} from {Central Station} to {Grand Terminal}, a flow of {69} from {Skyline Station} to {Grand Terminal}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 84 and 114? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {99} from {Grand Terminal} to {Skyline Station}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Central Station to Skyline Station or from Grand Terminal to Central Station?",
            "A": "The flow from {Central Station} to {Skyline Station} is larger."
        },
        {
            "Q": "Which flow is the largest: from Grand Terminal to Skyline Station, from Central Station to Skyline Station, or from Skyline Station to Central Station?",
            "A": "The flow from {Skyline Station} to {Central Station} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Grand Terminal}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Central Station} and {Skyline Station}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Skyline Station, Arc Central Station, Arc Grand Terminal}."
        }
    ]
}