{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {6} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {5} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc East Junction?",
            "A": "The next arc clockwise from arc East Junction is arc {Skyline Station}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc East Junction?",
            "A": "The next arc counterclockwise from arc East Junction is arc {Harbor Point}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Harbor Point} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Skyline Station} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from South Gate to Skyline Station in the chord chart?",
            "A": "The flow value is {3}."
        },
        {
            "Q": "What is the flow value from South Gate to East Junction in the chord chart?",
            "A": "The flow value is {74}."
        },
        {
            "Q": "What is the flow value from Harbor Point to East Junction in the chord chart?",
            "A": "The flow value is {53}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between South Gate and Metro Center in the chord chart?",
            "A": "The maximum flow value between South Gate and Metro Center is {145}."
        },
        {
            "Q": "What is the minimum flow value between East Junction and Harbor Point in the chord chart?",
            "A": "The minimum flow value between East Junction and Harbor Point is {16}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {190}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {3}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from East Junction?",
            "A": "The total flow output from East Junction is {201}."
        },
        {
            "Q": "What is the total flow input by East Junction?",
            "A": "The total flow input by East Junction is {236}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 123? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {145} from {South Gate} to {Metro Center}, a flow of {190} from {Harbor Point} to {Skyline Station}, a flow of {138} from {Skyline Station} to {South Gate}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 63? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {3} from {South Gate} to {Skyline Station}, a flow of {53} from {Harbor Point} to {East Junction}, a flow of {16} from {East Junction} to {Harbor Point}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 74 and 96? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {88} from {East Junction} to {Skyline Station}, a flow of {74} from {South Gate} to {East Junction}, a flow of {96} from {Metro Center} to {South Gate}, a flow of {75} from {Skyline Station} to {Harbor Point}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Skyline Station to East Junction or from South Gate to Metro Center?",
            "A": "The flow from {South Gate} to {Metro Center} is larger."
        },
        {
            "Q": "Which flow is the largest: from Harbor Point to Skyline Station, from South Gate to Metro Center, or from East Junction to South Gate?",
            "A": "The flow from {Harbor Point} to {Skyline Station} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Harbor Point}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Harbor Point} and {Skyline Station}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Metro Center, Arc South Gate, Arc East Junction, Arc Skyline Station, Arc Harbor Point}."
        }
    ]
}