{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Grand Terminal?",
            "A": "The next arc clockwise from arc Grand Terminal is arc {Valley Terminal}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Valley Terminal?",
            "A": "The next arc counterclockwise from arc Valley Terminal is arc {Grand Terminal}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Metro Center} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Harbor Point} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Metro Center to Harbor Point in the chord chart?",
            "A": "The flow value is {381}."
        },
        {
            "Q": "What is the flow value from Grand Terminal to Harbor Point in the chord chart?",
            "A": "The flow value is {52}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Harbor Point and Metro Center in the chord chart?",
            "A": "The maximum flow value between Harbor Point and Metro Center is {381}."
        },
        {
            "Q": "What is the minimum flow value between Metro Center and Grand Terminal in the chord chart?",
            "A": "The minimum flow value between Metro Center and Grand Terminal is {90}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {381}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {38}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Valley Terminal?",
            "A": "The total flow output from Valley Terminal is {109}."
        },
        {
            "Q": "What is the total flow input by Harbor Point?",
            "A": "The total flow input by Harbor Point is {504}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 280? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {381} from {Metro Center} to {Harbor Point}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 40? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {38} from {Valley Terminal} to {Metro Center}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 48 and 80? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {71} from {Valley Terminal} to {Harbor Point}, a flow of {65} from {Harbor Point} to {Valley Terminal}, a flow of {52} from {Grand Terminal} to {Harbor Point}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Metro Center to Harbor Point or from Harbor Point to Valley Terminal?",
            "A": "The flow from {Metro Center} to {Harbor Point} is larger."
        },
        {
            "Q": "Which flow is the largest: from Metro Center to Valley Terminal, from Metro Center to Harbor Point, or from Metro Center to Grand Terminal?",
            "A": "The flow from {Metro Center} to {Harbor Point} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Metro Center}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Harbor Point} and {Metro Center}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Valley Terminal, Arc Harbor Point, Arc Metro Center, Arc Grand Terminal}."
        }
    ]
}