{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Athleisure?",
            "A": "The next arc clockwise from arc Athleisure is arc {Streetwear}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Sustainable Fashion?",
            "A": "The next arc counterclockwise from arc Sustainable Fashion is arc {Streetwear}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Streetwear} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Sustainable Fashion} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Sustainable Fashion to Streetwear in the chord chart?",
            "A": "The flow value is {1071}."
        },
        {
            "Q": "What is the flow value from Streetwear to Athleisure in the chord chart?",
            "A": "The flow value is {530}."
        },
        {
            "Q": "What is the flow value from Sustainable Fashion to Athleisure in the chord chart?",
            "A": "The flow value is {1052}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Sustainable Fashion and Athleisure in the chord chart?",
            "A": "The maximum flow value between Sustainable Fashion and Athleisure is {1052}."
        },
        {
            "Q": "What is the minimum flow value between Athleisure and Sustainable Fashion in the chord chart?",
            "A": "The minimum flow value between Athleisure and Sustainable Fashion is {554}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {1305}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {193}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Athleisure?",
            "A": "The total flow output from Athleisure is {747}."
        },
        {
            "Q": "What is the total flow input by Sustainable Fashion?",
            "A": "The total flow input by Sustainable Fashion is {1859}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 1061? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1071} from {Sustainable Fashion} to {Streetwear}, a flow of {1305} from {Streetwear} to {Sustainable Fashion}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 542? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {193} from {Athleisure} to {Streetwear}, a flow of {530} from {Streetwear} to {Athleisure}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 361 and 1061? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {530} from {Streetwear} to {Athleisure}, a flow of {1052} from {Sustainable Fashion} to {Athleisure}, a flow of {554} from {Athleisure} to {Sustainable Fashion}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Sustainable Fashion to Streetwear or from Streetwear to Sustainable Fashion?",
            "A": "The flow from {Streetwear} to {Sustainable Fashion} is larger."
        },
        {
            "Q": "Which flow is the largest: from Sustainable Fashion to Athleisure, from Athleisure to Streetwear, or from Sustainable Fashion to Streetwear?",
            "A": "The flow from {Sustainable Fashion} to {Streetwear} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Streetwear}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Streetwear} and {Sustainable Fashion}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Streetwear, Arc Sustainable Fashion, Arc Athleisure}."
        }
    ]
}