{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Vintage?",
            "A": "The next arc clockwise from arc Vintage is arc {Streetwear}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Streetwear?",
            "A": "The next arc counterclockwise from arc Streetwear is arc {Vintage}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Sustainable Fashion} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Streetwear} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Streetwear to Sustainable Fashion in the chord chart?",
            "A": "The flow value is {193}."
        },
        {
            "Q": "What is the flow value from Streetwear to Vintage in the chord chart?",
            "A": "The flow value is {382}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Streetwear and Sustainable Fashion in the chord chart?",
            "A": "The maximum flow value between Streetwear and Sustainable Fashion is {433}."
        },
        {
            "Q": "What is the minimum flow value between Streetwear and Vintage in the chord chart?",
            "A": "The minimum flow value between Streetwear and Vintage is {69}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {433}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {29}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Vintage?",
            "A": "The total flow output from Vintage is {382}."
        },
        {
            "Q": "What is the total flow input by Vintage?",
            "A": "The total flow input by Vintage is {411}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 347? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {433} from {Sustainable Fashion} to {Streetwear}, a flow of {382} from {Streetwear} to {Vintage}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 253? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {193} from {Streetwear} to {Sustainable Fashion}, a flow of {69} from {Vintage} to {Streetwear}, a flow of {29} from {Sustainable Fashion} to {Vintage}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 131 and 347? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {193} from {Streetwear} to {Sustainable Fashion}, a flow of {313} from {Vintage} to {Sustainable Fashion}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Streetwear to Sustainable Fashion or from Sustainable Fashion to Vintage?",
            "A": "The flow from {Streetwear} to {Sustainable Fashion} is larger."
        },
        {
            "Q": "Which flow is the largest: from Sustainable Fashion to Vintage, from Vintage to Streetwear, or from Streetwear to Vintage?",
            "A": "The flow from {Streetwear} to {Vintage} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Streetwear}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Streetwear} and {Sustainable Fashion}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Vintage, Arc Streetwear, Arc Sustainable Fashion}."
        }
    ]
}