{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Computer Science?",
            "A": "The next arc clockwise from arc Computer Science is arc {Engineering}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Health Sciences?",
            "A": "The next arc counterclockwise from arc Health Sciences is arc {Engineering}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Health Sciences} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Computer Science} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Computer Science to Health Sciences in the chord chart?",
            "A": "The flow value is {511}."
        },
        {
            "Q": "What is the flow value from Computer Science to Engineering in the chord chart?",
            "A": "The flow value is {165}."
        },
        {
            "Q": "What is the flow value from Health Sciences to Engineering in the chord chart?",
            "A": "The flow value is {343}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Computer Science and Health Sciences in the chord chart?",
            "A": "The maximum flow value between Computer Science and Health Sciences is {1008}."
        },
        {
            "Q": "What is the minimum flow value between Health Sciences and Engineering in the chord chart?",
            "A": "The minimum flow value between Health Sciences and Engineering is {249}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {1008}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {165}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Health Sciences?",
            "A": "The total flow output from Health Sciences is {1351}."
        },
        {
            "Q": "What is the total flow input by Health Sciences?",
            "A": "The total flow input by Health Sciences is {760}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 427? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1008} from {Health Sciences} to {Computer Science}, a flow of {511} from {Computer Science} to {Health Sciences}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 296? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {249} from {Engineering} to {Health Sciences}, a flow of {213} from {Engineering} to {Computer Science}, a flow of {165} from {Computer Science} to {Engineering}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 231 and 296? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {249} from {Engineering} to {Health Sciences}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Health Sciences to Engineering or from Computer Science to Health Sciences?",
            "A": "The flow from {Computer Science} to {Health Sciences} is larger."
        },
        {
            "Q": "Which flow is the largest: from Engineering to Computer Science, from Computer Science to Engineering, or from Health Sciences to Computer Science?",
            "A": "The flow from {Health Sciences} to {Computer Science} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Health Sciences}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Computer Science} and {Health Sciences}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Computer Science, Arc Health Sciences, Arc Engineering}."
        }
    ]
}