{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Health Sciences?",
            "A": "The next arc clockwise from arc Health Sciences is arc {Arts}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Business?",
            "A": "The next arc counterclockwise from arc Business is arc {Arts}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Business} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Social Sciences} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Business to Social Sciences in the chord chart?",
            "A": "The flow value is {326}."
        },
        {
            "Q": "What is the flow value from Social Sciences to Health Sciences in the chord chart?",
            "A": "The flow value is {249}."
        },
        {
            "Q": "What is the flow value from Social Sciences to Business in the chord chart?",
            "A": "The flow value is {283}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Health Sciences and Social Sciences in the chord chart?",
            "A": "The maximum flow value between Health Sciences and Social Sciences is {262}."
        },
        {
            "Q": "What is the minimum flow value between Social Sciences and Business in the chord chart?",
            "A": "The minimum flow value between Social Sciences and Business is {283}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {326}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {92}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Health Sciences?",
            "A": "The total flow output from Health Sciences is {354}."
        },
        {
            "Q": "What is the total flow input by Business?",
            "A": "The total flow input by Business is {560}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 304? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {326} from {Business} to {Social Sciences}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 106? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {92} from {Health Sciences} to {Business}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 161 and 230? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {212} from {Business} to {Arts}, a flow of {185} from {Arts} to {Business}, a flow of {177} from {Arts} to {Social Sciences}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Health Sciences to Social Sciences or from Business to Health Sciences?",
            "A": "The flow from {Health Sciences} to {Social Sciences} is larger."
        },
        {
            "Q": "Which flow is the largest: from Health Sciences to Business, from Social Sciences to Health Sciences, or from Social Sciences to Business?",
            "A": "The flow from {Social Sciences} to {Business} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Business}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Business} and {Social Sciences}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Arts, Arc Business, Arc Social Sciences, Arc Health Sciences}."
        }
    ]
}