{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Social Sciences?",
            "A": "The next arc clockwise from arc Social Sciences is arc {Business}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Engineering?",
            "A": "The next arc counterclockwise from arc Engineering is arc {Business}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Social Sciences} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Engineering} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Engineering to Social Sciences in the chord chart?",
            "A": "The flow value is {252}."
        },
        {
            "Q": "What is the flow value from Business to Social Sciences in the chord chart?",
            "A": "The flow value is {21}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Social Sciences and Engineering in the chord chart?",
            "A": "The maximum flow value between Social Sciences and Engineering is {282}."
        },
        {
            "Q": "What is the minimum flow value between Social Sciences and Business in the chord chart?",
            "A": "The minimum flow value between Social Sciences and Business is {21}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {282}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {21}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Engineering?",
            "A": "The total flow output from Engineering is {367}."
        },
        {
            "Q": "What is the total flow input by Social Sciences?",
            "A": "The total flow input by Social Sciences is {273}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 267? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {282} from {Social Sciences} to {Engineering}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 125? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {21} from {Business} to {Social Sciences}, a flow of {115} from {Engineering} to {Business}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 125 and 171? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {135} from {Social Sciences} to {Business}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Business to Social Sciences or from Social Sciences to Business?",
            "A": "The flow from {Social Sciences} to {Business} is larger."
        },
        {
            "Q": "Which flow is the largest: from Social Sciences to Engineering, from Business to Social Sciences, or from Social Sciences to Business?",
            "A": "The flow from {Social Sciences} to {Engineering} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Social Sciences}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Engineering} and {Social Sciences}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Business, Arc Engineering, Arc Social Sciences}."
        }
    ]
}