{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Natural Sciences?",
            "A": "The next arc clockwise from arc Natural Sciences is arc {Health Sciences}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Computer Science?",
            "A": "The next arc counterclockwise from arc Computer Science is arc {Health Sciences}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Engineering} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Natural Sciences} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Natural Sciences to Computer Science in the chord chart?",
            "A": "The flow value is {107}."
        },
        {
            "Q": "What is the flow value from Health Sciences to Natural Sciences in the chord chart?",
            "A": "The flow value is {179}."
        },
        {
            "Q": "What is the flow value from Computer Science to Natural Sciences in the chord chart?",
            "A": "The flow value is {86}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Engineering and Health Sciences in the chord chart?",
            "A": "The maximum flow value between Engineering and Health Sciences is {62}."
        },
        {
            "Q": "What is the minimum flow value between Health Sciences and Engineering in the chord chart?",
            "A": "The minimum flow value between Health Sciences and Engineering is {52}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {519}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {52}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Computer Science?",
            "A": "The total flow output from Computer Science is {150}."
        },
        {
            "Q": "What is the total flow input by Computer Science?",
            "A": "The total flow input by Computer Science is {181}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 221? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {519} from {Engineering} to {Natural Sciences}, a flow of {263} from {Natural Sciences} to {Engineering}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 69? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {64} from {Computer Science} to {Engineering}, a flow of {62} from {Engineering} to {Health Sciences}, a flow of {52} from {Health Sciences} to {Engineering}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 80 and 120? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {107} from {Natural Sciences} to {Computer Science}, a flow of {86} from {Computer Science} to {Natural Sciences}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Engineering to Natural Sciences or from Natural Sciences to Health Sciences?",
            "A": "The flow from {Engineering} to {Natural Sciences} is larger."
        },
        {
            "Q": "Which flow is the largest: from Engineering to Natural Sciences, from Engineering to Computer Science, or from Natural Sciences to Computer Science?",
            "A": "The flow from {Engineering} to {Natural Sciences} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Engineering}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Engineering} and {Natural Sciences}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Computer Science, Arc Natural Sciences, Arc Engineering, Arc Health Sciences}."
        }
    ]
}