{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {4} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Arts?",
            "A": "The next arc clockwise from arc Arts is arc {Health Sciences}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Natural Sciences?",
            "A": "The next arc counterclockwise from arc Natural Sciences is arc {Health Sciences}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Natural Sciences} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Health Sciences} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Health Sciences to Natural Sciences in the chord chart?",
            "A": "The flow value is {477}."
        },
        {
            "Q": "What is the flow value from Arts to Health Sciences in the chord chart?",
            "A": "The flow value is {321}."
        },
        {
            "Q": "What is the flow value from Engineering to Health Sciences in the chord chart?",
            "A": "The flow value is {335}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Health Sciences and Engineering in the chord chart?",
            "A": "The maximum flow value between Health Sciences and Engineering is {335}."
        },
        {
            "Q": "What is the minimum flow value between Engineering and Natural Sciences in the chord chart?",
            "A": "The minimum flow value between Engineering and Natural Sciences is {81}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {515}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {81}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Natural Sciences?",
            "A": "The total flow output from Natural Sciences is {596}."
        },
        {
            "Q": "What is the total flow input by Natural Sciences?",
            "A": "The total flow input by Natural Sciences is {644}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 394? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {453} from {Health Sciences} to {Arts}, a flow of {515} from {Natural Sciences} to {Health Sciences}, a flow of {477} from {Health Sciences} to {Natural Sciences}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 248? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {81} from {Natural Sciences} to {Engineering}, a flow of {167} from {Engineering} to {Natural Sciences}, a flow of {175} from {Health Sciences} to {Engineering}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 248 and 394? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {321} from {Arts} to {Health Sciences}, a flow of {335} from {Engineering} to {Health Sciences}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Arts to Health Sciences or from Engineering to Health Sciences?",
            "A": "The flow from {Engineering} to {Health Sciences} is larger."
        },
        {
            "Q": "Which flow is the largest: from Arts to Health Sciences, from Natural Sciences to Health Sciences, or from Health Sciences to Arts?",
            "A": "The flow from {Natural Sciences} to {Health Sciences} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Engineering}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Health Sciences} and {Natural Sciences}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Engineering, Arc Health Sciences, Arc Natural Sciences, Arc Arts}."
        }
    ]
}