{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Arts?",
            "A": "The next arc clockwise from arc Arts is arc {Engineering}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Computer Science?",
            "A": "The next arc counterclockwise from arc Computer Science is arc {Engineering}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Engineering} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Social Sciences} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Social Sciences to Computer Science in the chord chart?",
            "A": "The flow value is {26}."
        },
        {
            "Q": "What is the flow value from Social Sciences to Arts in the chord chart?",
            "A": "The flow value is {105}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Engineering and Computer Science in the chord chart?",
            "A": "The maximum flow value between Engineering and Computer Science is {310}."
        },
        {
            "Q": "What is the minimum flow value between Social Sciences and Engineering in the chord chart?",
            "A": "The minimum flow value between Social Sciences and Engineering is {117}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {395}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {26}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Arts?",
            "A": "The total flow output from Arts is {429}."
        },
        {
            "Q": "What is the total flow input by Engineering?",
            "A": "The total flow input by Engineering is {427}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 321? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {332} from {Arts} to {Social Sciences}, a flow of {395} from {Engineering} to {Social Sciences}, a flow of {348} from {Computer Science} to {Arts}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 92? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {26} from {Social Sciences} to {Computer Science}, a flow of {88} from {Computer Science} to {Social Sciences}, a flow of {38} from {Engineering} to {Computer Science}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 92 and 213? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {105} from {Social Sciences} to {Arts}, a flow of {117} from {Social Sciences} to {Engineering}, a flow of {97} from {Arts} to {Computer Science}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Arts to Social Sciences or from Social Sciences to Arts?",
            "A": "The flow from {Arts} to {Social Sciences} is larger."
        },
        {
            "Q": "Which flow is the largest: from Arts to Social Sciences, from Engineering to Computer Science, or from Computer Science to Engineering?",
            "A": "The flow from {Arts} to {Social Sciences} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Computer Science}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Engineering} and {Social Sciences}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Arts, Arc Computer Science, Arc Social Sciences, Arc Engineering}."
        }
    ]
}