{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {4} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Wind?",
            "A": "The next arc clockwise from arc Wind is arc {Natural Gas}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Wind?",
            "A": "The next arc counterclockwise from arc Wind is arc {Nuclear}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Nuclear} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Wind} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Wind to Nuclear in the chord chart?",
            "A": "The flow value is {34}."
        },
        {
            "Q": "What is the flow value from Coal to Natural Gas in the chord chart?",
            "A": "The flow value is {111}."
        },
        {
            "Q": "What is the flow value from Wind to Natural Gas in the chord chart?",
            "A": "The flow value is {81}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Nuclear and Wind in the chord chart?",
            "A": "The maximum flow value between Nuclear and Wind is {170}."
        },
        {
            "Q": "What is the minimum flow value between Wind and Nuclear in the chord chart?",
            "A": "The minimum flow value between Wind and Nuclear is {34}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {170}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {34}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Natural Gas?",
            "A": "The total flow output from Natural Gas is {204}."
        },
        {
            "Q": "What is the total flow input by Natural Gas?",
            "A": "The total flow input by Natural Gas is {192}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 96? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {170} from {Nuclear} to {Wind}, a flow of {111} from {Coal} to {Natural Gas}, a flow of {135} from {Natural Gas} to {Wind}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 46? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {34} from {Wind} to {Nuclear}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 71 and 77? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {73} from {Coal} to {Wind}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Natural Gas to Wind or from Wind to Coal?",
            "A": "The flow from {Natural Gas} to {Wind} is larger."
        },
        {
            "Q": "Which flow is the largest: from Wind to Nuclear, from Coal to Natural Gas, or from Wind to Natural Gas?",
            "A": "The flow from {Coal} to {Natural Gas} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Nuclear}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Natural Gas} and {Wind}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Coal, Arc Natural Gas, Arc Wind, Arc Nuclear}."
        }
    ]
}