{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {4} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Biomass?",
            "A": "The next arc clockwise from arc Biomass is arc {Wind}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Biomass?",
            "A": "The next arc counterclockwise from arc Biomass is arc {Solar}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Nuclear} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Solar} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Nuclear to Solar in the chord chart?",
            "A": "The flow value is {301}."
        },
        {
            "Q": "What is the flow value from Solar to Biomass in the chord chart?",
            "A": "The flow value is {85}."
        },
        {
            "Q": "What is the flow value from Biomass to Wind in the chord chart?",
            "A": "The flow value is {225}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Solar and Nuclear in the chord chart?",
            "A": "The maximum flow value between Solar and Nuclear is {301}."
        },
        {
            "Q": "What is the minimum flow value between Biomass and Nuclear in the chord chart?",
            "A": "The minimum flow value between Biomass and Nuclear is {140}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {301}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {85}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Biomass?",
            "A": "The total flow output from Biomass is {524}."
        },
        {
            "Q": "What is the total flow input by Biomass?",
            "A": "The total flow input by Biomass is {428}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 244? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {301} from {Nuclear} to {Solar}, a flow of {264} from {Solar} to {Nuclear}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 127? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {114} from {Biomass} to {Solar}, a flow of {85} from {Solar} to {Biomass}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 162 and 194? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {185} from {Biomass} to {Nuclear}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Nuclear to Biomass or from Wind to Biomass?",
            "A": "The flow from {Wind} to {Biomass} is larger."
        },
        {
            "Q": "Which flow is the largest: from Biomass to Wind, from Biomass to Nuclear, or from Nuclear to Solar?",
            "A": "The flow from {Nuclear} to {Solar} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Biomass}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Nuclear} and {Solar}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Wind, Arc Biomass, Arc Nuclear, Arc Solar}."
        }
    ]
}