{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {4} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Kyle's Salads?",
            "A": "The next arc clockwise from arc Kyle's Salads is arc {Parkershire Burger}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Kyle's Salads?",
            "A": "The next arc counterclockwise from arc Kyle's Salads is arc {Christopher's Tacos}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Parkershire Burger} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Cisnerosfurt Sandwich} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Christopher's Tacos to Kyle's Salads in the chord chart?",
            "A": "The flow value is {498}."
        },
        {
            "Q": "What is the flow value from Christopher's Tacos to Cisnerosfurt Sandwich in the chord chart?",
            "A": "The flow value is {311}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Christopher's Tacos and Cisnerosfurt Sandwich in the chord chart?",
            "A": "The maximum flow value between Christopher's Tacos and Cisnerosfurt Sandwich is {311}."
        },
        {
            "Q": "What is the minimum flow value between Kyle's Salads and Cisnerosfurt Sandwich in the chord chart?",
            "A": "The minimum flow value between Kyle's Salads and Cisnerosfurt Sandwich is {198}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {1635}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {198}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Cisnerosfurt Sandwich?",
            "A": "The total flow output from Cisnerosfurt Sandwich is {1201}."
        },
        {
            "Q": "What is the total flow input by Kyle's Salads?",
            "A": "The total flow input by Kyle's Salads is {696}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 1191? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1635} from {Parkershire Burger} to {Cisnerosfurt Sandwich}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 205? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {198} from {Cisnerosfurt Sandwich} to {Kyle's Salads}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 234 and 436? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {375} from {Kyle's Salads} to {Christopher's Tacos}, a flow of {311} from {Christopher's Tacos} to {Cisnerosfurt Sandwich}, a flow of {255} from {Cisnerosfurt Sandwich} to {Christopher's Tacos}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Christopher's Tacos to Kyle's Salads or from Kyle's Salads to Cisnerosfurt Sandwich?",
            "A": "The flow from {Christopher's Tacos} to {Kyle's Salads} is larger."
        },
        {
            "Q": "Which flow is the largest: from Kyle's Salads to Christopher's Tacos, from Christopher's Tacos to Kyle's Salads, or from Cisnerosfurt Sandwich to Christopher's Tacos?",
            "A": "The flow from {Christopher's Tacos} to {Kyle's Salads} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Parkershire Burger}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Cisnerosfurt Sandwich} and {Parkershire Burger}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Parkershire Burger, Arc Cisnerosfurt Sandwich, Arc Christopher's Tacos, Arc Kyle's Salads}."
        }
    ]
}