{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {6} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {5} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Cisnerosfurt Sandwich?",
            "A": "The next arc clockwise from arc Cisnerosfurt Sandwich is arc {Crystalbury Coffee}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Cisnerosfurt Sandwich?",
            "A": "The next arc counterclockwise from arc Cisnerosfurt Sandwich is arc {Kathy's Pizzas}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Christopher's Tacos} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{World Donuts} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from World Donuts to Christopher's Tacos in the chord chart?",
            "A": "The flow value is {772}."
        },
        {
            "Q": "What is the flow value from World Donuts to Kathy's Pizzas in the chord chart?",
            "A": "The flow value is {516}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Christopher's Tacos and World Donuts in the chord chart?",
            "A": "The maximum flow value between Christopher's Tacos and World Donuts is {1433}."
        },
        {
            "Q": "What is the minimum flow value between Crystalbury Coffee and Kathy's Pizzas in the chord chart?",
            "A": "The minimum flow value between Crystalbury Coffee and Kathy's Pizzas is {195}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {1433}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {122}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Christopher's Tacos?",
            "A": "The total flow output from Christopher's Tacos is {1597}."
        },
        {
            "Q": "What is the total flow input by World Donuts?",
            "A": "The total flow input by World Donuts is {1957}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 644? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1433} from {Christopher's Tacos} to {World Donuts}, a flow of {772} from {World Donuts} to {Christopher's Tacos}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 148? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {140} from {Crystalbury Coffee} to {World Donuts}, a flow of {122} from {World Donuts} to {Crystalbury Coffee}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 204 and 282? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {260} from {Kathy's Pizzas} to {Cisnerosfurt Sandwich}, a flow of {214} from {Crystalbury Coffee} to {Kathy's Pizzas}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from World Donuts to Crystalbury Coffee or from Christopher's Tacos to World Donuts?",
            "A": "The flow from {Christopher's Tacos} to {World Donuts} is larger."
        },
        {
            "Q": "Which flow is the largest: from World Donuts to Crystalbury Coffee, from Kathy's Pizzas to Christopher's Tacos, or from Christopher's Tacos to Kathy's Pizzas?",
            "A": "The flow from {Christopher's Tacos} to {Kathy's Pizzas} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Christopher's Tacos}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Christopher's Tacos} and {World Donuts}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Christopher's Tacos, Arc World Donuts, Arc Kathy's Pizzas, Arc Crystalbury Coffee, Arc Cisnerosfurt Sandwich}."
        }
    ]
}