{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Kyle's Salads?",
            "A": "The next arc clockwise from arc Kyle's Salads is arc {World Donuts}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Danielle's Chicken?",
            "A": "The next arc counterclockwise from arc Danielle's Chicken is arc {World Donuts}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Danielle's Chicken} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Kathy's Pizzas} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Kathy's Pizzas to Kyle's Salads in the chord chart?",
            "A": "The flow value is {375}."
        },
        {
            "Q": "What is the flow value from Danielle's Chicken to Kathy's Pizzas in the chord chart?",
            "A": "The flow value is {1635}."
        },
        {
            "Q": "What is the flow value from Kathy's Pizzas to World Donuts in the chord chart?",
            "A": "The flow value is {247}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Kathy's Pizzas and World Donuts in the chord chart?",
            "A": "The maximum flow value between Kathy's Pizzas and World Donuts is {317}."
        },
        {
            "Q": "What is the minimum flow value between Danielle's Chicken and Kyle's Salads in the chord chart?",
            "A": "The minimum flow value between Danielle's Chicken and Kyle's Salads is {198}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {1635}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {153}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Kyle's Salads?",
            "A": "The total flow output from Kyle's Salads is {716}."
        },
        {
            "Q": "What is the total flow input by Kyle's Salads?",
            "A": "The total flow input by Kyle's Salads is {591}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 635? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1635} from {Danielle's Chicken} to {Kathy's Pizzas}, a flow of {752} from {Kathy's Pizzas} to {Danielle's Chicken}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 186? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {174} from {World Donuts} to {Danielle's Chicken}, a flow of {153} from {Danielle's Chicken} to {World Donuts}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 207 and 346? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {317} from {World Donuts} to {Kathy's Pizzas}, a flow of {247} from {Kathy's Pizzas} to {World Donuts}, a flow of {216} from {Danielle's Chicken} to {Kyle's Salads}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Danielle's Chicken to Kyle's Salads or from World Donuts to Danielle's Chicken?",
            "A": "The flow from {Danielle's Chicken} to {Kyle's Salads} is larger."
        },
        {
            "Q": "Which flow is the largest: from Kyle's Salads to Kathy's Pizzas, from World Donuts to Danielle's Chicken, or from Kyle's Salads to Danielle's Chicken?",
            "A": "The flow from {Kyle's Salads} to {Kathy's Pizzas} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Danielle's Chicken}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Danielle's Chicken} and {Kathy's Pizzas}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Danielle's Chicken, Arc Kathy's Pizzas, Arc Kyle's Salads, Arc World Donuts}."
        }
    ]
}