{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {4} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Parkershire Burger?",
            "A": "The next arc clockwise from arc Parkershire Burger is arc {World Donuts}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Parkershire Burger?",
            "A": "The next arc counterclockwise from arc Parkershire Burger is arc {Martinberg Hot Dog}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Martinberg Hot Dog} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Parkershire Burger} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from World Donuts to Martinberg Hot Dog in the chord chart?",
            "A": "The flow value is {299}."
        },
        {
            "Q": "What is the flow value from Martinberg Hot Dog to World Donuts in the chord chart?",
            "A": "The flow value is {259}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between World Donuts and Martinberg Hot Dog in the chord chart?",
            "A": "The maximum flow value between World Donuts and Martinberg Hot Dog is {299}."
        },
        {
            "Q": "What is the minimum flow value between Christopher's Tacos and Parkershire Burger in the chord chart?",
            "A": "The minimum flow value between Christopher's Tacos and Parkershire Burger is {149}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {511}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {149}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Martinberg Hot Dog?",
            "A": "The total flow output from Martinberg Hot Dog is {770}."
        },
        {
            "Q": "What is the total flow input by Christopher's Tacos?",
            "A": "The total flow input by Christopher's Tacos is {546}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 417? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {511} from {Martinberg Hot Dog} to {Parkershire Burger}, a flow of {438} from {Parkershire Burger} to {Martinberg Hot Dog}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 170? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {149} from {Parkershire Burger} to {Christopher's Tacos}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 279 and 316? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {299} from {World Donuts} to {Martinberg Hot Dog}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Christopher's Tacos to Parkershire Burger or from Christopher's Tacos to World Donuts?",
            "A": "The flow from {Christopher's Tacos} to {World Donuts} is larger."
        },
        {
            "Q": "Which flow is the largest: from Parkershire Burger to Christopher's Tacos, from Martinberg Hot Dog to Parkershire Burger, or from Martinberg Hot Dog to World Donuts?",
            "A": "The flow from {Martinberg Hot Dog} to {Parkershire Burger} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {World Donuts}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Martinberg Hot Dog} and {Parkershire Burger}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Martinberg Hot Dog, Arc Parkershire Burger, Arc World Donuts, Arc Christopher's Tacos}."
        }
    ]
}