{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Geriatric Care Hospital?",
            "A": "The next arc clockwise from arc Geriatric Care Hospital is arc {Maternal and Child Health Center}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Commdata_unity Health Center?",
            "A": "The next arc counterclockwise from arc Commdata_unity Health Center is arc {Maternal and Child Health Center}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Commdata_unity Health Center} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Emergency Medical Center} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Geriatric Care Hospital to Maternal and Child Health Center in the chord chart?",
            "A": "The flow value is {68}."
        },
        {
            "Q": "What is the flow value from Commdata_unity Health Center to Emergency Medical Center in the chord chart?",
            "A": "The flow value is {641}."
        },
        {
            "Q": "What is the flow value from Commdata_unity Health Center to Maternal and Child Health Center in the chord chart?",
            "A": "The flow value is {125}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Commdata_unity Health Center and Maternal and Child Health Center in the chord chart?",
            "A": "The maximum flow value between Commdata_unity Health Center and Maternal and Child Health Center is {125}."
        },
        {
            "Q": "What is the minimum flow value between Geriatric Care Hospital and Maternal and Child Health Center in the chord chart?",
            "A": "The minimum flow value between Geriatric Care Hospital and Maternal and Child Health Center is {62}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {641}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {62}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Commdata_unity Health Center?",
            "A": "The total flow output from Commdata_unity Health Center is {986}."
        },
        {
            "Q": "What is the total flow input by Maternal and Child Health Center?",
            "A": "The total flow input by Maternal and Child Health Center is {193}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 274? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {641} from {Commdata_unity Health Center} to {Emergency Medical Center}, a flow of {328} from {Emergency Medical Center} to {Commdata_unity Health Center}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 86? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {80} from {Geriatric Care Hospital} to {Emergency Medical Center}, a flow of {68} from {Geriatric Care Hospital} to {Maternal and Child Health Center}, a flow of {62} from {Maternal and Child Health Center} to {Geriatric Care Hospital}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 101 and 144? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {125} from {Commdata_unity Health Center} to {Maternal and Child Health Center}, a flow of {109} from {Maternal and Child Health Center} to {Commdata_unity Health Center}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Maternal and Child Health Center to Geriatric Care Hospital or from Maternal and Child Health Center to Commdata_unity Health Center?",
            "A": "The flow from {Maternal and Child Health Center} to {Commdata_unity Health Center} is larger."
        },
        {
            "Q": "Which flow is the largest: from Maternal and Child Health Center to Commdata_unity Health Center, from Commdata_unity Health Center to Geriatric Care Hospital, or from Commdata_unity Health Center to Emergency Medical Center?",
            "A": "The flow from {Commdata_unity Health Center} to {Emergency Medical Center} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Commdata_unity Health Center}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Commdata_unity Health Center} and {Emergency Medical Center}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Commdata_unity Health Center, Arc Emergency Medical Center, Arc Geriatric Care Hospital, Arc Maternal and Child Health Center}."
        }
    ]
}