{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc IT Department?",
            "A": "The next arc clockwise from arc IT Department is arc {Admin and Facilities}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Admin and Facilities?",
            "A": "The next arc counterclockwise from arc Admin and Facilities is arc {IT Department}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Admin and Facilities} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Sales Department} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Admin and Facilities to Sales Department in the chord chart?",
            "A": "The flow value is {1026}."
        },
        {
            "Q": "What is the flow value from Admin and Facilities to IT Department in the chord chart?",
            "A": "The flow value is {524}."
        },
        {
            "Q": "What is the flow value from Sales Department to Admin and Facilities in the chord chart?",
            "A": "The flow value is {33}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Sales Department and IT Department in the chord chart?",
            "A": "The maximum flow value between Sales Department and IT Department is {949}."
        },
        {
            "Q": "What is the minimum flow value between Admin and Facilities and Sales Department in the chord chart?",
            "A": "The minimum flow value between Admin and Facilities and Sales Department is {33}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {1026}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {33}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Admin and Facilities?",
            "A": "The total flow output from Admin and Facilities is {1550}."
        },
        {
            "Q": "What is the total flow input by IT Department?",
            "A": "The total flow input by IT Department is {646}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 987? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {1026} from {Admin and Facilities} to {Sales Department}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 77? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {33} from {Sales Department} to {Admin and Facilities}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 77 and 907? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {866} from {IT Department} to {Admin and Facilities}, a flow of {524} from {Admin and Facilities} to {IT Department}, a flow of {122} from {Sales Department} to {IT Department}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Sales Department to IT Department or from Sales Department to Admin and Facilities?",
            "A": "The flow from {Sales Department} to {IT Department} is larger."
        },
        {
            "Q": "Which flow is the largest: from Sales Department to IT Department, from IT Department to Sales Department, or from Admin and Facilities to IT Department?",
            "A": "The flow from {IT Department} to {Sales Department} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {IT Department}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Admin and Facilities} and {IT Department}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc IT Department, Arc Admin and Facilities, Arc Sales Department}."
        }
    ]
}