{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {4} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {4} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Human Resources Department?",
            "A": "The next arc clockwise from arc Human Resources Department is arc {Marketing Department}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Admin and Facilities?",
            "A": "The next arc counterclockwise from arc Admin and Facilities is arc {Marketing Department}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Admin and Facilities} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Operations Department} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Human Resources Department to Operations Department in the chord chart?",
            "A": "The flow value is {114}."
        },
        {
            "Q": "What is the flow value from Admin and Facilities to Operations Department in the chord chart?",
            "A": "The flow value is {809}."
        },
        {
            "Q": "What is the flow value from Marketing Department to Admin and Facilities in the chord chart?",
            "A": "The flow value is {134}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between Admin and Facilities and Marketing Department in the chord chart?",
            "A": "The maximum flow value between Admin and Facilities and Marketing Department is {155}."
        },
        {
            "Q": "What is the minimum flow value between Operations Department and Human Resources Department in the chord chart?",
            "A": "The minimum flow value between Operations Department and Human Resources Department is {103}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {809}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {103}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Marketing Department?",
            "A": "The total flow output from Marketing Department is {332}."
        },
        {
            "Q": "What is the total flow input by Marketing Department?",
            "A": "The total flow input by Marketing Department is {430}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 342? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {809} from {Admin and Facilities} to {Operations Department}, a flow of {409} from {Operations Department} to {Admin and Facilities}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 124? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {114} from {Human Resources Department} to {Operations Department}, a flow of {103} from {Operations Department} to {Human Resources Department}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 144 and 176? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {155} from {Admin and Facilities} to {Marketing Department}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Human Resources Department to Operations Department or from Operations Department to Human Resources Department?",
            "A": "The flow from {Human Resources Department} to {Operations Department} is larger."
        },
        {
            "Q": "Which flow is the largest: from Human Resources Department to Marketing Department, from Admin and Facilities to Marketing Department, or from Human Resources Department to Operations Department?",
            "A": "The flow from {Human Resources Department} to {Marketing Department} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Admin and Facilities}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Admin and Facilities} and {Operations Department}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc Marketing Department, Arc Human Resources Department, Arc Admin and Facilities, Arc Operations Department}."
        }
    ]
}