{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc IT Department?",
            "A": "The next arc clockwise from arc IT Department is arc {Legal Department}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc Legal Department?",
            "A": "The next arc counterclockwise from arc Legal Department is arc {IT Department}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{Legal Department} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Finance Department} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Legal Department to Finance Department in the chord chart?",
            "A": "The flow value is {921}."
        },
        {
            "Q": "What is the flow value from IT Department to Legal Department in the chord chart?",
            "A": "The flow value is {275}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between IT Department and Finance Department in the chord chart?",
            "A": "The maximum flow value between IT Department and Finance Department is {685}."
        },
        {
            "Q": "What is the minimum flow value between Finance Department and IT Department in the chord chart?",
            "A": "The minimum flow value between Finance Department and IT Department is {539}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {921}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {275}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from Legal Department?",
            "A": "The total flow output from Legal Department is {1333}."
        },
        {
            "Q": "What is the total flow input by Finance Department?",
            "A": "The total flow input by Finance Department is {1606}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 754? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {921} from {Legal Department} to {Finance Department}, a flow of {823} from {Finance Department} to {Legal Department}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 475? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {412} from {Legal Department} to {IT Department}, a flow of {275} from {IT Department} to {Legal Department}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 343 and 754? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {685} from {IT Department} to {Finance Department}, a flow of {539} from {Finance Department} to {IT Department}, a flow of {412} from {Legal Department} to {IT Department}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Finance Department to Legal Department or from IT Department to Legal Department?",
            "A": "The flow from {Finance Department} to {Legal Department} is larger."
        },
        {
            "Q": "Which flow is the largest: from Legal Department to Finance Department, from Finance Department to IT Department, or from Legal Department to IT Department?",
            "A": "The flow from {Legal Department} to {Finance Department} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Legal Department}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Finance Department} and {Legal Department}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc IT Department, Arc Finance Department, Arc Legal Department}."
        }
    ]
}