{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {5} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {5} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc AtkinsonExpress?",
            "A": "The next arc clockwise from arc AtkinsonExpress is arc {JohnsonLLC.com}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc DanielsGroupShop?",
            "A": "The next arc counterclockwise from arc DanielsGroupShop is arc {JohnsonLLC.com}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{DuffyLLCOnline} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{DanielsGroupShop} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from DanielsGroupShop to Garcia Global in the chord chart?",
            "A": "The flow value is {17}."
        },
        {
            "Q": "What is the flow value from DanielsGroupShop to DuffyLLCOnline in the chord chart?",
            "A": "The flow value is {119}."
        },
        {
            "Q": "What is the flow value from DuffyLLCOnline to DanielsGroupShop in the chord chart?",
            "A": "The flow value is {200}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between JohnsonLLC.com and AtkinsonExpress in the chord chart?",
            "A": "The maximum flow value between JohnsonLLC.com and AtkinsonExpress is {122}."
        },
        {
            "Q": "What is the minimum flow value between Garcia Global and DanielsGroupShop in the chord chart?",
            "A": "The minimum flow value between Garcia Global and DanielsGroupShop is {12}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {200}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {12}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from DanielsGroupShop?",
            "A": "The total flow output from DanielsGroupShop is {136}."
        },
        {
            "Q": "What is the total flow input by JohnsonLLC.com?",
            "A": "The total flow input by JohnsonLLC.com is {283}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 152? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {200} from {DuffyLLCOnline} to {DanielsGroupShop}, a flow of {156} from {JohnsonLLC.com} to {Garcia Global}, a flow of {191} from {Garcia Global} to {JohnsonLLC.com}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 67? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {17} from {DanielsGroupShop} to {Garcia Global}, a flow of {12} from {Garcia Global} to {DanielsGroupShop}, a flow of {43} from {DuffyLLCOnline} to {Garcia Global}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 105 and 135? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {122} from {JohnsonLLC.com} to {AtkinsonExpress}, a flow of {119} from {DanielsGroupShop} to {DuffyLLCOnline}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from AtkinsonExpress to JohnsonLLC.com or from JohnsonLLC.com to AtkinsonExpress?",
            "A": "The flow from {JohnsonLLC.com} to {AtkinsonExpress} is larger."
        },
        {
            "Q": "Which flow is the largest: from Garcia Global to DanielsGroupShop, from JohnsonLLC.com to AtkinsonExpress, or from DuffyLLCOnline to DanielsGroupShop?",
            "A": "The flow from {DuffyLLCOnline} to {DanielsGroupShop} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {Garcia Global}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Garcia Global} and {JohnsonLLC.com}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc DanielsGroupShop, Arc DuffyLLCOnline, Arc Garcia Global, Arc JohnsonLLC.com, Arc AtkinsonExpress}."
        }
    ]
}