{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {chord} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many chords are in this chord chart?",
            "A": "There are {3} chords."
        },
        {
            "Q": "How many outer arcs are in this chord chart?",
            "A": "There are {3} outer arcs."
        }
    ],
    "SRP": [
        {
            "Q": "In the chord chart, what is the next arc in the clockwise direction from arc Garcia Global?",
            "A": "The next arc clockwise from arc Garcia Global is arc {AtkinsonExpress}."
        },
        {
            "Q": "In the chord chart, what is the next arc in the counterclockwise direction from arc WeberGroupMart?",
            "A": "The next arc counterclockwise from arc WeberGroupMart is arc {AtkinsonExpress}."
        }
    ],
    "VPR": [
        {
            "Q": "Which arc has the largest output flow in this chord chart?",
            "A": "{WeberGroupMart} has the largest output flow."
        },
        {
            "Q": "Which arc has the largest input flow in this chord chart?",
            "A": "{Garcia Global} has the largest input flow."
        }
    ],
    "VE": [
        {
            "Q": "What is the flow value from Garcia Global to WeberGroupMart in the chord chart?",
            "A": "The flow value is {280}."
        },
        {
            "Q": "What is the flow value from Garcia Global to AtkinsonExpress in the chord chart?",
            "A": "The flow value is {92}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum flow value between WeberGroupMart and Garcia Global in the chord chart?",
            "A": "The maximum flow value between WeberGroupMart and Garcia Global is {311}."
        },
        {
            "Q": "What is the minimum flow value between AtkinsonExpress and WeberGroupMart in the chord chart?",
            "A": "The minimum flow value between AtkinsonExpress and WeberGroupMart is {175}."
        },
        {
            "Q": "What is the maximum flow value in the chord chart?",
            "A": "The maximum flow value is {311}."
        },
        {
            "Q": "What is the minimum flow value in the chord chart?",
            "A": "The minimum flow value is {92}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total flow output from WeberGroupMart?",
            "A": "The total flow output from WeberGroupMart is {536}."
        },
        {
            "Q": "What is the total flow input by Garcia Global?",
            "A": "The total flow input by Garcia Global is {445}."
        }
    ],
    "NF": [
        {
            "Q": "Which pairs of nodes in the chord chart have a flow greater than 295? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {311} from {WeberGroupMart} to {Garcia Global}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow less than 200? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {175} from {AtkinsonExpress} to {WeberGroupMart}, a flow of {134} from {AtkinsonExpress} to {Garcia Global}, a flow of {92} from {Garcia Global} to {AtkinsonExpress}."
        },
        {
            "Q": "Which pairs of nodes in the chord chart have a flow between 113 and 252? Please list the source node, target node, and the corresponding flow value.",
            "A": "There is a flow of {225} from {WeberGroupMart} to {AtkinsonExpress}, a flow of {175} from {AtkinsonExpress} to {WeberGroupMart}, a flow of {134} from {AtkinsonExpress} to {Garcia Global}."
        }
    ],
    "NC": [
        {
            "Q": "Which flow is larger: from Garcia Global to AtkinsonExpress or from WeberGroupMart to Garcia Global?",
            "A": "The flow from {WeberGroupMart} to {Garcia Global} is larger."
        },
        {
            "Q": "Which flow is the largest: from Garcia Global to AtkinsonExpress, from AtkinsonExpress to WeberGroupMart, or from WeberGroupMart to Garcia Global?",
            "A": "The flow from {WeberGroupMart} to {Garcia Global} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which category has the highest proportion of outgoing flow relative to its total flow?",
            "A": "The category with the highest proportion of outgoing flow relative to its total flow is {WeberGroupMart}."
        },
        {
            "Q": "Which pair has the strongest chord connection in this chord chart?",
            "A": "The strongest chord connection is between {Garcia Global} and {WeberGroupMart}."
        }
    ],
    "VA": [
        {
            "Q": "To minimize the crossings between chords, please reorder the outer arcs and list the reorder arc order in clockwise direction.",
            "A": "The reordered arc order in clockwise direction is: {Arc WeberGroupMart, Arc Garcia Global, Arc AtkinsonExpress}."
        }
    ]
}