{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Member Activity Rate?",
            "A": "The next dimension clockwise from Member Activity Rate is Gross Margin"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Member Activity Rate?",
            "A": "The next dimension counterclockwise from Member Activity Rate is Traffic Conversion Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Member Activity Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Cole-Mccarthy?",
            "A": "The strongest aspect is {Member Activity Rate}, while the weakest aspect is{ Traffic Conversion Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Cole-Mccarthy on the Traffic Conversion Rate in the radar chart?",
            "A": "The value of Cole-Mccarthy on the Safety dimension is {47}."
        },
        {
            "Q": "What is the value of Cole-Mccarthy on the Inventory Turnover Rate in the radar chart?",
            "A": "The value of Cole-Mccarthy on the Safety dimension is {50}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Cole-Mccarthy across all dimensions in the radar chart?",
            "A": "The maximum value of Cole-Mccarthy across all dimensions is {50}."
        },
        {
            "Q": "What is the minimum value of label Cole-Mccarthy across all dimensions in the radar chart?",
            "A": "The minimum value of Cole-Mccarthy across all dimensions is {50}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Traffic Conversion Rate",
            "A": "The average value of Traffic Conversion Rate is {47.0}."
        },
        {
            "Q": "What is the average value of Cole-Mccarthy",
            "A": "The average value of Cole-Mccarthy is {55.75}."
        }
    ],
    "NF": [
        {
            "Q": "For Cole-Mccarthy in the radar chart, which dimensions have scores above 63? Please list the dimensions and corresponding scores.",
            "A": "{Member Activity Rate} is {67}"
        },
        {
            "Q": "For Cole-Mccarthy in the radar chart, which dimensions have scores between 51 and 63? Please list the dimensions and corresponding scores.",
            "A": "{Gross Margin} is {59}"
        },
        {
            "Q": "For Cole-Mccarthy in the radar chart, which dimensions have scores below 51? Please list the dimensions and corresponding scores.",
            "A": "{Inventory Turnover Rate} is {50}, {Traffic Conversion Rate} is {47}"
        }
    ],
    "NC": [
        {
            "Q": "For Cole-Mccarthy, which dimension has a higher score: Traffic Conversion Rate or Gross Margin?",
            "A": "{Gross Margin} has a higher score than Traffic Conversion Rate for Cole-Mccarthy."
        },
        {
            "Q": "For Cole-Mccarthy, which dimension has a higher score: Member Activity Rate or Inventory Turnover Rate or Gross Margin?",
            "A": "{Member Activity Rate} has a higher score for Cole-Mccarthy."
        },
        {
            "Q": "For Cole-Mccarthy, which dimension has a higher score: Member Activity Rate or Inventory Turnover Rate or Gross Margin?",
            "A": "{Member Activity Rate} has a higher score for Cole-Mccarthy."
        }
    ],
    "MSR": [
        {
            "Q": "For Cole-Mccarthy, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Cole-Mccarthy most needs to improve its {Traffic Conversion Rate}."
        }
    ],
    "VA": []
}