{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Repurchase Rate?",
            "A": "The next dimension clockwise from Repurchase Rate is Self-Service Resolution Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Member Activity Rate?",
            "A": "The next dimension counterclockwise from Repurchase Rate is Member Activity Rate."
        },
        {
            "Q": "On the Traffic Conversion Rate, is the point for Perez, Johnson and Hughes inside or outside the point for Mitchell-Taylor?",
            "A": "On the Traffic Conversion Rate, the point for Perez, Johnson and Hughes is inside the point for Mitchell-Taylor."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Member Activity Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Parks, Smith and Ryan?",
            "A": "The strongest aspect is {Member Activity Rate}, while the weakest aspect is{ Repurchase Rate}."
        },
        {
            "Q": "On dimension Inventory Turnover Rate, which label scores the highest?",
            "A": "On Inventory Turnover Rate, label {Mitchell-Taylor} scores the highest."
        },
        {
            "Q": "On dimension Member Activity Rate, which label scores the highest?",
            "A": "On Member Activity Rate, label {Perez, Johnson and Hughes} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Perez, Johnson and Hughes on the Return on Investment (ROI) in the radar chart?",
            "A": "The value of Perez, Johnson and Hughes on the Safety dimension is {50}."
        },
        {
            "Q": "What is the value of Parks, Smith and Ryan on the Self-Service Resolution Rate in the radar chart?",
            "A": "The value of Parks, Smith and Ryan on the Safety dimension is {35}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Parks, Smith and Ryan across all dimensions in the radar chart?",
            "A": "The maximum value of Parks, Smith and Ryan across all dimensions is {38}."
        },
        {
            "Q": "What is the minimum value of label Perez, Johnson and Hughes across all dimensions in the radar chart?",
            "A": "The minimum value of Perez, Johnson and Hughes across all dimensions is {87}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Traffic Conversion Rate",
            "A": "The average value of Traffic Conversion Rate is {59.67}."
        },
        {
            "Q": "What is the average value of Mitchell-Taylor",
            "A": "The average value of Mitchell-Taylor is {51.17}."
        },
        {
            "Q": "What is the difference in Return on Investment (ROI) between Parks, Smith and Ryan and Perez, Johnson and Hughes?",
            "A": "The difference in Return on Investment (ROI) between Parks, Smith and Ryan and Perez, Johnson and Hughes is {36}."
        },
        {
            "Q": "What is the difference in Member Activity Rate between Perez, Johnson and Hughes and Parks, Smith and Ryan?",
            "A": "The difference in Member Activity Rate between Perez, Johnson and Hughes and Parks, Smith and Ryan is {49}."
        }
    ],
    "NF": [
        {
            "Q": "For Parks, Smith and Ryan in the radar chart, which dimensions have scores below 38? Please list the dimensions and corresponding scores.",
            "A": "{Self-Service Resolution Rate} is {31}"
        },
        {
            "Q": "For Parks, Smith and Ryan in the radar chart, which dimensions have scores between 38 and 76? Please list the dimensions and corresponding scores.",
            "A": "{Traffic Conversion Rate} is {59}, {Inventory Turnover Rate} is {73}"
        },
        {
            "Q": "Which labels have scores below 59 for the Inventory Turnover Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Mitchell-Taylor} is {50}"
        }
    ],
    "NC": [
        {
            "Q": "For Perez, Johnson and Hughes, which dimension has a higher score: Traffic Conversion Rate or Member Activity Rate?",
            "A": "{Traffic Conversion Rate} has a higher score than Member Activity Rate for Perez, Johnson and Hughes."
        },
        {
            "Q": "For Mitchell-Taylor, which dimension has a higher score: Repurchase Rate or Return on Investment (ROI)?",
            "A": "{Return on Investment (ROI)} has a higher score than Repurchase Rate for Mitchell-Taylor."
        },
        {
            "Q": "On Repurchase Rate, which label has a higher score: Perez, Johnson and Hughes or the Parks, Smith and Ryan?",
            "A": "{Perez, Johnson and Hughes} has a higher score on Repurchase Rate compared to Parks, Smith and Ryan."
        },
        {
            "Q": "For Perez, Johnson and Hughes, which dimension has a higher score: Self-Service Resolution Rate or Return on Investment (ROI) or Member Activity Rate?",
            "A": "{Return on Investment (ROI)} has a higher score for Perez, Johnson and Hughes."
        }
    ],
    "MSR": [
        {
            "Q": "For Parks, Smith and Ryan, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Parks, Smith and Ryan most needs to improve its {Repurchase Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Parks, Smith and Ryan}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Mitchell-Taylor}."
        }
    ],
    "VA": []
}