{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Interdisciplinary Collaboration Rate ?",
            "A": "The next dimension clockwise from Interdisciplinary Collaboration Rate  is Patent Commercialization Rate "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Research Growth Rate?",
            "A": "The next dimension counterclockwise from Interdisciplinary Collaboration Rate  is Research Growth Rate."
        },
        {
            "Q": "On the R&D ROI (Return on Investment), is the point for Fernandez, Bridges and Castillo AI inside or outside the point for Weaver LLC Biotech?",
            "A": "On the R&D ROI (Return on Investment), the point for Fernandez, Bridges and Castillo AI is outside the point for Weaver LLC Biotech."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Green Technology Adoption Rate Technology Transfer Success Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Fernandez, Bridges and Castillo AI?",
            "A": "The strongest aspect is {Green Technology Adoption Rate Technology Transfer Success Rate}, while the weakest aspect is{ Research Growth Rate}."
        },
        {
            "Q": "On dimension Green Technology Adoption Rate Technology Transfer Success Rate, which label scores the highest?",
            "A": "On Green Technology Adoption Rate Technology Transfer Success Rate, label {Weaver LLC Biotech} scores the highest."
        },
        {
            "Q": "On dimension Green Technology Adoption Rate Technology Transfer Success Rate, which label scores the highest?",
            "A": "On Green Technology Adoption Rate Technology Transfer Success Rate, label {Weaver LLC Biotech} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Fernandez, Bridges and Castillo AI on the Green Technology Adoption Rate Technology Transfer Success Rate in the radar chart?",
            "A": "The value of Fernandez, Bridges and Castillo AI on the Safety dimension is {81}."
        },
        {
            "Q": "What is the value of Weaver LLC Biotech on the Patent Commercialization Rate  in the radar chart?",
            "A": "The value of Weaver LLC Biotech on the Safety dimension is {88}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Weaver LLC Biotech across all dimensions in the radar chart?",
            "A": "The maximum value of Weaver LLC Biotech across all dimensions is {72}."
        },
        {
            "Q": "What is the minimum value of label Weaver LLC Biotech across all dimensions in the radar chart?",
            "A": "The minimum value of Weaver LLC Biotech across all dimensions is {20}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Citation Rate",
            "A": "The average value of Citation Rate is {73.5}."
        },
        {
            "Q": "What is the average value of Fernandez, Bridges and Castillo AI",
            "A": "The average value of Fernandez, Bridges and Castillo AI is {58.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 33 for the Research Growth Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Weaver LLC Biotech} is {35}"
        },
        {
            "Q": "Which labels have scores below 27 for the Research Growth Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Fernandez, Bridges and Castillo AI} is {25}"
        },
        {
            "Q": "For Fernandez, Bridges and Castillo AI in the radar chart, which dimensions have scores between 36 and 79? Please list the dimensions and corresponding scores.",
            "A": "{R&D ROI (Return on Investment)} is {72}, {Interdisciplinary Collaboration Rate } is {65}, {Patent Commercialization Rate } is {52}, {Citation Rate} is {53}"
        }
    ],
    "NC": [
        {
            "Q": "For Fernandez, Bridges and Castillo AI, which dimension has a higher score: Patent Commercialization Rate  or Interdisciplinary Collaboration Rate ?",
            "A": "{Interdisciplinary Collaboration Rate } has a higher score than Patent Commercialization Rate  for Fernandez, Bridges and Castillo AI."
        },
        {
            "Q": "For Weaver LLC Biotech, which dimension has a higher score: Interdisciplinary Collaboration Rate  or R&D ROI (Return on Investment)?",
            "A": "{Interdisciplinary Collaboration Rate } has a higher score than R&D ROI (Return on Investment) for Weaver LLC Biotech."
        },
        {
            "Q": "On Green Technology Adoption Rate Technology Transfer Success Rate, which label has a higher score: Fernandez, Bridges and Castillo AI or the Weaver LLC Biotech?",
            "A": "{Fernandez, Bridges and Castillo AI} has a higher score on Green Technology Adoption Rate Technology Transfer Success Rate compared to Weaver LLC Biotech."
        },
        {
            "Q": "On Interdisciplinary Collaboration Rate , which label has a higher score: Weaver LLC Biotech or the Fernandez, Bridges and Castillo AI?",
            "A": "{Fernandez, Bridges and Castillo AI} has a higher score on Interdisciplinary Collaboration Rate  compared to Weaver LLC Biotech."
        }
    ],
    "MSR": [
        {
            "Q": "For Weaver LLC Biotech, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Weaver LLC Biotech most needs to improve its {Green Technology Adoption Rate Technology Transfer Success Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Fernandez, Bridges and Castillo AI}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Weaver LLC Biotech}."
        }
    ],
    "VA": []
}