{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Live Stream Viewer Retention Rate?",
            "A": "The next dimension clockwise from Live Stream Viewer Retention Rate is Ad Click-Through Rate (CTR)"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from User Engagement Rate?",
            "A": "The next dimension counterclockwise from Live Stream Viewer Retention Rate is User Engagement Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Social Commerce Conversion Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Phillips and Sons Media?",
            "A": "The strongest aspect is {Social Commerce Conversion Rate}, while the weakest aspect is{ Live Stream Viewer Retention Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Phillips and Sons Media on the Live Stream Viewer Retention Rate in the radar chart?",
            "A": "The value of Phillips and Sons Media on the Safety dimension is {38}."
        },
        {
            "Q": "What is the value of Phillips and Sons Media on the Social Commerce Conversion Rate in the radar chart?",
            "A": "The value of Phillips and Sons Media on the Safety dimension is {87}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Phillips and Sons Media across all dimensions in the radar chart?",
            "A": "The maximum value of Phillips and Sons Media across all dimensions is {50}."
        },
        {
            "Q": "What is the minimum value of label Phillips and Sons Media across all dimensions in the radar chart?",
            "A": "The minimum value of Phillips and Sons Media across all dimensions is {50}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Follower Growth Rate",
            "A": "The average value of Follower Growth Rate is {50.0}."
        },
        {
            "Q": "What is the average value of Phillips and Sons Media",
            "A": "The average value of Phillips and Sons Media is {69.5}."
        }
    ],
    "NF": [
        {
            "Q": "For Phillips and Sons Media in the radar chart, which dimensions have scores below 48? Please list the dimensions and corresponding scores.",
            "A": "{Live Stream Viewer Retention Rate} is {38}"
        },
        {
            "Q": "For Phillips and Sons Media in the radar chart, which dimensions have scores between 48 and 77? Please list the dimensions and corresponding scores.",
            "A": "{Follower Growth Rate} is {50}"
        },
        {
            "Q": "For Phillips and Sons Media in the radar chart, which dimensions have scores above 77? Please list the dimensions and corresponding scores.",
            "A": "{Social Commerce Conversion Rate} is {87}, {User Engagement Rate} is {86}, {Influencer Collaboration ROI Rate} is {79}"
        }
    ],
    "NC": [
        {
            "Q": "For Phillips and Sons Media, which dimension has a higher score: Social Commerce Conversion Rate or Live Stream Viewer Retention Rate?",
            "A": "{Social Commerce Conversion Rate} has a higher score than Live Stream Viewer Retention Rate for Phillips and Sons Media."
        },
        {
            "Q": "For Phillips and Sons Media, which dimension has a higher score: User Engagement Rate or Ad Click-Through Rate (CTR)?",
            "A": "{User Engagement Rate} has a higher score than Ad Click-Through Rate (CTR) for Phillips and Sons Media."
        },
        {
            "Q": "For Phillips and Sons Media, which dimension has a higher score: Follower Growth Rate or Live Stream Viewer Retention Rate or User Engagement Rate?",
            "A": "{User Engagement Rate} has a higher score for Phillips and Sons Media."
        }
    ],
    "MSR": [
        {
            "Q": "For Phillips and Sons Media, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Phillips and Sons Media most needs to improve its {Live Stream Viewer Retention Rate}."
        }
    ],
    "VA": []
}