{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Ticket Sales Rate ?",
            "A": "The next dimension clockwise from Ticket Sales Rate  is Box Office ROI "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Ticket Sales Rate ?",
            "A": "The next dimension counterclockwise from Ticket Sales Rate  is Sponsorship Revenue Ratio ."
        },
        {
            "Q": "On the User Retention Rate , is the point for iterate one-to-one ROI inside or outside the point for drive visionary ROI?",
            "A": "On the User Retention Rate , the point for iterate one-to-one ROI is outside the point for drive visionary ROI."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Sponsorship Revenue Ratio } encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of iterate one-to-one ROI?",
            "A": "The strongest aspect is {Sponsorship Revenue Ratio }, while the weakest aspect is{ Ticket Sales Rate }."
        },
        {
            "Q": "On dimension Box Office ROI , which label scores the highest?",
            "A": "On Box Office ROI , label {drive visionary ROI} scores the highest."
        },
        {
            "Q": "On dimension Sponsorship Revenue Ratio , which label scores the highest?",
            "A": "On Sponsorship Revenue Ratio , label {drive visionary ROI} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of iterate one-to-one ROI on the TV/Streaming Viewership Rating  in the radar chart?",
            "A": "The value of iterate one-to-one ROI on the Safety dimension is {74}."
        },
        {
            "Q": "What is the value of iterate one-to-one ROI on the User Retention Rate  in the radar chart?",
            "A": "The value of iterate one-to-one ROI on the Safety dimension is {82}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label drive visionary ROI across all dimensions in the radar chart?",
            "A": "The maximum value of drive visionary ROI across all dimensions is {82}."
        },
        {
            "Q": "What is the minimum value of label drive visionary ROI across all dimensions in the radar chart?",
            "A": "The minimum value of drive visionary ROI across all dimensions is {88}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of User Retention Rate ",
            "A": "The average value of User Retention Rate  is {69.0}."
        },
        {
            "Q": "What is the average value of drive visionary ROI",
            "A": "The average value of drive visionary ROI is {55.83}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 64 for the TV/Streaming Viewership Rating  dimension? Please list the labels and corresponding scores.",
            "A": "{iterate one-to-one ROI} is {74}"
        },
        {
            "Q": "For iterate one-to-one ROI in the radar chart, which dimensions have scores below 75? Please list the dimensions and corresponding scores.",
            "A": "{Ticket Sales Rate } is {72}, {TV/Streaming Viewership Rating } is {74}"
        },
        {
            "Q": "For iterate one-to-one ROI in the radar chart, which dimensions have scores between 75 and 86? Please list the dimensions and corresponding scores.",
            "A": "{User Retention Rate } is {82}, {Box Office ROI } is {79}"
        }
    ],
    "NC": [
        {
            "Q": "For iterate one-to-one ROI, which dimension has a higher score: Box Office ROI  or Live Comment Engagement Rate ?",
            "A": "{Live Comment Engagement Rate } has a higher score than Box Office ROI  for iterate one-to-one ROI."
        },
        {
            "Q": "On TV/Streaming Viewership Rating , which label has a higher score: iterate one-to-one ROI or the drive visionary ROI?",
            "A": "{iterate one-to-one ROI} has a higher score on TV/Streaming Viewership Rating  compared to drive visionary ROI."
        },
        {
            "Q": "On Sponsorship Revenue Ratio , which label has a higher score: iterate one-to-one ROI or the drive visionary ROI?",
            "A": "{iterate one-to-one ROI} has a higher score on Sponsorship Revenue Ratio  compared to drive visionary ROI."
        },
        {
            "Q": "For drive visionary ROI, which dimension has a higher score: Ticket Sales Rate  or Sponsorship Revenue Ratio  or User Retention Rate ?",
            "A": "{Sponsorship Revenue Ratio } has a higher score for drive visionary ROI."
        }
    ],
    "MSR": [
        {
            "Q": "For iterate one-to-one ROI, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "iterate one-to-one ROI most needs to improve its {Ticket Sales Rate }."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {iterate one-to-one ROI}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {drive visionary ROI}."
        }
    ],
    "VA": []
}