{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Box Office ROI ?",
            "A": "The next dimension clockwise from Box Office ROI  is User Retention Rate "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Box Office ROI ?",
            "A": "The next dimension counterclockwise from Box Office ROI  is Ticket Sales Rate ."
        },
        {
            "Q": "On the Ticket Sales Rate , is the point for re-contextualize world-class mindshare inside or outside the point for generate magnetic models?",
            "A": "On the Ticket Sales Rate , the point for re-contextualize world-class mindshare is inside the point for generate magnetic models."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Box Office ROI } encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of re-contextualize world-class mindshare?",
            "A": "The strongest aspect is {Box Office ROI }, while the weakest aspect is{ Streaming Play Rate }."
        },
        {
            "Q": "On dimension Streaming Play Rate , which label scores the highest?",
            "A": "On Streaming Play Rate , label {generate magnetic models} scores the highest."
        },
        {
            "Q": "On dimension User Retention Rate , which label scores the highest?",
            "A": "On User Retention Rate , label {re-contextualize world-class mindshare} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of generate magnetic models on the Streaming Play Rate  in the radar chart?",
            "A": "The value of generate magnetic models on the Safety dimension is {44}."
        },
        {
            "Q": "What is the value of re-contextualize world-class mindshare on the Streaming Play Rate  in the radar chart?",
            "A": "The value of re-contextualize world-class mindshare on the Safety dimension is {65}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label re-contextualize world-class mindshare across all dimensions in the radar chart?",
            "A": "The maximum value of re-contextualize world-class mindshare across all dimensions is {44}."
        },
        {
            "Q": "What is the minimum value of label re-contextualize world-class mindshare across all dimensions in the radar chart?",
            "A": "The minimum value of re-contextualize world-class mindshare across all dimensions is {74}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Streaming Play Rate ",
            "A": "The average value of Streaming Play Rate  is {54.5}."
        },
        {
            "Q": "What is the average value of re-contextualize world-class mindshare",
            "A": "The average value of re-contextualize world-class mindshare is {76.25}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 87 for the Box Office ROI  dimension? Please list the labels and corresponding scores.",
            "A": "{re-contextualize world-class mindshare} is {99}"
        },
        {
            "Q": "Which labels have scores below 72 for the User Retention Rate  dimension? Please list the labels and corresponding scores.",
            "A": "{re-contextualize world-class mindshare} is {67}"
        },
        {
            "Q": "For generate magnetic models in the radar chart, which dimensions have scores below 50? Please list the dimensions and corresponding scores.",
            "A": "{Streaming Play Rate } is {44}, {Box Office ROI } is {40}"
        }
    ],
    "NC": [
        {
            "Q": "For re-contextualize world-class mindshare, which dimension has a higher score: Streaming Play Rate  or User Retention Rate ?",
            "A": "{User Retention Rate } has a higher score than Streaming Play Rate  for re-contextualize world-class mindshare."
        },
        {
            "Q": "For generate magnetic models, which dimension has a higher score: User Retention Rate  or Streaming Play Rate ?",
            "A": "{User Retention Rate } has a higher score than Streaming Play Rate  for generate magnetic models."
        },
        {
            "Q": "On User Retention Rate , which label has a higher score: generate magnetic models or the re-contextualize world-class mindshare?",
            "A": "{generate magnetic models} has a higher score on User Retention Rate  compared to re-contextualize world-class mindshare."
        },
        {
            "Q": "For generate magnetic models, which dimension has a higher score: Ticket Sales Rate  or Box Office ROI  or User Retention Rate ?",
            "A": "{User Retention Rate } has a higher score for generate magnetic models."
        }
    ],
    "MSR": [
        {
            "Q": "For re-contextualize world-class mindshare, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "re-contextualize world-class mindshare most needs to improve its {Streaming Play Rate }."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {re-contextualize world-class mindshare}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {generate magnetic models}."
        }
    ],
    "VA": []
}