{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Ticket Sales Rate ?",
            "A": "The next dimension clockwise from Ticket Sales Rate  is Ad Impression Rate "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Ad Impression Rate ?",
            "A": "The next dimension counterclockwise from Ticket Sales Rate  is Streaming Play Rate ."
        },
        {
            "Q": "On the Sponsorship Revenue Ratio , is the point for re-intermediate web-enabled ROI inside or outside the point for repurpose intuitive eyeballs?",
            "A": "On the Sponsorship Revenue Ratio , the point for re-intermediate web-enabled ROI is outside the point for repurpose intuitive eyeballs."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Live Comment Engagement Rate } encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of re-intermediate web-enabled ROI?",
            "A": "The strongest aspect is {Live Comment Engagement Rate }, while the weakest aspect is{ Ticket Sales Rate }."
        },
        {
            "Q": "On dimension Streaming Play Rate , which label scores the highest?",
            "A": "On Streaming Play Rate , label {re-intermediate web-enabled ROI} scores the highest."
        },
        {
            "Q": "On dimension User Retention Rate , which label scores the highest?",
            "A": "On User Retention Rate , label {re-intermediate web-enabled ROI} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of re-intermediate web-enabled ROI on the Sponsorship Revenue Ratio  in the radar chart?",
            "A": "The value of re-intermediate web-enabled ROI on the Safety dimension is {62}."
        },
        {
            "Q": "What is the value of repurpose intuitive eyeballs on the Ad Impression Rate  in the radar chart?",
            "A": "The value of repurpose intuitive eyeballs on the Safety dimension is {87}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label repurpose intuitive eyeballs across all dimensions in the radar chart?",
            "A": "The maximum value of repurpose intuitive eyeballs across all dimensions is {66}."
        },
        {
            "Q": "What is the minimum value of label repurpose intuitive eyeballs across all dimensions in the radar chart?",
            "A": "The minimum value of repurpose intuitive eyeballs across all dimensions is {82}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of User Retention Rate ",
            "A": "The average value of User Retention Rate  is {73.0}."
        },
        {
            "Q": "What is the average value of repurpose intuitive eyeballs",
            "A": "The average value of repurpose intuitive eyeballs is {63.0}."
        }
    ],
    "NF": [
        {
            "Q": "For repurpose intuitive eyeballs in the radar chart, which dimensions have scores above 60? Please list the dimensions and corresponding scores.",
            "A": "{Live Comment Engagement Rate } is {66}, {Sponsorship Revenue Ratio } is {62}, {TV/Streaming Viewership Rating } is {65}"
        },
        {
            "Q": "Which labels have scores below 50 for the Sponsorship Revenue Ratio  dimension? Please list the labels and corresponding scores.",
            "A": "{repurpose intuitive eyeballs} is {47}"
        },
        {
            "Q": "For re-intermediate web-enabled ROI in the radar chart, which dimensions have scores below 37? Please list the dimensions and corresponding scores.",
            "A": "{Ticket Sales Rate } is {22}, {TV/Streaming Viewership Rating } is {36}"
        }
    ],
    "NC": [
        {
            "Q": "For repurpose intuitive eyeballs, which dimension has a higher score: Streaming Play Rate  or Ticket Sales Rate ?",
            "A": "{Streaming Play Rate } has a higher score than Ticket Sales Rate  for repurpose intuitive eyeballs."
        },
        {
            "Q": "For re-intermediate web-enabled ROI, which dimension has a higher score: Live Comment Engagement Rate  or Sponsorship Revenue Ratio ?",
            "A": "{Live Comment Engagement Rate } has a higher score than Sponsorship Revenue Ratio  for re-intermediate web-enabled ROI."
        },
        {
            "Q": "On Ad Impression Rate , which label has a higher score: repurpose intuitive eyeballs or the re-intermediate web-enabled ROI?",
            "A": "{repurpose intuitive eyeballs} has a higher score on Ad Impression Rate  compared to re-intermediate web-enabled ROI."
        },
        {
            "Q": "For repurpose intuitive eyeballs, which dimension has a higher score: Ad Impression Rate  or TV/Streaming Viewership Rating  or Sponsorship Revenue Ratio ?",
            "A": "{Ad Impression Rate } has a higher score for repurpose intuitive eyeballs."
        }
    ],
    "MSR": [
        {
            "Q": "For re-intermediate web-enabled ROI, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "re-intermediate web-enabled ROI most needs to improve its {Ticket Sales Rate }."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {repurpose intuitive eyeballs}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {re-intermediate web-enabled ROI}."
        }
    ],
    "VA": []
}