{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Sponsorship Revenue Ratio ?",
            "A": "The next dimension clockwise from Sponsorship Revenue Ratio  is Streaming Play Rate "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Sponsorship Revenue Ratio ?",
            "A": "The next dimension counterclockwise from Sponsorship Revenue Ratio  is Ad Impression Rate ."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Streaming Play Rate } encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of integrate innovative relationships?",
            "A": "The strongest aspect is {Streaming Play Rate }, while the weakest aspect is{ Ad Impression Rate }."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of integrate innovative relationships on the Streaming Play Rate  in the radar chart?",
            "A": "The value of integrate innovative relationships on the Safety dimension is {84}."
        },
        {
            "Q": "What is the value of integrate innovative relationships on the User Retention Rate  in the radar chart?",
            "A": "The value of integrate innovative relationships on the Safety dimension is {43}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label integrate innovative relationships across all dimensions in the radar chart?",
            "A": "The maximum value of integrate innovative relationships across all dimensions is {43}."
        },
        {
            "Q": "What is the minimum value of label integrate innovative relationships across all dimensions in the radar chart?",
            "A": "The minimum value of integrate innovative relationships across all dimensions is {43}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Ad Impression Rate ",
            "A": "The average value of Ad Impression Rate  is {29.0}."
        },
        {
            "Q": "What is the average value of integrate innovative relationships",
            "A": "The average value of integrate innovative relationships is {53.75}."
        }
    ],
    "NF": [
        {
            "Q": "For integrate innovative relationships in the radar chart, which dimensions have scores above 73? Please list the dimensions and corresponding scores.",
            "A": "{Streaming Play Rate } is {84}"
        },
        {
            "Q": "For integrate innovative relationships in the radar chart, which dimensions have scores between 40 and 73? Please list the dimensions and corresponding scores.",
            "A": "{User Retention Rate } is {43}, {Sponsorship Revenue Ratio } is {59}"
        },
        {
            "Q": "Which labels have scores below 84 for the Streaming Play Rate  dimension? Please list the labels and corresponding scores.",
            "A": "{integrate innovative relationships} is {84}"
        }
    ],
    "NC": [
        {
            "Q": "For integrate innovative relationships, which dimension has a higher score: Ad Impression Rate  or Streaming Play Rate ?",
            "A": "{Streaming Play Rate } has a higher score than Ad Impression Rate  for integrate innovative relationships."
        },
        {
            "Q": "For integrate innovative relationships, which dimension has a higher score: User Retention Rate  or Ad Impression Rate  or Sponsorship Revenue Ratio ?",
            "A": "{Sponsorship Revenue Ratio } has a higher score for integrate innovative relationships."
        }
    ],
    "MSR": [
        {
            "Q": "For integrate innovative relationships, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "integrate innovative relationships most needs to improve its {Ad Impression Rate }."
        }
    ],
    "VA": []
}