{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Tourist Growth Rate?",
            "A": "The next dimension clockwise from Tourist Growth Rate is Attraction Capacity Utilization Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Attraction Capacity Utilization Rate?",
            "A": "The next dimension counterclockwise from Tourist Growth Rate is Hotel Occupancy Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Hotel Occupancy Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of West Marybury?",
            "A": "The strongest aspect is {Hotel Occupancy Rate}, while the weakest aspect is{ Attraction Capacity Utilization Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of West Marybury on the Attraction Capacity Utilization Rate in the radar chart?",
            "A": "The value of West Marybury on the Safety dimension is {29}."
        },
        {
            "Q": "What is the value of West Marybury on the Revisit Rate  in the radar chart?",
            "A": "The value of West Marybury on the Safety dimension is {67}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label West Marybury across all dimensions in the radar chart?",
            "A": "The maximum value of West Marybury across all dimensions is {31}."
        },
        {
            "Q": "What is the minimum value of label West Marybury across all dimensions in the radar chart?",
            "A": "The minimum value of West Marybury across all dimensions is {31}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Revisit Rate ",
            "A": "The average value of Revisit Rate  is {67.0}."
        },
        {
            "Q": "What is the average value of West Marybury",
            "A": "The average value of West Marybury is {59.5}."
        }
    ],
    "NF": [
        {
            "Q": "For West Marybury in the radar chart, which dimensions have scores below 42? Please list the dimensions and corresponding scores.",
            "A": "{Tourist Conversion Rate} is {31}, {Attraction Capacity Utilization Rate} is {29}"
        },
        {
            "Q": "Which labels have scores above 29 for the Attraction Capacity Utilization Rate dimension? Please list the labels and corresponding scores.",
            "A": "{West Marybury} is {29}"
        },
        {
            "Q": "Which labels have scores below 92 for the Tourist Growth Rate dimension? Please list the labels and corresponding scores.",
            "A": "{West Marybury} is {92}"
        }
    ],
    "NC": [
        {
            "Q": "For West Marybury, which dimension has a higher score: Tourist Growth Rate or Hotel Occupancy Rate?",
            "A": "{Tourist Growth Rate} has a higher score than Hotel Occupancy Rate for West Marybury."
        },
        {
            "Q": "For West Marybury, which dimension has a higher score: Return on Investment (ROI)Local Community Engagement Rate or Attraction Capacity Utilization Rate?",
            "A": "{Return on Investment (ROI)Local Community Engagement Rate} has a higher score than Attraction Capacity Utilization Rate for West Marybury."
        },
        {
            "Q": "For West Marybury, which dimension has a higher score: Attraction Capacity Utilization Rate or Revisit Rate  or Tourist Growth Rate?",
            "A": "{Tourist Growth Rate} has a higher score for West Marybury."
        }
    ],
    "MSR": [
        {
            "Q": "For West Marybury, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "West Marybury most needs to improve its {Attraction Capacity Utilization Rate}."
        }
    ],
    "VA": []
}