{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Tourist Conversion Rate?",
            "A": "The next dimension clockwise from Tourist Conversion Rate is Tourist Satisfaction Rate "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Hotel Occupancy Rate?",
            "A": "The next dimension counterclockwise from Tourist Conversion Rate is Hotel Occupancy Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Tourist Conversion Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Perezton?",
            "A": "The strongest aspect is {Tourist Conversion Rate}, while the weakest aspect is{ Return on Investment (ROI)Local Community Engagement Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Perezton on the Tourist Conversion Rate in the radar chart?",
            "A": "The value of Perezton on the Safety dimension is {98}."
        },
        {
            "Q": "What is the value of Perezton on the Hotel Occupancy Rate in the radar chart?",
            "A": "The value of Perezton on the Safety dimension is {83}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Perezton across all dimensions in the radar chart?",
            "A": "The maximum value of Perezton across all dimensions is {36}."
        },
        {
            "Q": "What is the minimum value of label Perezton across all dimensions in the radar chart?",
            "A": "The minimum value of Perezton across all dimensions is {36}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Tourist Satisfaction Rate ",
            "A": "The average value of Tourist Satisfaction Rate  is {79.0}."
        },
        {
            "Q": "What is the average value of Perezton",
            "A": "The average value of Perezton is {67.4}."
        }
    ],
    "NF": [
        {
            "Q": "For Perezton in the radar chart, which dimensions have scores between 48 and 86? Please list the dimensions and corresponding scores.",
            "A": "{Hotel Occupancy Rate} is {83}, {Tourist Satisfaction Rate } is {79}"
        },
        {
            "Q": "For Perezton in the radar chart, which dimensions have scores above 86? Please list the dimensions and corresponding scores.",
            "A": "{Tourist Conversion Rate} is {98}"
        },
        {
            "Q": "Which labels have scores above 98 for the Tourist Conversion Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Perezton} is {98}"
        }
    ],
    "NC": [
        {
            "Q": "For Perezton, which dimension has a higher score: Revisit Rate  or Hotel Occupancy Rate?",
            "A": "{Hotel Occupancy Rate} has a higher score than Revisit Rate  for Perezton."
        },
        {
            "Q": "For Perezton, which dimension has a higher score: Hotel Occupancy Rate or Return on Investment (ROI)Local Community Engagement Rate or Tourist Satisfaction Rate ?",
            "A": "{Hotel Occupancy Rate} has a higher score for Perezton."
        },
        {
            "Q": "For Perezton, which dimension has a higher score: Revisit Rate  or Tourist Conversion Rate or Tourist Satisfaction Rate ?",
            "A": "{Tourist Conversion Rate} has a higher score for Perezton."
        }
    ],
    "MSR": [
        {
            "Q": "For Perezton, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Perezton most needs to improve its {Return on Investment (ROI)Local Community Engagement Rate}."
        }
    ],
    "VA": []
}