{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Revisit Rate ?",
            "A": "The next dimension clockwise from Revisit Rate  is Tourist Growth Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Revisit Rate ?",
            "A": "The next dimension counterclockwise from Revisit Rate  is Attraction Capacity Utilization Rate."
        },
        {
            "Q": "On the Revisit Rate , is the point for Ballside inside or outside the point for Lake John?",
            "A": "On the Revisit Rate , the point for Ballside is outside the point for Lake John."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Return on Investment (ROI)Local Community Engagement Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Lake John?",
            "A": "The strongest aspect is {Return on Investment (ROI)Local Community Engagement Rate}, while the weakest aspect is{ Revisit Rate }."
        },
        {
            "Q": "On dimension Revisit Rate , which label scores the highest?",
            "A": "On Revisit Rate , label {Lake John} scores the highest."
        },
        {
            "Q": "On dimension Revisit Rate , which label scores the highest?",
            "A": "On Revisit Rate , label {Lake John} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Ballside on the Tourist Satisfaction Rate  in the radar chart?",
            "A": "The value of Ballside on the Safety dimension is {68}."
        },
        {
            "Q": "What is the value of Ballside on the Tourist Growth Rate in the radar chart?",
            "A": "The value of Ballside on the Safety dimension is {65}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Ballside across all dimensions in the radar chart?",
            "A": "The maximum value of Ballside across all dimensions is {68}."
        },
        {
            "Q": "What is the minimum value of label Ballside across all dimensions in the radar chart?",
            "A": "The minimum value of Ballside across all dimensions is {64}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Tourist Growth Rate",
            "A": "The average value of Tourist Growth Rate is {57.5}."
        },
        {
            "Q": "What is the average value of Lake John",
            "A": "The average value of Lake John is {54.8}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 71 for the Return on Investment (ROI)Local Community Engagement Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Ballside} is {64}"
        },
        {
            "Q": "For Lake John in the radar chart, which dimensions have scores above 63? Please list the dimensions and corresponding scores.",
            "A": "{Return on Investment (ROI)Local Community Engagement Rate} is {64}, {Tourist Satisfaction Rate } is {68}, {Tourist Growth Rate} is {65}"
        },
        {
            "Q": "Which labels have scores above 62 for the Tourist Growth Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Ballside} is {65}"
        }
    ],
    "NC": [
        {
            "Q": "For Lake John, which dimension has a higher score: Return on Investment (ROI)Local Community Engagement Rate or Tourist Satisfaction Rate ?",
            "A": "{Return on Investment (ROI)Local Community Engagement Rate} has a higher score than Tourist Satisfaction Rate  for Lake John."
        },
        {
            "Q": "On Revisit Rate , which label has a higher score: Ballside or the Lake John?",
            "A": "{Ballside} has a higher score on Revisit Rate  compared to Lake John."
        },
        {
            "Q": "On Return on Investment (ROI)Local Community Engagement Rate, which label has a higher score: Ballside or the Lake John?",
            "A": "{Lake John} has a higher score on Return on Investment (ROI)Local Community Engagement Rate compared to Ballside."
        },
        {
            "Q": "For Lake John, which dimension has a higher score: Revisit Rate  or Tourist Growth Rate or Return on Investment (ROI)Local Community Engagement Rate?",
            "A": "{Return on Investment (ROI)Local Community Engagement Rate} has a higher score for Lake John."
        }
    ],
    "MSR": [
        {
            "Q": "For Lake John, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Lake John most needs to improve its {Revisit Rate }."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Ballside}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Lake John}."
        }
    ],
    "VA": []
}