{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Net Profit Margin?",
            "A": "The next dimension clockwise from Net Profit Margin is ROI"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Net Profit Margin?",
            "A": "The next dimension counterclockwise from Net Profit Margin is Customer Retention Rate."
        },
        {
            "Q": "On the Current Ratio, is the point for Davies, Gutierrez and Jones inside or outside the point for Sosa Inc?",
            "A": "On the Current Ratio, the point for Davies, Gutierrez and Jones is inside the point for Sosa Inc."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Current Ratio} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Sosa Inc?",
            "A": "The strongest aspect is {Current Ratio}, while the weakest aspect is{ Net Profit Margin}."
        },
        {
            "Q": "On dimension Current Ratio, which label scores the highest?",
            "A": "On Current Ratio, label {Davies, Gutierrez and Jones} scores the highest."
        },
        {
            "Q": "On dimension Customer Retention Rate, which label scores the highest?",
            "A": "On Customer Retention Rate, label {Sosa Inc} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Davies, Gutierrez and Jones on the ROI in the radar chart?",
            "A": "The value of Davies, Gutierrez and Jones on the Safety dimension is {60}."
        },
        {
            "Q": "What is the value of Davies, Gutierrez and Jones on the Current Ratio in the radar chart?",
            "A": "The value of Davies, Gutierrez and Jones on the Safety dimension is {92}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Davies, Gutierrez and Jones across all dimensions in the radar chart?",
            "A": "The maximum value of Davies, Gutierrez and Jones across all dimensions is {89}."
        },
        {
            "Q": "What is the minimum value of label Davies, Gutierrez and Jones across all dimensions in the radar chart?",
            "A": "The minimum value of Davies, Gutierrez and Jones across all dimensions is {92}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Customer Retention Rate",
            "A": "The average value of Customer Retention Rate is {79.0}."
        },
        {
            "Q": "What is the average value of Sosa Inc",
            "A": "The average value of Sosa Inc is {67.0}."
        }
    ],
    "NF": [
        {
            "Q": "For Davies, Gutierrez and Jones in the radar chart, which dimensions have scores below 50? Please list the dimensions and corresponding scores.",
            "A": "{Net Profit Margin} is {38}"
        },
        {
            "Q": "For Sosa Inc in the radar chart, which dimensions have scores between 50 and 86? Please list the dimensions and corresponding scores.",
            "A": "{Customer Retention Rate} is {69}, {ROI} is {64}"
        },
        {
            "Q": "Which labels have scores above 63 for the ROI dimension? Please list the labels and corresponding scores.",
            "A": "{Sosa Inc} is {64}"
        }
    ],
    "NC": [
        {
            "Q": "For Davies, Gutierrez and Jones, which dimension has a higher score: Current Ratio or ROI?",
            "A": "{Current Ratio} has a higher score than ROI for Davies, Gutierrez and Jones."
        },
        {
            "Q": "For Sosa Inc, which dimension has a higher score: Customer Retention Rate or Net Profit Margin?",
            "A": "{Customer Retention Rate} has a higher score than Net Profit Margin for Sosa Inc."
        },
        {
            "Q": "On Current Ratio, which label has a higher score: Davies, Gutierrez and Jones or the Sosa Inc?",
            "A": "{Sosa Inc} has a higher score on Current Ratio compared to Davies, Gutierrez and Jones."
        },
        {
            "Q": "On Net Profit Margin, which label has a higher score: Sosa Inc or the Davies, Gutierrez and Jones?",
            "A": "{Davies, Gutierrez and Jones} has a higher score on Net Profit Margin compared to Sosa Inc."
        }
    ],
    "MSR": [
        {
            "Q": "For Davies, Gutierrez and Jones, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Davies, Gutierrez and Jones most needs to improve its {ROI}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Davies, Gutierrez and Jones}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Sosa Inc}."
        }
    ],
    "VA": []
}