{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Service Coverage Rate?",
            "A": "The next dimension clockwise from Service Coverage Rate is On-Time Delivery Rate "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from On-Time Delivery Rate ?",
            "A": "The next dimension counterclockwise from Service Coverage Rate is Route Efficiency ."
        },
        {
            "Q": "On the Damage/Loss Rate , is the point for Patterson, Roberts and Bates inside or outside the point for Dominguez Ltd?",
            "A": "On the Damage/Loss Rate , the point for Patterson, Roberts and Bates is inside the point for Dominguez Ltd."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Route Efficiency } encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Patterson, Roberts and Bates?",
            "A": "The strongest aspect is {Route Efficiency }, while the weakest aspect is{ Route Optimization Efficiency}."
        },
        {
            "Q": "On dimension On-Time Delivery Rate , which label scores the highest?",
            "A": "On On-Time Delivery Rate , label {Dominguez Ltd} scores the highest."
        },
        {
            "Q": "On dimension Vehicle Utilization Rate, which label scores the highest?",
            "A": "On Vehicle Utilization Rate, label {Patterson, Roberts and Bates} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Durham-White on the Vehicle Utilization Rate in the radar chart?",
            "A": "The value of Durham-White on the Safety dimension is {75}."
        },
        {
            "Q": "What is the value of Dominguez Ltd on the Vehicle Utilization Rate in the radar chart?",
            "A": "The value of Dominguez Ltd on the Safety dimension is {91}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Dominguez Ltd across all dimensions in the radar chart?",
            "A": "The maximum value of Dominguez Ltd across all dimensions is {25}."
        },
        {
            "Q": "What is the minimum value of label Dominguez Ltd across all dimensions in the radar chart?",
            "A": "The minimum value of Dominguez Ltd across all dimensions is {37}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Damage/Loss Rate ",
            "A": "The average value of Damage/Loss Rate  is {54.33}."
        },
        {
            "Q": "What is the average value of Dominguez Ltd",
            "A": "The average value of Dominguez Ltd is {60.43}."
        },
        {
            "Q": "What is the difference in Service Coverage Rate between Durham-White and Patterson, Roberts and Bates?",
            "A": "The difference in Service Coverage Rate between Durham-White and Patterson, Roberts and Bates is {4}."
        },
        {
            "Q": "What is the difference in Route Optimization Efficiency between Patterson, Roberts and Bates and Dominguez Ltd?",
            "A": "The difference in Route Optimization Efficiency between Patterson, Roberts and Bates and Dominguez Ltd is {1}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 81 for the Vehicle Utilization Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Dominguez Ltd} is {91}"
        },
        {
            "Q": "For Durham-White in the radar chart, which dimensions have scores between 47 and 80? Please list the dimensions and corresponding scores.",
            "A": "{Vehicle Utilization Rate} is {75}, {Route Efficiency } is {62}, {Service Coverage Rate} is {77}"
        },
        {
            "Q": "Which labels have scores below 28 for the Route Optimization Efficiency dimension? Please list the labels and corresponding scores.",
            "A": "{Durham-White} is {25}"
        }
    ],
    "NC": [
        {
            "Q": "For Patterson, Roberts and Bates, which dimension has a higher score: Fuel Cost as Rate of Revenue or Route Efficiency ?",
            "A": "{Route Efficiency } has a higher score than Fuel Cost as Rate of Revenue for Patterson, Roberts and Bates."
        },
        {
            "Q": "For Durham-White, which dimension has a higher score: Vehicle Utilization Rate or Route Optimization Efficiency?",
            "A": "{Vehicle Utilization Rate} has a higher score than Route Optimization Efficiency for Durham-White."
        },
        {
            "Q": "On Service Coverage Rate, which label has a higher score: Dominguez Ltd or the Patterson, Roberts and Bates?",
            "A": "{Dominguez Ltd} has a higher score on Service Coverage Rate compared to Patterson, Roberts and Bates."
        },
        {
            "Q": "For Patterson, Roberts and Bates, which dimension has a higher score: Fuel Cost as Rate of Revenue or On-Time Delivery Rate  or Damage/Loss Rate ?",
            "A": "{On-Time Delivery Rate } has a higher score for Patterson, Roberts and Bates."
        }
    ],
    "MSR": [
        {
            "Q": "For Dominguez Ltd, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Dominguez Ltd most needs to improve its {Route Optimization Efficiency}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Durham-White}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Patterson, Roberts and Bates}."
        }
    ],
    "VA": []
}