{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Damage/Loss Rate ?",
            "A": "The next dimension clockwise from Damage/Loss Rate  is Route Optimization Efficiency"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Fuel Cost as Rate of Revenue?",
            "A": "The next dimension counterclockwise from Damage/Loss Rate  is Service Coverage Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Fuel Cost as Rate of Revenue} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Lara, Lin and Brooks?",
            "A": "The strongest aspect is {Fuel Cost as Rate of Revenue}, while the weakest aspect is{ On-Time Delivery Rate }."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Lara, Lin and Brooks on the Service Coverage Rate in the radar chart?",
            "A": "The value of Lara, Lin and Brooks on the Safety dimension is {64}."
        },
        {
            "Q": "What is the value of Lara, Lin and Brooks on the Damage/Loss Rate  in the radar chart?",
            "A": "The value of Lara, Lin and Brooks on the Safety dimension is {63}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Lara, Lin and Brooks across all dimensions in the radar chart?",
            "A": "The maximum value of Lara, Lin and Brooks across all dimensions is {22}."
        },
        {
            "Q": "What is the minimum value of label Lara, Lin and Brooks across all dimensions in the radar chart?",
            "A": "The minimum value of Lara, Lin and Brooks across all dimensions is {22}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Vehicle Utilization Rate",
            "A": "The average value of Vehicle Utilization Rate is {71.0}."
        },
        {
            "Q": "What is the average value of Lara, Lin and Brooks",
            "A": "The average value of Lara, Lin and Brooks is {55.29}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 64 for the Service Coverage Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Lara, Lin and Brooks} is {64}"
        },
        {
            "Q": "For Lara, Lin and Brooks in the radar chart, which dimensions have scores between 37 and 83? Please list the dimensions and corresponding scores.",
            "A": "{Service Coverage Rate} is {64}, {Damage/Loss Rate } is {63}, {Route Efficiency } is {38}, {Vehicle Utilization Rate} is {71}"
        },
        {
            "Q": "For Lara, Lin and Brooks in the radar chart, which dimensions have scores above 83? Please list the dimensions and corresponding scores.",
            "A": "{Fuel Cost as Rate of Revenue} is {98}"
        }
    ],
    "NC": [
        {
            "Q": "For Lara, Lin and Brooks, which dimension has a higher score: Vehicle Utilization Rate or On-Time Delivery Rate ?",
            "A": "{Vehicle Utilization Rate} has a higher score than On-Time Delivery Rate  for Lara, Lin and Brooks."
        },
        {
            "Q": "For Lara, Lin and Brooks, which dimension has a higher score: Route Efficiency  or Damage/Loss Rate ?",
            "A": "{Damage/Loss Rate } has a higher score than Route Efficiency  for Lara, Lin and Brooks."
        }
    ],
    "MSR": [
        {
            "Q": "For Lara, Lin and Brooks, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Lara, Lin and Brooks most needs to improve its {On-Time Delivery Rate }."
        }
    ],
    "VA": []
}