{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Route Efficiency ?",
            "A": "The next dimension clockwise from Route Efficiency  is Damage/Loss Rate "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Service Coverage Rate?",
            "A": "The next dimension counterclockwise from Route Efficiency  is Customer Satisfaction ."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Route Efficiency } encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Nelson-Hahn?",
            "A": "The strongest aspect is {Route Efficiency }, while the weakest aspect is{ Damage/Loss Rate }."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Nelson-Hahn on the On-Time Delivery Rate  in the radar chart?",
            "A": "The value of Nelson-Hahn on the Safety dimension is {36}."
        },
        {
            "Q": "What is the value of Nelson-Hahn on the Damage/Loss Rate  in the radar chart?",
            "A": "The value of Nelson-Hahn on the Safety dimension is {34}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Nelson-Hahn across all dimensions in the radar chart?",
            "A": "The maximum value of Nelson-Hahn across all dimensions is {36}."
        },
        {
            "Q": "What is the minimum value of label Nelson-Hahn across all dimensions in the radar chart?",
            "A": "The minimum value of Nelson-Hahn across all dimensions is {36}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Customer Satisfaction ",
            "A": "The average value of Customer Satisfaction  is {72.0}."
        },
        {
            "Q": "What is the average value of Nelson-Hahn",
            "A": "The average value of Nelson-Hahn is {59.83}."
        }
    ],
    "NF": [
        {
            "Q": "For Nelson-Hahn in the radar chart, which dimensions have scores above 72? Please list the dimensions and corresponding scores.",
            "A": "{Route Efficiency } is {81}"
        },
        {
            "Q": "Which labels have scores below 34 for the Damage/Loss Rate  dimension? Please list the labels and corresponding scores.",
            "A": "{Nelson-Hahn} is {34}"
        },
        {
            "Q": "For Nelson-Hahn in the radar chart, which dimensions have scores between 43 and 72? Please list the dimensions and corresponding scores.",
            "A": "{Vehicle Utilization Rate} is {69}, {Service Coverage Rate} is {67}"
        }
    ],
    "NC": [
        {
            "Q": "For Nelson-Hahn, which dimension has a higher score: Vehicle Utilization Rate or Damage/Loss Rate ?",
            "A": "{Vehicle Utilization Rate} has a higher score than Damage/Loss Rate  for Nelson-Hahn."
        },
        {
            "Q": "For Nelson-Hahn, which dimension has a higher score: Vehicle Utilization Rate or Damage/Loss Rate  or Service Coverage Rate?",
            "A": "{Vehicle Utilization Rate} has a higher score for Nelson-Hahn."
        }
    ],
    "MSR": [
        {
            "Q": "For Nelson-Hahn, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Nelson-Hahn most needs to improve its {Damage/Loss Rate }."
        }
    ],
    "VA": []
}