{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Fuel Cost as Rate of Revenue?",
            "A": "The next dimension clockwise from Fuel Cost as Rate of Revenue is Vehicle Utilization Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Vehicle Utilization Rate?",
            "A": "The next dimension counterclockwise from Fuel Cost as Rate of Revenue is Route Optimization Efficiency."
        },
        {
            "Q": "On the Route Optimization Efficiency, is the point for Phelps, Morris and Villa inside or outside the point for Kim, Mercado and Wallace?",
            "A": "On the Route Optimization Efficiency, the point for Phelps, Morris and Villa is outside the point for Kim, Mercado and Wallace."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Customer Satisfaction } encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Phelps, Morris and Villa?",
            "A": "The strongest aspect is {Customer Satisfaction }, while the weakest aspect is{ Fuel Cost as Rate of Revenue}."
        },
        {
            "Q": "On dimension Service Coverage Rate, which label scores the highest?",
            "A": "On Service Coverage Rate, label {Phelps, Morris and Villa} scores the highest."
        },
        {
            "Q": "On dimension Route Optimization Efficiency, which label scores the highest?",
            "A": "On Route Optimization Efficiency, label {Kim, Mercado and Wallace} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Phelps, Morris and Villa on the Service Coverage Rate in the radar chart?",
            "A": "The value of Phelps, Morris and Villa on the Safety dimension is {56}."
        },
        {
            "Q": "What is the value of Kim, Mercado and Wallace on the Fuel Cost as Rate of Revenue in the radar chart?",
            "A": "The value of Kim, Mercado and Wallace on the Safety dimension is {71}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Phelps, Morris and Villa across all dimensions in the radar chart?",
            "A": "The maximum value of Phelps, Morris and Villa across all dimensions is {39}."
        },
        {
            "Q": "What is the minimum value of label Phelps, Morris and Villa across all dimensions in the radar chart?",
            "A": "The minimum value of Phelps, Morris and Villa across all dimensions is {73}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Service Coverage Rate",
            "A": "The average value of Service Coverage Rate is {60.5}."
        },
        {
            "Q": "What is the average value of Phelps, Morris and Villa",
            "A": "The average value of Phelps, Morris and Villa is {55.83}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 37 for the Route Optimization Efficiency dimension? Please list the labels and corresponding scores.",
            "A": "{Phelps, Morris and Villa} is {39}"
        },
        {
            "Q": "For Phelps, Morris and Villa in the radar chart, which dimensions have scores below 45? Please list the dimensions and corresponding scores.",
            "A": "{Route Optimization Efficiency} is {39}, {Fuel Cost as Rate of Revenue} is {36}"
        },
        {
            "Q": "Which labels have scores below 74 for the Customer Satisfaction  dimension? Please list the labels and corresponding scores.",
            "A": "{Kim, Mercado and Wallace} is {73}"
        }
    ],
    "NC": [
        {
            "Q": "For Phelps, Morris and Villa, which dimension has a higher score: Service Coverage Rate or Route Optimization Efficiency?",
            "A": "{Service Coverage Rate} has a higher score than Route Optimization Efficiency for Phelps, Morris and Villa."
        },
        {
            "Q": "On Vehicle Utilization Rate, which label has a higher score: Phelps, Morris and Villa or the Kim, Mercado and Wallace?",
            "A": "{Phelps, Morris and Villa} has a higher score on Vehicle Utilization Rate compared to Kim, Mercado and Wallace."
        },
        {
            "Q": "For Kim, Mercado and Wallace, which dimension has a higher score: Vehicle Utilization Rate or Customer Satisfaction  or Fuel Cost as Rate of Revenue?",
            "A": "{Customer Satisfaction } has a higher score for Kim, Mercado and Wallace."
        },
        {
            "Q": "For Phelps, Morris and Villa, which dimension has a higher score: Customer Satisfaction  or Service Coverage Rate or Damage/Loss Rate ?",
            "A": "{Customer Satisfaction } has a higher score for Phelps, Morris and Villa."
        }
    ],
    "MSR": [
        {
            "Q": "For Kim, Mercado and Wallace, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Kim, Mercado and Wallace most needs to improve its {Vehicle Utilization Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Phelps, Morris and Villa}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Kim, Mercado and Wallace}."
        }
    ],
    "VA": []
}