{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Customer Satisfaction ?",
            "A": "The next dimension clockwise from Customer Satisfaction  is On-Time Delivery Rate "
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Customer Satisfaction ?",
            "A": "The next dimension counterclockwise from Customer Satisfaction  is Damage/Loss Rate ."
        },
        {
            "Q": "On the On-Time Delivery Rate , is the point for Carter, Becker and Proctor inside or outside the point for Koch Ltd?",
            "A": "On the On-Time Delivery Rate , the point for Carter, Becker and Proctor is inside the point for Koch Ltd."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Route Optimization Efficiency} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Koch Ltd?",
            "A": "The strongest aspect is {Route Optimization Efficiency}, while the weakest aspect is{ Damage/Loss Rate }."
        },
        {
            "Q": "On dimension On-Time Delivery Rate , which label scores the highest?",
            "A": "On On-Time Delivery Rate , label {Carter, Becker and Proctor} scores the highest."
        },
        {
            "Q": "On dimension Route Optimization Efficiency, which label scores the highest?",
            "A": "On Route Optimization Efficiency, label {Carter, Becker and Proctor} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Carter, Becker and Proctor on the On-Time Delivery Rate  in the radar chart?",
            "A": "The value of Carter, Becker and Proctor on the Safety dimension is {30}."
        },
        {
            "Q": "What is the value of Koch Ltd on the Route Optimization Efficiency in the radar chart?",
            "A": "The value of Koch Ltd on the Safety dimension is {99}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Carter, Becker and Proctor across all dimensions in the radar chart?",
            "A": "The maximum value of Carter, Becker and Proctor across all dimensions is {70}."
        },
        {
            "Q": "What is the minimum value of label Koch Ltd across all dimensions in the radar chart?",
            "A": "The minimum value of Koch Ltd across all dimensions is {34}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of On-Time Delivery Rate ",
            "A": "The average value of On-Time Delivery Rate  is {35.5}."
        },
        {
            "Q": "What is the average value of Koch Ltd",
            "A": "The average value of Koch Ltd is {68.2}."
        }
    ],
    "NF": [
        {
            "Q": "For Koch Ltd in the radar chart, which dimensions have scores between 39 and 68? Please list the dimensions and corresponding scores.",
            "A": "{On-Time Delivery Rate } is {41}"
        },
        {
            "Q": "For Carter, Becker and Proctor in the radar chart, which dimensions have scores below 39? Please list the dimensions and corresponding scores.",
            "A": "{On-Time Delivery Rate } is {30}"
        },
        {
            "Q": "Which labels have scores below 55 for the Customer Satisfaction  dimension? Please list the labels and corresponding scores.",
            "A": "{Carter, Becker and Proctor} is {47}"
        }
    ],
    "NC": [
        {
            "Q": "For Carter, Becker and Proctor, which dimension has a higher score: Customer Satisfaction  or On-Time Delivery Rate ?",
            "A": "{Customer Satisfaction } has a higher score than On-Time Delivery Rate  for Carter, Becker and Proctor."
        },
        {
            "Q": "On On-Time Delivery Rate , which label has a higher score: Koch Ltd or the Carter, Becker and Proctor?",
            "A": "{Koch Ltd} has a higher score on On-Time Delivery Rate  compared to Carter, Becker and Proctor."
        },
        {
            "Q": "For Carter, Becker and Proctor, which dimension has a higher score: Route Optimization Efficiency or Fuel Cost as Rate of Revenue or Customer Satisfaction ?",
            "A": "{Route Optimization Efficiency} has a higher score for Carter, Becker and Proctor."
        },
        {
            "Q": "For Carter, Becker and Proctor, which dimension has a higher score: On-Time Delivery Rate  or Route Optimization Efficiency or Fuel Cost as Rate of Revenue?",
            "A": "{Route Optimization Efficiency} has a higher score for Carter, Becker and Proctor."
        }
    ],
    "MSR": [
        {
            "Q": "For Carter, Becker and Proctor, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Carter, Becker and Proctor most needs to improve its {On-Time Delivery Rate }."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Koch Ltd}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Carter, Becker and Proctor}."
        }
    ],
    "VA": []
}