{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Operating Cost Ratio?",
            "A": "The next dimension clockwise from Operating Cost Ratio is Current Ratio"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Operating Cost Ratio?",
            "A": "The next dimension counterclockwise from Operating Cost Ratio is Customer Retention Rate."
        },
        {
            "Q": "On the Net Profit Margin, is the point for Nichols LLC inside or outside the point for Nelson, Kelley and Hartman?",
            "A": "On the Net Profit Margin, the point for Nichols LLC is inside the point for Nelson, Kelley and Hartman."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {P/E Ratio vs. Industry Average Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Lin-Haney?",
            "A": "The strongest aspect is {P/E Ratio vs. Industry Average Rate}, while the weakest aspect is{ Capacity Utilization Rate}."
        },
        {
            "Q": "On dimension Capacity Utilization Rate, which label scores the highest?",
            "A": "On Capacity Utilization Rate, label {Nichols LLC} scores the highest."
        },
        {
            "Q": "On dimension Capacity Utilization Rate, which label scores the highest?",
            "A": "On Capacity Utilization Rate, label {Nichols LLC} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Lin-Haney on the Net Profit Margin in the radar chart?",
            "A": "The value of Lin-Haney on the Safety dimension is {64}."
        },
        {
            "Q": "What is the value of Nichols LLC on the Customer Retention Rate in the radar chart?",
            "A": "The value of Nichols LLC on the Safety dimension is {69}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Nichols LLC across all dimensions in the radar chart?",
            "A": "The maximum value of Nichols LLC across all dimensions is {92}."
        },
        {
            "Q": "What is the minimum value of label Nelson, Kelley and Hartman across all dimensions in the radar chart?",
            "A": "The minimum value of Nelson, Kelley and Hartman across all dimensions is {26}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Net Profit Margin",
            "A": "The average value of Net Profit Margin is {45.0}."
        },
        {
            "Q": "What is the average value of Nichols LLC",
            "A": "The average value of Nichols LLC is {45.71}."
        },
        {
            "Q": "What is the difference in Operating Cost Ratio between Nelson, Kelley and Hartman and Lin-Haney?",
            "A": "The difference in Operating Cost Ratio between Nelson, Kelley and Hartman and Lin-Haney is {59}."
        },
        {
            "Q": "What is the difference in Operating Cost Ratio between Nichols LLC and Nelson, Kelley and Hartman?",
            "A": "The difference in Operating Cost Ratio between Nichols LLC and Nelson, Kelley and Hartman is {67}."
        },
        {
            "Q": "What is the difference in Operating Cost Ratio between Lin-Haney and Nichols LLC?",
            "A": "The difference in Operating Cost Ratio between Lin-Haney and Nichols LLC is {8}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 43 for the Customer Retention Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Lin-Haney} is {42}, {Nelson, Kelley and Hartman} is {37}"
        },
        {
            "Q": "For Nichols LLC in the radar chart, which dimensions have scores above 82? Please list the dimensions and corresponding scores.",
            "A": "{Operating Cost Ratio} is {98}"
        },
        {
            "Q": "Which labels have scores above 85 for the Operating Cost Ratio dimension? Please list the labels and corresponding scores.",
            "A": "{Nichols LLC} is {98}, {Lin-Haney} is {90}"
        }
    ],
    "NC": [
        {
            "Q": "For Nichols LLC, which dimension has a higher score: P/E Ratio vs. Industry Average Rate or Customer Retention Rate?",
            "A": "{Customer Retention Rate} has a higher score than P/E Ratio vs. Industry Average Rate for Nichols LLC."
        },
        {
            "Q": "On Operating Cost Ratio, which label has a higher score: Lin-Haney or the Nelson, Kelley and Hartman?",
            "A": "{Lin-Haney} has a higher score on Operating Cost Ratio compared to Nelson, Kelley and Hartman."
        },
        {
            "Q": "For Nelson, Kelley and Hartman, which dimension has a higher score: P/E Ratio vs. Industry Average Rate or Current Ratio or Operating Cost Ratio?",
            "A": "{Current Ratio} has a higher score for Nelson, Kelley and Hartman."
        },
        {
            "Q": "For Lin-Haney, which dimension has a higher score: Customer Retention Rate or Current Ratio or Capacity Utilization Rate?",
            "A": "{Current Ratio} has a higher score for Lin-Haney."
        }
    ],
    "MSR": [
        {
            "Q": "For Nichols LLC, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Nichols LLC most needs to improve its {Current Ratio}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Lin-Haney}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Nichols LLC}."
        }
    ],
    "VA": []
}