{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Market Share Rate?",
            "A": "The next dimension clockwise from Market Share Rate is Capacity Utilization Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Market Share Rate?",
            "A": "The next dimension counterclockwise from Market Share Rate is Current Ratio."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Current Ratio} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Davidson-Patel?",
            "A": "The strongest aspect is {Current Ratio}, while the weakest aspect is{ Operating Cost Ratio}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Davidson-Patel on the Current Ratio in the radar chart?",
            "A": "The value of Davidson-Patel on the Safety dimension is {99}."
        },
        {
            "Q": "What is the value of Davidson-Patel on the P/E Ratio vs. Industry Average Rate in the radar chart?",
            "A": "The value of Davidson-Patel on the Safety dimension is {61}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Davidson-Patel across all dimensions in the radar chart?",
            "A": "The maximum value of Davidson-Patel across all dimensions is {61}."
        },
        {
            "Q": "What is the minimum value of label Davidson-Patel across all dimensions in the radar chart?",
            "A": "The minimum value of Davidson-Patel across all dimensions is {61}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Market Share Rate",
            "A": "The average value of Market Share Rate is {63.0}."
        },
        {
            "Q": "What is the average value of Davidson-Patel",
            "A": "The average value of Davidson-Patel is {58.17}."
        }
    ],
    "NF": [
        {
            "Q": "For Davidson-Patel in the radar chart, which dimensions have scores between 36 and 83? Please list the dimensions and corresponding scores.",
            "A": "{P/E Ratio vs. Industry Average Rate} is {61}, {Market Share Rate} is {63}, {Customer Retention Rate} is {79}"
        },
        {
            "Q": "Which labels have scores below 79 for the Customer Retention Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Davidson-Patel} is {79}"
        },
        {
            "Q": "For Davidson-Patel in the radar chart, which dimensions have scores below 36? Please list the dimensions and corresponding scores.",
            "A": "{Capacity Utilization Rate} is {27}, {Operating Cost Ratio} is {20}"
        }
    ],
    "NC": [
        {
            "Q": "For Davidson-Patel, which dimension has a higher score: Customer Retention Rate or Capacity Utilization Rate?",
            "A": "{Customer Retention Rate} has a higher score than Capacity Utilization Rate for Davidson-Patel."
        },
        {
            "Q": "For Davidson-Patel, which dimension has a higher score: Operating Cost Ratio or Customer Retention Rate?",
            "A": "{Customer Retention Rate} has a higher score than Operating Cost Ratio for Davidson-Patel."
        },
        {
            "Q": "For Davidson-Patel, which dimension has a higher score: P/E Ratio vs. Industry Average Rate or Customer Retention Rate or Market Share Rate?",
            "A": "{Customer Retention Rate} has a higher score for Davidson-Patel."
        }
    ],
    "MSR": [
        {
            "Q": "For Davidson-Patel, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Davidson-Patel most needs to improve its {Operating Cost Ratio}."
        }
    ],
    "VA": []
}