{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Capacity Utilization Rate?",
            "A": "The next dimension clockwise from Capacity Utilization Rate is Current Ratio"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Capacity Utilization Rate?",
            "A": "The next dimension counterclockwise from Capacity Utilization Rate is Net Profit Margin."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {P/E Ratio vs. Industry Average Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Saunders-Webster?",
            "A": "The strongest aspect is {P/E Ratio vs. Industry Average Rate}, while the weakest aspect is{ Capacity Utilization Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Saunders-Webster on the Current Ratio in the radar chart?",
            "A": "The value of Saunders-Webster on the Safety dimension is {74}."
        },
        {
            "Q": "What is the value of Saunders-Webster on the Capacity Utilization Rate in the radar chart?",
            "A": "The value of Saunders-Webster on the Safety dimension is {34}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Saunders-Webster across all dimensions in the radar chart?",
            "A": "The maximum value of Saunders-Webster across all dimensions is {98}."
        },
        {
            "Q": "What is the minimum value of label Saunders-Webster across all dimensions in the radar chart?",
            "A": "The minimum value of Saunders-Webster across all dimensions is {98}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of P/E Ratio vs. Industry Average Rate",
            "A": "The average value of P/E Ratio vs. Industry Average Rate is {98.0}."
        },
        {
            "Q": "What is the average value of Saunders-Webster",
            "A": "The average value of Saunders-Webster is {75.75}."
        }
    ],
    "NF": [
        {
            "Q": "For Saunders-Webster in the radar chart, which dimensions have scores above 85? Please list the dimensions and corresponding scores.",
            "A": "{P/E Ratio vs. Industry Average Rate} is {98}, {Net Profit Margin} is {97}"
        },
        {
            "Q": "Which labels have scores above 34 for the Capacity Utilization Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Saunders-Webster} is {34}"
        },
        {
            "Q": "For Saunders-Webster in the radar chart, which dimensions have scores between 47 and 85? Please list the dimensions and corresponding scores.",
            "A": "{Current Ratio} is {74}"
        }
    ],
    "NC": [
        {
            "Q": "For Saunders-Webster, which dimension has a higher score: Capacity Utilization Rate or Net Profit Margin?",
            "A": "{Net Profit Margin} has a higher score than Capacity Utilization Rate for Saunders-Webster."
        },
        {
            "Q": "For Saunders-Webster, which dimension has a higher score: Net Profit Margin or P/E Ratio vs. Industry Average Rate or Capacity Utilization Rate?",
            "A": "{P/E Ratio vs. Industry Average Rate} has a higher score for Saunders-Webster."
        }
    ],
    "MSR": [
        {
            "Q": "For Saunders-Webster, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Saunders-Webster most needs to improve its {Capacity Utilization Rate}."
        }
    ],
    "VA": []
}