{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Digital Content Creation Rate?",
            "A": "The next dimension clockwise from Digital Content Creation Rate is Artwork Sales Growth Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Digital Content Creation Rate?",
            "A": "The next dimension counterclockwise from Digital Content Creation Rate is Cultural Event Participation Rate."
        },
        {
            "Q": "On the Cultural Event Participation Rate, is the point for North Amyfort Cultural Center inside or outside the point for Youngton Cultural Center?",
            "A": "On the Cultural Event Participation Rate, the point for North Amyfort Cultural Center is outside the point for Youngton Cultural Center."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Digital Content Creation Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of North Amyfort Cultural Center?",
            "A": "The strongest aspect is {Digital Content Creation Rate}, while the weakest aspect is{ Artwork Sales Growth Rate}."
        },
        {
            "Q": "On dimension Artwork Sales Growth Rate, which label scores the highest?",
            "A": "On Artwork Sales Growth Rate, label {Youngton Cultural Center} scores the highest."
        },
        {
            "Q": "On dimension Digital Content Creation Rate, which label scores the highest?",
            "A": "On Digital Content Creation Rate, label {East Rhonda Cultural Center} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of North Amyfort Cultural Center on the Local Heritage Awareness Rate in the radar chart?",
            "A": "The value of North Amyfort Cultural Center on the Safety dimension is {56}."
        },
        {
            "Q": "What is the value of East Rhonda Cultural Center on the Cultural Event Participation Rate in the radar chart?",
            "A": "The value of East Rhonda Cultural Center on the Safety dimension is {66}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label East Rhonda Cultural Center across all dimensions in the radar chart?",
            "A": "The maximum value of East Rhonda Cultural Center across all dimensions is {72}."
        },
        {
            "Q": "What is the minimum value of label Youngton Cultural Center across all dimensions in the radar chart?",
            "A": "The minimum value of Youngton Cultural Center across all dimensions is {66}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Local Heritage Awareness Rate",
            "A": "The average value of Local Heritage Awareness Rate is {45.67}."
        },
        {
            "Q": "What is the average value of Youngton Cultural Center",
            "A": "The average value of Youngton Cultural Center is {49.75}."
        },
        {
            "Q": "What is the difference in Digital Content Creation Rate between North Amyfort Cultural Center and East Rhonda Cultural Center?",
            "A": "The difference in Digital Content Creation Rate between North Amyfort Cultural Center and East Rhonda Cultural Center is {43}."
        },
        {
            "Q": "What is the difference in Cultural Event Participation Rate between East Rhonda Cultural Center and Youngton Cultural Center?",
            "A": "The difference in Cultural Event Participation Rate between East Rhonda Cultural Center and Youngton Cultural Center is {6}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 65 for the Cultural Event Participation Rate dimension? Please list the labels and corresponding scores.",
            "A": "{East Rhonda Cultural Center} is {66}"
        },
        {
            "Q": "For East Rhonda Cultural Center in the radar chart, which dimensions have scores between 34 and 58? Please list the dimensions and corresponding scores.",
            "A": "None is between 34 and 58"
        },
        {
            "Q": "For North Amyfort Cultural Center in the radar chart, which dimensions have scores above 58? Please list the dimensions and corresponding scores.",
            "A": "{Cultural Event Participation Rate} is {66}"
        }
    ],
    "NC": [
        {
            "Q": "For East Rhonda Cultural Center, which dimension has a higher score: Digital Content Creation Rate or Local Heritage Awareness Rate?",
            "A": "{Digital Content Creation Rate} has a higher score than Local Heritage Awareness Rate for East Rhonda Cultural Center."
        },
        {
            "Q": "On Cultural Event Participation Rate, which label has a higher score: North Amyfort Cultural Center or the East Rhonda Cultural Center?",
            "A": "{East Rhonda Cultural Center} has a higher score on Cultural Event Participation Rate compared to North Amyfort Cultural Center."
        },
        {
            "Q": "For East Rhonda Cultural Center, which dimension has a higher score: Local Heritage Awareness Rate or Artwork Sales Growth Rate or Digital Content Creation Rate?",
            "A": "{Artwork Sales Growth Rate} has a higher score for East Rhonda Cultural Center."
        },
        {
            "Q": "For East Rhonda Cultural Center, which dimension has a higher score: Artwork Sales Growth Rate or Digital Content Creation Rate or Cultural Event Participation Rate?",
            "A": "{Cultural Event Participation Rate} has a higher score for East Rhonda Cultural Center."
        }
    ],
    "MSR": [
        {
            "Q": "For Youngton Cultural Center, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Youngton Cultural Center most needs to improve its {Artwork Sales Growth Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {North Amyfort Cultural Center}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {East Rhonda Cultural Center}."
        }
    ],
    "VA": []
}