{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Artwork Sales Growth Rate?",
            "A": "The next dimension clockwise from Artwork Sales Growth Rate is Streaming Media Cultural Content Consumption Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Museum/Gallery Visitor Growth Rate?",
            "A": "The next dimension counterclockwise from Artwork Sales Growth Rate is Cultural Funding Utilization Rate."
        },
        {
            "Q": "On the Artwork Sales Growth Rate, is the point for West Lisa Cultural Center inside or outside the point for Aguirrestad Cultural Center?",
            "A": "On the Artwork Sales Growth Rate, the point for West Lisa Cultural Center is inside the point for Aguirrestad Cultural Center."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Streaming Media Cultural Content Consumption Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Aguirrestad Cultural Center?",
            "A": "The strongest aspect is {Streaming Media Cultural Content Consumption Rate}, while the weakest aspect is{ Cultural Industry Employment Growth Rate}."
        },
        {
            "Q": "On dimension Museum/Gallery Visitor Growth Rate, which label scores the highest?",
            "A": "On Museum/Gallery Visitor Growth Rate, label {West Lisa Cultural Center} scores the highest."
        },
        {
            "Q": "On dimension Digital Content Creation Rate, which label scores the highest?",
            "A": "On Digital Content Creation Rate, label {West Lisa Cultural Center} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of West Lisa Cultural Center on the Cultural Funding Utilization Rate in the radar chart?",
            "A": "The value of West Lisa Cultural Center on the Safety dimension is {68}."
        },
        {
            "Q": "What is the value of Aguirrestad Cultural Center on the Local Heritage Awareness Rate in the radar chart?",
            "A": "The value of Aguirrestad Cultural Center on the Safety dimension is {78}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label West Lisa Cultural Center across all dimensions in the radar chart?",
            "A": "The maximum value of West Lisa Cultural Center across all dimensions is {68}."
        },
        {
            "Q": "What is the minimum value of label West Lisa Cultural Center across all dimensions in the radar chart?",
            "A": "The minimum value of West Lisa Cultural Center across all dimensions is {49}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Artwork Sales Growth Rate",
            "A": "The average value of Artwork Sales Growth Rate is {49.5}."
        },
        {
            "Q": "What is the average value of West Lisa Cultural Center",
            "A": "The average value of West Lisa Cultural Center is {50.29}."
        }
    ],
    "NF": [
        {
            "Q": "For West Lisa Cultural Center in the radar chart, which dimensions have scores between 56 and 61? Please list the dimensions and corresponding scores.",
            "A": "{Streaming Media Cultural Content Consumption Rate} is {57}"
        },
        {
            "Q": "For Aguirrestad Cultural Center in the radar chart, which dimensions have scores above 61? Please list the dimensions and corresponding scores.",
            "A": "{Cultural Industry Employment Growth Rate} is {68}, {Cultural Funding Utilization Rate} is {68}"
        },
        {
            "Q": "Which labels have scores above 64 for the Cultural Industry Employment Growth Rate dimension? Please list the labels and corresponding scores.",
            "A": "{West Lisa Cultural Center} is {68}"
        }
    ],
    "NC": [
        {
            "Q": "For West Lisa Cultural Center, which dimension has a higher score: Artwork Sales Growth Rate or Local Heritage Awareness Rate?",
            "A": "{Local Heritage Awareness Rate} has a higher score than Artwork Sales Growth Rate for West Lisa Cultural Center."
        },
        {
            "Q": "On Cultural Funding Utilization Rate, which label has a higher score: Aguirrestad Cultural Center or the West Lisa Cultural Center?",
            "A": "{Aguirrestad Cultural Center} has a higher score on Cultural Funding Utilization Rate compared to West Lisa Cultural Center."
        },
        {
            "Q": "For Aguirrestad Cultural Center, which dimension has a higher score: Cultural Funding Utilization Rate or Cultural Industry Employment Growth Rate or Local Heritage Awareness Rate?",
            "A": "{Local Heritage Awareness Rate} has a higher score for Aguirrestad Cultural Center."
        },
        {
            "Q": "For Aguirrestad Cultural Center, which dimension has a higher score: Artwork Sales Growth Rate or Digital Content Creation Rate or Local Heritage Awareness Rate?",
            "A": "{Local Heritage Awareness Rate} has a higher score for Aguirrestad Cultural Center."
        }
    ],
    "MSR": [
        {
            "Q": "For West Lisa Cultural Center, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "West Lisa Cultural Center most needs to improve its {Artwork Sales Growth Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Aguirrestad Cultural Center}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {West Lisa Cultural Center}."
        }
    ],
    "VA": []
}