{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Cultural Funding Utilization Rate?",
            "A": "The next dimension clockwise from Cultural Funding Utilization Rate is Artwork Sales Growth Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Museum/Gallery Visitor Growth Rate?",
            "A": "The next dimension counterclockwise from Cultural Funding Utilization Rate is Museum/Gallery Visitor Growth Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Museum/Gallery Visitor Growth Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Leetown Cultural Center?",
            "A": "The strongest aspect is {Museum/Gallery Visitor Growth Rate}, while the weakest aspect is{ Artwork Sales Growth Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Leetown Cultural Center on the Cultural Funding Utilization Rate in the radar chart?",
            "A": "The value of Leetown Cultural Center on the Safety dimension is {39}."
        },
        {
            "Q": "What is the value of Leetown Cultural Center on the Museum/Gallery Visitor Growth Rate in the radar chart?",
            "A": "The value of Leetown Cultural Center on the Safety dimension is {51}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Leetown Cultural Center across all dimensions in the radar chart?",
            "A": "The maximum value of Leetown Cultural Center across all dimensions is {22}."
        },
        {
            "Q": "What is the minimum value of label Leetown Cultural Center across all dimensions in the radar chart?",
            "A": "The minimum value of Leetown Cultural Center across all dimensions is {22}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Cultural Event Participation Rate",
            "A": "The average value of Cultural Event Participation Rate is {22.0}."
        },
        {
            "Q": "What is the average value of Leetown Cultural Center",
            "A": "The average value of Leetown Cultural Center is {32.6}."
        }
    ],
    "NF": [
        {
            "Q": "For Leetown Cultural Center in the radar chart, which dimensions have scores between 26 and 45? Please list the dimensions and corresponding scores.",
            "A": "{Digital Content Creation Rate} is {31}, {Cultural Funding Utilization Rate} is {39}"
        },
        {
            "Q": "For Leetown Cultural Center in the radar chart, which dimensions have scores above 45? Please list the dimensions and corresponding scores.",
            "A": "{Museum/Gallery Visitor Growth Rate} is {51}"
        },
        {
            "Q": "For Leetown Cultural Center in the radar chart, which dimensions have scores below 26? Please list the dimensions and corresponding scores.",
            "A": "{Cultural Event Participation Rate} is {22}, {Artwork Sales Growth Rate} is {20}"
        }
    ],
    "NC": [
        {
            "Q": "For Leetown Cultural Center, which dimension has a higher score: Artwork Sales Growth Rate or Museum/Gallery Visitor Growth Rate?",
            "A": "{Museum/Gallery Visitor Growth Rate} has a higher score than Artwork Sales Growth Rate for Leetown Cultural Center."
        },
        {
            "Q": "For Leetown Cultural Center, which dimension has a higher score: Cultural Event Participation Rate or Artwork Sales Growth Rate or Digital Content Creation Rate?",
            "A": "{Digital Content Creation Rate} has a higher score for Leetown Cultural Center."
        },
        {
            "Q": "For Leetown Cultural Center, which dimension has a higher score: Museum/Gallery Visitor Growth Rate or Cultural Funding Utilization Rate or Cultural Event Participation Rate?",
            "A": "{Museum/Gallery Visitor Growth Rate} has a higher score for Leetown Cultural Center."
        }
    ],
    "MSR": [
        {
            "Q": "For Leetown Cultural Center, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Leetown Cultural Center most needs to improve its {Artwork Sales Growth Rate}."
        }
    ],
    "VA": []
}