{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Cultural Funding Utilization Rate?",
            "A": "The next dimension clockwise from Cultural Funding Utilization Rate is Artwork Sales Growth Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Artwork Sales Growth Rate?",
            "A": "The next dimension counterclockwise from Cultural Funding Utilization Rate is Local Heritage Awareness Rate."
        },
        {
            "Q": "On the Cultural Funding Utilization Rate, is the point for West Mark Cultural Center inside or outside the point for Hannahfurt Cultural Center?",
            "A": "On the Cultural Funding Utilization Rate, the point for West Mark Cultural Center is outside the point for Hannahfurt Cultural Center."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Artwork Sales Growth Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Hannahfurt Cultural Center?",
            "A": "The strongest aspect is {Artwork Sales Growth Rate}, while the weakest aspect is{ Cultural Funding Utilization Rate}."
        },
        {
            "Q": "On dimension Cultural Industry Employment Growth Rate, which label scores the highest?",
            "A": "On Cultural Industry Employment Growth Rate, label {Port Nicole Cultural Center} scores the highest."
        },
        {
            "Q": "On dimension Local Heritage Awareness Rate, which label scores the highest?",
            "A": "On Local Heritage Awareness Rate, label {West Mark Cultural Center} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Hannahfurt Cultural Center on the Digital Content Creation Rate in the radar chart?",
            "A": "The value of Hannahfurt Cultural Center on the Safety dimension is {87}."
        },
        {
            "Q": "What is the value of Port Nicole Cultural Center on the Digital Content Creation Rate in the radar chart?",
            "A": "The value of Port Nicole Cultural Center on the Safety dimension is {37}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Hannahfurt Cultural Center across all dimensions in the radar chart?",
            "A": "The maximum value of Hannahfurt Cultural Center across all dimensions is {68}."
        },
        {
            "Q": "What is the minimum value of label Hannahfurt Cultural Center across all dimensions in the radar chart?",
            "A": "The minimum value of Hannahfurt Cultural Center across all dimensions is {59}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Cultural Funding Utilization Rate",
            "A": "The average value of Cultural Funding Utilization Rate is {49.67}."
        },
        {
            "Q": "What is the average value of West Mark Cultural Center",
            "A": "The average value of West Mark Cultural Center is {63.71}."
        },
        {
            "Q": "What is the difference in Cultural Industry Employment Growth Rate between West Mark Cultural Center and Port Nicole Cultural Center?",
            "A": "The difference in Cultural Industry Employment Growth Rate between West Mark Cultural Center and Port Nicole Cultural Center is {50}."
        },
        {
            "Q": "What is the difference in Artwork Sales Growth Rate between West Mark Cultural Center and Hannahfurt Cultural Center?",
            "A": "The difference in Artwork Sales Growth Rate between West Mark Cultural Center and Hannahfurt Cultural Center is {45}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 52 for the Streaming Media Cultural Content Consumption Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Hannahfurt Cultural Center} is {47}"
        },
        {
            "Q": "For West Mark Cultural Center in the radar chart, which dimensions have scores between 47 and 70? Please list the dimensions and corresponding scores.",
            "A": "{Local Heritage Awareness Rate} is {65}, {Artwork Sales Growth Rate} is {50}, {Cultural Event Participation Rate} is {67}"
        },
        {
            "Q": "Which labels have scores above 73 for the Local Heritage Awareness Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Port Nicole Cultural Center} is {75}"
        }
    ],
    "NC": [
        {
            "Q": "For West Mark Cultural Center, which dimension has a higher score: Cultural Funding Utilization Rate or Cultural Event Participation Rate?",
            "A": "{Cultural Event Participation Rate} has a higher score than Cultural Funding Utilization Rate for West Mark Cultural Center."
        },
        {
            "Q": "For West Mark Cultural Center, which dimension has a higher score: Local Heritage Awareness Rate or Artwork Sales Growth Rate?",
            "A": "{Local Heritage Awareness Rate} has a higher score than Artwork Sales Growth Rate for West Mark Cultural Center."
        },
        {
            "Q": "On Cultural Funding Utilization Rate, which label has a higher score: Hannahfurt Cultural Center or the West Mark Cultural Center?",
            "A": "{West Mark Cultural Center} has a higher score on Cultural Funding Utilization Rate compared to Hannahfurt Cultural Center."
        },
        {
            "Q": "On Artwork Sales Growth Rate, which label has a higher score: Port Nicole Cultural Center or the West Mark Cultural Center?",
            "A": "{West Mark Cultural Center} has a higher score on Artwork Sales Growth Rate compared to Port Nicole Cultural Center."
        }
    ],
    "MSR": [
        {
            "Q": "For Port Nicole Cultural Center, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Port Nicole Cultural Center most needs to improve its {Cultural Industry Employment Growth Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {West Mark Cultural Center}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Port Nicole Cultural Center}."
        }
    ],
    "VA": []
}