{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Research Investment Rate?",
            "A": "The next dimension clockwise from Research Investment Rate is Discipline Coverage Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Research Investment Rate?",
            "A": "The next dimension counterclockwise from Research Investment Rate is Citation Rate."
        },
        {
            "Q": "On the Graduation Rate, is the point for Lake Benjamin Institute inside or outside the point for Lake Williamland School?",
            "A": "On the Graduation Rate, the point for Lake Benjamin Institute is inside the point for Lake Williamland School."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Patent Conversion Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Lake Williamland School?",
            "A": "The strongest aspect is {Patent Conversion Rate}, while the weakest aspect is{ Further Education Rate}."
        },
        {
            "Q": "On dimension Research Investment Rate, which label scores the highest?",
            "A": "On Research Investment Rate, label {Lake Benjamin Institute} scores the highest."
        },
        {
            "Q": "On dimension Patent Conversion Rate, which label scores the highest?",
            "A": "On Patent Conversion Rate, label {Lake Benjamin Institute} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Lake Williamland School on the Patent Conversion Rate in the radar chart?",
            "A": "The value of Lake Williamland School on the Safety dimension is {79}."
        },
        {
            "Q": "What is the value of Lake Benjamin Institute on the Research Investment Rate in the radar chart?",
            "A": "The value of Lake Benjamin Institute on the Safety dimension is {53}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Lake Benjamin Institute across all dimensions in the radar chart?",
            "A": "The maximum value of Lake Benjamin Institute across all dimensions is {67}."
        },
        {
            "Q": "What is the minimum value of label Cardenasview College across all dimensions in the radar chart?",
            "A": "The minimum value of Cardenasview College across all dimensions is {53}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Citation Rate",
            "A": "The average value of Citation Rate is {65.67}."
        },
        {
            "Q": "What is the average value of Cardenasview College",
            "A": "The average value of Cardenasview College is {59.5}."
        },
        {
            "Q": "What is the difference in Graduation Rate between Lake Williamland School and Lake Benjamin Institute?",
            "A": "The difference in Graduation Rate between Lake Williamland School and Lake Benjamin Institute is {24}."
        },
        {
            "Q": "What is the difference in Further Education Rate between Lake Williamland School and Cardenasview College?",
            "A": "The difference in Further Education Rate between Lake Williamland School and Cardenasview College is {1}."
        }
    ],
    "NF": [
        {
            "Q": "For Lake Williamland School in the radar chart, which dimensions have scores above 81? Please list the dimensions and corresponding scores.",
            "A": "{Graduation Rate} is {92}, {Citation Rate} is {86}"
        },
        {
            "Q": "For Cardenasview College in the radar chart, which dimensions have scores between 44 and 81? Please list the dimensions and corresponding scores.",
            "A": "{Patent Conversion Rate} is {47}, {Research Investment Rate} is {58}"
        },
        {
            "Q": "For Cardenasview College in the radar chart, which dimensions have scores below 44? Please list the dimensions and corresponding scores.",
            "A": "{Further Education Rate} is {35}"
        }
    ],
    "NC": [
        {
            "Q": "For Lake Benjamin Institute, which dimension has a higher score: Discipline Coverage Rate or Patent Conversion Rate?",
            "A": "{Discipline Coverage Rate} has a higher score than Patent Conversion Rate for Lake Benjamin Institute."
        },
        {
            "Q": "On Further Education Rate, which label has a higher score: Cardenasview College or the Lake Williamland School?",
            "A": "{Cardenasview College} has a higher score on Further Education Rate compared to Lake Williamland School."
        },
        {
            "Q": "On Patent Conversion Rate, which label has a higher score: Cardenasview College or the Lake Williamland School?",
            "A": "{Lake Williamland School} has a higher score on Patent Conversion Rate compared to Cardenasview College."
        },
        {
            "Q": "For Lake Williamland School, which dimension has a higher score: Citation Rate or Patent Conversion Rate or Graduation Rate?",
            "A": "{Patent Conversion Rate} has a higher score for Lake Williamland School."
        }
    ],
    "MSR": [
        {
            "Q": "For Cardenasview College, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Cardenasview College most needs to improve its {Further Education Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Lake Williamland School}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Lake Benjamin Institute}."
        }
    ],
    "VA": []
}