{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Patent Conversion Rate?",
            "A": "The next dimension clockwise from Patent Conversion Rate is Citation Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Patent Conversion Rate?",
            "A": "The next dimension counterclockwise from Patent Conversion Rate is Further Education Rate."
        },
        {
            "Q": "On the Citation Rate, is the point for East William Institute inside or outside the point for Carrmouth Institute?",
            "A": "On the Citation Rate, the point for East William Institute is outside the point for Carrmouth Institute."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Further Education Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Carrmouth Institute?",
            "A": "The strongest aspect is {Further Education Rate}, while the weakest aspect is{ Citation Rate}."
        },
        {
            "Q": "On dimension Further Education Rate, which label scores the highest?",
            "A": "On Further Education Rate, label {East William Institute} scores the highest."
        },
        {
            "Q": "On dimension Patent Conversion Rate, which label scores the highest?",
            "A": "On Patent Conversion Rate, label {Carrmouth Institute} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of East William Institute on the Patent Conversion Rate in the radar chart?",
            "A": "The value of East William Institute on the Safety dimension is {84}."
        },
        {
            "Q": "What is the value of East William Institute on the Graduation Rate in the radar chart?",
            "A": "The value of East William Institute on the Safety dimension is {81}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Carrmouth Institute across all dimensions in the radar chart?",
            "A": "The maximum value of Carrmouth Institute across all dimensions is {55}."
        },
        {
            "Q": "What is the minimum value of label East William Institute across all dimensions in the radar chart?",
            "A": "The minimum value of East William Institute across all dimensions is {55}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Further Education Rate",
            "A": "The average value of Further Education Rate is {67.5}."
        },
        {
            "Q": "What is the average value of Carrmouth Institute",
            "A": "The average value of Carrmouth Institute is {46.0}."
        }
    ],
    "NF": [
        {
            "Q": "For East William Institute in the radar chart, which dimensions have scores above 68? Please list the dimensions and corresponding scores.",
            "A": "{Further Education Rate} is {80}"
        },
        {
            "Q": "For East William Institute in the radar chart, which dimensions have scores between 62 and 68? Please list the dimensions and corresponding scores.",
            "A": "None is between 62 and 68"
        },
        {
            "Q": "For Carrmouth Institute in the radar chart, which dimensions have scores below 62? Please list the dimensions and corresponding scores.",
            "A": "{Further Education Rate} is {55}"
        }
    ],
    "NC": [
        {
            "Q": "For Carrmouth Institute, which dimension has a higher score: Graduation Rate or Citation Rate?",
            "A": "{Graduation Rate} has a higher score than Citation Rate for Carrmouth Institute."
        },
        {
            "Q": "On Citation Rate, which label has a higher score: Carrmouth Institute or the East William Institute?",
            "A": "{East William Institute} has a higher score on Citation Rate compared to Carrmouth Institute."
        },
        {
            "Q": "For East William Institute, which dimension has a higher score: Further Education Rate or Patent Conversion Rate or Graduation Rate?",
            "A": "{Patent Conversion Rate} has a higher score for East William Institute."
        },
        {
            "Q": "For East William Institute, which dimension has a higher score: Graduation Rate or Citation Rate or Patent Conversion Rate?",
            "A": "{Citation Rate} has a higher score for East William Institute."
        }
    ],
    "MSR": [
        {
            "Q": "For Carrmouth Institute, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Carrmouth Institute most needs to improve its {Citation Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {East William Institute}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Carrmouth Institute}."
        }
    ],
    "VA": []
}