{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Employment Rate?",
            "A": "The next dimension clockwise from Employment Rate is Further Education Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Employment Rate?",
            "A": "The next dimension counterclockwise from Employment Rate is Citation Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Paper Publication Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of North Charlene University?",
            "A": "The strongest aspect is {Paper Publication Rate}, while the weakest aspect is{ Citation Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of North Charlene University on the Research Investment Rate in the radar chart?",
            "A": "The value of North Charlene University on the Safety dimension is {48}."
        },
        {
            "Q": "What is the value of North Charlene University on the Paper Publication Rate in the radar chart?",
            "A": "The value of North Charlene University on the Safety dimension is {98}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label North Charlene University across all dimensions in the radar chart?",
            "A": "The maximum value of North Charlene University across all dimensions is {48}."
        },
        {
            "Q": "What is the minimum value of label North Charlene University across all dimensions in the radar chart?",
            "A": "The minimum value of North Charlene University across all dimensions is {48}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Citation Rate",
            "A": "The average value of Citation Rate is {37.0}."
        },
        {
            "Q": "What is the average value of North Charlene University",
            "A": "The average value of North Charlene University is {68.17}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 76 for the Graduation Rate dimension? Please list the labels and corresponding scores.",
            "A": "{North Charlene University} is {76}"
        },
        {
            "Q": "Which labels have scores above 76 for the Graduation Rate dimension? Please list the labels and corresponding scores.",
            "A": "{North Charlene University} is {76}"
        },
        {
            "Q": "For North Charlene University in the radar chart, which dimensions have scores above 86? Please list the dimensions and corresponding scores.",
            "A": "{Paper Publication Rate} is {98}"
        }
    ],
    "NC": [
        {
            "Q": "For North Charlene University, which dimension has a higher score: Citation Rate or Paper Publication Rate?",
            "A": "{Paper Publication Rate} has a higher score than Citation Rate for North Charlene University."
        },
        {
            "Q": "For North Charlene University, which dimension has a higher score: Research Investment Rate or Employment Rate or Further Education Rate?",
            "A": "{Further Education Rate} has a higher score for North Charlene University."
        },
        {
            "Q": "For North Charlene University, which dimension has a higher score: Paper Publication Rate or Citation Rate or Graduation Rate?",
            "A": "{Paper Publication Rate} has a higher score for North Charlene University."
        }
    ],
    "MSR": [
        {
            "Q": "For North Charlene University, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "North Charlene University most needs to improve its {Citation Rate}."
        }
    ],
    "VA": []
}