{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Graduation Rate?",
            "A": "The next dimension clockwise from Graduation Rate is Paper Publication Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Graduation Rate?",
            "A": "The next dimension counterclockwise from Graduation Rate is Research Investment Rate."
        },
        {
            "Q": "On the Research Investment Rate, is the point for New Stacystad Institute inside or outside the point for Scottport Academy?",
            "A": "On the Research Investment Rate, the point for New Stacystad Institute is inside the point for Scottport Academy."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Further Education Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of New Stacystad Institute?",
            "A": "The strongest aspect is {Further Education Rate}, while the weakest aspect is{ Graduation Rate}."
        },
        {
            "Q": "On dimension Graduation Rate, which label scores the highest?",
            "A": "On Graduation Rate, label {New Stacystad Institute} scores the highest."
        },
        {
            "Q": "On dimension Further Education Rate, which label scores the highest?",
            "A": "On Further Education Rate, label {Scottport Academy} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Scottport Academy on the Research Investment Rate in the radar chart?",
            "A": "The value of Scottport Academy on the Safety dimension is {59}."
        },
        {
            "Q": "What is the value of New Stacystad Institute on the Paper Publication Rate in the radar chart?",
            "A": "The value of New Stacystad Institute on the Safety dimension is {43}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Scottport Academy across all dimensions in the radar chart?",
            "A": "The maximum value of Scottport Academy across all dimensions is {59}."
        },
        {
            "Q": "What is the minimum value of label New Stacystad Institute across all dimensions in the radar chart?",
            "A": "The minimum value of New Stacystad Institute across all dimensions is {50}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Graduation Rate",
            "A": "The average value of Graduation Rate is {39.5}."
        },
        {
            "Q": "What is the average value of Scottport Academy",
            "A": "The average value of Scottport Academy is {57.25}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 57 for the Research Investment Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Scottport Academy} is {59}"
        },
        {
            "Q": "For Scottport Academy in the radar chart, which dimensions have scores above 74? Please list the dimensions and corresponding scores.",
            "A": "{Paper Publication Rate} is {84}"
        },
        {
            "Q": "For Scottport Academy in the radar chart, which dimensions have scores between 46 and 74? Please list the dimensions and corresponding scores.",
            "A": "{Research Investment Rate} is {59}, {Graduation Rate} is {50}"
        }
    ],
    "NC": [
        {
            "Q": "For Scottport Academy, which dimension has a higher score: Paper Publication Rate or Graduation Rate?",
            "A": "{Paper Publication Rate} has a higher score than Graduation Rate for Scottport Academy."
        },
        {
            "Q": "For Scottport Academy, which dimension has a higher score: Graduation Rate or Further Education Rate?",
            "A": "{Graduation Rate} has a higher score than Further Education Rate for Scottport Academy."
        },
        {
            "Q": "On Paper Publication Rate, which label has a higher score: Scottport Academy or the New Stacystad Institute?",
            "A": "{Scottport Academy} has a higher score on Paper Publication Rate compared to New Stacystad Institute."
        },
        {
            "Q": "For New Stacystad Institute, which dimension has a higher score: Graduation Rate or Research Investment Rate or Further Education Rate?",
            "A": "{Further Education Rate} has a higher score for New Stacystad Institute."
        }
    ],
    "MSR": [
        {
            "Q": "For Scottport Academy, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Scottport Academy most needs to improve its {Further Education Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Scottport Academy}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {New Stacystad Institute}."
        }
    ],
    "VA": []
}