{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Net Profit Margin ?",
            "A": "The next dimension clockwise from Net Profit Margin  is Patent Growth Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Renewable Energy Investment Ratio?",
            "A": "The next dimension counterclockwise from Net Profit Margin  is Renewable Energy Investment Ratio."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Net Profit Margin } encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Zimmerman PLC?",
            "A": "The strongest aspect is {Net Profit Margin }, while the weakest aspect is{ Energy Conversion Efficiency}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Zimmerman PLC on the Energy Conversion Efficiency in the radar chart?",
            "A": "The value of Zimmerman PLC on the Safety dimension is {26}."
        },
        {
            "Q": "What is the value of Zimmerman PLC on the Power Transmission and Distribution Loss Rate in the radar chart?",
            "A": "The value of Zimmerman PLC on the Safety dimension is {28}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Zimmerman PLC across all dimensions in the radar chart?",
            "A": "The maximum value of Zimmerman PLC across all dimensions is {31}."
        },
        {
            "Q": "What is the minimum value of label Zimmerman PLC across all dimensions in the radar chart?",
            "A": "The minimum value of Zimmerman PLC across all dimensions is {31}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Power Transmission and Distribution Loss Rate",
            "A": "The average value of Power Transmission and Distribution Loss Rate is {28.0}."
        },
        {
            "Q": "What is the average value of Zimmerman PLC",
            "A": "The average value of Zimmerman PLC is {46.67}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 31 for the Market Share dimension? Please list the labels and corresponding scores.",
            "A": "{Zimmerman PLC} is {31}"
        },
        {
            "Q": "For Zimmerman PLC in the radar chart, which dimensions have scores between 38 and 74? Please list the dimensions and corresponding scores.",
            "A": "{Renewable Energy Investment Ratio} is {73}"
        },
        {
            "Q": "Which labels have scores above 28 for the Power Transmission and Distribution Loss Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Zimmerman PLC} is {28}"
        }
    ],
    "NC": [
        {
            "Q": "For Zimmerman PLC, which dimension has a higher score: Market Share or Net Profit Margin ?",
            "A": "{Net Profit Margin } has a higher score than Market Share for Zimmerman PLC."
        },
        {
            "Q": "For Zimmerman PLC, which dimension has a higher score: Market Share or Net Profit Margin  or Patent Growth Rate?",
            "A": "{Net Profit Margin } has a higher score for Zimmerman PLC."
        }
    ],
    "MSR": [
        {
            "Q": "For Zimmerman PLC, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Zimmerman PLC most needs to improve its {Energy Conversion Efficiency}."
        }
    ],
    "VA": []
}