{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Energy Conversion Efficiency?",
            "A": "The next dimension clockwise from Energy Conversion Efficiency is Power Transmission and Distribution Loss Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Revenue Growth Rate?",
            "A": "The next dimension counterclockwise from Energy Conversion Efficiency is Revenue Growth Rate."
        },
        {
            "Q": "On the Renewable Energy Investment Ratio, is the point for Bennett-Bradley inside or outside the point for Weiss Group?",
            "A": "On the Renewable Energy Investment Ratio, the point for Bennett-Bradley is inside the point for Weiss Group."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Revenue Growth Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Bennett-Bradley?",
            "A": "The strongest aspect is {Revenue Growth Rate}, while the weakest aspect is{ Patent Growth Rate}."
        },
        {
            "Q": "On dimension R&D Investment Ratio, which label scores the highest?",
            "A": "On R&D Investment Ratio, label {Bradford Ltd} scores the highest."
        },
        {
            "Q": "On dimension Energy Conversion Efficiency, which label scores the highest?",
            "A": "On Energy Conversion Efficiency, label {Bennett-Bradley} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Bradford Ltd on the Renewable Energy Investment Ratio in the radar chart?",
            "A": "The value of Bradford Ltd on the Safety dimension is {69}."
        },
        {
            "Q": "What is the value of Weiss Group on the Power Transmission and Distribution Loss Rate in the radar chart?",
            "A": "The value of Weiss Group on the Safety dimension is {53}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Bennett-Bradley across all dimensions in the radar chart?",
            "A": "The maximum value of Bennett-Bradley across all dimensions is {69}."
        },
        {
            "Q": "What is the minimum value of label Weiss Group across all dimensions in the radar chart?",
            "A": "The minimum value of Weiss Group across all dimensions is {33}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Patent Growth Rate",
            "A": "The average value of Patent Growth Rate is {48.33}."
        },
        {
            "Q": "What is the average value of Weiss Group",
            "A": "The average value of Weiss Group is {69.83}."
        },
        {
            "Q": "What is the difference in Energy Conversion Efficiency between Bradford Ltd and Bennett-Bradley?",
            "A": "The difference in Energy Conversion Efficiency between Bradford Ltd and Bennett-Bradley is {9}."
        },
        {
            "Q": "What is the difference in Renewable Energy Investment Ratio between Bennett-Bradley and Bradford Ltd?",
            "A": "The difference in Renewable Energy Investment Ratio between Bennett-Bradley and Bradford Ltd is {10}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 89 for the Revenue Growth Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Bennett-Bradley} is {89}, {Bradford Ltd} is {95}"
        },
        {
            "Q": "For Bradford Ltd in the radar chart, which dimensions have scores between 45 and 81? Please list the dimensions and corresponding scores.",
            "A": "{R&D Investment Ratio} is {73}, {Patent Growth Rate} is {65}, {Renewable Energy Investment Ratio} is {69}, {Energy Conversion Efficiency} is {72}"
        },
        {
            "Q": "Which labels have scores below 68 for the Energy Conversion Efficiency dimension? Please list the labels and corresponding scores.",
            "A": "{Bennett-Bradley} is {63}"
        }
    ],
    "NC": [
        {
            "Q": "For Weiss Group, which dimension has a higher score: Patent Growth Rate or R&D Investment Ratio?",
            "A": "{R&D Investment Ratio} has a higher score than Patent Growth Rate for Weiss Group."
        },
        {
            "Q": "On Revenue Growth Rate, which label has a higher score: Weiss Group or the Bradford Ltd?",
            "A": "{Bradford Ltd} has a higher score on Revenue Growth Rate compared to Weiss Group."
        },
        {
            "Q": "For Bennett-Bradley, which dimension has a higher score: R&D Investment Ratio or Energy Conversion Efficiency or Power Transmission and Distribution Loss Rate?",
            "A": "{R&D Investment Ratio} has a higher score for Bennett-Bradley."
        },
        {
            "Q": "For Weiss Group, which dimension has a higher score: R&D Investment Ratio or Revenue Growth Rate or Power Transmission and Distribution Loss Rate?",
            "A": "{R&D Investment Ratio} has a higher score for Weiss Group."
        }
    ],
    "MSR": [
        {
            "Q": "For Bennett-Bradley, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Bennett-Bradley most needs to improve its {Patent Growth Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Bradford Ltd}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Weiss Group}."
        }
    ],
    "VA": []
}