{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Water Conservation Efficiency Rate?",
            "A": "The next dimension clockwise from Water Conservation Efficiency Rate is Waste-to-Energy Conversion Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Waste-to-Energy Conversion Rate?",
            "A": "The next dimension counterclockwise from Water Conservation Efficiency Rate is Eco-Friendly Product Sales Growth Rate."
        },
        {
            "Q": "On the Green Building Certification Rate, is the point for Mcgrath-Glenn Sustainability Initiative inside or outside the point for Moore PLC Sustainability Initiative?",
            "A": "On the Green Building Certification Rate, the point for Mcgrath-Glenn Sustainability Initiative is outside the point for Moore PLC Sustainability Initiative."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Sustainable Packaging Adoption Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Acosta, Small and Parker Sustainability Initiative?",
            "A": "The strongest aspect is {Sustainable Packaging Adoption Rate}, while the weakest aspect is{ Green Building Certification Rate}."
        },
        {
            "Q": "On dimension Waste-to-Energy Conversion Rate, which label scores the highest?",
            "A": "On Waste-to-Energy Conversion Rate, label {Acosta, Small and Parker Sustainability Initiative} scores the highest."
        },
        {
            "Q": "On dimension Recycling Material Utilization Rate, which label scores the highest?",
            "A": "On Recycling Material Utilization Rate, label {Mcgrath-Glenn Sustainability Initiative} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Moore PLC Sustainability Initiative on the Eco-Friendly Product Sales Growth Rate in the radar chart?",
            "A": "The value of Moore PLC Sustainability Initiative on the Safety dimension is {31}."
        },
        {
            "Q": "What is the value of Mcgrath-Glenn Sustainability Initiative on the Eco-Friendly Product Sales Growth Rate in the radar chart?",
            "A": "The value of Mcgrath-Glenn Sustainability Initiative on the Safety dimension is {55}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Mcgrath-Glenn Sustainability Initiative across all dimensions in the radar chart?",
            "A": "The maximum value of Mcgrath-Glenn Sustainability Initiative across all dimensions is {72}."
        },
        {
            "Q": "What is the minimum value of label Acosta, Small and Parker Sustainability Initiative across all dimensions in the radar chart?",
            "A": "The minimum value of Acosta, Small and Parker Sustainability Initiative across all dimensions is {95}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Recycling Material Utilization Rate",
            "A": "The average value of Recycling Material Utilization Rate is {47.33}."
        },
        {
            "Q": "What is the average value of Mcgrath-Glenn Sustainability Initiative",
            "A": "The average value of Mcgrath-Glenn Sustainability Initiative is {61.29}."
        },
        {
            "Q": "What is the difference in Waste-to-Energy Conversion Rate between Moore PLC Sustainability Initiative and Acosta, Small and Parker Sustainability Initiative?",
            "A": "The difference in Waste-to-Energy Conversion Rate between Moore PLC Sustainability Initiative and Acosta, Small and Parker Sustainability Initiative is {3}."
        }
    ],
    "NF": [
        {
            "Q": "For Mcgrath-Glenn Sustainability Initiative in the radar chart, which dimensions have scores below 56? Please list the dimensions and corresponding scores.",
            "A": "{Green Building Certification Rate} is {51}"
        },
        {
            "Q": "Which labels have scores above 61 for the Eco-Friendly Product Sales Growth Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Acosta, Small and Parker Sustainability Initiative} is {69}"
        },
        {
            "Q": "Which labels have scores below 45 for the Recycling Material Utilization Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Mcgrath-Glenn Sustainability Initiative} is {41}, {Moore PLC Sustainability Initiative} is {41}"
        }
    ],
    "NC": [
        {
            "Q": "For Acosta, Small and Parker Sustainability Initiative, which dimension has a higher score: Renewable Energy Adoption Rate or Eco-Friendly Product Sales Growth Rate?",
            "A": "{Eco-Friendly Product Sales Growth Rate} has a higher score than Renewable Energy Adoption Rate for Acosta, Small and Parker Sustainability Initiative."
        },
        {
            "Q": "For Acosta, Small and Parker Sustainability Initiative, which dimension has a higher score: Recycling Material Utilization Rate or Sustainable Packaging Adoption Rate?",
            "A": "{Sustainable Packaging Adoption Rate} has a higher score than Recycling Material Utilization Rate for Acosta, Small and Parker Sustainability Initiative."
        },
        {
            "Q": "On Eco-Friendly Product Sales Growth Rate, which label has a higher score: Mcgrath-Glenn Sustainability Initiative or the Moore PLC Sustainability Initiative?",
            "A": "{Mcgrath-Glenn Sustainability Initiative} has a higher score on Eco-Friendly Product Sales Growth Rate compared to Moore PLC Sustainability Initiative."
        },
        {
            "Q": "On Water Conservation Efficiency Rate, which label has a higher score: Moore PLC Sustainability Initiative or the Acosta, Small and Parker Sustainability Initiative?",
            "A": "{Acosta, Small and Parker Sustainability Initiative} has a higher score on Water Conservation Efficiency Rate compared to Moore PLC Sustainability Initiative."
        }
    ],
    "MSR": [
        {
            "Q": "For Moore PLC Sustainability Initiative, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Moore PLC Sustainability Initiative most needs to improve its {Green Building Certification Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Acosta, Small and Parker Sustainability Initiative}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Moore PLC Sustainability Initiative}."
        }
    ],
    "VA": []
}