{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from High-value Crop Cultivation Ratio?",
            "A": "The next dimension clockwise from High-value Crop Cultivation Ratio is Profit MarginSustainable Farming Adoption Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from High-value Crop Cultivation Ratio?",
            "A": "The next dimension counterclockwise from High-value Crop Cultivation Ratio is Smart Equipment Coverage Rate."
        },
        {
            "Q": "On the Smart Equipment Coverage Rate, is the point for Romero-WilliamsFarm inside or outside the point for Jacobs, Holland and PrinceFarm?",
            "A": "On the Smart Equipment Coverage Rate, the point for Romero-WilliamsFarm is inside the point for Jacobs, Holland and PrinceFarm."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Profit MarginSustainable Farming Adoption Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Jacobs, Holland and PrinceFarm?",
            "A": "The strongest aspect is {Profit MarginSustainable Farming Adoption Rate}, while the weakest aspect is{ High-value Crop Cultivation Ratio}."
        },
        {
            "Q": "On dimension High-value Crop Cultivation Ratio, which label scores the highest?",
            "A": "On High-value Crop Cultivation Ratio, label {Bauer PLCFarm} scores the highest."
        },
        {
            "Q": "On dimension High-value Crop Cultivation Ratio, which label scores the highest?",
            "A": "On High-value Crop Cultivation Ratio, label {Bauer PLCFarm} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Bauer PLCFarm on the Profit MarginSustainable Farming Adoption Rate in the radar chart?",
            "A": "The value of Bauer PLCFarm on the Safety dimension is {61}."
        },
        {
            "Q": "What is the value of Bauer PLCFarm on the High-value Crop Cultivation Ratio in the radar chart?",
            "A": "The value of Bauer PLCFarm on the Safety dimension is {27}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Bauer PLCFarm across all dimensions in the radar chart?",
            "A": "The maximum value of Bauer PLCFarm across all dimensions is {49}."
        },
        {
            "Q": "What is the minimum value of label Bauer PLCFarm across all dimensions in the radar chart?",
            "A": "The minimum value of Bauer PLCFarm across all dimensions is {27}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Smart Equipment Coverage Rate",
            "A": "The average value of Smart Equipment Coverage Rate is {54.0}."
        },
        {
            "Q": "What is the average value of Romero-WilliamsFarm",
            "A": "The average value of Romero-WilliamsFarm is {52.0}."
        },
        {
            "Q": "What is the difference in Land Utilization Rate between Romero-WilliamsFarm and Jacobs, Holland and PrinceFarm?",
            "A": "The difference in Land Utilization Rate between Romero-WilliamsFarm and Jacobs, Holland and PrinceFarm is {19}."
        },
        {
            "Q": "What is the difference in High-value Crop Cultivation Ratio between Bauer PLCFarm and Romero-WilliamsFarm?",
            "A": "The difference in High-value Crop Cultivation Ratio between Bauer PLCFarm and Romero-WilliamsFarm is {5}."
        },
        {
            "Q": "What is the difference in Land Utilization Rate between Romero-WilliamsFarm and Jacobs, Holland and PrinceFarm?",
            "A": "The difference in Land Utilization Rate between Romero-WilliamsFarm and Jacobs, Holland and PrinceFarm is {19}."
        }
    ],
    "NF": [
        {
            "Q": "For Romero-WilliamsFarm in the radar chart, which dimensions have scores above 69? Please list the dimensions and corresponding scores.",
            "A": "{Land Utilization Rate} is {79}"
        },
        {
            "Q": "Which labels have scores above 75 for the Profit MarginSustainable Farming Adoption Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Jacobs, Holland and PrinceFarm} is {80}"
        },
        {
            "Q": "For Bauer PLCFarm in the radar chart, which dimensions have scores below 43? Please list the dimensions and corresponding scores.",
            "A": "{Smart Equipment Coverage Rate} is {36}, {High-value Crop Cultivation Ratio} is {32}"
        }
    ],
    "NC": [
        {
            "Q": "For Romero-WilliamsFarm, which dimension has a higher score: High-value Crop Cultivation Ratio or Smart Equipment Coverage Rate?",
            "A": "{Smart Equipment Coverage Rate} has a higher score than High-value Crop Cultivation Ratio for Romero-WilliamsFarm."
        },
        {
            "Q": "On Smart Equipment Coverage Rate, which label has a higher score: Bauer PLCFarm or the Jacobs, Holland and PrinceFarm?",
            "A": "{Jacobs, Holland and PrinceFarm} has a higher score on Smart Equipment Coverage Rate compared to Bauer PLCFarm."
        },
        {
            "Q": "On Smart Equipment Coverage Rate, which label has a higher score: Romero-WilliamsFarm or the Bauer PLCFarm?",
            "A": "{Bauer PLCFarm} has a higher score on Smart Equipment Coverage Rate compared to Romero-WilliamsFarm."
        },
        {
            "Q": "For Romero-WilliamsFarm, which dimension has a higher score: Smart Equipment Coverage Rate or Profit MarginSustainable Farming Adoption Rate or High-value Crop Cultivation Ratio?",
            "A": "{Profit MarginSustainable Farming Adoption Rate} has a higher score for Romero-WilliamsFarm."
        }
    ],
    "MSR": [
        {
            "Q": "For Romero-WilliamsFarm, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Romero-WilliamsFarm most needs to improve its {High-value Crop Cultivation Ratio}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Jacobs, Holland and PrinceFarm}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Romero-WilliamsFarm}."
        }
    ],
    "VA": []
}