{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Seat Occupancy Rate?",
            "A": "The next dimension clockwise from Seat Occupancy Rate is Customer Retention Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Seat Occupancy Rate?",
            "A": "The next dimension counterclockwise from Seat Occupancy Rate is Table Turnover Rate."
        },
        {
            "Q": "On the Ingredient Utilization Rate, is the point for Thomas-Black Restaurant inside or outside the point for Campos Group Restaurant?",
            "A": "On the Ingredient Utilization Rate, the point for Thomas-Black Restaurant is outside the point for Campos Group Restaurant."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Gross Profit Margin} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Campos Group Restaurant?",
            "A": "The strongest aspect is {Gross Profit Margin}, while the weakest aspect is{ Net Promoter Score (NPS)}."
        },
        {
            "Q": "On dimension Gross Profit Margin, which label scores the highest?",
            "A": "On Gross Profit Margin, label {Thomas-Black Restaurant} scores the highest."
        },
        {
            "Q": "On dimension Gross Profit Margin, which label scores the highest?",
            "A": "On Gross Profit Margin, label {Thomas-Black Restaurant} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Campos Group Restaurant on the Seat Occupancy Rate in the radar chart?",
            "A": "The value of Campos Group Restaurant on the Safety dimension is {59}."
        },
        {
            "Q": "What is the value of Thomas-Black Restaurant on the Customer Retention Rate in the radar chart?",
            "A": "The value of Thomas-Black Restaurant on the Safety dimension is {45}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Thomas-Black Restaurant across all dimensions in the radar chart?",
            "A": "The maximum value of Thomas-Black Restaurant across all dimensions is {75}."
        },
        {
            "Q": "What is the minimum value of label Thomas-Black Restaurant across all dimensions in the radar chart?",
            "A": "The minimum value of Thomas-Black Restaurant across all dimensions is {21}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Ingredient Utilization Rate",
            "A": "The average value of Ingredient Utilization Rate is {62.5}."
        },
        {
            "Q": "What is the average value of Campos Group Restaurant",
            "A": "The average value of Campos Group Restaurant is {50.43}."
        }
    ],
    "NF": [
        {
            "Q": "For Thomas-Black Restaurant in the radar chart, which dimensions have scores above 65? Please list the dimensions and corresponding scores.",
            "A": "{Gross Profit Margin} is {75}"
        },
        {
            "Q": "For Campos Group Restaurant in the radar chart, which dimensions have scores below 35? Please list the dimensions and corresponding scores.",
            "A": "{Net Promoter Score (NPS)} is {21}, {Inventory Turnover Rate} is {25}"
        },
        {
            "Q": "Which labels have scores below 47 for the Table Turnover Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Thomas-Black Restaurant} is {46}"
        }
    ],
    "NC": [
        {
            "Q": "For Campos Group Restaurant, which dimension has a higher score: Table Turnover Rate or Customer Retention Rate?",
            "A": "{Customer Retention Rate} has a higher score than Table Turnover Rate for Campos Group Restaurant."
        },
        {
            "Q": "On Ingredient Utilization Rate, which label has a higher score: Thomas-Black Restaurant or the Campos Group Restaurant?",
            "A": "{Thomas-Black Restaurant} has a higher score on Ingredient Utilization Rate compared to Campos Group Restaurant."
        },
        {
            "Q": "On Table Turnover Rate, which label has a higher score: Thomas-Black Restaurant or the Campos Group Restaurant?",
            "A": "{Campos Group Restaurant} has a higher score on Table Turnover Rate compared to Thomas-Black Restaurant."
        },
        {
            "Q": "For Thomas-Black Restaurant, which dimension has a higher score: Table Turnover Rate or Inventory Turnover Rate or Customer Retention Rate?",
            "A": "{Table Turnover Rate} has a higher score for Thomas-Black Restaurant."
        }
    ],
    "MSR": [
        {
            "Q": "For Campos Group Restaurant, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Campos Group Restaurant most needs to improve its {Net Promoter Score (NPS)}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Thomas-Black Restaurant}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Campos Group Restaurant}."
        }
    ],
    "VA": []
}