{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Agricultural Product Market Share?",
            "A": "The next dimension clockwise from Agricultural Product Market Share is Irrigation Water Use Efficiency"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Agricultural Product Market Share?",
            "A": "The next dimension counterclockwise from Agricultural Product Market Share is Land Utilization Rate."
        },
        {
            "Q": "On the Land Utilization Rate, is the point for Henderson LtdFarm inside or outside the point for Ray LtdFarm?",
            "A": "On the Land Utilization Rate, the point for Henderson LtdFarm is inside the point for Ray LtdFarm."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Land Utilization Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Ray LtdFarm?",
            "A": "The strongest aspect is {Land Utilization Rate}, while the weakest aspect is{ Agricultural Product Market Share}."
        },
        {
            "Q": "On dimension Agricultural Product Market Share, which label scores the highest?",
            "A": "On Agricultural Product Market Share, label {Ray LtdFarm} scores the highest."
        },
        {
            "Q": "On dimension Yield Growth Rate, which label scores the highest?",
            "A": "On Yield Growth Rate, label {Ray LtdFarm} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Henderson LtdFarm on the Irrigation Water Use Efficiency in the radar chart?",
            "A": "The value of Henderson LtdFarm on the Safety dimension is {86}."
        },
        {
            "Q": "What is the value of Henderson LtdFarm on the Land Utilization Rate in the radar chart?",
            "A": "The value of Henderson LtdFarm on the Safety dimension is {23}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Henderson LtdFarm across all dimensions in the radar chart?",
            "A": "The maximum value of Henderson LtdFarm across all dimensions is {77}."
        },
        {
            "Q": "What is the minimum value of label Ray LtdFarm across all dimensions in the radar chart?",
            "A": "The minimum value of Ray LtdFarm across all dimensions is {77}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Agricultural Product Market Share",
            "A": "The average value of Agricultural Product Market Share is {56.5}."
        },
        {
            "Q": "What is the average value of Henderson LtdFarm",
            "A": "The average value of Henderson LtdFarm is {66.5}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 30 for the Land Utilization Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Henderson LtdFarm} is {23}"
        },
        {
            "Q": "For Henderson LtdFarm in the radar chart, which dimensions have scores above 73? Please list the dimensions and corresponding scores.",
            "A": "{Yield Growth Rate} is {77}, {Agricultural Product Market Share} is {80}, {Irrigation Water Use Efficiency} is {86}"
        },
        {
            "Q": "For Henderson LtdFarm in the radar chart, which dimensions have scores below 36? Please list the dimensions and corresponding scores.",
            "A": "{Land Utilization Rate} is {23}"
        }
    ],
    "NC": [
        {
            "Q": "For Ray LtdFarm, which dimension has a higher score: Agricultural Product Market Share or Irrigation Water Use Efficiency?",
            "A": "{Irrigation Water Use Efficiency} has a higher score than Agricultural Product Market Share for Ray LtdFarm."
        },
        {
            "Q": "On Land Utilization Rate, which label has a higher score: Henderson LtdFarm or the Ray LtdFarm?",
            "A": "{Ray LtdFarm} has a higher score on Land Utilization Rate compared to Henderson LtdFarm."
        },
        {
            "Q": "On Irrigation Water Use Efficiency, which label has a higher score: Ray LtdFarm or the Henderson LtdFarm?",
            "A": "{Henderson LtdFarm} has a higher score on Irrigation Water Use Efficiency compared to Ray LtdFarm."
        },
        {
            "Q": "For Henderson LtdFarm, which dimension has a higher score: Agricultural Product Market Share or Irrigation Water Use Efficiency or Yield Growth Rate?",
            "A": "{Irrigation Water Use Efficiency} has a higher score for Henderson LtdFarm."
        }
    ],
    "MSR": [
        {
            "Q": "For Henderson LtdFarm, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Henderson LtdFarm most needs to improve its {Land Utilization Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Henderson LtdFarm}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Ray LtdFarm}."
        }
    ],
    "VA": []
}