{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Gross Profit Margin?",
            "A": "The next dimension clockwise from Gross Profit Margin is Inventory Turnover Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Gross Profit Margin?",
            "A": "The next dimension counterclockwise from Gross Profit Margin is Table Turnover Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Customer Satisfaction Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Salinas, Moore and Padilla Restaurant?",
            "A": "The strongest aspect is {Customer Satisfaction Rate}, while the weakest aspect is{ Inventory Turnover Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Salinas, Moore and Padilla Restaurant on the Table Turnover Rate in the radar chart?",
            "A": "The value of Salinas, Moore and Padilla Restaurant on the Safety dimension is {35}."
        },
        {
            "Q": "What is the value of Salinas, Moore and Padilla Restaurant on the Inventory Turnover Rate in the radar chart?",
            "A": "The value of Salinas, Moore and Padilla Restaurant on the Safety dimension is {33}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Salinas, Moore and Padilla Restaurant across all dimensions in the radar chart?",
            "A": "The maximum value of Salinas, Moore and Padilla Restaurant across all dimensions is {97}."
        },
        {
            "Q": "What is the minimum value of label Salinas, Moore and Padilla Restaurant across all dimensions in the radar chart?",
            "A": "The minimum value of Salinas, Moore and Padilla Restaurant across all dimensions is {97}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Inventory Turnover Rate",
            "A": "The average value of Inventory Turnover Rate is {33.0}."
        },
        {
            "Q": "What is the average value of Salinas, Moore and Padilla Restaurant",
            "A": "The average value of Salinas, Moore and Padilla Restaurant is {62.5}."
        }
    ],
    "NF": [
        {
            "Q": "For Salinas, Moore and Padilla Restaurant in the radar chart, which dimensions have scores below 46? Please list the dimensions and corresponding scores.",
            "A": "{Table Turnover Rate} is {35}, {Inventory Turnover Rate} is {33}"
        },
        {
            "Q": "For Salinas, Moore and Padilla Restaurant in the radar chart, which dimensions have scores between 46 and 84? Please list the dimensions and corresponding scores.",
            "A": "None is between 46 and 84"
        },
        {
            "Q": "For Salinas, Moore and Padilla Restaurant in the radar chart, which dimensions have scores above 84? Please list the dimensions and corresponding scores.",
            "A": "{Customer Satisfaction Rate} is {97}, {Gross Profit Margin} is {85}"
        }
    ],
    "NC": [
        {
            "Q": "For Salinas, Moore and Padilla Restaurant, which dimension has a higher score: Inventory Turnover Rate or Gross Profit Margin?",
            "A": "{Gross Profit Margin} has a higher score than Inventory Turnover Rate for Salinas, Moore and Padilla Restaurant."
        },
        {
            "Q": "For Salinas, Moore and Padilla Restaurant, which dimension has a higher score: Table Turnover Rate or Customer Satisfaction Rate or Gross Profit Margin?",
            "A": "{Customer Satisfaction Rate} has a higher score for Salinas, Moore and Padilla Restaurant."
        }
    ],
    "MSR": [
        {
            "Q": "For Salinas, Moore and Padilla Restaurant, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Salinas, Moore and Padilla Restaurant most needs to improve its {Inventory Turnover Rate}."
        }
    ],
    "VA": []
}