{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {1} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Gross Profit Margin?",
            "A": "The next dimension clockwise from Gross Profit Margin is Ingredient Utilization Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Gross Profit Margin?",
            "A": "The next dimension counterclockwise from Gross Profit Margin is Customer Satisfaction Rate."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Gross Profit Margin} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Lopez Group Restaurant?",
            "A": "The strongest aspect is {Gross Profit Margin}, while the weakest aspect is{ Customer Satisfaction Rate}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Lopez Group Restaurant on the Ingredient Utilization Rate in the radar chart?",
            "A": "The value of Lopez Group Restaurant on the Safety dimension is {83}."
        },
        {
            "Q": "What is the value of Lopez Group Restaurant on the Table Turnover Rate in the radar chart?",
            "A": "The value of Lopez Group Restaurant on the Safety dimension is {68}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Lopez Group Restaurant across all dimensions in the radar chart?",
            "A": "The maximum value of Lopez Group Restaurant across all dimensions is {62}."
        },
        {
            "Q": "What is the minimum value of label Lopez Group Restaurant across all dimensions in the radar chart?",
            "A": "The minimum value of Lopez Group Restaurant across all dimensions is {62}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Net Promoter Score (NPS)",
            "A": "The average value of Net Promoter Score (NPS) is {65.0}."
        },
        {
            "Q": "What is the average value of Lopez Group Restaurant",
            "A": "The average value of Lopez Group Restaurant is {64.67}."
        }
    ],
    "NF": [
        {
            "Q": "For Lopez Group Restaurant in the radar chart, which dimensions have scores below 38? Please list the dimensions and corresponding scores.",
            "A": "{Customer Satisfaction Rate} is {27}"
        },
        {
            "Q": "Which labels have scores below 27 for the Customer Satisfaction Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Lopez Group Restaurant} is {27}"
        },
        {
            "Q": "For Lopez Group Restaurant in the radar chart, which dimensions have scores between 38 and 72? Please list the dimensions and corresponding scores.",
            "A": "{Seat Occupancy Rate} is {62}, {Net Promoter Score (NPS)} is {65}, {Table Turnover Rate} is {68}"
        }
    ],
    "NC": [
        {
            "Q": "For Lopez Group Restaurant, which dimension has a higher score: Seat Occupancy Rate or Table Turnover Rate?",
            "A": "{Table Turnover Rate} has a higher score than Seat Occupancy Rate for Lopez Group Restaurant."
        },
        {
            "Q": "For Lopez Group Restaurant, which dimension has a higher score: Ingredient Utilization Rate or Table Turnover Rate or Net Promoter Score (NPS)?",
            "A": "{Ingredient Utilization Rate} has a higher score for Lopez Group Restaurant."
        }
    ],
    "MSR": [
        {
            "Q": "For Lopez Group Restaurant, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Lopez Group Restaurant most needs to improve its {Customer Satisfaction Rate}."
        }
    ],
    "VA": []
}