{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Hospital Bed Utilization Rate?",
            "A": "The next dimension clockwise from Hospital Bed Utilization Rate is Disease Incidence Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Disease Incidence Rate?",
            "A": "The next dimension counterclockwise from Hospital Bed Utilization Rate is Primary Healthcare Institutions Ratio."
        },
        {
            "Q": "On the Disease Incidence Rate, is the point for Samoa inside or outside the point for Jersey?",
            "A": "On the Disease Incidence Rate, the point for Samoa is outside the point for Jersey."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Disease Incidence Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Samoa?",
            "A": "The strongest aspect is {Disease Incidence Rate}, while the weakest aspect is{ Primary Healthcare Institutions Ratio}."
        },
        {
            "Q": "On dimension Disease Incidence Rate, which label scores the highest?",
            "A": "On Disease Incidence Rate, label {Burundi} scores the highest."
        },
        {
            "Q": "On dimension Hospital Bed Utilization Rate, which label scores the highest?",
            "A": "On Hospital Bed Utilization Rate, label {Burundi} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Samoa on the Primary Healthcare Institutions Ratio in the radar chart?",
            "A": "The value of Samoa on the Safety dimension is {28}."
        },
        {
            "Q": "What is the value of Jersey on the Outpatient Satisfaction Rate  in the radar chart?",
            "A": "The value of Jersey on the Safety dimension is {78}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Jersey across all dimensions in the radar chart?",
            "A": "The maximum value of Jersey across all dimensions is {57}."
        },
        {
            "Q": "What is the minimum value of label Samoa across all dimensions in the radar chart?",
            "A": "The minimum value of Samoa across all dimensions is {78}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Primary Healthcare Institutions Ratio",
            "A": "The average value of Primary Healthcare Institutions Ratio is {27.0}."
        },
        {
            "Q": "What is the average value of Jersey",
            "A": "The average value of Jersey is {52.0}."
        },
        {
            "Q": "What is the difference in Outpatient Satisfaction Rate  between Burundi and Jersey?",
            "A": "The difference in Outpatient Satisfaction Rate  between Burundi and Jersey is {21}."
        },
        {
            "Q": "What is the difference in Disease Incidence Rate between Jersey and Burundi?",
            "A": "The difference in Disease Incidence Rate between Jersey and Burundi is {11}."
        },
        {
            "Q": "What is the difference in Primary Healthcare Institutions Ratio between Jersey and Samoa?",
            "A": "The difference in Primary Healthcare Institutions Ratio between Jersey and Samoa is {0}."
        }
    ],
    "NF": [
        {
            "Q": "For Samoa in the radar chart, which dimensions have scores above 51? Please list the dimensions and corresponding scores.",
            "A": "{Outpatient Satisfaction Rate } is {57}"
        },
        {
            "Q": "For Burundi in the radar chart, which dimensions have scores between 42 and 51? Please list the dimensions and corresponding scores.",
            "A": "{Disease Incidence Rate} is {47}"
        },
        {
            "Q": "For Burundi in the radar chart, which dimensions have scores below 42? Please list the dimensions and corresponding scores.",
            "A": "{Primary Healthcare Institutions Ratio} is {28}"
        }
    ],
    "NC": [
        {
            "Q": "For Samoa, which dimension has a higher score: Hospital Bed Utilization Rate or Vaccination Rate?",
            "A": "{Hospital Bed Utilization Rate} has a higher score than Vaccination Rate for Samoa."
        },
        {
            "Q": "For Samoa, which dimension has a higher score: Disease Incidence Rate or Primary Healthcare Institutions Ratio?",
            "A": "{Disease Incidence Rate} has a higher score than Primary Healthcare Institutions Ratio for Samoa."
        },
        {
            "Q": "On Vaccination Rate, which label has a higher score: Jersey or the Burundi?",
            "A": "{Jersey} has a higher score on Vaccination Rate compared to Burundi."
        },
        {
            "Q": "On Primary Healthcare Institutions Ratio, which label has a higher score: Jersey or the Samoa?",
            "A": "{Jersey} has a higher score on Primary Healthcare Institutions Ratio compared to Samoa."
        }
    ],
    "MSR": [
        {
            "Q": "For Jersey, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Jersey most needs to improve its {Primary Healthcare Institutions Ratio}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Samoa}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Burundi}."
        }
    ],
    "VA": []
}