{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {5} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Vaccination Rate?",
            "A": "The next dimension clockwise from Vaccination Rate is Chronic Disease Management Compliance Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Vaccination Rate?",
            "A": "The next dimension counterclockwise from Vaccination Rate is Outpatient Satisfaction Rate ."
        },
        {
            "Q": "On the Primary Healthcare Institutions Ratio, is the point for Malaysia inside or outside the point for Russian Federation?",
            "A": "On the Primary Healthcare Institutions Ratio, the point for Malaysia is outside the point for Russian Federation."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Vaccination Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Malaysia?",
            "A": "The strongest aspect is {Vaccination Rate}, while the weakest aspect is{ Chronic Disease Management Compliance Rate}."
        },
        {
            "Q": "On dimension Disease Incidence Rate, which label scores the highest?",
            "A": "On Disease Incidence Rate, label {Russian Federation} scores the highest."
        },
        {
            "Q": "On dimension Vaccination Rate, which label scores the highest?",
            "A": "On Vaccination Rate, label {Russian Federation} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Malaysia on the Primary Healthcare Institutions Ratio in the radar chart?",
            "A": "The value of Malaysia on the Safety dimension is {74}."
        },
        {
            "Q": "What is the value of Korea on the Primary Healthcare Institutions Ratio in the radar chart?",
            "A": "The value of Korea on the Safety dimension is {78}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Russian Federation across all dimensions in the radar chart?",
            "A": "The maximum value of Russian Federation across all dimensions is {74}."
        },
        {
            "Q": "What is the minimum value of label Malaysia across all dimensions in the radar chart?",
            "A": "The minimum value of Malaysia across all dimensions is {95}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Vaccination Rate",
            "A": "The average value of Vaccination Rate is {73.0}."
        },
        {
            "Q": "What is the average value of Korea",
            "A": "The average value of Korea is {73.8}."
        },
        {
            "Q": "What is the difference in Vaccination Rate between Malaysia and Korea?",
            "A": "The difference in Vaccination Rate between Malaysia and Korea is {30}."
        },
        {
            "Q": "What is the difference in Vaccination Rate between Malaysia and Russian Federation?",
            "A": "The difference in Vaccination Rate between Malaysia and Russian Federation is {33}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 76 for the Primary Healthcare Institutions Ratio dimension? Please list the labels and corresponding scores.",
            "A": "{Korea} is {78}"
        },
        {
            "Q": "For Malaysia in the radar chart, which dimensions have scores above 80? Please list the dimensions and corresponding scores.",
            "A": "{Outpatient Satisfaction Rate } is {87}, {Chronic Disease Management Compliance Rate} is {81}"
        },
        {
            "Q": "For Korea in the radar chart, which dimensions have scores between 53 and 80? Please list the dimensions and corresponding scores.",
            "A": "{Disease Incidence Rate} is {79}, {Primary Healthcare Institutions Ratio} is {78}, {Vaccination Rate} is {64}"
        }
    ],
    "NC": [
        {
            "Q": "For Malaysia, which dimension has a higher score: Vaccination Rate or Primary Healthcare Institutions Ratio?",
            "A": "{Vaccination Rate} has a higher score than Primary Healthcare Institutions Ratio for Malaysia."
        },
        {
            "Q": "On Disease Incidence Rate, which label has a higher score: Malaysia or the Russian Federation?",
            "A": "{Malaysia} has a higher score on Disease Incidence Rate compared to Russian Federation."
        },
        {
            "Q": "For Malaysia, which dimension has a higher score: Primary Healthcare Institutions Ratio or Vaccination Rate or Outpatient Satisfaction Rate ?",
            "A": "{Vaccination Rate} has a higher score for Malaysia."
        },
        {
            "Q": "For Russian Federation, which dimension has a higher score: Chronic Disease Management Compliance Rate or Disease Incidence Rate or Vaccination Rate?",
            "A": "{Chronic Disease Management Compliance Rate} has a higher score for Russian Federation."
        }
    ],
    "MSR": [
        {
            "Q": "For Russian Federation, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Russian Federation most needs to improve its {Disease Incidence Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Malaysia}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Russian Federation}."
        }
    ],
    "VA": []
}