{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Disease Incidence Rate?",
            "A": "The next dimension clockwise from Disease Incidence Rate is Primary Healthcare Institutions Ratio"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Chronic Disease Management Compliance Rate?",
            "A": "The next dimension counterclockwise from Disease Incidence Rate is Hospital Bed Utilization Rate."
        },
        {
            "Q": "On the Vaccination Rate, is the point for Togo inside or outside the point for Bolivia?",
            "A": "On the Vaccination Rate, the point for Togo is inside the point for Bolivia."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Vaccination Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Bolivia?",
            "A": "The strongest aspect is {Vaccination Rate}, while the weakest aspect is{ Hospital Bed Utilization Rate}."
        },
        {
            "Q": "On dimension Primary Healthcare Institutions Ratio, which label scores the highest?",
            "A": "On Primary Healthcare Institutions Ratio, label {Togo} scores the highest."
        },
        {
            "Q": "On dimension Disease Incidence Rate, which label scores the highest?",
            "A": "On Disease Incidence Rate, label {Bolivia} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Bolivia on the Vaccination Rate in the radar chart?",
            "A": "The value of Bolivia on the Safety dimension is {84}."
        },
        {
            "Q": "What is the value of Bolivia on the Electronic Medical Record Adoption Rate in the radar chart?",
            "A": "The value of Bolivia on the Safety dimension is {48}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Togo across all dimensions in the radar chart?",
            "A": "The maximum value of Togo across all dimensions is {50}."
        },
        {
            "Q": "What is the minimum value of label Guadeloupe across all dimensions in the radar chart?",
            "A": "The minimum value of Guadeloupe across all dimensions is {50}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Vaccination Rate",
            "A": "The average value of Vaccination Rate is {71.0}."
        },
        {
            "Q": "What is the average value of Bolivia",
            "A": "The average value of Bolivia is {59.83}."
        },
        {
            "Q": "What is the difference in Chronic Disease Management Compliance Rate between Togo and Bolivia?",
            "A": "The difference in Chronic Disease Management Compliance Rate between Togo and Bolivia is {6}."
        }
    ],
    "NF": [
        {
            "Q": "For Togo in the radar chart, which dimensions have scores below 46? Please list the dimensions and corresponding scores.",
            "A": "{Hospital Bed Utilization Rate} is {37}"
        },
        {
            "Q": "For Bolivia in the radar chart, which dimensions have scores above 77? Please list the dimensions and corresponding scores.",
            "A": "{Hospital Bed Utilization Rate} is {84}"
        },
        {
            "Q": "Which labels have scores above 75 for the Hospital Bed Utilization Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Togo} is {84}"
        }
    ],
    "NC": [
        {
            "Q": "For Togo, which dimension has a higher score: Primary Healthcare Institutions Ratio or Chronic Disease Management Compliance Rate?",
            "A": "{Chronic Disease Management Compliance Rate} has a higher score than Primary Healthcare Institutions Ratio for Togo."
        },
        {
            "Q": "For Bolivia, which dimension has a higher score: Hospital Bed Utilization Rate or Primary Healthcare Institutions Ratio?",
            "A": "{Primary Healthcare Institutions Ratio} has a higher score than Hospital Bed Utilization Rate for Bolivia."
        },
        {
            "Q": "On Disease Incidence Rate, which label has a higher score: Guadeloupe or the Togo?",
            "A": "{Guadeloupe} has a higher score on Disease Incidence Rate compared to Togo."
        },
        {
            "Q": "On Disease Incidence Rate, which label has a higher score: Guadeloupe or the Togo?",
            "A": "{Guadeloupe} has a higher score on Disease Incidence Rate compared to Togo."
        }
    ],
    "MSR": [
        {
            "Q": "For Bolivia, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Bolivia most needs to improve its {Hospital Bed Utilization Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Guadeloupe}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Bolivia}."
        }
    ],
    "VA": []
}