{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Electronic Medical Record Adoption Rate?",
            "A": "The next dimension clockwise from Electronic Medical Record Adoption Rate is Vaccination Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Electronic Medical Record Adoption Rate?",
            "A": "The next dimension counterclockwise from Electronic Medical Record Adoption Rate is Health Insurance Coverage Rate."
        },
        {
            "Q": "On the Disease Incidence Rate, is the point for United States of America inside or outside the point for Iraq?",
            "A": "On the Disease Incidence Rate, the point for United States of America is outside the point for Iraq."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Vaccination Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of United States of America?",
            "A": "The strongest aspect is {Vaccination Rate}, while the weakest aspect is{ Hospital Bed Utilization Rate}."
        },
        {
            "Q": "On dimension Electronic Medical Record Adoption Rate, which label scores the highest?",
            "A": "On Electronic Medical Record Adoption Rate, label {United States of America} scores the highest."
        },
        {
            "Q": "On dimension Primary Healthcare Institutions Ratio, which label scores the highest?",
            "A": "On Primary Healthcare Institutions Ratio, label {Cambodia} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of United States of America on the Health Insurance Coverage Rate in the radar chart?",
            "A": "The value of United States of America on the Safety dimension is {54}."
        },
        {
            "Q": "What is the value of Cambodia on the Primary Healthcare Institutions Ratio in the radar chart?",
            "A": "The value of Cambodia on the Safety dimension is {41}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Iraq across all dimensions in the radar chart?",
            "A": "The maximum value of Iraq across all dimensions is {74}."
        },
        {
            "Q": "What is the minimum value of label Iraq across all dimensions in the radar chart?",
            "A": "The minimum value of Iraq across all dimensions is {61}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Primary Healthcare Institutions Ratio",
            "A": "The average value of Primary Healthcare Institutions Ratio is {66.67}."
        },
        {
            "Q": "What is the average value of Iraq",
            "A": "The average value of Iraq is {60.67}."
        },
        {
            "Q": "What is the difference in Disease Incidence Rate between Cambodia and Iraq?",
            "A": "The difference in Disease Incidence Rate between Cambodia and Iraq is {4}."
        },
        {
            "Q": "What is the difference in Health Insurance Coverage Rate between Iraq and Cambodia?",
            "A": "The difference in Health Insurance Coverage Rate between Iraq and Cambodia is {29}."
        }
    ],
    "NF": [
        {
            "Q": "For Iraq in the radar chart, which dimensions have scores between 40 and 76? Please list the dimensions and corresponding scores.",
            "A": "{Disease Incidence Rate} is {57}, {Electronic Medical Record Adoption Rate} is {51}, {Vaccination Rate} is {51}"
        },
        {
            "Q": "For Iraq in the radar chart, which dimensions have scores below 40? Please list the dimensions and corresponding scores.",
            "A": "{Hospital Bed Utilization Rate} is {29}"
        },
        {
            "Q": "For United States of America in the radar chart, which dimensions have scores above 76? Please list the dimensions and corresponding scores.",
            "A": "{Primary Healthcare Institutions Ratio} is {85}, {Health Insurance Coverage Rate} is {82}"
        }
    ],
    "NC": [
        {
            "Q": "For Iraq, which dimension has a higher score: Vaccination Rate or Hospital Bed Utilization Rate?",
            "A": "{Vaccination Rate} has a higher score than Hospital Bed Utilization Rate for Iraq."
        },
        {
            "Q": "For Iraq, which dimension has a higher score: Hospital Bed Utilization Rate or Electronic Medical Record Adoption Rate?",
            "A": "{Electronic Medical Record Adoption Rate} has a higher score than Hospital Bed Utilization Rate for Iraq."
        },
        {
            "Q": "On Primary Healthcare Institutions Ratio, which label has a higher score: Cambodia or the Iraq?",
            "A": "{Iraq} has a higher score on Primary Healthcare Institutions Ratio compared to Cambodia."
        },
        {
            "Q": "For Cambodia, which dimension has a higher score: Primary Healthcare Institutions Ratio or Electronic Medical Record Adoption Rate or Disease Incidence Rate?",
            "A": "{Electronic Medical Record Adoption Rate} has a higher score for Cambodia."
        }
    ],
    "MSR": [
        {
            "Q": "For United States of America, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "United States of America most needs to improve its {Hospital Bed Utilization Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Iraq}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Cambodia}."
        }
    ],
    "VA": []
}