{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Skill Proficiency Rate?",
            "A": "The next dimension clockwise from Skill Proficiency Rate is Job Satisfaction"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Skill Proficiency Rate?",
            "A": "The next dimension counterclockwise from Skill Proficiency Rate is Offer Acceptance Rate."
        },
        {
            "Q": "On the Offer Acceptance Rate, is the point for Bates, Moore and Evans inside or outside the point for Bryant, Burnett and Maldonado?",
            "A": "On the Offer Acceptance Rate, the point for Bates, Moore and Evans is outside the point for Bryant, Burnett and Maldonado."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Job Satisfaction} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Montes, Martin and Russell?",
            "A": "The strongest aspect is {Job Satisfaction}, while the weakest aspect is{ Offer Acceptance Rate}."
        },
        {
            "Q": "On dimension Time-to-Fill Rate, which label scores the highest?",
            "A": "On Time-to-Fill Rate, label {Bryant, Burnett and Maldonado} scores the highest."
        },
        {
            "Q": "On dimension Skill Proficiency Rate, which label scores the highest?",
            "A": "On Skill Proficiency Rate, label {Bryant, Burnett and Maldonado} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Montes, Martin and Russell on the Skill Proficiency Rate in the radar chart?",
            "A": "The value of Montes, Martin and Russell on the Safety dimension is {50}."
        },
        {
            "Q": "What is the value of Montes, Martin and Russell on the Time-to-Fill Rate in the radar chart?",
            "A": "The value of Montes, Martin and Russell on the Safety dimension is {72}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Bryant, Burnett and Maldonado across all dimensions in the radar chart?",
            "A": "The maximum value of Bryant, Burnett and Maldonado across all dimensions is {50}."
        },
        {
            "Q": "What is the minimum value of label Bates, Moore and Evans across all dimensions in the radar chart?",
            "A": "The minimum value of Bates, Moore and Evans across all dimensions is {42}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Job Satisfaction",
            "A": "The average value of Job Satisfaction is {78.33}."
        },
        {
            "Q": "What is the average value of Bryant, Burnett and Maldonado",
            "A": "The average value of Bryant, Burnett and Maldonado is {60.25}."
        },
        {
            "Q": "What is the difference in Job Satisfaction between Bates, Moore and Evans and Montes, Martin and Russell?",
            "A": "The difference in Job Satisfaction between Bates, Moore and Evans and Montes, Martin and Russell is {8}."
        }
    ],
    "NF": [
        {
            "Q": "For Bryant, Burnett and Maldonado in the radar chart, which dimensions have scores below 51? Please list the dimensions and corresponding scores.",
            "A": "{Skill Proficiency Rate} is {45}"
        },
        {
            "Q": "Which labels have scores below 51 for the Offer Acceptance Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Montes, Martin and Russell} is {42}"
        },
        {
            "Q": "Which labels have scores above 80 for the Offer Acceptance Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Bates, Moore and Evans} is {89}"
        }
    ],
    "NC": [
        {
            "Q": "For Montes, Martin and Russell, which dimension has a higher score: Offer Acceptance Rate or Time-to-Fill Rate?",
            "A": "{Time-to-Fill Rate} has a higher score than Offer Acceptance Rate for Montes, Martin and Russell."
        },
        {
            "Q": "For Bates, Moore and Evans, which dimension has a higher score: Job Satisfaction or Time-to-Fill Rate?",
            "A": "{Time-to-Fill Rate} has a higher score than Job Satisfaction for Bates, Moore and Evans."
        },
        {
            "Q": "On Skill Proficiency Rate, which label has a higher score: Bates, Moore and Evans or the Montes, Martin and Russell?",
            "A": "{Bates, Moore and Evans} has a higher score on Skill Proficiency Rate compared to Montes, Martin and Russell."
        },
        {
            "Q": "On Job Satisfaction, which label has a higher score: Montes, Martin and Russell or the Bates, Moore and Evans?",
            "A": "{Montes, Martin and Russell} has a higher score on Job Satisfaction compared to Bates, Moore and Evans."
        }
    ],
    "MSR": [
        {
            "Q": "For Montes, Martin and Russell, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Montes, Martin and Russell most needs to improve its {Offer Acceptance Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Bates, Moore and Evans}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Bryant, Burnett and Maldonado}."
        }
    ],
    "VA": []
}