{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Promotion Rate?",
            "A": "The next dimension clockwise from Promotion Rate is Time-to-Fill Rate"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Skill Proficiency Rate?",
            "A": "The next dimension counterclockwise from Promotion Rate is Retention Rate."
        },
        {
            "Q": "On the Skill Proficiency Rate, is the point for Gutierrez-Snyder inside or outside the point for Turner-Davis?",
            "A": "On the Skill Proficiency Rate, the point for Gutierrez-Snyder is outside the point for Turner-Davis."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Time-to-Fill Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of Gutierrez-Snyder?",
            "A": "The strongest aspect is {Time-to-Fill Rate}, while the weakest aspect is{ Promotion Rate}."
        },
        {
            "Q": "On dimension Offer Acceptance Rate, which label scores the highest?",
            "A": "On Offer Acceptance Rate, label {Gutierrez-Snyder} scores the highest."
        },
        {
            "Q": "On dimension Offer Acceptance Rate, which label scores the highest?",
            "A": "On Offer Acceptance Rate, label {Gutierrez-Snyder} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of Turner-Davis on the Retention Rate in the radar chart?",
            "A": "The value of Turner-Davis on the Safety dimension is {72}."
        },
        {
            "Q": "What is the value of Turner-Davis on the Offer Acceptance Rate in the radar chart?",
            "A": "The value of Turner-Davis on the Safety dimension is {38}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label Gutierrez-Snyder across all dimensions in the radar chart?",
            "A": "The maximum value of Gutierrez-Snyder across all dimensions is {39}."
        },
        {
            "Q": "What is the minimum value of label Turner-Davis across all dimensions in the radar chart?",
            "A": "The minimum value of Turner-Davis across all dimensions is {56}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Promotion Rate",
            "A": "The average value of Promotion Rate is {48.67}."
        },
        {
            "Q": "What is the average value of Black, Martinez and Rodriguez",
            "A": "The average value of Black, Martinez and Rodriguez is {72.0}."
        },
        {
            "Q": "What is the difference in Job Satisfaction between Gutierrez-Snyder and Black, Martinez and Rodriguez?",
            "A": "The difference in Job Satisfaction between Gutierrez-Snyder and Black, Martinez and Rodriguez is {16}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 66 for the Retention Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Gutierrez-Snyder} is {64}"
        },
        {
            "Q": "For Black, Martinez and Rodriguez in the radar chart, which dimensions have scores above 81? Please list the dimensions and corresponding scores.",
            "A": "{Skill Proficiency Rate} is {88}"
        },
        {
            "Q": "Which labels have scores above 73 for the Retention Rate dimension? Please list the labels and corresponding scores.",
            "A": "{Black, Martinez and Rodriguez} is {75}"
        }
    ],
    "NC": [
        {
            "Q": "For Turner-Davis, which dimension has a higher score: Retention Rate or Time-to-Fill Rate?",
            "A": "{Retention Rate} has a higher score than Time-to-Fill Rate for Turner-Davis."
        },
        {
            "Q": "For Turner-Davis, which dimension has a higher score: Retention Rate or Skill Proficiency Rate?",
            "A": "{Retention Rate} has a higher score than Skill Proficiency Rate for Turner-Davis."
        },
        {
            "Q": "On Time-to-Fill Rate, which label has a higher score: Gutierrez-Snyder or the Turner-Davis?",
            "A": "{Gutierrez-Snyder} has a higher score on Time-to-Fill Rate compared to Turner-Davis."
        },
        {
            "Q": "On Skill Proficiency Rate, which label has a higher score: Black, Martinez and Rodriguez or the Gutierrez-Snyder?",
            "A": "{Black, Martinez and Rodriguez} has a higher score on Skill Proficiency Rate compared to Gutierrez-Snyder."
        }
    ],
    "MSR": [
        {
            "Q": "For Gutierrez-Snyder, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "Gutierrez-Snyder most needs to improve its {Promotion Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {Black, Martinez and Rodriguez}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {Turner-Davis}."
        }
    ],
    "VA": []
}