{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {6} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Price-to-Income Ratio?",
            "A": "The next dimension clockwise from Price-to-Income Ratio is Rental Yield"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Price Volatility Index?",
            "A": "The next dimension counterclockwise from Price-to-Income Ratio is Transaction Volume Growth."
        },
        {
            "Q": "On the Capital Appreciation Rate, is the point for furt inside or outside the point for borough?",
            "A": "On the Capital Appreciation Rate, the point for furt is outside the point for borough."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Price-to-Income Ratio} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of furt?",
            "A": "The strongest aspect is {Price-to-Income Ratio}, while the weakest aspect is{ Price Volatility Index}."
        },
        {
            "Q": "On dimension Price Volatility Index, which label scores the highest?",
            "A": "On Price Volatility Index, label {furt} scores the highest."
        },
        {
            "Q": "On dimension Rental Yield, which label scores the highest?",
            "A": "On Rental Yield, label {borough} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of furt on the Rental Yield in the radar chart?",
            "A": "The value of furt on the Safety dimension is {61}."
        },
        {
            "Q": "What is the value of borough on the Rate of Newly Built Homes in the radar chart?",
            "A": "The value of borough on the Safety dimension is {52}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label borough across all dimensions in the radar chart?",
            "A": "The maximum value of borough across all dimensions is {46}."
        },
        {
            "Q": "What is the minimum value of label furt across all dimensions in the radar chart?",
            "A": "The minimum value of furt across all dimensions is {37}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Rental Yield",
            "A": "The average value of Rental Yield is {54.0}."
        },
        {
            "Q": "What is the average value of borough",
            "A": "The average value of borough is {39.0}."
        }
    ],
    "NF": [
        {
            "Q": "For borough in the radar chart, which dimensions have scores between 30 and 57? Please list the dimensions and corresponding scores.",
            "A": "{Capital Appreciation Rate} is {37}, {Transaction Volume Growth} is {32}, {Rental Yield} is {47}, {Price Volatility Index} is {42}, {Rate of Newly Built Homes} is {52}"
        },
        {
            "Q": "Which labels have scores below 35 for the Transaction Volume Growth dimension? Please list the labels and corresponding scores.",
            "A": "{borough} is {32}"
        },
        {
            "Q": "For borough in the radar chart, which dimensions have scores above 57? Please list the dimensions and corresponding scores.",
            "A": "{Price-to-Income Ratio} is {64}, {Rental Yield} is {61}"
        }
    ],
    "NC": [
        {
            "Q": "For borough, which dimension has a higher score: Rental Yield or Transaction Volume Growth?",
            "A": "{Rental Yield} has a higher score than Transaction Volume Growth for borough."
        },
        {
            "Q": "On Price Volatility Index, which label has a higher score: furt or the borough?",
            "A": "{borough} has a higher score on Price Volatility Index compared to furt."
        },
        {
            "Q": "On Price-to-Income Ratio, which label has a higher score: borough or the furt?",
            "A": "{furt} has a higher score on Price-to-Income Ratio compared to borough."
        },
        {
            "Q": "For furt, which dimension has a higher score: Rate of Newly Built Homes or Price Volatility Index or Rental Yield?",
            "A": "{Rental Yield} has a higher score for furt."
        }
    ],
    "MSR": [
        {
            "Q": "For borough, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "borough most needs to improve its {Price-to-Income Ratio}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {furt}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {borough}."
        }
    ],
    "VA": []
}