{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {2} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {7} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Rate of Newly Built Homes?",
            "A": "The next dimension clockwise from Rate of Newly Built Homes is Price-to-Income Ratio"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Price Volatility Index?",
            "A": "The next dimension counterclockwise from Rate of Newly Built Homes is Yearly Price Growth Rate."
        },
        {
            "Q": "On the Price-to-Income Ratio, is the point for mouth inside or outside the point for stad?",
            "A": "On the Price-to-Income Ratio, the point for mouth is outside the point for stad."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Yearly Price Growth Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of mouth?",
            "A": "The strongest aspect is {Yearly Price Growth Rate}, while the weakest aspect is{ Price-to-Income Ratio}."
        },
        {
            "Q": "On dimension Price Volatility Index, which label scores the highest?",
            "A": "On Price Volatility Index, label {mouth} scores the highest."
        },
        {
            "Q": "On dimension Yearly Price Growth Rate, which label scores the highest?",
            "A": "On Yearly Price Growth Rate, label {stad} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of mouth on the Price-to-Income Ratio in the radar chart?",
            "A": "The value of mouth on the Safety dimension is {45}."
        },
        {
            "Q": "What is the value of stad on the Price Volatility Index in the radar chart?",
            "A": "The value of stad on the Safety dimension is {68}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label stad across all dimensions in the radar chart?",
            "A": "The maximum value of stad across all dimensions is {50}."
        },
        {
            "Q": "What is the minimum value of label stad across all dimensions in the radar chart?",
            "A": "The minimum value of stad across all dimensions is {56}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Price Volatility Index",
            "A": "The average value of Price Volatility Index is {61.5}."
        },
        {
            "Q": "What is the average value of stad",
            "A": "The average value of stad is {57.71}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores below 52 for the Rental Yield dimension? Please list the labels and corresponding scores.",
            "A": "{stad} is {50}"
        },
        {
            "Q": "Which labels have scores above 50 for the Transaction Volume Growth dimension? Please list the labels and corresponding scores.",
            "A": "{mouth} is {50}"
        },
        {
            "Q": "For mouth in the radar chart, which dimensions have scores between 48 and 59? Please list the dimensions and corresponding scores.",
            "A": "{Transaction Volume Growth} is {50}, {Rate of Newly Built Homes} is {57}, {Price Volatility Index} is {55}"
        }
    ],
    "NC": [
        {
            "Q": "For stad, which dimension has a higher score: Mortgage Payment as Rate of Income or Rate of Newly Built Homes?",
            "A": "{Rate of Newly Built Homes} has a higher score than Mortgage Payment as Rate of Income for stad."
        },
        {
            "Q": "On Price-to-Income Ratio, which label has a higher score: stad or the mouth?",
            "A": "{mouth} has a higher score on Price-to-Income Ratio compared to stad."
        },
        {
            "Q": "On Yearly Price Growth Rate, which label has a higher score: stad or the mouth?",
            "A": "{mouth} has a higher score on Yearly Price Growth Rate compared to stad."
        },
        {
            "Q": "For stad, which dimension has a higher score: Transaction Volume Growth or Mortgage Payment as Rate of Income or Price Volatility Index?",
            "A": "{Mortgage Payment as Rate of Income} has a higher score for stad."
        }
    ],
    "MSR": [
        {
            "Q": "For mouth, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "mouth most needs to improve its {Price-to-Income Ratio}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {stad}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {mouth}."
        }
    ],
    "VA": []
}