{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Rental Yield?",
            "A": "The next dimension clockwise from Rental Yield is Mortgage Payment as Rate of Income"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Rental Yield?",
            "A": "The next dimension counterclockwise from Rental Yield is Transaction Volume Growth."
        },
        {
            "Q": "On the Rental Yield, is the point for town inside or outside the point for borough?",
            "A": "On the Rental Yield, the point for town is inside the point for borough."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Mortgage Payment as Rate of Income} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of town?",
            "A": "The strongest aspect is {Mortgage Payment as Rate of Income}, while the weakest aspect is{ Rental Yield}."
        },
        {
            "Q": "On dimension Transaction Volume Growth, which label scores the highest?",
            "A": "On Transaction Volume Growth, label {town} scores the highest."
        },
        {
            "Q": "On dimension Transaction Volume Growth, which label scores the highest?",
            "A": "On Transaction Volume Growth, label {town} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of ton on the Mortgage Payment as Rate of Income in the radar chart?",
            "A": "The value of ton on the Safety dimension is {67}."
        },
        {
            "Q": "What is the value of ton on the Capital Appreciation Rate in the radar chart?",
            "A": "The value of ton on the Safety dimension is {63}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label ton across all dimensions in the radar chart?",
            "A": "The maximum value of ton across all dimensions is {68}."
        },
        {
            "Q": "What is the minimum value of label borough across all dimensions in the radar chart?",
            "A": "The minimum value of borough across all dimensions is {63}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Rental Yield",
            "A": "The average value of Rental Yield is {43.33}."
        },
        {
            "Q": "What is the average value of town",
            "A": "The average value of town is {57.75}."
        },
        {
            "Q": "What is the difference in Mortgage Payment as Rate of Income between town and ton?",
            "A": "The difference in Mortgage Payment as Rate of Income between town and ton is {22}."
        },
        {
            "Q": "What is the difference in Capital Appreciation Rate between town and borough?",
            "A": "The difference in Capital Appreciation Rate between town and borough is {44}."
        },
        {
            "Q": "What is the difference in Mortgage Payment as Rate of Income between ton and borough?",
            "A": "The difference in Mortgage Payment as Rate of Income between ton and borough is {24}."
        }
    ],
    "NF": [
        {
            "Q": "Which labels have scores above 86 for the Mortgage Payment as Rate of Income dimension? Please list the labels and corresponding scores.",
            "A": "{town} is {89}, {borough} is {91}"
        },
        {
            "Q": "Which labels have scores below 44 for the Transaction Volume Growth dimension? Please list the labels and corresponding scores.",
            "A": "{town} is {40}"
        },
        {
            "Q": "For ton in the radar chart, which dimensions have scores below 35? Please list the dimensions and corresponding scores.",
            "A": "{Rental Yield} is {21}"
        }
    ],
    "NC": [
        {
            "Q": "For ton, which dimension has a higher score: Capital Appreciation Rate or Transaction Volume Growth?",
            "A": "{Capital Appreciation Rate} has a higher score than Transaction Volume Growth for ton."
        },
        {
            "Q": "On Capital Appreciation Rate, which label has a higher score: borough or the town?",
            "A": "{town} has a higher score on Capital Appreciation Rate compared to borough."
        },
        {
            "Q": "On Capital Appreciation Rate, which label has a higher score: ton or the borough?",
            "A": "{ton} has a higher score on Capital Appreciation Rate compared to borough."
        },
        {
            "Q": "For borough, which dimension has a higher score: Capital Appreciation Rate or Rental Yield or Mortgage Payment as Rate of Income?",
            "A": "{Mortgage Payment as Rate of Income} has a higher score for borough."
        }
    ],
    "MSR": [
        {
            "Q": "For borough, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "borough most needs to improve its {Capital Appreciation Rate}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {ton}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {borough}."
        }
    ],
    "VA": []
}