{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {Radar Chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many labels are in this radar chart?",
            "A": "There are {3} labels"
        },
        {
            "Q": "How many dimensions are in this radar chart?",
            "A": "There are {4} dimensions."
        }
    ],
    "SRP": [
        {
            "Q": "In the radar chart, what is the next dimension in the clockwise direction from Price-to-Income Ratio?",
            "A": "The next dimension clockwise from Price-to-Income Ratio is Rental Yield"
        },
        {
            "Q": "In the radar chart, what is the next dimension in the counterclockwise direction from Price-to-Income Ratio?",
            "A": "The next dimension counterclockwise from Price-to-Income Ratio is Yearly Price Growth Rate."
        },
        {
            "Q": "On the Rental Yield, is the point for burgh inside or outside the point for stad?",
            "A": "On the Rental Yield, the point for burgh is outside the point for stad."
        }
    ],
    "VPR": [
        {
            "Q": "Which label encloses the largest score in the radar chart?",
            "A": "label {Yearly Price Growth Rate} encloses the largest score"
        },
        {
            "Q": "What are the strongest and weakest dimension of stad?",
            "A": "The strongest aspect is {Yearly Price Growth Rate}, while the weakest aspect is{ Rental Yield}."
        },
        {
            "Q": "On dimension Transaction Volume Growth, which label scores the highest?",
            "A": "On Transaction Volume Growth, label {burgh} scores the highest."
        },
        {
            "Q": "On dimension Transaction Volume Growth, which label scores the highest?",
            "A": "On Transaction Volume Growth, label {burgh} scores the lowest."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of burgh on the Yearly Price Growth Rate in the radar chart?",
            "A": "The value of burgh on the Safety dimension is {54}."
        },
        {
            "Q": "What is the value of port on the Rental Yield in the radar chart?",
            "A": "The value of port on the Safety dimension is {63}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of label port across all dimensions in the radar chart?",
            "A": "The maximum value of port across all dimensions is {42}."
        },
        {
            "Q": "What is the minimum value of label stad across all dimensions in the radar chart?",
            "A": "The minimum value of stad across all dimensions is {46}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of Transaction Volume Growth",
            "A": "The average value of Transaction Volume Growth is {56.67}."
        },
        {
            "Q": "What is the average value of port",
            "A": "The average value of port is {58.75}."
        },
        {
            "Q": "What is the difference in Yearly Price Growth Rate between stad and burgh?",
            "A": "The difference in Yearly Price Growth Rate between stad and burgh is {33}."
        }
    ],
    "NF": [
        {
            "Q": "For port in the radar chart, which dimensions have scores between 53 and 74? Please list the dimensions and corresponding scores.",
            "A": "{Rental Yield} is {63}"
        },
        {
            "Q": "For port in the radar chart, which dimensions have scores above 74? Please list the dimensions and corresponding scores.",
            "A": "{Yearly Price Growth Rate} is {87}"
        },
        {
            "Q": "For stad in the radar chart, which dimensions have scores below 53? Please list the dimensions and corresponding scores.",
            "A": "{Yearly Price Growth Rate} is {46}, {Price-to-Income Ratio} is {46}"
        }
    ],
    "NC": [
        {
            "Q": "For stad, which dimension has a higher score: Yearly Price Growth Rate or Rental Yield?",
            "A": "{Yearly Price Growth Rate} has a higher score than Rental Yield for stad."
        },
        {
            "Q": "On Yearly Price Growth Rate, which label has a higher score: burgh or the port?",
            "A": "{burgh} has a higher score on Yearly Price Growth Rate compared to port."
        },
        {
            "Q": "For port, which dimension has a higher score: Transaction Volume Growth or Rental Yield or Yearly Price Growth Rate?",
            "A": "{Transaction Volume Growth} has a higher score for port."
        },
        {
            "Q": "For burgh, which dimension has a higher score: Transaction Volume Growth or Yearly Price Growth Rate or Rental Yield?",
            "A": "{Rental Yield} has a higher score for burgh."
        }
    ],
    "MSR": [
        {
            "Q": "For burgh, based on the data shown in the radar chart, which dimension does it most need to improve?",
            "A": "burgh most needs to improve its {Transaction Volume Growth}."
        },
        {
            "Q": "In the radar chart, which label has the strongest overall capability across all labels?",
            "A": "The label with the strongest overall capability is {burgh}."
        },
        {
            "Q": "In the radar chart, which label has the weaknest overall capability across all labels?",
            "A": "The label with the weaknest overall capability is {stad}."
        }
    ],
    "VA": []
}