{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {6} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Operating Costs?",
            "A": "The next slice clockwise from slice Operating Costs is {Investments}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Operating Costs?",
            "A": "The next slice counterclockwise from slice Operating Costs is {Profit Margin}."
        }
    ],
    "VPR": [
        {
            "Q": "Which revenue has the largest proportion in this pie chart?",
            "A": "The revenue with the largest proportion is {Profit Margin}."
        },
        {
            "Q": "Which revenue has the smallest proportion in this pie chart?",
            "A": "The revenue with the smallest proportion is {Debt}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Investments slice in this pie chart?",
            "A": "The value of the Investments slice is {15}%."
        },
        {
            "Q": "What is the value of the Profit Margin slice in this pie chart?",
            "A": "The value of the Profit Margin slice is {27}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {27}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {10}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Cash Flow and Investments in this pie chart?",
            "A": "The difference between Cash Flow and Investments is {4}%."
        },
        {
            "Q": "What is the sum of the values of Revenue and Debt in this pie chart?",
            "A": "The sum of Revenue and Debt is {32}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 20.25%? Please list the category names and corresponding percentages.",
            "A": "{Profit Margin} accounts for {27}% and {Revenue} accounts for {22}%"
        },
        {
            "Q": "Which categories in the pie chart are below 12.0%? Please list the category names and corresponding percentages.",
            "A": "{Cash Flow} accounts for {11}% and {Debt} accounts for {10}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Profit Margin or Revenue?",
            "A": "The value of {Profit Margin} is larger."
        },
        {
            "Q": "Which is larger, the value of Profit Margin, Revenue, or Investments?",
            "A": "The value of {Profit Margin} is larger."
        },
        {
            "Q": "Which is smaller, the value of Revenue, Investments, or Operating Costs?",
            "A": "The value of {Operating Costs} is smaller."
        },
        {
            "Q": "Which has the largest value: Profit Margin, Revenue, Investments, or Cash Flow?",
            "A": "The value of {Profit Margin} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 10% and 15%?",
            "A": "There are {4} sectors that have a percentage between 10% and 15%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 50%? List all possible combinations.",
            "A": "The possible combinations are: {(Profit Margin, Cash Flow, Debt), (Revenue, Investments, Cash Flow), (Revenue, Investments, Debt), (Revenue, Operating Costs, Cash Flow), (Revenue, Operating Costs, Debt), (Revenue, Cash Flow, Debt), (Investments, Operating Costs, Cash Flow), (Investments, Operating Costs, Debt), (Investments, Cash Flow, Debt), (Operating Costs, Cash Flow, Debt)}."
        }
    ],
    "VA": []
}