{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {7} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Investments?",
            "A": "The next slice clockwise from slice Investments is {Revenue}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Investments?",
            "A": "The next slice counterclockwise from slice Investments is {Equity}."
        }
    ],
    "VPR": [
        {
            "Q": "Which revenue has the largest proportion in this pie chart?",
            "A": "The revenue with the largest proportion is {Profit Margin}."
        },
        {
            "Q": "Which revenue has the smallest proportion in this pie chart?",
            "A": "The revenue with the smallest proportion is {Equity}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Profit Margin slice in this pie chart?",
            "A": "The value of the Profit Margin slice is {19}%."
        },
        {
            "Q": "What is the value of the Operating Costs slice in this pie chart?",
            "A": "The value of the Operating Costs slice is {13}%."
        },
        {
            "Q": "What is the value of the Cash Flow slice in this pie chart?",
            "A": "The value of the Cash Flow slice is {16}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {19}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {10}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Equity and Cash Flow in this pie chart?",
            "A": "The difference between Equity and Cash Flow is {6}%."
        },
        {
            "Q": "What is the sum of the values of Profit Margin and Investments in this pie chart?",
            "A": "The sum of Profit Margin and Investments is {35}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 16.0%? Please list the category names and corresponding percentages.",
            "A": "{Profit Margin} accounts for {19}%"
        },
        {
            "Q": "Which categories in the pie chart are below 13.0%? Please list the category names and corresponding percentages.",
            "A": "{Equity} accounts for {10}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Profit Margin, Investments, or Cash Flow?",
            "A": "The value of {Profit Margin} is larger."
        },
        {
            "Q": "Which is larger, the value of Profit Margin or Investments?",
            "A": "The value of {Profit Margin} is larger."
        },
        {
            "Q": "Which is smaller, the value of Investments, Cash Flow, or Revenue?",
            "A": "The value of {Revenue} is smaller."
        },
        {
            "Q": "Which has the largest value: Profit Margin, Investments, Cash Flow, or Operating Costs?",
            "A": "The value of {Profit Margin} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 3% and 20%?",
            "A": "There are {7} sectors that have a percentage between 3% and 20%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 50%? List all possible combinations.",
            "A": "The possible combinations are: {(Profit Margin, Investments, Revenue), (Profit Margin, Investments, Operating Costs), (Profit Margin, Investments, Debt), (Profit Margin, Investments, Equity), (Profit Margin, Cash Flow, Revenue), (Profit Margin, Cash Flow, Operating Costs), (Profit Margin, Cash Flow, Debt), (Profit Margin, Cash Flow, Equity), (Profit Margin, Revenue, Operating Costs), (Profit Margin, Revenue, Debt), (Profit Margin, Revenue, Equity), (Profit Margin, Operating Costs, Debt), (Profit Margin, Operating Costs, Equity), (Profit Margin, Debt, Equity), (Investments, Cash Flow, Revenue), (Investments, Cash Flow, Operating Costs), (Investments, Cash Flow, Debt), (Investments, Cash Flow, Equity), (Investments, Revenue, Operating Costs), (Investments, Revenue, Debt), (Investments, Revenue, Equity), (Investments, Operating Costs, Debt), (Investments, Operating Costs, Equity), (Investments, Debt, Equity), (Cash Flow, Revenue, Operating Costs), (Cash Flow, Revenue, Debt), (Cash Flow, Revenue, Equity), (Cash Flow, Operating Costs, Debt), (Cash Flow, Operating Costs, Equity), (Cash Flow, Debt, Equity), (Revenue, Operating Costs, Debt), (Revenue, Operating Costs, Equity), (Revenue, Debt, Equity), (Operating Costs, Debt, Equity)}."
        }
    ],
    "VA": []
}