{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {5} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Theater Play?",
            "A": "The next slice clockwise from slice Theater Play is {Literary Event}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Theater Play?",
            "A": "The next slice counterclockwise from slice Theater Play is {Art Exhibition}."
        }
    ],
    "VPR": [
        {
            "Q": "Which cultural has the largest proportion in this pie chart?",
            "A": "The cultural with the largest proportion is {Music Concert}."
        },
        {
            "Q": "Which cultural has the smallest proportion in this pie chart?",
            "A": "The cultural with the smallest proportion is {Dance Performance}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Theater Play slice in this pie chart?",
            "A": "The value of the Theater Play slice is {20}%."
        },
        {
            "Q": "What is the value of the Dance Performance slice in this pie chart?",
            "A": "The value of the Dance Performance slice is {18}%."
        },
        {
            "Q": "What is the value of the Art Exhibition slice in this pie chart?",
            "A": "The value of the Art Exhibition slice is {20}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {22}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {18}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Dance Performance and Theater Play in this pie chart?",
            "A": "The difference between Dance Performance and Theater Play is {2}%."
        },
        {
            "Q": "What is the sum of the values of Art Exhibition and Literary Event in this pie chart?",
            "A": "The sum of Art Exhibition and Literary Event is {40}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 20.0%? Please list the category names and corresponding percentages.",
            "A": "{Music Concert} accounts for {22}%"
        },
        {
            "Q": "Which categories in the pie chart are below 20.0%? Please list the category names and corresponding percentages.",
            "A": "{Dance Performance} accounts for {18}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Art Exhibition, Literary Event, or Theater Play?",
            "A": "The value of {Theater Play} is smaller."
        },
        {
            "Q": "Which is larger, the value of Music Concert or Art Exhibition?",
            "A": "The value of {Music Concert} is larger."
        },
        {
            "Q": "Which is larger, the value of Music Concert, Art Exhibition, or Literary Event?",
            "A": "The value of {Music Concert} is larger."
        },
        {
            "Q": "Which has the largest value: Music Concert, Art Exhibition, Literary Event, or Dance Performance?",
            "A": "The value of {Music Concert} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 5% and 20%?",
            "A": "There are {4} sectors that have a percentage between 5% and 20%."
        }
    ],
    "VA": []
}