{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {4} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Dance Performance?",
            "A": "The next slice clockwise from slice Dance Performance is {Music Concert}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Dance Performance?",
            "A": "The next slice counterclockwise from slice Dance Performance is {Film Screening}."
        }
    ],
    "VPR": [
        {
            "Q": "Which cultural has the largest proportion in this pie chart?",
            "A": "The cultural with the largest proportion is {Film Screening}."
        },
        {
            "Q": "Which cultural has the smallest proportion in this pie chart?",
            "A": "The cultural with the smallest proportion is {Theater Play}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Dance Performance slice in this pie chart?",
            "A": "The value of the Dance Performance slice is {20}%."
        },
        {
            "Q": "What is the value of the Film Screening slice in this pie chart?",
            "A": "The value of the Film Screening slice is {37}%."
        },
        {
            "Q": "What is the value of the Theater Play slice in this pie chart?",
            "A": "The value of the Theater Play slice is {15}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {37}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {15}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Theater Play and Music Concert in this pie chart?",
            "A": "The difference between Theater Play and Music Concert is {13}%."
        },
        {
            "Q": "What is the sum of the values of Dance Performance and Film Screening in this pie chart?",
            "A": "The sum of Dance Performance and Film Screening is {57}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 30.25%? Please list the category names and corresponding percentages.",
            "A": "{Film Screening} accounts for {37}%"
        },
        {
            "Q": "Which categories in the pie chart are below 18.75%? Please list the category names and corresponding percentages.",
            "A": "{Theater Play} accounts for {15}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Film Screening, Music Concert, or Dance Performance?",
            "A": "The value of {Film Screening} is larger."
        },
        {
            "Q": "Which is smaller, the value of Music Concert, Dance Performance, or Theater Play?",
            "A": "The value of {Theater Play} is smaller."
        },
        {
            "Q": "Which is larger, the value of Film Screening or Music Concert?",
            "A": "The value of {Film Screening} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}