{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {7} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Soybeans?",
            "A": "The next slice clockwise from slice Soybeans is {Corn}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Soybeans?",
            "A": "The next slice counterclockwise from slice Soybeans is {Barley}."
        }
    ],
    "VPR": [
        {
            "Q": "Which crop has the largest proportion in this pie chart?",
            "A": "The crop with the largest proportion is {Corn}."
        },
        {
            "Q": "Which crop has the smallest proportion in this pie chart?",
            "A": "The crop with the smallest proportion is {Soybeans}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Rice slice in this pie chart?",
            "A": "The value of the Rice slice is {20}%."
        },
        {
            "Q": "What is the value of the Cotton slice in this pie chart?",
            "A": "The value of the Cotton slice is {20}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {23}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {7}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Wheat and Rice in this pie chart?",
            "A": "The difference between Wheat and Rice is {13}%."
        },
        {
            "Q": "What is the sum of the values of Corn and Oats in this pie chart?",
            "A": "The sum of Corn and Oats is {33}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 20.0%? Please list the category names and corresponding percentages.",
            "A": "{Corn} accounts for {23}%"
        },
        {
            "Q": "Which categories in the pie chart are below 8.5%? Please list the category names and corresponding percentages.",
            "A": "{Wheat} accounts for {7}% and {Soybeans} accounts for {7}%"
        }
    ],
    "NC": [
        {
            "Q": "Which has the largest value: Corn, Cotton, Rice, or Oats?",
            "A": "The value of {Corn} is the largest."
        },
        {
            "Q": "Which is larger, the value of Corn, Cotton, or Rice?",
            "A": "The value of {Corn} is larger."
        },
        {
            "Q": "Which is larger, the value of Corn or Cotton?",
            "A": "The value of {Corn} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 10% and 20%?",
            "A": "There are {4} sectors that have a percentage between 10% and 20%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 50%? List all possible combinations.",
            "A": "The possible combinations are: {(Corn, Barley, Oats), (Corn, Barley, Wheat), (Corn, Barley, Soybeans), (Corn, Oats, Wheat), (Corn, Oats, Soybeans), (Corn, Wheat, Soybeans), (Cotton, Rice, Wheat), (Cotton, Rice, Soybeans), (Cotton, Barley, Oats), (Cotton, Barley, Wheat), (Cotton, Barley, Soybeans), (Cotton, Oats, Wheat), (Cotton, Oats, Soybeans), (Cotton, Wheat, Soybeans), (Rice, Barley, Oats), (Rice, Barley, Wheat), (Rice, Barley, Soybeans), (Rice, Oats, Wheat), (Rice, Oats, Soybeans), (Rice, Wheat, Soybeans), (Barley, Oats, Wheat), (Barley, Oats, Soybeans), (Barley, Wheat, Soybeans), (Oats, Wheat, Soybeans)}."
        }
    ],
    "VA": []
}