{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {6} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Public Schools?",
            "A": "The next slice clockwise from slice Public Schools is {International Schools}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Public Schools?",
            "A": "The next slice counterclockwise from slice Public Schools is {Vocational Schools}."
        }
    ],
    "VPR": [
        {
            "Q": "Which student has the largest proportion in this pie chart?",
            "A": "The student with the largest proportion is {Universities}."
        },
        {
            "Q": "Which student has the smallest proportion in this pie chart?",
            "A": "The student with the smallest proportion is {Public Schools}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Vocational Schools slice in this pie chart?",
            "A": "The value of the Vocational Schools slice is {13}%."
        },
        {
            "Q": "What is the value of the International Schools slice in this pie chart?",
            "A": "The value of the International Schools slice is {23}%."
        },
        {
            "Q": "What is the value of the Public Schools slice in this pie chart?",
            "A": "The value of the Public Schools slice is {11}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {25}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {11}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Charter Schools and International Schools in this pie chart?",
            "A": "The difference between Charter Schools and International Schools is {7}%."
        },
        {
            "Q": "What is the sum of the values of Online Schools and Universities in this pie chart?",
            "A": "The sum of Online Schools and Universities is {37}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 21.25%? Please list the category names and corresponding percentages.",
            "A": "{Universities} accounts for {25}% and {International Schools} accounts for {23}%"
        },
        {
            "Q": "Which categories in the pie chart are below 12.25%? Please list the category names and corresponding percentages.",
            "A": "{Online Schools} accounts for {12}% and {Public Schools} accounts for {11}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of International Schools, Charter Schools, or Vocational Schools?",
            "A": "The value of {Vocational Schools} is smaller."
        },
        {
            "Q": "Which has the largest value: Universities, International Schools, Charter Schools, or Online Schools?",
            "A": "The value of {Universities} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 10% and 20%?",
            "A": "There are {4} sectors that have a percentage between 10% and 20%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 45%? List all possible combinations.",
            "A": "The possible combinations are: {(Charter Schools, Vocational Schools, Online Schools), (Charter Schools, Vocational Schools, Public Schools), (Charter Schools, Online Schools, Public Schools), (Vocational Schools, Online Schools, Public Schools)}."
        }
    ],
    "VA": []
}