{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {6} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Solar?",
            "A": "The next slice clockwise from slice Solar is {Wave}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Solar?",
            "A": "The next slice counterclockwise from slice Solar is {Wind}."
        }
    ],
    "VPR": [
        {
            "Q": "Which renewable has the largest proportion in this pie chart?",
            "A": "The renewable with the largest proportion is {Wind}."
        },
        {
            "Q": "Which renewable has the smallest proportion in this pie chart?",
            "A": "The renewable with the smallest proportion is {Solar}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Wind slice in this pie chart?",
            "A": "The value of the Wind slice is {21}%."
        },
        {
            "Q": "What is the value of the Solar slice in this pie chart?",
            "A": "The value of the Solar slice is {11}%."
        },
        {
            "Q": "What is the value of the Geothermal slice in this pie chart?",
            "A": "The value of the Geothermal slice is {16}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {21}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {11}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Geothermal and Hydropower in this pie chart?",
            "A": "The difference between Geothermal and Hydropower is {4}%."
        },
        {
            "Q": "What is the sum of the values of Wave and Biomass in this pie chart?",
            "A": "The sum of Wave and Biomass is {32}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 19.25%? Please list the category names and corresponding percentages.",
            "A": "{Wind} accounts for {21}% and {Hydropower} accounts for {20}%"
        },
        {
            "Q": "Which categories in the pie chart are below 15.25%? Please list the category names and corresponding percentages.",
            "A": "{Biomass} accounts for {15}% and {Solar} accounts for {11}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Wind, Hydropower, or Wave?",
            "A": "The value of {Wind} is larger."
        },
        {
            "Q": "Which is smaller, the value of Hydropower, Wave, or Geothermal?",
            "A": "The value of {Geothermal} is smaller."
        },
        {
            "Q": "Which is larger, the value of Wind or Hydropower?",
            "A": "The value of {Wind} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 3% and 12%?",
            "A": "There are {1} sectors that have a percentage between 3% and 12%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 45%? List all possible combinations.",
            "A": "The possible combinations are: {(Wave, Geothermal, Solar), (Wave, Biomass, Solar), (Geothermal, Biomass, Solar)}."
        }
    ],
    "VA": []
}