{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {4} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Cafes?",
            "A": "The next slice clockwise from slice Cafes is {Restaurants}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Cafes?",
            "A": "The next slice counterclockwise from slice Cafes is {Bakeries}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2023 has the largest proportion in this pie chart?",
            "A": "The 2023 with the largest proportion is {Cafes}."
        },
        {
            "Q": "Which 2023 has the smallest proportion in this pie chart?",
            "A": "The 2023 with the smallest proportion is {Food Trucks}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Bakeries slice in this pie chart?",
            "A": "The value of the Bakeries slice is {31}%."
        },
        {
            "Q": "What is the value of the Food Trucks slice in this pie chart?",
            "A": "The value of the Food Trucks slice is {11}%."
        },
        {
            "Q": "What is the value of the Restaurants slice in this pie chart?",
            "A": "The value of the Restaurants slice is {26}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {32}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {11}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Bakeries and Restaurants in this pie chart?",
            "A": "The difference between Bakeries and Restaurants is {5}%."
        },
        {
            "Q": "What is the sum of the values of Cafes and Food Trucks in this pie chart?",
            "A": "The sum of Cafes and Food Trucks is {43}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 31.25%? Please list the category names and corresponding percentages.",
            "A": "{Cafes} accounts for {32}%"
        },
        {
            "Q": "Which categories in the pie chart are below 22.25%? Please list the category names and corresponding percentages.",
            "A": "{Food Trucks} accounts for {11}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Bakeries, Restaurants, or Food Trucks?",
            "A": "The value of {Food Trucks} is smaller."
        },
        {
            "Q": "Which is larger, the value of Cafes, Bakeries, or Restaurants?",
            "A": "The value of {Cafes} is larger."
        },
        {
            "Q": "Which is larger, the value of Cafes or Bakeries?",
            "A": "The value of {Cafes} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 5% and 15%?",
            "A": "There are {1} sectors that have a percentage between 5% and 15%."
        }
    ],
    "VA": []
}