{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {3} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Fast Food?",
            "A": "The next slice clockwise from slice Fast Food is {Bakeries}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Fast Food?",
            "A": "The next slice counterclockwise from slice Fast Food is {Catering}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2023 has the largest proportion in this pie chart?",
            "A": "The 2023 with the largest proportion is {Bakeries}."
        },
        {
            "Q": "Which 2023 has the smallest proportion in this pie chart?",
            "A": "The 2023 with the smallest proportion is {Catering}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Fast Food slice in this pie chart?",
            "A": "The value of the Fast Food slice is {25}%."
        },
        {
            "Q": "What is the value of the Bakeries slice in this pie chart?",
            "A": "The value of the Bakeries slice is {53}%."
        },
        {
            "Q": "What is the value of the Catering slice in this pie chart?",
            "A": "The value of the Catering slice is {22}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {53}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {22}%."
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 39.0%? Please list the category names and corresponding percentages.",
            "A": "{Bakeries} accounts for {53}%"
        },
        {
            "Q": "Which categories in the pie chart are below 23.5%? Please list the category names and corresponding percentages.",
            "A": "{Catering} accounts for {22}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Bakeries or Fast Food?",
            "A": "The value of {Bakeries} is larger."
        },
        {
            "Q": "Which is larger, the value of Bakeries, Fast Food, or Catering?",
            "A": "The value of {Bakeries} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}