{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {3} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Oats?",
            "A": "The next slice clockwise from slice Oats is {Corn}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Oats?",
            "A": "The next slice counterclockwise from slice Oats is {Cotton}."
        }
    ],
    "VPR": [
        {
            "Q": "Which crop has the largest proportion in this pie chart?",
            "A": "The crop with the largest proportion is {Corn}."
        },
        {
            "Q": "Which crop has the smallest proportion in this pie chart?",
            "A": "The crop with the smallest proportion is {Oats}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Oats slice in this pie chart?",
            "A": "The value of the Oats slice is {32}%."
        },
        {
            "Q": "What is the value of the Cotton slice in this pie chart?",
            "A": "The value of the Cotton slice is {33}%."
        },
        {
            "Q": "What is the value of the Corn slice in this pie chart?",
            "A": "The value of the Corn slice is {35}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {35}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {32}%."
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 34.0%? Please list the category names and corresponding percentages.",
            "A": "{Corn} accounts for {35}%"
        },
        {
            "Q": "Which categories in the pie chart are below 32.5%? Please list the category names and corresponding percentages.",
            "A": "{Oats} accounts for {32}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Corn, Cotton, or Oats?",
            "A": "The value of {Corn} is larger."
        },
        {
            "Q": "Which is larger, the value of Corn or Cotton?",
            "A": "The value of {Corn} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}