{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {4} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Bars?",
            "A": "The next slice clockwise from slice Bars is {Restaurants}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Bars?",
            "A": "The next slice counterclockwise from slice Bars is {Fast Food}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2023 has the largest proportion in this pie chart?",
            "A": "The 2023 with the largest proportion is {Bars}."
        },
        {
            "Q": "Which 2023 has the smallest proportion in this pie chart?",
            "A": "The 2023 with the smallest proportion is {Fast Food}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Fast Food slice in this pie chart?",
            "A": "The value of the Fast Food slice is {13}%."
        },
        {
            "Q": "What is the value of the Restaurants slice in this pie chart?",
            "A": "The value of the Restaurants slice is {22}%."
        },
        {
            "Q": "What is the value of the Bars slice in this pie chart?",
            "A": "The value of the Bars slice is {35}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {35}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {13}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Fast Food and Bars in this pie chart?",
            "A": "The difference between Fast Food and Bars is {22}%."
        },
        {
            "Q": "What is the sum of the values of Restaurants and Bakeries in this pie chart?",
            "A": "The sum of Restaurants and Bakeries is {52}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 31.25%? Please list the category names and corresponding percentages.",
            "A": "{Bars} accounts for {35}%"
        },
        {
            "Q": "Which categories in the pie chart are below 19.75%? Please list the category names and corresponding percentages.",
            "A": "{Fast Food} accounts for {13}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Bars or Bakeries?",
            "A": "The value of {Bars} is larger."
        },
        {
            "Q": "Which is larger, the value of Bars, Bakeries, or Restaurants?",
            "A": "The value of {Bars} is larger."
        },
        {
            "Q": "Which is smaller, the value of Bakeries, Restaurants, or Fast Food?",
            "A": "The value of {Fast Food} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 5% and 15%?",
            "A": "There are {1} sectors that have a percentage between 5% and 15%."
        }
    ],
    "VA": []
}