{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {4} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Influenza?",
            "A": "The next slice clockwise from slice Influenza is {Cancer}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Influenza?",
            "A": "The next slice counterclockwise from slice Influenza is {Stroke}."
        }
    ],
    "VPR": [
        {
            "Q": "Which disease has the largest proportion in this pie chart?",
            "A": "The disease with the largest proportion is {Influenza}."
        },
        {
            "Q": "Which disease has the smallest proportion in this pie chart?",
            "A": "The disease with the smallest proportion is {Stroke}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Cancer slice in this pie chart?",
            "A": "The value of the Cancer slice is {26}%."
        },
        {
            "Q": "What is the value of the Influenza slice in this pie chart?",
            "A": "The value of the Influenza slice is {38}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {38}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {13}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Cancer and Stroke in this pie chart?",
            "A": "The difference between Cancer and Stroke is {13}%."
        },
        {
            "Q": "What is the sum of the values of Influenza and Heart Disease in this pie chart?",
            "A": "The sum of Influenza and Heart Disease is {61}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 29.0%? Please list the category names and corresponding percentages.",
            "A": "{Influenza} accounts for {38}%"
        },
        {
            "Q": "Which categories in the pie chart are below 20.5%? Please list the category names and corresponding percentages.",
            "A": "{Stroke} accounts for {13}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Cancer, Heart Disease, or Stroke?",
            "A": "The value of {Stroke} is smaller."
        },
        {
            "Q": "Which is larger, the value of Influenza or Cancer?",
            "A": "The value of {Influenza} is larger."
        },
        {
            "Q": "Which is larger, the value of Influenza, Cancer, or Heart Disease?",
            "A": "The value of {Influenza} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 3% and 15%?",
            "A": "There are {1} sectors that have a percentage between 3% and 15%."
        }
    ],
    "VA": []
}