{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {7} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Influenza?",
            "A": "The next slice clockwise from slice Influenza is {Heart Disease}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Influenza?",
            "A": "The next slice counterclockwise from slice Influenza is {Cancer}."
        }
    ],
    "VPR": [
        {
            "Q": "Which disease has the largest proportion in this pie chart?",
            "A": "The disease with the largest proportion is {Stroke}."
        },
        {
            "Q": "Which disease has the smallest proportion in this pie chart?",
            "A": "The disease with the smallest proportion is {Alzheimer's Disease}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Influenza slice in this pie chart?",
            "A": "The value of the Influenza slice is {18}%."
        },
        {
            "Q": "What is the value of the Cancer slice in this pie chart?",
            "A": "The value of the Cancer slice is {13}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {19}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {10}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Cancer and Diabetes in this pie chart?",
            "A": "The difference between Cancer and Diabetes is {0}%."
        },
        {
            "Q": "What is the sum of the values of Chronic Respiratory Diseases and Influenza in this pie chart?",
            "A": "The sum of Chronic Respiratory Diseases and Influenza is {29}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 17.0%? Please list the category names and corresponding percentages.",
            "A": "{Stroke} accounts for {19}% and {Influenza} accounts for {18}%"
        },
        {
            "Q": "Which categories in the pie chart are below 12.0%? Please list the category names and corresponding percentages.",
            "A": "{Chronic Respiratory Diseases} accounts for {11}% and {Alzheimer's Disease} accounts for {10}%"
        }
    ],
    "NC": [
        {
            "Q": "Which has the largest value: Stroke, Influenza, Heart Disease, or Diabetes?",
            "A": "The value of {Stroke} is the largest."
        },
        {
            "Q": "Which is larger, the value of Stroke, Influenza, or Heart Disease?",
            "A": "The value of {Stroke} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 10% and 12%?",
            "A": "There are {2} sectors that have a percentage between 10% and 12%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 45%? List all possible combinations.",
            "A": "The possible combinations are: {(Stroke, Cancer, Chronic Respiratory Diseases), (Stroke, Cancer, Alzheimer's Disease), (Stroke, Diabetes, Chronic Respiratory Diseases), (Stroke, Diabetes, Alzheimer's Disease), (Stroke, Chronic Respiratory Diseases, Alzheimer's Disease), (Influenza, Heart Disease, Alzheimer's Disease), (Influenza, Cancer, Diabetes), (Influenza, Cancer, Chronic Respiratory Diseases), (Influenza, Cancer, Alzheimer's Disease), (Influenza, Diabetes, Chronic Respiratory Diseases), (Influenza, Diabetes, Alzheimer's Disease), (Influenza, Chronic Respiratory Diseases, Alzheimer's Disease), (Heart Disease, Cancer, Diabetes), (Heart Disease, Cancer, Chronic Respiratory Diseases), (Heart Disease, Cancer, Alzheimer's Disease), (Heart Disease, Diabetes, Chronic Respiratory Diseases), (Heart Disease, Diabetes, Alzheimer's Disease), (Heart Disease, Chronic Respiratory Diseases, Alzheimer's Disease), (Cancer, Diabetes, Chronic Respiratory Diseases), (Cancer, Diabetes, Alzheimer's Disease), (Cancer, Chronic Respiratory Diseases, Alzheimer's Disease), (Diabetes, Chronic Respiratory Diseases, Alzheimer's Disease)}."
        }
    ],
    "VA": []
}