{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {7} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Cancer?",
            "A": "The next slice clockwise from slice Cancer is {Chronic Respiratory Diseases}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Cancer?",
            "A": "The next slice counterclockwise from slice Cancer is {Alzheimer's Disease}."
        }
    ],
    "VPR": [
        {
            "Q": "Which disease has the largest proportion in this pie chart?",
            "A": "The disease with the largest proportion is {Alzheimer's Disease}."
        },
        {
            "Q": "Which disease has the smallest proportion in this pie chart?",
            "A": "The disease with the smallest proportion is {Cancer}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Alzheimer's Disease slice in this pie chart?",
            "A": "The value of the Alzheimer's Disease slice is {19}%."
        },
        {
            "Q": "What is the value of the Heart Disease slice in this pie chart?",
            "A": "The value of the Heart Disease slice is {15}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {19}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {8}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Alzheimer's Disease and Cancer in this pie chart?",
            "A": "The difference between Alzheimer's Disease and Cancer is {11}%."
        },
        {
            "Q": "What is the sum of the values of Influenza and Chronic Respiratory Diseases in this pie chart?",
            "A": "The sum of Influenza and Chronic Respiratory Diseases is {26}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 16.5%? Please list the category names and corresponding percentages.",
            "A": "{Alzheimer's Disease} accounts for {19}% and {Influenza} accounts for {17}%"
        },
        {
            "Q": "Which categories in the pie chart are below 12.0%? Please list the category names and corresponding percentages.",
            "A": "{Chronic Respiratory Diseases} accounts for {9}% and {Cancer} accounts for {8}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Alzheimer's Disease or Influenza?",
            "A": "The value of {Alzheimer's Disease} is larger."
        },
        {
            "Q": "Which has the largest value: Alzheimer's Disease, Influenza, Stroke, or Heart Disease?",
            "A": "The value of {Alzheimer's Disease} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 3% and 20%?",
            "A": "There are {7} sectors that have a percentage between 3% and 20%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 45%? List all possible combinations.",
            "A": "The possible combinations are: {(Alzheimer's Disease, Influenza, Cancer), (Alzheimer's Disease, Stroke, Chronic Respiratory Diseases), (Alzheimer's Disease, Stroke, Cancer), (Alzheimer's Disease, Diabetes, Chronic Respiratory Diseases), (Alzheimer's Disease, Diabetes, Cancer), (Alzheimer's Disease, Heart Disease, Chronic Respiratory Diseases), (Alzheimer's Disease, Heart Disease, Cancer), (Alzheimer's Disease, Chronic Respiratory Diseases, Cancer), (Influenza, Stroke, Chronic Respiratory Diseases), (Influenza, Stroke, Cancer), (Influenza, Diabetes, Chronic Respiratory Diseases), (Influenza, Diabetes, Cancer), (Influenza, Heart Disease, Chronic Respiratory Diseases), (Influenza, Heart Disease, Cancer), (Influenza, Chronic Respiratory Diseases, Cancer), (Stroke, Diabetes, Chronic Respiratory Diseases), (Stroke, Diabetes, Cancer), (Stroke, Heart Disease, Chronic Respiratory Diseases), (Stroke, Heart Disease, Cancer), (Stroke, Chronic Respiratory Diseases, Cancer), (Diabetes, Heart Disease, Chronic Respiratory Diseases), (Diabetes, Heart Disease, Cancer), (Diabetes, Chronic Respiratory Diseases, Cancer), (Heart Disease, Chronic Respiratory Diseases, Cancer)}."
        }
    ],
    "VA": []
}