{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {5} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Senior-Level?",
            "A": "The next slice clockwise from slice Senior-Level is {Executive}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Senior-Level?",
            "A": "The next slice counterclockwise from slice Senior-Level is {Entry-Level}."
        }
    ],
    "VPR": [
        {
            "Q": "Which income has the largest proportion in this pie chart?",
            "A": "The income with the largest proportion is {Senior-Level}."
        },
        {
            "Q": "Which income has the smallest proportion in this pie chart?",
            "A": "The income with the smallest proportion is {Entry-Level}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Senior-Level slice in this pie chart?",
            "A": "The value of the Senior-Level slice is {27}%."
        },
        {
            "Q": "What is the value of the Freelancers slice in this pie chart?",
            "A": "The value of the Freelancers slice is {25}%."
        },
        {
            "Q": "What is the value of the Contractors slice in this pie chart?",
            "A": "The value of the Contractors slice is {12}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {27}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {11}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Freelancers and Senior-Level in this pie chart?",
            "A": "The difference between Freelancers and Senior-Level is {2}%."
        },
        {
            "Q": "What is the sum of the values of Entry-Level and Contractors in this pie chart?",
            "A": "The sum of Entry-Level and Contractors is {23}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 25.0%? Please list the category names and corresponding percentages.",
            "A": "{Senior-Level} accounts for {27}%"
        },
        {
            "Q": "Which categories in the pie chart are below 12.0%? Please list the category names and corresponding percentages.",
            "A": "{Entry-Level} accounts for {11}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Executive, Freelancers, or Contractors?",
            "A": "The value of {Contractors} is smaller."
        },
        {
            "Q": "Which is larger, the value of Senior-Level, Executive, or Freelancers?",
            "A": "The value of {Senior-Level} is larger."
        },
        {
            "Q": "Which has the largest value: Senior-Level, Executive, Freelancers, or Entry-Level?",
            "A": "The value of {Senior-Level} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 3% and 20%?",
            "A": "There are {2} sectors that have a percentage between 3% and 20%."
        }
    ],
    "VA": []
}