{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {5} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Freelancers?",
            "A": "The next slice clockwise from slice Freelancers is {Contractors}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Freelancers?",
            "A": "The next slice counterclockwise from slice Freelancers is {Executive}."
        }
    ],
    "VPR": [
        {
            "Q": "Which income has the largest proportion in this pie chart?",
            "A": "The income with the largest proportion is {Internships}."
        },
        {
            "Q": "Which income has the smallest proportion in this pie chart?",
            "A": "The income with the smallest proportion is {Mid-Level}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Contractors slice in this pie chart?",
            "A": "The value of the Contractors slice is {28}%."
        },
        {
            "Q": "What is the value of the Internships slice in this pie chart?",
            "A": "The value of the Internships slice is {28}%."
        },
        {
            "Q": "What is the value of the Executive slice in this pie chart?",
            "A": "The value of the Executive slice is {16}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {28}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {10}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Executive and Freelancers in this pie chart?",
            "A": "The difference between Executive and Freelancers is {2}%."
        },
        {
            "Q": "What is the sum of the values of Mid-Level and Internships in this pie chart?",
            "A": "The sum of Mid-Level and Internships is {38}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 20.0%? Please list the category names and corresponding percentages.",
            "A": "{Internships} accounts for {28}% and {Contractors} accounts for {28}%"
        },
        {
            "Q": "Which categories in the pie chart are below 16.0%? Please list the category names and corresponding percentages.",
            "A": "{Mid-Level} accounts for {10}%"
        }
    ],
    "NC": [
        {
            "Q": "Which has the largest value: Internships, Contractors, Freelancers, or Mid-Level?",
            "A": "The value of {Internships} is the largest."
        },
        {
            "Q": "Which is larger, the value of Internships, Contractors, or Freelancers?",
            "A": "The value of {Internships} is larger."
        },
        {
            "Q": "Which is smaller, the value of Contractors, Freelancers, or Executive?",
            "A": "The value of {Executive} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 5% and 12%?",
            "A": "There are {1} sectors that have a percentage between 5% and 12%."
        }
    ],
    "VA": []
}