{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {3} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Senior-Level?",
            "A": "The next slice clockwise from slice Senior-Level is {Entry-Level}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Senior-Level?",
            "A": "The next slice counterclockwise from slice Senior-Level is {Freelancers}."
        }
    ],
    "VPR": [
        {
            "Q": "Which income has the largest proportion in this pie chart?",
            "A": "The income with the largest proportion is {Entry-Level}."
        },
        {
            "Q": "Which income has the smallest proportion in this pie chart?",
            "A": "The income with the smallest proportion is {Freelancers}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Freelancers slice in this pie chart?",
            "A": "The value of the Freelancers slice is {25}%."
        },
        {
            "Q": "What is the value of the Senior-Level slice in this pie chart?",
            "A": "The value of the Senior-Level slice is {29}%."
        },
        {
            "Q": "What is the value of the Entry-Level slice in this pie chart?",
            "A": "The value of the Entry-Level slice is {46}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {46}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {25}%."
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 37.5%? Please list the category names and corresponding percentages.",
            "A": "{Entry-Level} accounts for {46}%"
        },
        {
            "Q": "Which categories in the pie chart are below 27.0%? Please list the category names and corresponding percentages.",
            "A": "{Freelancers} accounts for {25}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Entry-Level, Senior-Level, or Freelancers?",
            "A": "The value of {Entry-Level} is larger."
        },
        {
            "Q": "Which is larger, the value of Entry-Level or Senior-Level?",
            "A": "The value of {Entry-Level} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}