{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {3} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Commercial Rentals?",
            "A": "The next slice clockwise from slice Commercial Rentals is {Residential Rentals}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Commercial Rentals?",
            "A": "The next slice counterclockwise from slice Commercial Rentals is {Vacation Rentals}."
        }
    ],
    "VPR": [
        {
            "Q": "Which rental has the largest proportion in this pie chart?",
            "A": "The rental with the largest proportion is {Commercial Rentals}."
        },
        {
            "Q": "Which rental has the smallest proportion in this pie chart?",
            "A": "The rental with the smallest proportion is {Vacation Rentals}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Commercial Rentals slice in this pie chart?",
            "A": "The value of the Commercial Rentals slice is {40}%."
        },
        {
            "Q": "What is the value of the Residential Rentals slice in this pie chart?",
            "A": "The value of the Residential Rentals slice is {35}%."
        },
        {
            "Q": "What is the value of the Vacation Rentals slice in this pie chart?",
            "A": "The value of the Vacation Rentals slice is {25}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {40}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {25}%."
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 37.5%? Please list the category names and corresponding percentages.",
            "A": "{Commercial Rentals} accounts for {40}%"
        },
        {
            "Q": "Which categories in the pie chart are below 30.0%? Please list the category names and corresponding percentages.",
            "A": "{Vacation Rentals} accounts for {25}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Commercial Rentals, Residential Rentals, or Vacation Rentals?",
            "A": "The value of {Commercial Rentals} is larger."
        },
        {
            "Q": "Which is larger, the value of Commercial Rentals or Residential Rentals?",
            "A": "The value of {Commercial Rentals} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}