{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {7} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Discount Seeking?",
            "A": "The next slice clockwise from slice Discount Seeking is {Planned Purchases}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Discount Seeking?",
            "A": "The next slice counterclockwise from slice Discount Seeking is {Impulse Buying}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2024 has the largest proportion in this pie chart?",
            "A": "The 2024 with the largest proportion is {Planned Purchases}."
        },
        {
            "Q": "Which 2024 has the smallest proportion in this pie chart?",
            "A": "The 2024 with the smallest proportion is {Impulse Buying}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the In-Store Purchases slice in this pie chart?",
            "A": "The value of the In-Store Purchases slice is {11}%."
        },
        {
            "Q": "What is the value of the Impulse Buying slice in this pie chart?",
            "A": "The value of the Impulse Buying slice is {9}%."
        },
        {
            "Q": "What is the value of the Online Shopping slice in this pie chart?",
            "A": "The value of the Online Shopping slice is {12}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {21}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {9}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Impulse Buying and In-Store Purchases in this pie chart?",
            "A": "The difference between Impulse Buying and In-Store Purchases is {2}%."
        },
        {
            "Q": "What is the sum of the values of Price Sensitivity and Online Shopping in this pie chart?",
            "A": "The sum of Price Sensitivity and Online Shopping is {24}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 17.5%? Please list the category names and corresponding percentages.",
            "A": "{Planned Purchases} accounts for {21}% and {Discount Seeking} accounts for {18}%"
        },
        {
            "Q": "Which categories in the pie chart are below 11.5%? Please list the category names and corresponding percentages.",
            "A": "{In-Store Purchases} accounts for {11}% and {Impulse Buying} accounts for {9}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Discount Seeking, Brand Loyalty, or Price Sensitivity?",
            "A": "The value of {Price Sensitivity} is smaller."
        },
        {
            "Q": "Which has the largest value: Planned Purchases, Discount Seeking, Brand Loyalty, or Online Shopping?",
            "A": "The value of {Planned Purchases} is the largest."
        },
        {
            "Q": "Which is larger, the value of Planned Purchases, Discount Seeking, or Brand Loyalty?",
            "A": "The value of {Planned Purchases} is larger."
        },
        {
            "Q": "Which is larger, the value of Planned Purchases or Discount Seeking?",
            "A": "The value of {Planned Purchases} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 5% and 15%?",
            "A": "There are {4} sectors that have a percentage between 5% and 15%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 40%? List all possible combinations.",
            "A": "The possible combinations are: {(Discount Seeking, Price Sensitivity, Impulse Buying), (Discount Seeking, Online Shopping, Impulse Buying), (Discount Seeking, In-Store Purchases, Impulse Buying), (Brand Loyalty, Price Sensitivity, Impulse Buying), (Brand Loyalty, Online Shopping, Impulse Buying), (Brand Loyalty, In-Store Purchases, Impulse Buying), (Price Sensitivity, Online Shopping, In-Store Purchases), (Price Sensitivity, Online Shopping, Impulse Buying), (Price Sensitivity, In-Store Purchases, Impulse Buying), (Online Shopping, In-Store Purchases, Impulse Buying)}."
        }
    ],
    "VA": []
}