{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {3} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice PhD Thesis?",
            "A": "The next slice clockwise from slice PhD Thesis is {Innovative Solution}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice PhD Thesis?",
            "A": "The next slice counterclockwise from slice PhD Thesis is {Patent}."
        }
    ],
    "VPR": [
        {
            "Q": "Which discipline-wise has the largest proportion in this pie chart?",
            "A": "The discipline-wise with the largest proportion is {Innovative Solution}."
        },
        {
            "Q": "Which discipline-wise has the smallest proportion in this pie chart?",
            "A": "The discipline-wise with the smallest proportion is {Patent}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the PhD Thesis slice in this pie chart?",
            "A": "The value of the PhD Thesis slice is {38}%."
        },
        {
            "Q": "What is the value of the Innovative Solution slice in this pie chart?",
            "A": "The value of the Innovative Solution slice is {39}%."
        },
        {
            "Q": "What is the value of the Patent slice in this pie chart?",
            "A": "The value of the Patent slice is {23}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {39}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {23}%."
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 38.5%? Please list the category names and corresponding percentages.",
            "A": "{Innovative Solution} accounts for {39}%"
        },
        {
            "Q": "Which categories in the pie chart are below 30.5%? Please list the category names and corresponding percentages.",
            "A": "{Patent} accounts for {23}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Innovative Solution, PhD Thesis, or Patent?",
            "A": "The value of {Innovative Solution} is larger."
        },
        {
            "Q": "Which is larger, the value of Innovative Solution or PhD Thesis?",
            "A": "The value of {Innovative Solution} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}