{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {6} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Patent?",
            "A": "The next slice clockwise from slice Patent is {Collaborative Research}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Patent?",
            "A": "The next slice counterclockwise from slice Patent is {Conference Paper}."
        }
    ],
    "VPR": [
        {
            "Q": "Which discipline-wise has the largest proportion in this pie chart?",
            "A": "The discipline-wise with the largest proportion is {Patent}."
        },
        {
            "Q": "Which discipline-wise has the smallest proportion in this pie chart?",
            "A": "The discipline-wise with the smallest proportion is {Publication}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Patent slice in this pie chart?",
            "A": "The value of the Patent slice is {24}%."
        },
        {
            "Q": "What is the value of the Conference Paper slice in this pie chart?",
            "A": "The value of the Conference Paper slice is {20}%."
        },
        {
            "Q": "What is the value of the PhD Thesis slice in this pie chart?",
            "A": "The value of the PhD Thesis slice is {16}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {24}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {11}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of PhD Thesis and Patent in this pie chart?",
            "A": "The difference between PhD Thesis and Patent is {8}%."
        },
        {
            "Q": "What is the sum of the values of Publication and Collaborative Research in this pie chart?",
            "A": "The sum of Publication and Collaborative Research is {25}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 19.0%? Please list the category names and corresponding percentages.",
            "A": "{Patent} accounts for {24}% and {Conference Paper} accounts for {20}%"
        },
        {
            "Q": "Which categories in the pie chart are below 14.25%? Please list the category names and corresponding percentages.",
            "A": "{Collaborative Research} accounts for {14}% and {Publication} accounts for {11}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Patent, Conference Paper, or PhD Thesis?",
            "A": "The value of {Patent} is larger."
        },
        {
            "Q": "Which is smaller, the value of Conference Paper, PhD Thesis, or Innovative Solution?",
            "A": "The value of {Innovative Solution} is smaller."
        },
        {
            "Q": "Which is larger, the value of Patent or Conference Paper?",
            "A": "The value of {Patent} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 3% and 12%?",
            "A": "There are {1} sectors that have a percentage between 3% and 12%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 50%? List all possible combinations.",
            "A": "The possible combinations are: {(Patent, Collaborative Research, Publication), (Conference Paper, PhD Thesis, Publication), (Conference Paper, Innovative Solution, Collaborative Research), (Conference Paper, Innovative Solution, Publication), (Conference Paper, Collaborative Research, Publication), (PhD Thesis, Innovative Solution, Collaborative Research), (PhD Thesis, Innovative Solution, Publication), (PhD Thesis, Collaborative Research, Publication), (Innovative Solution, Collaborative Research, Publication)}."
        }
    ],
    "VA": []
}