{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {7} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Publication?",
            "A": "The next slice clockwise from slice Publication is {Collaborative Research}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Publication?",
            "A": "The next slice counterclockwise from slice Publication is {Research Grant}."
        }
    ],
    "VPR": [
        {
            "Q": "Which discipline-wise has the largest proportion in this pie chart?",
            "A": "The discipline-wise with the largest proportion is {Publication}."
        },
        {
            "Q": "Which discipline-wise has the smallest proportion in this pie chart?",
            "A": "The discipline-wise with the smallest proportion is {Research Grant}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Research Grant slice in this pie chart?",
            "A": "The value of the Research Grant slice is {11}%."
        },
        {
            "Q": "What is the value of the Patent slice in this pie chart?",
            "A": "The value of the Patent slice is {12}%."
        },
        {
            "Q": "What is the value of the PhD Thesis slice in this pie chart?",
            "A": "The value of the PhD Thesis slice is {12}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {18}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {11}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Innovative Solution and Research Grant in this pie chart?",
            "A": "The difference between Innovative Solution and Research Grant is {4}%."
        },
        {
            "Q": "What is the sum of the values of PhD Thesis and Publication in this pie chart?",
            "A": "The sum of PhD Thesis and Publication is {30}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 16.0%? Please list the category names and corresponding percentages.",
            "A": "{Publication} accounts for {18}% and {Collaborative Research} accounts for {17}%"
        },
        {
            "Q": "Which categories in the pie chart are below 12.0%? Please list the category names and corresponding percentages.",
            "A": "{Research Grant} accounts for {11}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Publication, Collaborative Research, or Conference Paper?",
            "A": "The value of {Publication} is larger."
        },
        {
            "Q": "Which is smaller, the value of Collaborative Research, Conference Paper, or Innovative Solution?",
            "A": "The value of {Innovative Solution} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 3% and 20%?",
            "A": "There are {7} sectors that have a percentage between 3% and 20%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 50%? List all possible combinations.",
            "A": "The possible combinations are: {(Publication, Collaborative Research, PhD Thesis), (Publication, Collaborative Research, Patent), (Publication, Collaborative Research, Research Grant), (Publication, Conference Paper, Innovative Solution), (Publication, Conference Paper, PhD Thesis), (Publication, Conference Paper, Patent), (Publication, Conference Paper, Research Grant), (Publication, Innovative Solution, PhD Thesis), (Publication, Innovative Solution, Patent), (Publication, Innovative Solution, Research Grant), (Publication, PhD Thesis, Patent), (Publication, PhD Thesis, Research Grant), (Publication, Patent, Research Grant), (Collaborative Research, Conference Paper, Innovative Solution), (Collaborative Research, Conference Paper, PhD Thesis), (Collaborative Research, Conference Paper, Patent), (Collaborative Research, Conference Paper, Research Grant), (Collaborative Research, Innovative Solution, PhD Thesis), (Collaborative Research, Innovative Solution, Patent), (Collaborative Research, Innovative Solution, Research Grant), (Collaborative Research, PhD Thesis, Patent), (Collaborative Research, PhD Thesis, Research Grant), (Collaborative Research, Patent, Research Grant), (Conference Paper, Innovative Solution, PhD Thesis), (Conference Paper, Innovative Solution, Patent), (Conference Paper, Innovative Solution, Research Grant), (Conference Paper, PhD Thesis, Patent), (Conference Paper, PhD Thesis, Research Grant), (Conference Paper, Patent, Research Grant), (Innovative Solution, PhD Thesis, Patent), (Innovative Solution, PhD Thesis, Research Grant), (Innovative Solution, Patent, Research Grant), (PhD Thesis, Patent, Research Grant)}."
        }
    ],
    "VA": []
}