{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {7} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Facebook?",
            "A": "The next slice clockwise from slice Facebook is {Twitter}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Facebook?",
            "A": "The next slice counterclockwise from slice Facebook is {YouTube}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2024 has the largest proportion in this pie chart?",
            "A": "The 2024 with the largest proportion is {YouTube}."
        },
        {
            "Q": "Which 2024 has the smallest proportion in this pie chart?",
            "A": "The 2024 with the smallest proportion is {Facebook}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Snapchat slice in this pie chart?",
            "A": "The value of the Snapchat slice is {16}%."
        },
        {
            "Q": "What is the value of the Twitter slice in this pie chart?",
            "A": "The value of the Twitter slice is {16}%."
        },
        {
            "Q": "What is the value of the YouTube slice in this pie chart?",
            "A": "The value of the YouTube slice is {18}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {18}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {11}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of YouTube and Facebook in this pie chart?",
            "A": "The difference between YouTube and Facebook is {7}%."
        },
        {
            "Q": "What is the sum of the values of Snapchat and TikTok in this pie chart?",
            "A": "The sum of Snapchat and TikTok is {28}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 16.0%? Please list the category names and corresponding percentages.",
            "A": "{YouTube} accounts for {18}%"
        },
        {
            "Q": "Which categories in the pie chart are below 12.0%? Please list the category names and corresponding percentages.",
            "A": "{Facebook} accounts for {11}%"
        }
    ],
    "NC": [
        {
            "Q": "Which has the largest value: YouTube, Snapchat, Twitter, or LinkedIn?",
            "A": "The value of {YouTube} is the largest."
        },
        {
            "Q": "Which is larger, the value of YouTube or Snapchat?",
            "A": "The value of {YouTube} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 10% and 15%?",
            "A": "There are {4} sectors that have a percentage between 10% and 15%."
        },
        {
            "Q": "Which three sectors have a sum of percentage less than 50%? List all possible combinations.",
            "A": "The possible combinations are: {(YouTube, Snapchat, Instagram), (YouTube, Snapchat, LinkedIn), (YouTube, Snapchat, TikTok), (YouTube, Snapchat, Facebook), (YouTube, Twitter, Instagram), (YouTube, Twitter, LinkedIn), (YouTube, Twitter, TikTok), (YouTube, Twitter, Facebook), (YouTube, Instagram, LinkedIn), (YouTube, Instagram, TikTok), (YouTube, Instagram, Facebook), (YouTube, LinkedIn, TikTok), (YouTube, LinkedIn, Facebook), (YouTube, TikTok, Facebook), (Snapchat, Twitter, Instagram), (Snapchat, Twitter, LinkedIn), (Snapchat, Twitter, TikTok), (Snapchat, Twitter, Facebook), (Snapchat, Instagram, LinkedIn), (Snapchat, Instagram, TikTok), (Snapchat, Instagram, Facebook), (Snapchat, LinkedIn, TikTok), (Snapchat, LinkedIn, Facebook), (Snapchat, TikTok, Facebook), (Twitter, Instagram, LinkedIn), (Twitter, Instagram, TikTok), (Twitter, Instagram, Facebook), (Twitter, LinkedIn, TikTok), (Twitter, LinkedIn, Facebook), (Twitter, TikTok, Facebook), (Instagram, LinkedIn, TikTok), (Instagram, LinkedIn, Facebook), (Instagram, TikTok, Facebook), (LinkedIn, TikTok, Facebook)}."
        }
    ],
    "VA": []
}