{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {5} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Facebook?",
            "A": "The next slice clockwise from slice Facebook is {TikTok}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Facebook?",
            "A": "The next slice counterclockwise from slice Facebook is {YouTube}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2024 has the largest proportion in this pie chart?",
            "A": "The 2024 with the largest proportion is {YouTube}."
        },
        {
            "Q": "Which 2024 has the smallest proportion in this pie chart?",
            "A": "The 2024 with the smallest proportion is {Instagram}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the YouTube slice in this pie chart?",
            "A": "The value of the YouTube slice is {23}%."
        },
        {
            "Q": "What is the value of the Instagram slice in this pie chart?",
            "A": "The value of the Instagram slice is {16}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {23}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {16}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Twitter and Instagram in this pie chart?",
            "A": "The difference between Twitter and Instagram is {5}%."
        },
        {
            "Q": "What is the sum of the values of YouTube and Facebook in this pie chart?",
            "A": "The sum of YouTube and Facebook is {46}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 20.0%? Please list the category names and corresponding percentages.",
            "A": "{YouTube} accounts for {23}% and {Facebook} accounts for {23}% and {Twitter} accounts for {21}%"
        },
        {
            "Q": "Which categories in the pie chart are below 17.0%? Please list the category names and corresponding percentages.",
            "A": "{Instagram} accounts for {16}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Facebook, Twitter, or TikTok?",
            "A": "The value of {TikTok} is smaller."
        },
        {
            "Q": "Which is larger, the value of YouTube, Facebook, or Twitter?",
            "A": "The value of {YouTube} is larger."
        },
        {
            "Q": "Which has the largest value: YouTube, Facebook, Twitter, or Instagram?",
            "A": "The value of {YouTube} is the largest."
        },
        {
            "Q": "Which is larger, the value of YouTube or Facebook?",
            "A": "The value of {YouTube} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 10% and 20%?",
            "A": "There are {2} sectors that have a percentage between 10% and 20%."
        }
    ],
    "VA": []
}