{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {4} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Twitter?",
            "A": "The next slice clockwise from slice Twitter is {LinkedIn}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Twitter?",
            "A": "The next slice counterclockwise from slice Twitter is {Facebook}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2024 has the largest proportion in this pie chart?",
            "A": "The 2024 with the largest proportion is {Twitter}."
        },
        {
            "Q": "Which 2024 has the smallest proportion in this pie chart?",
            "A": "The 2024 with the smallest proportion is {Facebook}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the TikTok slice in this pie chart?",
            "A": "The value of the TikTok slice is {22}%."
        },
        {
            "Q": "What is the value of the Twitter slice in this pie chart?",
            "A": "The value of the Twitter slice is {29}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {29}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {21}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of LinkedIn and Twitter in this pie chart?",
            "A": "The difference between LinkedIn and Twitter is {1}%."
        },
        {
            "Q": "What is the sum of the values of TikTok and Facebook in this pie chart?",
            "A": "The sum of TikTok and Facebook is {43}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 28.25%? Please list the category names and corresponding percentages.",
            "A": "{Twitter} accounts for {29}%"
        },
        {
            "Q": "Which categories in the pie chart are below 21.75%? Please list the category names and corresponding percentages.",
            "A": "{Facebook} accounts for {21}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Twitter, LinkedIn, or TikTok?",
            "A": "The value of {Twitter} is larger."
        },
        {
            "Q": "Which is smaller, the value of LinkedIn, TikTok, or Facebook?",
            "A": "The value of {Facebook} is smaller."
        }
    ],
    "MSR": [],
    "VA": []
}