{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {3} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice TikTok?",
            "A": "The next slice clockwise from slice TikTok is {Facebook}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice TikTok?",
            "A": "The next slice counterclockwise from slice TikTok is {Snapchat}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2024 has the largest proportion in this pie chart?",
            "A": "The 2024 with the largest proportion is {TikTok}."
        },
        {
            "Q": "Which 2024 has the smallest proportion in this pie chart?",
            "A": "The 2024 with the smallest proportion is {Facebook}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Facebook slice in this pie chart?",
            "A": "The value of the Facebook slice is {19}%."
        },
        {
            "Q": "What is the value of the Snapchat slice in this pie chart?",
            "A": "The value of the Snapchat slice is {38}%."
        },
        {
            "Q": "What is the value of the TikTok slice in this pie chart?",
            "A": "The value of the TikTok slice is {43}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {43}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {19}%."
        }
    ],
    "SC": [],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 40.5%? Please list the category names and corresponding percentages.",
            "A": "{TikTok} accounts for {43}%"
        },
        {
            "Q": "Which categories in the pie chart are below 28.5%? Please list the category names and corresponding percentages.",
            "A": "{Facebook} accounts for {19}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of TikTok, Snapchat, or Facebook?",
            "A": "The value of {TikTok} is larger."
        },
        {
            "Q": "Which is larger, the value of TikTok or Snapchat?",
            "A": "The value of {TikTok} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}