{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {4} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Cooking Competitions?",
            "A": "The next slice clockwise from slice Cooking Competitions is {Math Olympiad}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Cooking Competitions?",
            "A": "The next slice counterclockwise from slice Cooking Competitions is {Sports Competitions}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2024 has the largest proportion in this pie chart?",
            "A": "The 2024 with the largest proportion is {Math Olympiad}."
        },
        {
            "Q": "Which 2024 has the smallest proportion in this pie chart?",
            "A": "The 2024 with the smallest proportion is {Sports Competitions}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Cooking Competitions slice in this pie chart?",
            "A": "The value of the Cooking Competitions slice is {28}%."
        },
        {
            "Q": "What is the value of the Math Olympiad slice in this pie chart?",
            "A": "The value of the Math Olympiad slice is {31}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {31}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {15}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Math Olympiad and Cooking Competitions in this pie chart?",
            "A": "The difference between Math Olympiad and Cooking Competitions is {3}%."
        },
        {
            "Q": "What is the sum of the values of Sports Competitions and Coding Competitions in this pie chart?",
            "A": "The sum of Sports Competitions and Coding Competitions is {41}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 28.75%? Please list the category names and corresponding percentages.",
            "A": "{Math Olympiad} accounts for {31}%"
        },
        {
            "Q": "Which categories in the pie chart are below 23.25%? Please list the category names and corresponding percentages.",
            "A": "{Sports Competitions} accounts for {15}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Cooking Competitions, Coding Competitions, or Sports Competitions?",
            "A": "The value of {Sports Competitions} is smaller."
        },
        {
            "Q": "Which is larger, the value of Math Olympiad, Cooking Competitions, or Coding Competitions?",
            "A": "The value of {Math Olympiad} is larger."
        },
        {
            "Q": "Which is larger, the value of Math Olympiad or Cooking Competitions?",
            "A": "The value of {Math Olympiad} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}