{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {4} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Music Competitions?",
            "A": "The next slice clockwise from slice Music Competitions is {Cooking Competitions}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Music Competitions?",
            "A": "The next slice counterclockwise from slice Music Competitions is {Debates}."
        }
    ],
    "VPR": [
        {
            "Q": "Which 2024 has the largest proportion in this pie chart?",
            "A": "The 2024 with the largest proportion is {Debates}."
        },
        {
            "Q": "Which 2024 has the smallest proportion in this pie chart?",
            "A": "The 2024 with the smallest proportion is {Cooking Competitions}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Debates slice in this pie chart?",
            "A": "The value of the Debates slice is {39}%."
        },
        {
            "Q": "What is the value of the Math Olympiad slice in this pie chart?",
            "A": "The value of the Math Olympiad slice is {27}%."
        },
        {
            "Q": "What is the value of the Music Competitions slice in this pie chart?",
            "A": "The value of the Music Competitions slice is {19}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {39}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {15}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Music Competitions and Debates in this pie chart?",
            "A": "The difference between Music Competitions and Debates is {20}%."
        },
        {
            "Q": "What is the sum of the values of Math Olympiad and Cooking Competitions in this pie chart?",
            "A": "The sum of Math Olympiad and Cooking Competitions is {42}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 30.0%? Please list the category names and corresponding percentages.",
            "A": "{Debates} accounts for {39}%"
        },
        {
            "Q": "Which categories in the pie chart are below 18.0%? Please list the category names and corresponding percentages.",
            "A": "{Cooking Competitions} accounts for {15}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Debates, Math Olympiad, or Music Competitions?",
            "A": "The value of {Debates} is larger."
        },
        {
            "Q": "Which is larger, the value of Debates or Math Olympiad?",
            "A": "The value of {Debates} is larger."
        },
        {
            "Q": "Which is smaller, the value of Math Olympiad, Music Competitions, or Cooking Competitions?",
            "A": "The value of {Cooking Competitions} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 10% and 20%?",
            "A": "There are {2} sectors that have a percentage between 10% and 20%."
        }
    ],
    "VA": []
}