{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {5} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Cruise Travel?",
            "A": "The next slice clockwise from slice Cruise Travel is {Domestic Tourism}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Cruise Travel?",
            "A": "The next slice counterclockwise from slice Cruise Travel is {Cultural Tourism}."
        }
    ],
    "VPR": [
        {
            "Q": "Which of has the largest proportion in this pie chart?",
            "A": "The of with the largest proportion is {Domestic Tourism}."
        },
        {
            "Q": "Which of has the smallest proportion in this pie chart?",
            "A": "The of with the smallest proportion is {Cruise Travel}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Beach Resorts slice in this pie chart?",
            "A": "The value of the Beach Resorts slice is {23}%."
        },
        {
            "Q": "What is the value of the Domestic Tourism slice in this pie chart?",
            "A": "The value of the Domestic Tourism slice is {24}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {24}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {9}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Cruise Travel and Beach Resorts in this pie chart?",
            "A": "The difference between Cruise Travel and Beach Resorts is {14}%."
        },
        {
            "Q": "What is the sum of the values of Domestic Tourism and Cultural Tourism in this pie chart?",
            "A": "The sum of Domestic Tourism and Cultural Tourism is {45}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 23.0%? Please list the category names and corresponding percentages.",
            "A": "{Domestic Tourism} accounts for {24}%"
        },
        {
            "Q": "Which categories in the pie chart are below 21.0%? Please list the category names and corresponding percentages.",
            "A": "{Cruise Travel} accounts for {9}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Domestic Tourism or Beach Resorts?",
            "A": "The value of {Domestic Tourism} is larger."
        },
        {
            "Q": "Which has the largest value: Domestic Tourism, Beach Resorts, Eco-Tourism, or Cruise Travel?",
            "A": "The value of {Domestic Tourism} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 3% and 15%?",
            "A": "There are {1} sectors that have a percentage between 3% and 15%."
        }
    ],
    "VA": []
}