{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {pie chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many slices are there in this pie chart?",
            "A": "There are {5} slices in this pie chart."
        }
    ],
    "SRP": [
        {
            "Q": "In the pie chart, what is the next slice in the clockwise direction from slice Cruise Travel?",
            "A": "The next slice clockwise from slice Cruise Travel is {International Tourism}."
        },
        {
            "Q": "In the pie chart, what is the next slice in the counterclockwise direction from slice Cruise Travel?",
            "A": "The next slice counterclockwise from slice Cruise Travel is {Cultural Tourism}."
        }
    ],
    "VPR": [
        {
            "Q": "Which of has the largest proportion in this pie chart?",
            "A": "The of with the largest proportion is {International Tourism}."
        },
        {
            "Q": "Which of has the smallest proportion in this pie chart?",
            "A": "The of with the smallest proportion is {Cultural Tourism}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Cruise Travel slice in this pie chart?",
            "A": "The value of the Cruise Travel slice is {18}%."
        },
        {
            "Q": "What is the value of the Adventure Travel slice in this pie chart?",
            "A": "The value of the Adventure Travel slice is {19}%."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value in this pie chart?",
            "A": "The maximum value is {27}%."
        },
        {
            "Q": "What is the minimum value in this pie chart?",
            "A": "The minimum value is {16}%."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the values of Cruise Travel and Eco-Tourism in this pie chart?",
            "A": "The difference between Cruise Travel and Eco-Tourism is {2}%."
        },
        {
            "Q": "What is the sum of the values of International Tourism and Adventure Travel in this pie chart?",
            "A": "The sum of International Tourism and Adventure Travel is {46}%."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the pie chart exceed 20.0%? Please list the category names and corresponding percentages.",
            "A": "{International Tourism} accounts for {27}%"
        },
        {
            "Q": "Which categories in the pie chart are below 18.0%? Please list the category names and corresponding percentages.",
            "A": "{Cultural Tourism} accounts for {16}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of International Tourism, Eco-Tourism, or Adventure Travel?",
            "A": "The value of {International Tourism} is larger."
        },
        {
            "Q": "Which is smaller, the value of Eco-Tourism, Adventure Travel, or Cruise Travel?",
            "A": "The value of {Cruise Travel} is smaller."
        },
        {
            "Q": "Which is larger, the value of International Tourism or Eco-Tourism?",
            "A": "The value of {International Tourism} is larger."
        },
        {
            "Q": "Which has the largest value: International Tourism, Eco-Tourism, Adventure Travel, or Cultural Tourism?",
            "A": "The value of {International Tourism} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "How many sectors have a percentage between 5% and 20%?",
            "A": "There are {4} sectors that have a percentage between 5% and 20%."
        }
    ],
    "VA": []
}