{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Performing Arts positioned outside, inside or on the same side as Creative Interviews?",
            "A": "Performing Arts is positioned {inside} Creative Interviews."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Digital Culture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Theatre segment in this sunburst chart?",
            "A": "The value of the Theatre segment is {15.1}."
        },
        {
            "Q": "What is the value of the Drama segment in this sunburst chart?",
            "A": "The value of the Drama segment is {5.09}."
        },
        {
            "Q": "What is the value of the Performing Arts segment in this sunburst chart?",
            "A": "The value of the Performing Arts segment is {23.14}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {44.3}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.62}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {20.33}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Digital Culture exceed 59%? Please list the category names and corresponding percentages.",
            "A": "{Streaming Culture} accounts for {68.56}%"
        },
        {
            "Q": "Which categories in the segment Digital Culture are below 41%? Please list the category names and corresponding percentages.",
            "A": "{Online Exhibitions} accounts for {31.44}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Digital Culture, Creative Expression, or Streaming Culture?",
            "A": "The value of {Digital Culture} is larger."
        },
        {
            "Q": "Which is larger, the value of Digital Culture or Creative Expression?",
            "A": "The value of {Digital Culture} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Digital Culture to Streaming Culture to Cultural Podcasts to Creative Interviews}."
        }
    ],
    "VA": []
}