{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {3} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {13} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Visual Arts positioned outside, inside or on the same side as Cultural Participation?",
            "A": "Visual Arts is positioned {outside} Cultural Participation."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Creative Expression}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Virtual Museums segment in this sunburst chart?",
            "A": "The value of the Virtual Museums segment is {5.42}."
        },
        {
            "Q": "What is the value of the Creative Expression segment in this sunburst chart?",
            "A": "The value of the Creative Expression segment is {39.85}."
        },
        {
            "Q": "What is the value of the Site Tours segment in this sunburst chart?",
            "A": "The value of the Site Tours segment is {9.21}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {39.85}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {23.18}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {11.24}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.42}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Creative Expression exceed 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        },
        {
            "Q": "Which categories in the segment Creative Expression are below 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Creative Expression, Visual Arts, or Cultural Participation?",
            "A": "The value of {Creative Expression} is larger."
        },
        {
            "Q": "Which is larger, the value of Creative Expression or Visual Arts?",
            "A": "The value of {Creative Expression} is larger."
        },
        {
            "Q": "Which is smaller, the value of Visual Arts, Cultural Participation, or Digital Culture?",
            "A": "The value of {Digital Culture} is smaller."
        },
        {
            "Q": "Which has the largest value: Creative Expression, Visual Arts, Cultural Participation, or Art Festivals?",
            "A": "The value of {Creative Expression} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Cultural Participation to Art Festivals to Local Festivals}."
        }
    ],
    "VA": []
}