{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {15} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {2} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Organic positioned outside, inside or on the same side as Grains?",
            "A": "Organic is positioned {outside} Grains."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Livestock}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Agricultural Inputs segment in this sunburst chart?",
            "A": "The value of the Agricultural Inputs segment is {27.87}."
        },
        {
            "Q": "What is the value of the Rice segment in this sunburst chart?",
            "A": "The value of the Rice segment is {6.73}."
        },
        {
            "Q": "What is the value of the Crop Production segment in this sunburst chart?",
            "A": "The value of the Crop Production segment is {20.82}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {51.32}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {20.82}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {10.53}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.63}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.01}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Livestock exceed 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        },
        {
            "Q": "Which categories in the segment Livestock are below 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Livestock or Cattle?",
            "A": "The value of {Livestock} is larger."
        },
        {
            "Q": "Which is smaller, the value of Cattle, Agricultural Inputs, or Fertilizers?",
            "A": "The value of {Fertilizers} is smaller."
        },
        {
            "Q": "Which has the largest value: Livestock, Cattle, Agricultural Inputs, or Crop Production?",
            "A": "The value of {Livestock} is the largest."
        },
        {
            "Q": "Which is larger, the value of Livestock, Cattle, or Agricultural Inputs?",
            "A": "The value of {Livestock} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Agricultural Inputs to Fertilizers to Nitrogen to Urea}."
        }
    ],
    "VA": []
}