{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Postgraduate positioned outside, inside or on the same side as MA?",
            "A": "Postgraduate is positioned {inside} MA."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Higher Education}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the MBA segment in this sunburst chart?",
            "A": "The value of the MBA segment is {5.86}."
        },
        {
            "Q": "What is the value of the Informal Learning segment in this sunburst chart?",
            "A": "The value of the Informal Learning segment is {34.93}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {41.99}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {23.08}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {5.86}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.01}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Higher Education exceed 53%? Please list the category names and corresponding percentages.",
            "A": "{Undergraduate} accounts for {55.2}%"
        },
        {
            "Q": "Which categories in the segment Higher Education are below 47%? Please list the category names and corresponding percentages.",
            "A": "{Postgraduate} accounts for {44.8}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Informal Learning, Undergraduate, or Formal Education?",
            "A": "The value of {Formal Education} is smaller."
        },
        {
            "Q": "Which is larger, the value of Higher Education or Informal Learning?",
            "A": "The value of {Higher Education} is larger."
        },
        {
            "Q": "Which has the largest value: Higher Education, Informal Learning, Undergraduate, or Primary Education?",
            "A": "The value of {Higher Education} is the largest."
        },
        {
            "Q": "Which is larger, the value of Higher Education, Informal Learning, or Undergraduate?",
            "A": "The value of {Higher Education} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Higher Education to Postgraduate to Masters Programs to MBA}."
        }
    ],
    "VA": []
}