{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Secondary Education positioned outside, inside or on the same side as Private Primary?",
            "A": "Secondary Education is positioned {inside} Private Primary."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Informal Learning}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Research Universities segment in this sunburst chart?",
            "A": "The value of the Research Universities segment is {29.45}."
        },
        {
            "Q": "What is the value of the Undergraduate segment in this sunburst chart?",
            "A": "The value of the Undergraduate segment is {29.45}."
        },
        {
            "Q": "What is the value of the Online Education segment in this sunburst chart?",
            "A": "The value of the Online Education segment is {43.06}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {48.9}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.66}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {22.61}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {6.21}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.01}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Informal Learning exceed 69%? Please list the category names and corresponding percentages.",
            "A": "{Online Education} accounts for {88.06}%"
        },
        {
            "Q": "Which categories in the segment Informal Learning are below 31%? Please list the category names and corresponding percentages.",
            "A": "{Community Learning} accounts for {11.94}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Informal Learning, Online Education, or Skill Platforms?",
            "A": "The value of {Informal Learning} is larger."
        },
        {
            "Q": "Which has the largest value: Informal Learning, Online Education, Skill Platforms, or Undergraduate?",
            "A": "The value of {Informal Learning} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Higher Education to Undergraduate to Research Universities to Medical Schools}."
        }
    ],
    "VA": []
}