{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {15} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {2} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Generation positioned outside, inside or on the same side as Smart Grids?",
            "A": "Generation is positioned {inside} Smart Grids."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Energy Sources}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Energy Infrastructure segment in this sunburst chart?",
            "A": "The value of the Energy Infrastructure segment is {35.94}."
        },
        {
            "Q": "What is the value of the High Voltage Lines segment in this sunburst chart?",
            "A": "The value of the High Voltage Lines segment is {19.5}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {41.87}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {22.19}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {14.35}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.15}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Energy Sources exceed 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        },
        {
            "Q": "Which categories in the segment Energy Sources are below 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        }
    ],
    "NC": [
        {
            "Q": "Which has the largest value: Energy Sources, Renewables, Energy Infrastructure, or Energy Consumption?",
            "A": "The value of {Energy Sources} is the largest."
        },
        {
            "Q": "Which is smaller, the value of Renewables, Energy Infrastructure, or Transmission?",
            "A": "The value of {Transmission} is smaller."
        },
        {
            "Q": "Which is larger, the value of Energy Sources, Renewables, or Energy Infrastructure?",
            "A": "The value of {Energy Sources} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Energy Infrastructure to Transmission to High Voltage Lines to AC Lines}."
        }
    ],
    "VA": []
}