{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Transmission positioned outside, inside or on the same side as Sensors?",
            "A": "Transmission is positioned {inside} Sensors."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Energy Consumption}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Fossil Fuels segment in this sunburst chart?",
            "A": "The value of the Fossil Fuels segment is {28.22}."
        },
        {
            "Q": "What is the value of the Energy Consumption segment in this sunburst chart?",
            "A": "The value of the Energy Consumption segment is {50.56}."
        },
        {
            "Q": "What is the value of the Energy Sources segment in this sunburst chart?",
            "A": "The value of the Energy Sources segment is {28.22}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {50.56}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.22}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {17.51}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.1}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Energy Consumption exceed 60%? Please list the category names and corresponding percentages.",
            "A": "{Residential} accounts for {69.22}%"
        },
        {
            "Q": "Which categories in the segment Energy Consumption are below 40%? Please list the category names and corresponding percentages.",
            "A": "{Industrial} accounts for {30.78}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Residential, Energy Sources, or Fossil Fuels?",
            "A": "The value of {Fossil Fuels} is smaller."
        },
        {
            "Q": "Which has the largest value: Energy Consumption, Residential, Energy Sources, or Heating?",
            "A": "The value of {Energy Consumption} is the largest."
        },
        {
            "Q": "Which is larger, the value of Energy Consumption or Residential?",
            "A": "The value of {Energy Consumption} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Energy Consumption to Residential to Heating to Gas Heating}."
        }
    ],
    "VA": []
}