{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Financial Management positioned outside, inside or on the same side as Innovation Strategy?",
            "A": "Financial Management is positioned {inside} Innovation Strategy."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Corporate Strategy}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Corporate Strategy segment in this sunburst chart?",
            "A": "The value of the Corporate Strategy segment is {48.46}."
        },
        {
            "Q": "What is the value of the Innovation Strategy segment in this sunburst chart?",
            "A": "The value of the Innovation Strategy segment is {48.46}."
        },
        {
            "Q": "What is the value of the Data Strategy segment in this sunburst chart?",
            "A": "The value of the Data Strategy segment is {14.93}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {48.46}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.5}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {30.34}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.07}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Corporate Strategy exceed 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        },
        {
            "Q": "Which categories in the segment Corporate Strategy are below 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Corporate Strategy or Innovation Strategy?",
            "A": "The value of {Corporate Strategy} is larger."
        },
        {
            "Q": "Which is smaller, the value of Innovation Strategy, Process Innovation, or Agile Transformation?",
            "A": "The value of {Agile Transformation} is smaller."
        },
        {
            "Q": "Which has the largest value: Corporate Strategy, Innovation Strategy, Process Innovation, or Financial Management?",
            "A": "The value of {Corporate Strategy} is the largest."
        },
        {
            "Q": "Which is larger, the value of Corporate Strategy, Innovation Strategy, or Process Innovation?",
            "A": "The value of {Corporate Strategy} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Corporate Strategy to Innovation Strategy to Process Innovation to Agile Transformation}."
        }
    ],
    "VA": []
}