{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {16} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {3} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Job Posting positioned outside, inside or on the same side as Employee Lifecycle?",
            "A": "Job Posting is positioned {outside} Employee Lifecycle."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Workplace Wellbeing}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Compressed Weeks segment in this sunburst chart?",
            "A": "The value of the Compressed Weeks segment is {12.11}."
        },
        {
            "Q": "What is the value of the Candidate Evaluation segment in this sunburst chart?",
            "A": "The value of the Candidate Evaluation segment is {5.29}."
        },
        {
            "Q": "What is the value of the Hybrid Options segment in this sunburst chart?",
            "A": "The value of the Hybrid Options segment is {10.69}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {43.21}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.91}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {12.11}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {9.42}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Workplace Wellbeing exceed 62%? Please list the category names and corresponding percentages.",
            "A": "{Work-Life Balance} accounts for {74.57}%"
        },
        {
            "Q": "Which categories in the segment Workplace Wellbeing are below 38%? Please list the category names and corresponding percentages.",
            "A": "{Health & Safety} accounts for {25.43}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Employee Development, Training Programs, or Work-Life Balance?",
            "A": "The value of {Work-Life Balance} is smaller."
        },
        {
            "Q": "Which is larger, the value of Workplace Wellbeing or Employee Development?",
            "A": "The value of {Workplace Wellbeing} is larger."
        },
        {
            "Q": "Which has the largest value: Workplace Wellbeing, Employee Development, Training Programs, or Flexible Scheduling?",
            "A": "The value of {Workplace Wellbeing} is the largest."
        },
        {
            "Q": "Which is larger, the value of Workplace Wellbeing, Employee Development, or Training Programs?",
            "A": "The value of {Workplace Wellbeing} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Workplace Wellbeing to Work-Life Balance to Flexible Scheduling to Compressed Weeks}."
        }
    ],
    "VA": []
}