{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Candidate Evaluation positioned outside, inside or on the same side as Work-Life Balance?",
            "A": "Candidate Evaluation is positioned {outside} Work-Life Balance."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Employee Development}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Peer Review segment in this sunburst chart?",
            "A": "The value of the Peer Review segment is {9.62}."
        },
        {
            "Q": "What is the value of the 360 Review segment in this sunburst chart?",
            "A": "The value of the 360 Review segment is {7.38}."
        },
        {
            "Q": "What is the value of the Candidate Evaluation segment in this sunburst chart?",
            "A": "The value of the Candidate Evaluation segment is {8.39}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {41.41}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {29.06}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {9.62}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.39}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.01}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Employee Development exceed 69%? Please list the category names and corresponding percentages.",
            "A": "{Performance Management} accounts for {87.06}%"
        },
        {
            "Q": "Which categories in the segment Employee Development are below 31%? Please list the category names and corresponding percentages.",
            "A": "{Training Programs} accounts for {12.94}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Employee Development or Performance Management?",
            "A": "The value of {Employee Development} is larger."
        },
        {
            "Q": "Which is larger, the value of Employee Development, Performance Management, or Employee Lifecycle?",
            "A": "The value of {Employee Development} is larger."
        },
        {
            "Q": "Which has the largest value: Employee Development, Performance Management, Employee Lifecycle, or Work-Life Balance?",
            "A": "The value of {Employee Development} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Employee Development to Performance Management to Feedback to Peer Review}."
        }
    ],
    "VA": []
}