{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Buddy System positioned outside, inside or on the same side as Candidate Evaluation?",
            "A": "Buddy System is positioned {outside} Candidate Evaluation."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Workplace Wellbeing}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Candidate Evaluation segment in this sunburst chart?",
            "A": "The value of the Candidate Evaluation segment is {5.09}."
        },
        {
            "Q": "What is the value of the Job Posting segment in this sunburst chart?",
            "A": "The value of the Job Posting segment is {7.0}."
        },
        {
            "Q": "What is the value of the Learning Modules segment in this sunburst chart?",
            "A": "The value of the Learning Modules segment is {5.56}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {41.7}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.28}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {6.51}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.02}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.01}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Workplace Wellbeing exceed 62%? Please list the category names and corresponding percentages.",
            "A": "{Health & Safety} accounts for {74.32}%"
        },
        {
            "Q": "Which categories in the segment Workplace Wellbeing are below 38%? Please list the category names and corresponding percentages.",
            "A": "{Work-Life Balance} accounts for {25.68}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Workplace Wellbeing or Employee Lifecycle?",
            "A": "The value of {Workplace Wellbeing} is larger."
        },
        {
            "Q": "Which is smaller, the value of Employee Lifecycle, Health & Safety, or Onboarding?",
            "A": "The value of {Onboarding} is smaller."
        },
        {
            "Q": "Which is larger, the value of Workplace Wellbeing, Employee Lifecycle, or Health & Safety?",
            "A": "The value of {Workplace Wellbeing} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Employee Lifecycle to Onboarding to Mentorship to Buddy System}."
        }
    ],
    "VA": []
}