{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {16} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {3} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Residential Property positioned outside, inside or on the same side as Long-Term Rentals?",
            "A": "Residential Property is positioned {inside} Long-Term Rentals."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Rental Market}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Vrbo Hosts segment in this sunburst chart?",
            "A": "The value of the Vrbo Hosts segment is {5.88}."
        },
        {
            "Q": "What is the value of the Rental Market segment in this sunburst chart?",
            "A": "The value of the Rental Market segment is {53.71}."
        },
        {
            "Q": "What is the value of the Detached segment in this sunburst chart?",
            "A": "The value of the Detached segment is {5.55}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {53.71}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {20.08}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {21.69}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.88}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Rental Market exceed 64%? Please list the category names and corresponding percentages.",
            "A": "{Short-Term Rentals} accounts for {77.96}%"
        },
        {
            "Q": "Which categories in the segment Rental Market are below 36%? Please list the category names and corresponding percentages.",
            "A": "{Long-Term Rentals} accounts for {22.04}%"
        }
    ],
    "NC": [
        {
            "Q": "Which has the largest value: Rental Market, Short-Term Rentals, Platforms, or Office Buildings?",
            "A": "The value of {Rental Market} is the largest."
        },
        {
            "Q": "Which is smaller, the value of Short-Term Rentals, Platforms, or Commercial Real Estate?",
            "A": "The value of {Commercial Real Estate} is smaller."
        },
        {
            "Q": "Which is larger, the value of Rental Market, Short-Term Rentals, or Platforms?",
            "A": "The value of {Rental Market} is larger."
        },
        {
            "Q": "Which is larger, the value of Rental Market or Short-Term Rentals?",
            "A": "The value of {Rental Market} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Rental Market to Short-Term Rentals to Platforms to Booking.com}."
        }
    ],
    "VA": []
}