{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is FAQ Automation positioned outside, inside or on the same side as Marketing Strategies?",
            "A": "FAQ Automation is positioned {outside} Marketing Strategies."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Customer Engagement}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Influencer Marketing segment in this sunburst chart?",
            "A": "The value of the Influencer Marketing segment is {5.38}."
        },
        {
            "Q": "What is the value of the Multilingual Support segment in this sunburst chart?",
            "A": "The value of the Multilingual Support segment is {5.46}."
        },
        {
            "Q": "What is the value of the Digital Payment Systems segment in this sunburst chart?",
            "A": "The value of the Digital Payment Systems segment is {5.8}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {39.05}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {22.22}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {8.74}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.38}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Customer Engagement exceed 56%? Please list the category names and corresponding percentages.",
            "A": "{Customer Service} accounts for {63.84}%"
        },
        {
            "Q": "Which categories in the segment Customer Engagement are below 43%? Please list the category names and corresponding percentages.",
            "A": "{Marketing Strategies} accounts for {36.16}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Customer Engagement or Marketplace Platforms?",
            "A": "The value of {Customer Engagement} is larger."
        },
        {
            "Q": "Which is smaller, the value of Marketplace Platforms, C2C Marketplaces, or Customer Service?",
            "A": "The value of {Customer Service} is smaller."
        },
        {
            "Q": "Which has the largest value: Customer Engagement, Marketplace Platforms, C2C Marketplaces, or Payment & Logistics?",
            "A": "The value of {Customer Engagement} is the largest."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Customer Engagement to Marketing Strategies to Social Media Ads to Short Videos}."
        }
    ],
    "VA": []
}