{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {3} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {13} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is E-Wallets positioned outside, inside or on the same side as Warehousing?",
            "A": "E-Wallets is positioned {on the same side} Warehousing."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Customer Engagement}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Warehousing segment in this sunburst chart?",
            "A": "The value of the Warehousing segment is {5.43}."
        },
        {
            "Q": "What is the value of the E-Wallets segment in this sunburst chart?",
            "A": "The value of the E-Wallets segment is {5.56}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {50.62}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.97}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {10.22}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.43}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Customer Engagement exceed 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        },
        {
            "Q": "Which categories in the segment Customer Engagement are below 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Customer Engagement or Marketing Strategies?",
            "A": "The value of {Customer Engagement} is larger."
        },
        {
            "Q": "Which is smaller, the value of Marketing Strategies, Payment & Logistics, or Marketplace Platforms?",
            "A": "The value of {Marketplace Platforms} is smaller."
        },
        {
            "Q": "Which is larger, the value of Customer Engagement, Marketing Strategies, or Payment & Logistics?",
            "A": "The value of {Customer Engagement} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Payment & Logistics to Fulfillment & Delivery to Last-mile Delivery}."
        }
    ],
    "VA": []
}