{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {16} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {3} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Applied Sciences positioned outside, inside or on the same side as Artificial Intelligence?",
            "A": "Applied Sciences is positioned {inside} Artificial Intelligence."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Physical Sciences}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Engineering segment in this sunburst chart?",
            "A": "The value of the Engineering segment is {11.4}."
        },
        {
            "Q": "What is the value of the Computer Science segment in this sunburst chart?",
            "A": "The value of the Computer Science segment is {10.24}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {48.36}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.64}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {13.73}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {12.18}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Physical Sciences exceed 65%? Please list the category names and corresponding percentages.",
            "A": "{Chemistry} accounts for {80.93}%"
        },
        {
            "Q": "Which categories in the segment Physical Sciences are below 35%? Please list the category names and corresponding percentages.",
            "A": "{Physics} accounts for {19.07}%"
        }
    ],
    "NC": [
        {
            "Q": "Which has the largest value: Physical Sciences, Chemistry, Inorganic Chemistry, or Biology?",
            "A": "The value of {Physical Sciences} is the largest."
        },
        {
            "Q": "Which is smaller, the value of Chemistry, Inorganic Chemistry, or Life Sciences?",
            "A": "The value of {Life Sciences} is smaller."
        },
        {
            "Q": "Which is larger, the value of Physical Sciences, Chemistry, or Inorganic Chemistry?",
            "A": "The value of {Physical Sciences} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Physical Sciences to Chemistry to Inorganic Chemistry to Transition Metals}."
        }
    ],
    "VA": []
}