{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {18} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {5} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Playlists positioned outside, inside or on the same side as Shorts?",
            "A": "Playlists is positioned {on the same side} Shorts."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {User Engagement}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Memes segment in this sunburst chart?",
            "A": "The value of the Memes segment is {14.1}."
        },
        {
            "Q": "What is the value of the Social Networks segment in this sunburst chart?",
            "A": "The value of the Social Networks segment is {23.44}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {45.79}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {23.44}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {15.85}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.08}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment User Engagement exceed 68%? Please list the category names and corresponding percentages.",
            "A": "{Sharing and Virality} accounts for {85.06}%"
        },
        {
            "Q": "Which categories in the segment User Engagement are below 32%? Please list the category names and corresponding percentages.",
            "A": "{Reactions and Comments} accounts for {14.94}%"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of User Engagement, Sharing and Virality, or Content Creation?",
            "A": "The value of {User Engagement} is larger."
        },
        {
            "Q": "Which is smaller, the value of Sharing and Virality, Content Creation, or Reposts?",
            "A": "The value of {Reposts} is smaller."
        },
        {
            "Q": "Which has the largest value: User Engagement, Sharing and Virality, Content Creation, or Platforms?",
            "A": "The value of {User Engagement} is the largest."
        },
        {
            "Q": "Which is larger, the value of User Engagement or Sharing and Virality?",
            "A": "The value of {User Engagement} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {User Engagement to Sharing and Virality to Reposts to Link Shares}."
        }
    ],
    "VA": []
}