{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {16} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {3} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is International Routes positioned outside, inside or on the same side as Passenger Flights?",
            "A": "International Routes is positioned {outside} Passenger Flights."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Freight and Logistics}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Bike Sharing segment in this sunburst chart?",
            "A": "The value of the Bike Sharing segment is {9.3}."
        },
        {
            "Q": "What is the value of the Passenger Flights segment in this sunburst chart?",
            "A": "The value of the Passenger Flights segment is {18.05}."
        },
        {
            "Q": "What is the value of the International Routes segment in this sunburst chart?",
            "A": "The value of the International Routes segment is {6.7}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {45.32}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {22.85}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {6.7}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.42}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {99.99}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Freight and Logistics exceed 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        },
        {
            "Q": "Which categories in the segment Freight and Logistics are below 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Freight and Logistics or Rail Freight?",
            "A": "The value of {Freight and Logistics} is larger."
        },
        {
            "Q": "Which has the largest value: Freight and Logistics, Rail Freight, Air Transport, or Commercial Airlines?",
            "A": "The value of {Freight and Logistics} is the largest."
        },
        {
            "Q": "Which is larger, the value of Freight and Logistics, Rail Freight, or Air Transport?",
            "A": "The value of {Freight and Logistics} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Air Transport to Commercial Airlines to Passenger Flights to International Routes}."
        }
    ],
    "VA": []
}