{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {16} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {3} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Logistics Platforms positioned outside, inside or on the same side as Safety Standards?",
            "A": "Logistics Platforms is positioned {inside} Safety Standards."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Freight and Logistics}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Public Transit segment in this sunburst chart?",
            "A": "The value of the Public Transit segment is {9.31}."
        },
        {
            "Q": "What is the value of the Cargo Airlines segment in this sunburst chart?",
            "A": "The value of the Cargo Airlines segment is {5.27}."
        },
        {
            "Q": "What is the value of the Air Transport segment in this sunburst chart?",
            "A": "The value of the Air Transport segment is {21.89}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {46.44}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {21.89}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {5.79}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.05}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Freight and Logistics exceed 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        },
        {
            "Q": "Which categories in the segment Freight and Logistics are below 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Freight and Logistics, Road Freight, or Urban Mobility?",
            "A": "The value of {Freight and Logistics} is larger."
        },
        {
            "Q": "Which has the largest value: Freight and Logistics, Road Freight, Urban Mobility, or Air Transport?",
            "A": "The value of {Freight and Logistics} is the largest."
        },
        {
            "Q": "Which is smaller, the value of Road Freight, Urban Mobility, or Micromobility?",
            "A": "The value of {Micromobility} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Urban Mobility to Micromobility to E-Scooters to Safety Standards}."
        }
    ],
    "VA": []
}