{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {sunburst chart}."
        }
    ],
    "VEC": [
        {
            "Q": "How many ring layers are in this sunburst chart?",
            "A": "There are {4} ring layers."
        },
        {
            "Q": "How many segments are in this sunburst chart?",
            "A": "There are {16} segments."
        },
        {
            "Q": "How many segments are in the innermost ring of this sunburst chart?",
            "A": "There are {3} segments in the innermost ring."
        },
        {
            "Q": "How many segments are in the outermost ring of this sunburst chart?",
            "A": "There are {3} segments in the outermost ring."
        }
    ],
    "SRP": [
        {
            "Q": "Is Air Cargo positioned outside, inside or on the same side as Road Freight?",
            "A": "Air Cargo is positioned {on the same side} Road Freight."
        }
    ],
    "VPR": [
        {
            "Q": "Which top-level category has the highest proportion in this sunburst chart?",
            "A": "The top-level category with the highest proportion is {Urban Mobility}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Intermodal Hubs segment in this sunburst chart?",
            "A": "The value of the Intermodal Hubs segment is {6.5}."
        },
        {
            "Q": "What is the value of the Air Transport segment in this sunburst chart?",
            "A": "The value of the Air Transport segment is {22.94}."
        },
        {
            "Q": "What is the value of the Logistics Parks segment in this sunburst chart?",
            "A": "The value of the Logistics Parks segment is {5.15}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value of the innermost layer in this sunburst chart?",
            "A": "The maximum value of the innermost layer is {39.62}."
        },
        {
            "Q": "What is the minimum value of the innermost layer in this sunburst chart?",
            "A": "The minimum value of the innermost layer is {22.94}."
        },
        {
            "Q": "What is the maximum value of the outermost layer in this sunburst chart?",
            "A": "The maximum value of the outermost layer is {6.53}."
        },
        {
            "Q": "What is the minimum value of the outermost layer in this sunburst chart?",
            "A": "The minimum value of the outermost layer is {5.06}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of the second layer?",
            "A": "The total value of the second layer is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Which categories in the segment Urban Mobility exceed 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        },
        {
            "Q": "Which categories in the segment Urban Mobility are below 100%? Please list the category names and corresponding percentages.",
            "A": "None."
        }
    ],
    "NC": [
        {
            "Q": "Which has the largest value: Urban Mobility, Micromobility, Freight and Logistics, or Air Transport?",
            "A": "The value of {Urban Mobility} is the largest."
        },
        {
            "Q": "Which is larger, the value of Urban Mobility or Micromobility?",
            "A": "The value of {Urban Mobility} is larger."
        },
        {
            "Q": "Which is larger, the value of Urban Mobility, Micromobility, or Freight and Logistics?",
            "A": "The value of {Urban Mobility} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "Which hierarchical path in the sunburst chart makes the largest contribution to the total?",
            "A": "The path that contributes the most to the total is: {Freight and Logistics to Road Freight to Highway Networks to Expressways}."
        }
    ],
    "VA": []
}