{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {fill bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this fill bubble chart?",
            "A": "There are {8} bubbles."
        },
        {
            "Q": "How many bubbles are in layer 2 of this fill bubble chart?",
            "A": "There are {2} bubbles in layer 2."
        }
    ],
    "SRP": [
        {
            "Q": "Is Bubble Air Transport positioned deeper, shallower or on the same depth as Bubble Aerospace Technology?",
            "A": "Bubble Air Transport is positioned {on the same depth as} Bubble Aerospace Technology."
        }
    ],
    "VPR": [
        {
            "Q": "What is the maximum depth in this fill bubble chart?",
            "A": "The maximum depth is {3}."
        },
        {
            "Q": "Which bubble contains bubble Air Transport in the fill bubble chart?",
            "A": "Bubble Air Transport is contained by bubble {Modes of Transport}."
        },
        {
            "Q": "Which bubbles are contained within bubble Modes of Transport in the fill bubble chart?",
            "A": "Bubble Modes of Transport contains bubbles {Maritime Transport, Air Transport, Road Transport}."
        }
    ],
    "VE": [
        {
            "Q": "What is the size value of bubble Aerospace Technology?",
            "A": "The size value of bubble Aerospace Technology is {11.35}."
        },
        {
            "Q": "What is the size value of bubble Modes of Transport?",
            "A": "The size value of bubble Modes of Transport is {31.51}."
        },
        {
            "Q": "What is the size value of bubble Vehicle Technology?",
            "A": "The size value of bubble Vehicle Technology is {18.43}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum size value in the fill bubble chart?",
            "A": "The global maximum size value is {76.98}."
        },
        {
            "Q": "What is the global minimum size value in the fill bubble chart?",
            "A": "The global minimum size value is {6.21}."
        },
        {
            "Q": "What is the maximum value under category Vehicle Technology?",
            "A": "The maximum value under category Vehicle Technology is {11.80}."
        },
        {
            "Q": "What is the minimum value under category Vehicle Technology?",
            "A": "The minimum value under category Vehicle Technology is {11.35}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of layer 2 of bubbles?",
            "A": "The total value of layer 2 of bubbles is {49.94}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 size values in the fill bubble chart?",
            "A": "{76.98, 31.51, 18.43}."
        },
        {
            "Q": "What are the bottom 3 size values in the fill bubble chart?",
            "A": "{6.21, 8.07, 11.35}."
        },
        {
            "Q": "Which bubbles have size values exceed 25.65? Please list the bubbles and corresponding values.",
            "A": "Transportation and Logistics has {76.98}, and Modes of Transport has {31.51}."
        },
        {
            "Q": "Which bubbles have size values between 19.57 and 74.96? Please list the bubbles and corresponding values.",
            "A": "Modes of Transport has {31.51}."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the size value of Modes of Transport or Aerospace Technology in the fill bubble chart?",
            "A": "The size value of {Modes of Transport} is larger."
        },
        {
            "Q": "Which is larger, the size value of Vehicle Technology or Road Transport in the fill bubble chart?",
            "A": "The size value of {Vehicle Technology} is larger."
        },
        {
            "Q": "Which is larger, the size value of Aerospace Technology or Road Transport in the fill bubble chart?",
            "A": "The size value of {Aerospace Technology} is larger."
        },
        {
            "Q": "Which is larger, the size value of Transportation and Logistics or Aerospace Technology in the fill bubble chart?",
            "A": "The size value of {Transportation and Logistics} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the fill bubble chart, which subcategory in the level 3 has the largest bubble area?",
            "A": "The subcategory with the largest bubble area in the level 3 is {Maritime Transport}."
        },
        {
            "Q": "In the fill bubble chart, which subcategory in the level 2 has the smallest bubble area?",
            "A": "The subcategory with the smallest bubble area in the level 2 is {Vehicle Technology}."
        },
        {
            "Q": "How many bubbles have values above the average size across all categories?",
            "A": "There are {2} bubbles with values above the average size."
        },
        {
            "Q": "How many bubbles have values below the average oil storage across all categories?",
            "A": "There are {6} bubbles with values below the average size."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual clutter caused by overlapping labels in the bubble chart, sample the labels and list the top 2 labels recommended for removal.",
            "A": "The top 2 labels recommended for removal to reduce label overlap are: {Air Transport}, {Aerospace Technology}."
        }
    ]
}