{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {fill bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this fill bubble chart?",
            "A": "There are {4} bubbles."
        },
        {
            "Q": "How many bubbles are in layer 2 of this fill bubble chart?",
            "A": "There are {3} bubbles in layer 2."
        }
    ],
    "SRP": [
        {
            "Q": "Is Bubble Conservation positioned deeper, shallower or on the same depth as Bubble Renewable Energy?",
            "A": "Bubble Conservation is positioned {on the same depth as} Bubble Renewable Energy."
        }
    ],
    "VPR": [
        {
            "Q": "What is the maximum depth in this fill bubble chart?",
            "A": "The maximum depth is {2}."
        },
        {
            "Q": "Which bubble contains bubble Renewable Energy in the fill bubble chart?",
            "A": "Bubble Renewable Energy is contained by bubble {Environmental Science}."
        },
        {
            "Q": "Which bubbles are contained within bubble Environmental Science in the fill bubble chart?",
            "A": "Bubble Environmental Science contains bubbles {Pollution Control, Conservation, Renewable Energy}."
        }
    ],
    "VE": [
        {
            "Q": "What is the size value of bubble Pollution Control?",
            "A": "The size value of bubble Pollution Control is {32.94}."
        },
        {
            "Q": "What is the size value of bubble Conservation?",
            "A": "The size value of bubble Conservation is {37.71}."
        },
        {
            "Q": "What is the size value of bubble Renewable Energy?",
            "A": "The size value of bubble Renewable Energy is {38.39}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum size value in the fill bubble chart?",
            "A": "The global maximum size value is {82.64}."
        },
        {
            "Q": "What is the global minimum size value in the fill bubble chart?",
            "A": "The global minimum size value is {32.94}."
        },
        {
            "Q": "What is the maximum value under category Environmental Science?",
            "A": "The maximum value under category Environmental Science is {38.39}."
        },
        {
            "Q": "What is the maximum value under category General?",
            "A": "The maximum value under category {General} is {100.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of layer 2 of bubbles?",
            "A": "The total value of layer 2 of bubbles is {109.04}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 size values in the fill bubble chart?",
            "A": "{82.64, 38.39, 37.71}."
        },
        {
            "Q": "What are the bottom 3 size values in the fill bubble chart?",
            "A": "{32.94, 37.71, 38.39}."
        },
        {
            "Q": "Which bubbles have size values exceed 54.73? Please list the bubbles and corresponding values.",
            "A": "Environmental Science has {82.64}."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the size value of Environmental Science or Renewable Energy in the fill bubble chart?",
            "A": "The size value of {Environmental Science} is larger."
        },
        {
            "Q": "Which is larger, the size value of Environmental Science or Pollution Control in the fill bubble chart?",
            "A": "The size value of {Environmental Science} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the fill bubble chart, which subcategory in the level 2 has the largest bubble area?",
            "A": "The subcategory with the largest bubble area in the level 2 is {Renewable Energy}."
        },
        {
            "Q": "In the fill bubble chart, which subcategory in the level 2 has the smallest bubble area?",
            "A": "The subcategory with the smallest bubble area in the level 2 is {Pollution Control}."
        },
        {
            "Q": "How many bubbles have values above the average size across all categories?",
            "A": "There are {1} bubbles with values above the average size."
        },
        {
            "Q": "How many bubbles have values below the average oil storage across all categories?",
            "A": "There are {3} bubbles with values below the average size."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual clutter caused by overlapping labels in the bubble chart, sample the labels and list the top 2 labels recommended for removal.",
            "A": "The top 2 labels recommended for removal to reduce label overlap are: {Pollution Control}, {Renewable Energy}."
        }
    ]
}