{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {fill bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this fill bubble chart?",
            "A": "There are {6} bubbles."
        },
        {
            "Q": "How many bubbles are in layer 2 of this fill bubble chart?",
            "A": "There are {1} bubbles in layer 2."
        }
    ],
    "SRP": [
        {
            "Q": "Is Bubble Local Government positioned deeper, shallower or on the same depth as Bubble Federal Government?",
            "A": "Bubble Local Government is positioned {on the same depth as} Bubble Federal Government."
        }
    ],
    "VPR": [
        {
            "Q": "What is the maximum depth in this fill bubble chart?",
            "A": "The maximum depth is {3}."
        },
        {
            "Q": "Which bubble contains bubble International Relations in the fill bubble chart?",
            "A": "Bubble International Relations is contained by bubble {Levels of Government}."
        },
        {
            "Q": "Which bubbles are contained within bubble Levels of Government in the fill bubble chart?",
            "A": "Bubble Levels of Government contains bubbles {Local Government, State Government, Federal Government, International Relations}."
        }
    ],
    "VE": [
        {
            "Q": "What is the size value of bubble Federal Government?",
            "A": "The size value of bubble Federal Government is {14.23}."
        },
        {
            "Q": "What is the size value of bubble Government and Politics?",
            "A": "The size value of bubble Government and Politics is {93.57}."
        },
        {
            "Q": "What is the size value of bubble Levels of Government?",
            "A": "The size value of bubble Levels of Government is {25.15}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum size value in the fill bubble chart?",
            "A": "The global maximum size value is {93.57}."
        },
        {
            "Q": "What is the global minimum size value in the fill bubble chart?",
            "A": "The global minimum size value is {6.47}."
        },
        {
            "Q": "What is the maximum value under category Levels of Government?",
            "A": "The maximum value under category Levels of Government is {14.23}."
        },
        {
            "Q": "What is the minimum value under category Levels of Government?",
            "A": "The minimum value under category Levels of Government is {6.47}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of layer 3 of bubbles?",
            "A": "The total value of layer 3 of bubbles is {38.05}."
        },
        {
            "Q": "What is the total value of layer 2 of bubbles?",
            "A": "The total value of layer 2 of bubbles is {25.15}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 size values in the fill bubble chart?",
            "A": "{93.57, 25.15, 14.23}."
        },
        {
            "Q": "What are the bottom 3 size values in the fill bubble chart?",
            "A": "{6.47, 7.29, 10.06}."
        },
        {
            "Q": "Which bubbles have size values exceed 72.55? Please list the bubbles and corresponding values.",
            "A": "Government and Politics has {93.57}."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the size value of Government and Politics or State Government in the fill bubble chart?",
            "A": "The size value of {Government and Politics} is larger."
        },
        {
            "Q": "Which is larger, the size value of Government and Politics or Local Government in the fill bubble chart?",
            "A": "The size value of {Government and Politics} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the fill bubble chart, which subcategory in the level 2 has the largest bubble area?",
            "A": "The subcategory with the largest bubble area in the level 2 is {Levels of Government}."
        },
        {
            "Q": "In the fill bubble chart, which subcategory in the level 2 has the smallest bubble area?",
            "A": "The subcategory with the smallest bubble area in the level 2 is {Levels of Government}."
        },
        {
            "Q": "How many bubbles have values above the average size across all categories?",
            "A": "There are {1} bubbles with values above the average size."
        },
        {
            "Q": "How many bubbles have values below the average oil storage across all categories?",
            "A": "There are {5} bubbles with values below the average size."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual clutter caused by overlapping labels in the bubble chart, sample the labels and list the top 2 labels recommended for removal.",
            "A": "The top 2 labels recommended for removal to reduce label overlap are: {Local Government}, {Government and Politics}."
        }
    ]
}