{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {fill bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this fill bubble chart?",
            "A": "There are {4} bubbles."
        },
        {
            "Q": "How many bubbles are in layer 2 of this fill bubble chart?",
            "A": "There are {1} bubbles in layer 2."
        }
    ],
    "SRP": [
        {
            "Q": "Is Bubble Quality Control positioned deeper, shallower or on the same depth as Bubble Hospital Management?",
            "A": "Bubble Quality Control is positioned {deeper than} Bubble Hospital Management."
        }
    ],
    "VPR": [
        {
            "Q": "What is the maximum depth in this fill bubble chart?",
            "A": "The maximum depth is {3}."
        },
        {
            "Q": "Which bubble contains bubble Patient Care in the fill bubble chart?",
            "A": "Bubble Patient Care is contained by bubble {Hospital Management}."
        },
        {
            "Q": "Which bubbles are contained within bubble Hospital Management in the fill bubble chart?",
            "A": "Bubble Hospital Management contains bubbles {Patient Care, Quality Control}."
        }
    ],
    "VE": [
        {
            "Q": "What is the size value of bubble Quality Control?",
            "A": "The size value of bubble Quality Control is {10.22}."
        },
        {
            "Q": "What is the size value of bubble Healthcare and Medicine?",
            "A": "The size value of bubble Healthcare and Medicine is {66.20}."
        },
        {
            "Q": "What is the size value of bubble Patient Care?",
            "A": "The size value of bubble Patient Care is {7.64}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum size value in the fill bubble chart?",
            "A": "The global maximum size value is {66.20}."
        },
        {
            "Q": "What is the global minimum size value in the fill bubble chart?",
            "A": "The global minimum size value is {7.64}."
        },
        {
            "Q": "What is the maximum value under category Hospital Management?",
            "A": "The maximum value under category Hospital Management is {10.22}."
        },
        {
            "Q": "What is the minimum value under category Hospital Management?",
            "A": "The minimum value under category Hospital Management is {7.64}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of layer 3 of bubbles?",
            "A": "The total value of layer 3 of bubbles is {17.86}."
        },
        {
            "Q": "What is the total value of layer 2 of bubbles?",
            "A": "The total value of layer 2 of bubbles is {35.85}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 size values in the fill bubble chart?",
            "A": "{66.20, 35.85, 10.22}."
        },
        {
            "Q": "What are the bottom 3 size values in the fill bubble chart?",
            "A": "{7.64, 10.22, 35.85}."
        },
        {
            "Q": "Which bubbles have size values exceed 54.69? Please list the bubbles and corresponding values.",
            "A": "Healthcare and Medicine has {66.20}."
        },
        {
            "Q": "Which bubbles have size values between 30.01 and 46.29? Please list the bubbles and corresponding values.",
            "A": "Hospital Management has {35.85}."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the size value of Healthcare and Medicine or Hospital Management in the fill bubble chart?",
            "A": "The size value of {Healthcare and Medicine} is larger."
        },
        {
            "Q": "Which is larger, the size value of Healthcare and Medicine or Patient Care in the fill bubble chart?",
            "A": "The size value of {Healthcare and Medicine} is larger."
        },
        {
            "Q": "Which is larger, the size value of Healthcare and Medicine or Quality Control in the fill bubble chart?",
            "A": "The size value of {Healthcare and Medicine} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the fill bubble chart, which subcategory in the level 3 has the largest bubble area?",
            "A": "The subcategory with the largest bubble area in the level 3 is {Quality Control}."
        },
        {
            "Q": "In the fill bubble chart, which subcategory in the level 2 has the smallest bubble area?",
            "A": "The subcategory with the smallest bubble area in the level 2 is {Hospital Management}."
        },
        {
            "Q": "How many bubbles have values above the average size across all categories?",
            "A": "There are {2} bubbles with values above the average size."
        },
        {
            "Q": "How many bubbles have values below the average oil storage across all categories?",
            "A": "There are {2} bubbles with values below the average size."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual clutter caused by overlapping labels in the bubble chart, sample the labels and list the top 2 labels recommended for removal.",
            "A": "The top 2 labels recommended for removal to reduce label overlap are: {Patient Care}, {Quality Control}."
        }
    ]
}