{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {fill bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this fill bubble chart?",
            "A": "There are {8} bubbles."
        },
        {
            "Q": "How many bubbles are in layer 3 of this fill bubble chart?",
            "A": "There are {5} bubbles in layer 3."
        }
    ],
    "SRP": [
        {
            "Q": "Is Bubble Retail Channels positioned deeper, shallower or on the same depth as Bubble Customer Service?",
            "A": "Bubble Retail Channels is positioned {shallower than} Bubble Customer Service."
        }
    ],
    "VPR": [
        {
            "Q": "What is the maximum depth in this fill bubble chart?",
            "A": "The maximum depth is {3}."
        },
        {
            "Q": "Which bubble contains bubble Retail Channels in the fill bubble chart?",
            "A": "Bubble Retail Channels is contained by bubble {Retail and E-commerce}."
        },
        {
            "Q": "Which bubbles are contained within bubble Retail Channels in the fill bubble chart?",
            "A": "Bubble Retail Channels contains bubbles {Mobile Commerce, Physical Stores, Pop-up Shops}."
        }
    ],
    "VE": [
        {
            "Q": "What is the size value of bubble Retail Channels?",
            "A": "The size value of bubble Retail Channels is {39.11}."
        },
        {
            "Q": "What is the size value of bubble Retail and E-commerce?",
            "A": "The size value of bubble Retail and E-commerce is {97.06}."
        },
        {
            "Q": "What is the size value of bubble Mobile Commerce?",
            "A": "The size value of bubble Mobile Commerce is {13.48}."
        },
        {
            "Q": "What is the size value of bubble Physical Stores?",
            "A": "The size value of bubble Physical Stores is {7.58}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum size value in the fill bubble chart?",
            "A": "The global maximum size value is {97.06}."
        },
        {
            "Q": "What is the global minimum size value in the fill bubble chart?",
            "A": "The global minimum size value is {5.18}."
        },
        {
            "Q": "What is the maximum value under category Retail Channels?",
            "A": "The maximum value under category Retail Channels is {13.48}."
        },
        {
            "Q": "What is the minimum value under category Retail Channels?",
            "A": "The minimum value under category Retail Channels is {7.58}."
        }
    ],
    "SC": [
        {
            "Q": "What is the total value of layer 3 of bubbles?",
            "A": "The total value of layer 3 of bubbles is {44.26}."
        },
        {
            "Q": "What is the total value of layer 2 of bubbles?",
            "A": "The total value of layer 2 of bubbles is {55.10}."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 size values in the fill bubble chart?",
            "A": "{97.06, 39.11, 15.99}."
        },
        {
            "Q": "What are the bottom 3 size values in the fill bubble chart?",
            "A": "{5.18, 5.46, 7.58}."
        },
        {
            "Q": "Which bubbles have size values exceed 67.88? Please list the bubbles and corresponding values.",
            "A": "Retail and E-commerce has {97.06}."
        },
        {
            "Q": "Which bubbles have size values between 22.10 and 63.63? Please list the bubbles and corresponding values.",
            "A": "Retail Channels has {39.11}."
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the size value of Retail Channels or Personalization in the fill bubble chart?",
            "A": "The size value of {Retail Channels} is larger."
        },
        {
            "Q": "Which is larger, the size value of Retail Channels or Customer Service in the fill bubble chart?",
            "A": "The size value of {Retail Channels} is larger."
        },
        {
            "Q": "Which is larger, the size value of Personalization or Pop-up Shops in the fill bubble chart?",
            "A": "The size value of {Pop-up Shops} is larger."
        },
        {
            "Q": "Which is larger, the size value of Retail and E-commerce or Physical Stores in the fill bubble chart?",
            "A": "The size value of {Retail and E-commerce} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "In the fill bubble chart, which subcategory in the level 2 has the largest bubble area?",
            "A": "The subcategory with the largest bubble area in the level 2 is {Retail Channels}."
        },
        {
            "Q": "In the fill bubble chart, which subcategory in the level 2 has the smallest bubble area?",
            "A": "The subcategory with the smallest bubble area in the level 2 is {Customer Experience}."
        },
        {
            "Q": "How many bubbles have values above the average size across all categories?",
            "A": "There are {2} bubbles with values above the average size."
        },
        {
            "Q": "How many bubbles have values below the average oil storage across all categories?",
            "A": "There are {6} bubbles with values below the average size."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual clutter caused by overlapping labels in the bubble chart, sample the labels and list the top 2 labels recommended for removal.",
            "A": "The top 2 labels recommended for removal to reduce label overlap are: {Pop-up Shops}, {Physical Stores}."
        }
    ]
}