{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category ABC Analysis in this treemap?",
            "A": "There are {2} child rectangles under the category ABC Analysis."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Supply Chain}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Genetic Algorithm}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Supply Chain}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Containerization rectangle in this treemap?",
            "A": "The value of the Containerization rectangle is {5.17}."
        },
        {
            "Q": "What is the value of the Supply Chain rectangle in this treemap?",
            "A": "The value of the Supply Chain rectangle is {100.0}."
        },
        {
            "Q": "What is the value of the Intermodal rectangle in this treemap?",
            "A": "The value of the Intermodal rectangle is {14.4}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.13}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Ant Colony and Velocity Profiling?",
            "A": "The difference between Ant Colony and Velocity Profiling is {2.23}."
        },
        {
            "Q": "What is the sum of the regions of TMS Integration and RFID Tracking?",
            "A": "The sum of TMS Integration and RFID Tracking is {42.32}."
        }
    ],
    "NF": [
        {
            "Q": "Under the ABC Analysis category in the treemap, which rectangular labels have a value exceeded 22.13? Please list the labels and values.",
            "A": "{Pareto Thresholds} has {26.80}"
        },
        {
            "Q": "Under the ABC Analysis category in the treemap, which rectangular labels have a value below 12.78? Please list the labels and values.",
            "A": "{Velocity Profiling} has {8.11}"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Logistics, Inventory Control, or Warehouse Design?",
            "A": "The value of {Warehouse Design} is smaller."
        },
        {
            "Q": "Which is larger, the value of Inventory Control or Slotting Algorithms?",
            "A": "The value of {Inventory Control} is larger."
        },
        {
            "Q": "Which is larger, the value of Supply Chain or Logistics?",
            "A": "The value of {Supply Chain} is larger."
        },
        {
            "Q": "Which is larger, the value of Supply Chain, Logistics, or Inventory Control?",
            "A": "The value of {Supply Chain} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {8} leaf nodes below the global average."
        }
    ],
    "VA": []
}