{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Gallery Shows in this treemap?",
            "A": "There are {2} child rectangles under the category Gallery Shows."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Cultural Activities}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Investment Grade}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Cultural Activities}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Emerging Artists rectangle in this treemap?",
            "A": "The value of the Emerging Artists rectangle is {6.77}."
        },
        {
            "Q": "What is the value of the Cultural Activities rectangle in this treemap?",
            "A": "The value of the Cultural Activities rectangle is {62.97}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {62.97}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.11}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Art Exhibitions and Experimental?",
            "A": "The difference between Art Exhibitions and Experimental is {29.71}."
        },
        {
            "Q": "What is the sum of the regions of Primary Market and Solo Exhibitions?",
            "A": "The sum of Primary Market and Solo Exhibitions is {14.01}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Gallery Shows category in the treemap, which rectangular labels have a value exceeded 5.50? Please list the labels and values.",
            "A": "{Solo Exhibitions} has {5.55}"
        },
        {
            "Q": "Under the Gallery Shows category in the treemap, which rectangular labels have a value below 5.38? Please list the labels and values.",
            "A": "{Group Exhibitions} has {5.33}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Cultural Activities or Artwork Sales?",
            "A": "The value of {Cultural Activities} is larger."
        },
        {
            "Q": "Which is larger, the value of Art Exhibitions or Public Art?",
            "A": "The value of {Art Exhibitions} is larger."
        },
        {
            "Q": "Which is smaller, the value of Artwork Sales, Art Exhibitions, or Secondary Market?",
            "A": "The value of {Secondary Market} is smaller."
        },
        {
            "Q": "Which is larger, the value of Cultural Activities, Artwork Sales, or Art Exhibitions?",
            "A": "The value of {Cultural Activities} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {11} leaf nodes below the global average."
        }
    ],
    "VA": []
}