{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Cultural Activities in this treemap?",
            "A": "There are {2} child rectangles under the category Cultural Activities."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Artwork Sales}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Auction Houses}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Artwork Sales}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Art Exhibitions rectangle in this treemap?",
            "A": "The value of the Art Exhibitions rectangle is {6.32}."
        },
        {
            "Q": "What is the value of the Auction Houses rectangle in this treemap?",
            "A": "The value of the Auction Houses rectangle is {6.05}."
        },
        {
            "Q": "What is the value of the Artwork Sales rectangle in this treemap?",
            "A": "The value of the Artwork Sales rectangle is {86.42}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {86.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {6.05}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Contemporary and Regional?",
            "A": "The difference between Contemporary and Regional is {28.04}."
        },
        {
            "Q": "What is the sum of the regions of Traditional and Public Art?",
            "A": "The sum of Traditional and Public Art is {23.16}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Cultural Activities category in the treemap, which rectangular labels have a value exceeded 7.02? Please list the labels and values.",
            "A": "{Public Art} has {7.26}"
        },
        {
            "Q": "Under the Cultural Activities category in the treemap, which rectangular labels have a value below 6.56? Please list the labels and values.",
            "A": "{Art Exhibitions} has {6.32}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Artwork Sales, Primary Market, or Galleries?",
            "A": "The value of {Artwork Sales} is larger."
        },
        {
            "Q": "Which is smaller, the value of Primary Market, Galleries, or Contemporary?",
            "A": "The value of {Contemporary} is smaller."
        },
        {
            "Q": "Which is larger, the value of Galleries or Art Fairs?",
            "A": "The value of {Galleries} is larger."
        },
        {
            "Q": "Which is larger, the value of Artwork Sales or Primary Market?",
            "A": "The value of {Artwork Sales} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {7} leaf nodes below the global average."
        }
    ],
    "VA": []
}