{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Cultural Activities in this treemap?",
            "A": "There are {2} child rectangles under the category Cultural Activities."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Artwork Sales}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Galleries}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Artwork Sales}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Public Art rectangle in this treemap?",
            "A": "The value of the Public Art rectangle is {16.25}."
        },
        {
            "Q": "What is the value of the Cultural Activities rectangle in this treemap?",
            "A": "The value of the Cultural Activities rectangle is {23.6}."
        },
        {
            "Q": "What is the value of the Art Exhibitions rectangle in this treemap?",
            "A": "The value of the Art Exhibitions rectangle is {7.35}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {76.4}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {6.51}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Art Fairs and Cultural Activities?",
            "A": "The difference between Art Fairs and Cultural Activities is {2.55}."
        },
        {
            "Q": "What is the sum of the regions of Artwork Sales and Public Art?",
            "A": "The sum of Artwork Sales and Public Art is {92.65}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Cultural Activities category in the treemap, which rectangular labels have a value exceeded 14.02? Please list the labels and values.",
            "A": "{Public Art} has {16.25}"
        },
        {
            "Q": "Under the Cultural Activities category in the treemap, which rectangular labels have a value below 9.57? Please list the labels and values.",
            "A": "{Art Exhibitions} has {7.35}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Artwork Sales, Secondary Market, or Auction Houses?",
            "A": "The value of {Artwork Sales} is larger."
        },
        {
            "Q": "Which is larger, the value of Auction Houses or Cultural Activities?",
            "A": "The value of {Auction Houses} is larger."
        },
        {
            "Q": "Which is smaller, the value of Secondary Market, Auction Houses, or Primary Market?",
            "A": "The value of {Primary Market} is smaller."
        },
        {
            "Q": "Which is larger, the value of Artwork Sales or Secondary Market?",
            "A": "The value of {Artwork Sales} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {9} leaf nodes below the global average."
        }
    ],
    "VA": []
}