{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Learning Systems in this treemap?",
            "A": "There are {2} child rectangles under the category Learning Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Learning Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {LoRa Modules}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Learning Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Blockchain Issuance rectangle in this treemap?",
            "A": "The value of the Blockchain Issuance rectangle is {36.73}."
        },
        {
            "Q": "What is the value of the Collaborative Tools rectangle in this treemap?",
            "A": "The value of the Collaborative Tools rectangle is {8.45}."
        },
        {
            "Q": "What is the value of the Experiential rectangle in this treemap?",
            "A": "The value of the Experiential rectangle is {21.1}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.17}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Blockchain Issuance and Edge Computing?",
            "A": "The difference between Blockchain Issuance and Edge Computing is {31.45}."
        },
        {
            "Q": "What is the sum of the regions of Decentralized IDs and VR Environments?",
            "A": "The sum of Decentralized IDs and VR Environments is {14.56}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Learning Systems category in the treemap, which rectangular labels have a value exceeded 64.45? Please list the labels and values.",
            "A": "{Pedagogy} has {78.90}"
        },
        {
            "Q": "Under the Learning Systems category in the treemap, which rectangular labels have a value below 35.55? Please list the labels and values.",
            "A": "{Experiential} has {21.10}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Learning Systems or Pedagogy?",
            "A": "The value of {Learning Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Pedagogy, Active Learning, or Competency-Based?",
            "A": "The value of {Competency-Based} is smaller."
        },
        {
            "Q": "Which is larger, the value of Learning Systems, Pedagogy, or Active Learning?",
            "A": "The value of {Learning Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Active Learning or Micro-Credentials?",
            "A": "The value of {Active Learning} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {7} leaf nodes below the global average."
        }
    ],
    "VA": []
}