{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Learning Systems in this treemap?",
            "A": "There are {2} child rectangles under the category Learning Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Learning Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Active Learning}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Learning Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Competency-Based rectangle in this treemap?",
            "A": "The value of the Competency-Based rectangle is {18.88}."
        },
        {
            "Q": "What is the value of the Mobile Sensing rectangle in this treemap?",
            "A": "The value of the Mobile Sensing rectangle is {49.73}."
        },
        {
            "Q": "What is the value of the Edge Computing rectangle in this treemap?",
            "A": "The value of the Edge Computing rectangle is {42.41}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.27}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Micro-Credentials and Lab Simulations?",
            "A": "The difference between Micro-Credentials and Lab Simulations is {7.24}."
        },
        {
            "Q": "What is the sum of the regions of Experiential and AR Labs?",
            "A": "The sum of Experiential and AR Labs is {85.21}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Learning Systems category in the treemap, which rectangular labels have a value exceeded 62.92? Please list the labels and values.",
            "A": "{Experiential} has {75.85}"
        },
        {
            "Q": "Under the Learning Systems category in the treemap, which rectangular labels have a value below 37.07? Please list the labels and values.",
            "A": "{Pedagogy} has {24.15}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Learning Systems, Experiential, or Fieldwork Tech?",
            "A": "The value of {Learning Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Learning Systems or Experiential?",
            "A": "The value of {Learning Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Experiential, Fieldwork Tech, or Mobile Sensing?",
            "A": "The value of {Mobile Sensing} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {7} leaf nodes below the global average."
        }
    ],
    "VA": []
}