{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Learning Systems in this treemap?",
            "A": "There are {2} child rectangles under the category Learning Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Learning Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Collaborative Tools}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Learning Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Learning Systems rectangle in this treemap?",
            "A": "The value of the Learning Systems rectangle is {100.0}."
        },
        {
            "Q": "What is the value of the Cloud Anchoring rectangle in this treemap?",
            "A": "The value of the Cloud Anchoring rectangle is {9.73}."
        },
        {
            "Q": "What is the value of the IoT Kits rectangle in this treemap?",
            "A": "The value of the IoT Kits rectangle is {8.07}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.18}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Flipped Classroom and Cloud Anchoring?",
            "A": "The difference between Flipped Classroom and Cloud Anchoring is {3.45}."
        },
        {
            "Q": "What is the sum of the regions of AR Labs and Motion Capture?",
            "A": "The sum of AR Labs and Motion Capture is {29.78}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Learning Systems category in the treemap, which rectangular labels have a value exceeded 52.92? Please list the labels and values.",
            "A": "{Pedagogy} has {55.84}"
        },
        {
            "Q": "Under the Learning Systems category in the treemap, which rectangular labels have a value below 47.08? Please list the labels and values.",
            "A": "{Experiential} has {44.16}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Learning Systems, Pedagogy, or Competency-Based?",
            "A": "The value of {Learning Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Learning Systems or Pedagogy?",
            "A": "The value of {Learning Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Pedagogy, Competency-Based, or Micro-Credentials?",
            "A": "The value of {Micro-Credentials} is smaller."
        },
        {
            "Q": "Which is larger, the value of Competency-Based or Blockchain Issuance?",
            "A": "The value of {Competency-Based} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {8} leaf nodes below the global average."
        }
    ],
    "VA": []
}