{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Depth Control in this treemap?",
            "A": "There are {2} child rectangles under the category Depth Control."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Crop Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Brass Alloy}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Crop Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Drip Networks rectangle in this treemap?",
            "A": "The value of the Drip Networks rectangle is {23.16}."
        },
        {
            "Q": "What is the value of the Flow Calibration rectangle in this treemap?",
            "A": "The value of the Flow Calibration rectangle is {5.73}."
        },
        {
            "Q": "What is the value of the Sprinkler Types rectangle in this treemap?",
            "A": "The value of the Sprinkler Types rectangle is {10.45}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.15}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Pressure Compensating and Venturi Injectors?",
            "A": "The difference between Pressure Compensating and Venturi Injectors is {9.92}."
        },
        {
            "Q": "What is the sum of the regions of Brass Alloy and Valve Types?",
            "A": "The sum of Brass Alloy and Valve Types is {20.0}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Depth Control category in the treemap, which rectangular labels have a value exceeded 19.94? Please list the labels and values.",
            "A": "{Parallel Linkages} has {20.74}"
        },
        {
            "Q": "Under the Depth Control category in the treemap, which rectangular labels have a value below 18.35? Please list the labels and values.",
            "A": "{Pressure Sensors} has {17.56}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Irrigation Tech or Row Units?",
            "A": "The value of {Irrigation Tech} is larger."
        },
        {
            "Q": "Which is smaller, the value of Precision Planting, Irrigation Tech, or Seeders?",
            "A": "The value of {Seeders} is smaller."
        },
        {
            "Q": "Which is larger, the value of Crop Systems or Precision Planting?",
            "A": "The value of {Crop Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Crop Systems, Precision Planting, or Irrigation Tech?",
            "A": "The value of {Crop Systems} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {10} leaf nodes below the global average."
        }
    ],
    "VA": []
}