{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Wind Turbines in this treemap?",
            "A": "There are {1} child rectangles under the category Wind Turbines."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Power Generation}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Aerodynamic Testing}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Power Generation}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Solar Arrays rectangle in this treemap?",
            "A": "The value of the Solar Arrays rectangle is {14.34}."
        },
        {
            "Q": "What is the value of the Composite Materials rectangle in this treemap?",
            "A": "The value of the Composite Materials rectangle is {5.54}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.54}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Pressurized Water and Single-Axis?",
            "A": "The difference between Pressurized Water and Single-Axis is {64.98}."
        },
        {
            "Q": "What is the sum of the regions of Aerodynamic Testing and Azimuth Control?",
            "A": "The sum of Aerodynamic Testing and Azimuth Control is {11.1}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Wind Turbines category in the treemap, which rectangular labels have a value exceeded 5.53? Please list the labels and values.",
            "A": "{Blade Design} has {5.54}"
        },
        {
            "Q": "Under the Wind Turbines category in the treemap, which rectangular labels have a value below 5.55? Please list the labels and values.",
            "A": "{Blade Design} has {5.54}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Reactor Types or Coolant Systems?",
            "A": "The value of {Reactor Types} is larger."
        },
        {
            "Q": "Which is larger, the value of Power Generation, Nuclear Plants, or Reactor Types?",
            "A": "The value of {Power Generation} is larger."
        },
        {
            "Q": "Which is larger, the value of Power Generation or Nuclear Plants?",
            "A": "The value of {Power Generation} is larger."
        },
        {
            "Q": "Which is smaller, the value of Nuclear Plants, Reactor Types, or Pressurized Water?",
            "A": "The value of {Pressurized Water} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {5} leaf nodes below the global average."
        }
    ],
    "VA": []
}