{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Depth Control in this treemap?",
            "A": "There are {2} child rectangles under the category Depth Control."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Crop Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Silicone Diaphragms}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Crop Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Parallel Linkages rectangle in this treemap?",
            "A": "The value of the Parallel Linkages rectangle is {5.76}."
        },
        {
            "Q": "What is the value of the Drip Networks rectangle in this treemap?",
            "A": "The value of the Drip Networks rectangle is {5.62}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.62}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Control Modules and Ceramic Coatings?",
            "A": "The difference between Control Modules and Ceramic Coatings is {2.2}."
        },
        {
            "Q": "What is the sum of the regions of Crop Systems and Parallel Linkages?",
            "A": "The sum of Crop Systems and Parallel Linkages is {105.76}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Depth Control category in the treemap, which rectangular labels have a value exceeded 10.49? Please list the labels and values.",
            "A": "{Pressure Sensors} has {12.07}"
        },
        {
            "Q": "Under the Depth Control category in the treemap, which rectangular labels have a value below 7.34? Please list the labels and values.",
            "A": "{Parallel Linkages} has {5.76}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Fertigation Systems or Venturi Injectors?",
            "A": "The value of {Fertigation Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Crop Systems, Precision Planting, or Fertigation Systems?",
            "A": "The value of {Crop Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Crop Systems or Precision Planting?",
            "A": "The value of {Crop Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Precision Planting, Fertigation Systems, or Dosing Mechanisms?",
            "A": "The value of {Dosing Mechanisms} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {6} leaf nodes below the global average."
        }
    ],
    "VA": []
}