{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Thermal Systems in this treemap?",
            "A": "There are {2} child rectangles under the category Thermal Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Packaging Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Compressor Types}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Packaging Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Packaging Systems rectangle in this treemap?",
            "A": "The value of the Packaging Systems rectangle is {50.85}."
        },
        {
            "Q": "What is the value of the Condensation Traps rectangle in this treemap?",
            "A": "The value of the Condensation Traps rectangle is {5.66}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {50.85}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.32}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Pneumatic Valves and Compressor Types?",
            "A": "The difference between Pneumatic Valves and Compressor Types is {2.28}."
        },
        {
            "Q": "What is the sum of the regions of Blast Chillers and H2O2 Sterilization?",
            "A": "The sum of Blast Chillers and H2O2 Sterilization is {18.3}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Thermal Systems category in the treemap, which rectangular labels have a value exceeded 34.20? Please list the labels and values.",
            "A": "{Retort Machines} has {43.83}"
        },
        {
            "Q": "Under the Thermal Systems category in the treemap, which rectangular labels have a value below 14.95? Please list the labels and values.",
            "A": "{Blast Chillers} has {5.32}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Packaging Systems or Processing Lines?",
            "A": "The value of {Packaging Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Thermal Systems or Filling Machines?",
            "A": "The value of {Thermal Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Processing Lines, Thermal Systems, or Retort Machines?",
            "A": "The value of {Retort Machines} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {9} leaf nodes below the global average."
        }
    ],
    "VA": []
}