{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Aseptic Sealers in this treemap?",
            "A": "There are {1} child rectangles under the category Aseptic Sealers."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Processing Lines}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Scroll Compressors}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Processing Lines}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Heat Exchangers rectangle in this treemap?",
            "A": "The value of the Heat Exchangers rectangle is {49.0}."
        },
        {
            "Q": "What is the value of the Sealing Equipment rectangle in this treemap?",
            "A": "The value of the Sealing Equipment rectangle is {7.55}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {84.41}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.09}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Heat Exchangers and Laser-Welded?",
            "A": "The difference between Heat Exchangers and Laser-Welded is {28.0}."
        },
        {
            "Q": "What is the sum of the regions of Digital Manometers and Control Units?",
            "A": "The sum of Digital Manometers and Control Units is {23.72}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Aseptic Sealers category in the treemap, which rectangular labels have a value exceeded 7.54? Please list the labels and values.",
            "A": "{H2O2 Sterilization} has {7.55}"
        },
        {
            "Q": "Under the Aseptic Sealers category in the treemap, which rectangular labels have a value below 7.56? Please list the labels and values.",
            "A": "{H2O2 Sterilization} has {7.55}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Retort Machines or Plate Designs?",
            "A": "The value of {Retort Machines} is larger."
        },
        {
            "Q": "Which is larger, the value of Processing Lines or Thermal Systems?",
            "A": "The value of {Processing Lines} is larger."
        },
        {
            "Q": "Which is smaller, the value of Thermal Systems, Retort Machines, or Heat Exchangers?",
            "A": "The value of {Heat Exchangers} is smaller."
        },
        {
            "Q": "Which is larger, the value of Processing Lines, Thermal Systems, or Retort Machines?",
            "A": "The value of {Processing Lines} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {7} leaf nodes below the global average."
        }
    ],
    "VA": []
}