{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Aseptic Sealers in this treemap?",
            "A": "There are {1} child rectangles under the category Aseptic Sealers."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Packaging Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Filling Machines}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Packaging Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Vapor Control rectangle in this treemap?",
            "A": "The value of the Vapor Control rectangle is {86.39}."
        },
        {
            "Q": "What is the value of the Aseptic Sealers rectangle in this treemap?",
            "A": "The value of the Aseptic Sealers rectangle is {86.39}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {92.97}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {6.58}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Filling Machines and Aseptic Sealers?",
            "A": "The difference between Filling Machines and Aseptic Sealers is {79.81}."
        },
        {
            "Q": "What is the sum of the regions of Thermal Systems and Packaging Systems?",
            "A": "The sum of Thermal Systems and Packaging Systems is {100.0}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Aseptic Sealers category in the treemap, which rectangular labels have a value exceeded 86.38? Please list the labels and values.",
            "A": "{H2O2 Sterilization} has {86.39}"
        },
        {
            "Q": "Under the Aseptic Sealers category in the treemap, which rectangular labels have a value below 86.40? Please list the labels and values.",
            "A": "{H2O2 Sterilization} has {86.39}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Aseptic Sealers or Vapor Control?",
            "A": "The value of {Aseptic Sealers} is larger."
        },
        {
            "Q": "Which is larger, the value of Packaging Systems or Sealing Equipment?",
            "A": "The value of {Packaging Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Packaging Systems, Sealing Equipment, or Aseptic Sealers?",
            "A": "The value of {Packaging Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Sealing Equipment, Aseptic Sealers, or H2O2 Sterilization?",
            "A": "The value of {H2O2 Sterilization} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {3} leaf nodes below the global average."
        }
    ],
    "VA": []
}