{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Thermal Systems in this treemap?",
            "A": "There are {2} child rectangles under the category Thermal Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Processing Lines}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Gasket Sealed}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Processing Lines}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Processing Lines rectangle in this treemap?",
            "A": "The value of the Processing Lines rectangle is {90.77}."
        },
        {
            "Q": "What is the value of the Retort Machines rectangle in this treemap?",
            "A": "The value of the Retort Machines rectangle is {32.14}."
        },
        {
            "Q": "What is the value of the Plate Designs rectangle in this treemap?",
            "A": "The value of the Plate Designs rectangle is {22.93}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {90.77}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {8.86}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Pressure Regulation and Laser-Welded?",
            "A": "The difference between Pressure Regulation and Laser-Welded is {4.86}."
        },
        {
            "Q": "What is the sum of the regions of Heat Exchangers and Compressor Types?",
            "A": "The sum of Heat Exchangers and Compressor Types is {81.56}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Thermal Systems category in the treemap, which rectangular labels have a value exceeded 52.01? Please list the labels and values.",
            "A": "{Blast Chillers} has {58.63}"
        },
        {
            "Q": "Under the Thermal Systems category in the treemap, which rectangular labels have a value below 38.76? Please list the labels and values.",
            "A": "{Retort Machines} has {32.14}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Processing Lines, Thermal Systems, or Blast Chillers?",
            "A": "The value of {Processing Lines} is larger."
        },
        {
            "Q": "Which is smaller, the value of Thermal Systems, Blast Chillers, or Refrigeration Circuits?",
            "A": "The value of {Refrigeration Circuits} is smaller."
        },
        {
            "Q": "Which is larger, the value of Blast Chillers or Compressor Types?",
            "A": "The value of {Blast Chillers} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {6} leaf nodes below the global average."
        }
    ],
    "VA": []
}