{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Thermal Systems in this treemap?",
            "A": "There are {2} child rectangles under the category Thermal Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Packaging Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Pneumatic Valves}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Packaging Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Volumetric rectangle in this treemap?",
            "A": "The value of the Volumetric rectangle is {8.2}."
        },
        {
            "Q": "What is the value of the Laser-Welded rectangle in this treemap?",
            "A": "The value of the Laser-Welded rectangle is {5.35}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {56.96}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.27}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Load Cells and Condensation Traps?",
            "A": "The difference between Load Cells and Condensation Traps is {7.74}."
        },
        {
            "Q": "What is the sum of the regions of Thermal Systems and Plate Designs?",
            "A": "The sum of Thermal Systems and Plate Designs is {64.47}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Thermal Systems category in the treemap, which rectangular labels have a value exceeded 28.28? Please list the labels and values.",
            "A": "{Retort Machines} has {35.03}"
        },
        {
            "Q": "Under the Thermal Systems category in the treemap, which rectangular labels have a value below 14.76? Please list the labels and values.",
            "A": "{Blast Chillers} has {8.01}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Packaging Systems or Processing Lines?",
            "A": "The value of {Packaging Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Packaging Systems, Processing Lines, or Thermal Systems?",
            "A": "The value of {Packaging Systems} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {9} leaf nodes below the global average."
        }
    ],
    "VA": []
}