{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Thermal Systems in this treemap?",
            "A": "There are {2} child rectangles under the category Thermal Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Processing Lines}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Auto-Zeroing}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Processing Lines}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Blast Chillers rectangle in this treemap?",
            "A": "The value of the Blast Chillers rectangle is {32.56}."
        },
        {
            "Q": "What is the value of the Filling Machines rectangle in this treemap?",
            "A": "The value of the Filling Machines rectangle is {19.5}."
        },
        {
            "Q": "What is the value of the Screw Compressors rectangle in this treemap?",
            "A": "The value of the Screw Compressors rectangle is {15.92}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {61.16}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.06}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Digital Manometers and Blast Chillers?",
            "A": "The difference between Digital Manometers and Blast Chillers is {23.07}."
        },
        {
            "Q": "What is the sum of the regions of Pneumatic Valves and Condensation Traps?",
            "A": "The sum of Pneumatic Valves and Condensation Traps is {23.09}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Thermal Systems category in the treemap, which rectangular labels have a value exceeded 31.57? Please list the labels and values.",
            "A": "{Blast Chillers} has {32.56}"
        },
        {
            "Q": "Under the Thermal Systems category in the treemap, which rectangular labels have a value below 29.59? Please list the labels and values.",
            "A": "{Retort Machines} has {28.60}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Processing Lines or Thermal Systems?",
            "A": "The value of {Processing Lines} is larger."
        },
        {
            "Q": "Which is larger, the value of Packaging Systems or Refrigeration Circuits?",
            "A": "The value of {Packaging Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Thermal Systems, Packaging Systems, or Blast Chillers?",
            "A": "The value of {Blast Chillers} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {10} leaf nodes below the global average."
        }
    ],
    "VA": []
}