{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Force Feedback in this treemap?",
            "A": "There are {1} child rectangles under the category Force Feedback."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Medical Tech}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Attention Gates}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Medical Tech}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Reconstruction rectangle in this treemap?",
            "A": "The value of the Reconstruction rectangle is {33.21}."
        },
        {
            "Q": "What is the value of the MAP-EM rectangle in this treemap?",
            "A": "The value of the MAP-EM rectangle is {8.19}."
        },
        {
            "Q": "What is the value of the U-Net Variants rectangle in this treemap?",
            "A": "The value of the U-Net Variants rectangle is {6.97}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {6.12}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Passivity Control and Haptic Control?",
            "A": "The difference between Passivity Control and Haptic Control is {22.14}."
        },
        {
            "Q": "What is the sum of the regions of Bilateral Teleoperation and Pulse Sequences?",
            "A": "The sum of Bilateral Teleoperation and Pulse Sequences is {66.79}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Force Feedback category in the treemap, which rectangular labels have a value exceeded 58.86? Please list the labels and values.",
            "A": "{Bilateral Teleoperation} has {58.87}"
        },
        {
            "Q": "Under the Force Feedback category in the treemap, which rectangular labels have a value below 58.88? Please list the labels and values.",
            "A": "{Bilateral Teleoperation} has {58.87}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Medical Tech or Robotic Surgery?",
            "A": "The value of {Medical Tech} is larger."
        },
        {
            "Q": "Which is smaller, the value of Robotic Surgery, Haptic Control, or Force Feedback?",
            "A": "The value of {Force Feedback} is smaller."
        },
        {
            "Q": "Which is larger, the value of Haptic Control or Bilateral Teleoperation?",
            "A": "The value of {Haptic Control} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {6} leaf nodes below the global average."
        }
    ],
    "VA": []
}