{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Fertigation Systems in this treemap?",
            "A": "There are {1} child rectangles under the category Fertigation Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Crop Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Nozzle Plates}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Crop Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Drip Networks rectangle in this treemap?",
            "A": "The value of the Drip Networks rectangle is {53.91}."
        },
        {
            "Q": "What is the value of the Parallel Linkages rectangle in this treemap?",
            "A": "The value of the Parallel Linkages rectangle is {19.13}."
        },
        {
            "Q": "What is the value of the Valve Types rectangle in this treemap?",
            "A": "The value of the Valve Types rectangle is {7.5}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.01}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Laser-Drilled Orifices and Parallel Linkages?",
            "A": "The difference between Laser-Drilled Orifices and Parallel Linkages is {26.92}."
        },
        {
            "Q": "What is the sum of the regions of Precision Planting and Fertigation Systems?",
            "A": "The sum of Precision Planting and Fertigation Systems is {41.84}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Fertigation Systems category in the treemap, which rectangular labels have a value exceeded 8.25? Please list the labels and values.",
            "A": "{Dosing Mechanisms} has {8.26}"
        },
        {
            "Q": "Under the Fertigation Systems category in the treemap, which rectangular labels have a value below 8.27? Please list the labels and values.",
            "A": "{Dosing Mechanisms} has {8.26}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Drip Networks or Pressure Compensating?",
            "A": "The value of {Drip Networks} is larger."
        },
        {
            "Q": "Which is larger, the value of Crop Systems, Irrigation Tech, or Drip Networks?",
            "A": "The value of {Crop Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Crop Systems or Irrigation Tech?",
            "A": "The value of {Crop Systems} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {6} leaf nodes below the global average."
        }
    ],
    "VA": []
}