{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Contrast Weighting in this treemap?",
            "A": "There are {2} child rectangles under the category Contrast Weighting."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Medical Tech}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {U-Net Variants}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Medical Tech}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the MRI Machines rectangle in this treemap?",
            "A": "The value of the MRI Machines rectangle is {51.23}."
        },
        {
            "Q": "What is the value of the Robotic Surgery rectangle in this treemap?",
            "A": "The value of the Robotic Surgery rectangle is {25.03}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.4}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Attention Gates and Contrast Weighting?",
            "A": "The difference between Attention Gates and Contrast Weighting is {34.49}."
        },
        {
            "Q": "What is the sum of the regions of Robotic Surgery and MRI Machines?",
            "A": "The sum of Robotic Surgery and MRI Machines is {76.26}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Contrast Weighting category in the treemap, which rectangular labels have a value exceeded 25.07? Please list the labels and values.",
            "A": "{T1 Mapping} has {27.89}"
        },
        {
            "Q": "Under the Contrast Weighting category in the treemap, which rectangular labels have a value below 19.42? Please list the labels and values.",
            "A": "{T2 Relaxometry} has {16.60}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of MRI Machines or Spin Echo?",
            "A": "The value of {MRI Machines} is larger."
        },
        {
            "Q": "Which is smaller, the value of Imaging Systems, MRI Machines, or Pulse Sequences?",
            "A": "The value of {Pulse Sequences} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {8} leaf nodes below the global average."
        }
    ],
    "VA": []
}