{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category nan in this treemap?",
            "A": "There are {1} child rectangles under the category nan."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Talent Development}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {k-Anonymity}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Talent Development}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Differential Privacy rectangle in this treemap?",
            "A": "The value of the Differential Privacy rectangle is {75.39}."
        },
        {
            "Q": "What is the value of the Competency Models rectangle in this treemap?",
            "A": "The value of the Competency Models rectangle is {90.23}."
        },
        {
            "Q": "What is the value of the Talent Development rectangle in this treemap?",
            "A": "The value of the Talent Development rectangle is {100.0}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.09}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Talent Development and Career Pathing?",
            "A": "The difference between Talent Development and Career Pathing is {90.23}."
        },
        {
            "Q": "What is the sum of the regions of Peer Evaluation and AI Assessment?",
            "A": "The sum of Peer Evaluation and AI Assessment is {90.23}."
        }
    ],
    "NF": [
        {
            "Q": "Under the nan category in the treemap, which rectangular labels have a value exceeded 99.99? Please list the labels and values.",
            "A": "{Talent Development} has {100.00}"
        },
        {
            "Q": "Under the nan category in the treemap, which rectangular labels have a value below 100.01? Please list the labels and values.",
            "A": "{Talent Development} has {100.00}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of 360 Feedback or Anonymization?",
            "A": "The value of {360 Feedback} is larger."
        },
        {
            "Q": "Which is larger, the value of Talent Development, Competency Models, or 360 Feedback?",
            "A": "The value of {Talent Development} is larger."
        },
        {
            "Q": "Which is smaller, the value of Competency Models, 360 Feedback, or Peer Evaluation?",
            "A": "The value of {Peer Evaluation} is smaller."
        },
        {
            "Q": "Which is larger, the value of Talent Development or Competency Models?",
            "A": "The value of {Talent Development} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {3} leaf nodes below the global average."
        }
    ],
    "VA": []
}