{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Graph Databases in this treemap?",
            "A": "There are {1} child rectangles under the category Graph Databases."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Talent Development}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Path Algorithms}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Talent Development}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Competency Models rectangle in this treemap?",
            "A": "The value of the Competency Models rectangle is {57.49}."
        },
        {
            "Q": "What is the value of the Succession Planning rectangle in this treemap?",
            "A": "The value of the Succession Planning rectangle is {20.16}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {7.84}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Stress Testing and Succession Planning?",
            "A": "The difference between Stress Testing and Succession Planning is {6.81}."
        },
        {
            "Q": "What is the sum of the regions of Skill Mapping and Graph Databases?",
            "A": "The sum of Skill Mapping and Graph Databases is {29.76}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Graph Databases category in the treemap, which rectangular labels have a value exceeded 20.15? Please list the labels and values.",
            "A": "{Neo4j Queries} has {20.16}"
        },
        {
            "Q": "Under the Graph Databases category in the treemap, which rectangular labels have a value below 20.17? Please list the labels and values.",
            "A": "{Neo4j Queries} has {20.16}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of 360 Feedback or Anonymization?",
            "A": "The value of {360 Feedback} is larger."
        },
        {
            "Q": "Which is larger, the value of Talent Development or Competency Models?",
            "A": "The value of {Talent Development} is larger."
        },
        {
            "Q": "Which is larger, the value of Talent Development, Competency Models, or 360 Feedback?",
            "A": "The value of {Talent Development} is larger."
        },
        {
            "Q": "Which is smaller, the value of Competency Models, 360 Feedback, or Peer Evaluation?",
            "A": "The value of {Peer Evaluation} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {7} leaf nodes below the global average."
        }
    ],
    "VA": []
}