{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category nan in this treemap?",
            "A": "There are {1} child rectangles under the category nan."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Valuation Models}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Moran's I Test}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Valuation Models}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Weighted Polygons rectangle in this treemap?",
            "A": "The value of the Weighted Polygons rectangle is {5.98}."
        },
        {
            "Q": "What is the value of the POI Analysis rectangle in this treemap?",
            "A": "The value of the POI Analysis rectangle is {8.17}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.32}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of POI Analysis and Heatmap Layers?",
            "A": "The difference between POI Analysis and Heatmap Layers is {0.87}."
        },
        {
            "Q": "What is the sum of the regions of Voronoi Diagrams and Weighted Polygons?",
            "A": "The sum of Voronoi Diagrams and Weighted Polygons is {21.47}."
        }
    ],
    "NF": [
        {
            "Q": "Under the nan category in the treemap, which rectangular labels have a value exceeded 99.99? Please list the labels and values.",
            "A": "{Valuation Models} has {100.00}"
        },
        {
            "Q": "Under the nan category in the treemap, which rectangular labels have a value below 100.01? Please list the labels and values.",
            "A": "{Valuation Models} has {100.00}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Valuation Models, Hedonic Pricing, or Crime Statistics?",
            "A": "The value of {Valuation Models} is larger."
        },
        {
            "Q": "Which is larger, the value of Crime Statistics or Getis-Ord Gi*?",
            "A": "The value of {Crime Statistics} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {7} leaf nodes below the global average."
        }
    ],
    "VA": []
}