{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Heatmap Layers in this treemap?",
            "A": "There are {2} child rectangles under the category Heatmap Layers."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Valuation Models}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {POI Analysis}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Valuation Models}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Geospatial Regression rectangle in this treemap?",
            "A": "The value of the Geospatial Regression rectangle is {21.35}."
        },
        {
            "Q": "What is the value of the School Districts rectangle in this treemap?",
            "A": "The value of the School Districts rectangle is {8.93}."
        },
        {
            "Q": "What is the value of the Voronoi Diagrams rectangle in this treemap?",
            "A": "The value of the Voronoi Diagrams rectangle is {8.93}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.06}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Queen Contiguity and Spatial Lag?",
            "A": "The difference between Queen Contiguity and Spatial Lag is {9.27}."
        },
        {
            "Q": "What is the sum of the regions of Z-Score Clustering and Hotspot Analysis?",
            "A": "The sum of Z-Score Clustering and Hotspot Analysis is {25.86}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Heatmap Layers category in the treemap, which rectangular labels have a value exceeded 25.10? Please list the labels and values.",
            "A": "{Kernel Density} has {27.73}"
        },
        {
            "Q": "Under the Heatmap Layers category in the treemap, which rectangular labels have a value below 19.83? Please list the labels and values.",
            "A": "{Hexagonal Binning} has {17.20}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Valuation Models, Hedonic Pricing, or Spatial Features?",
            "A": "The value of {Valuation Models} is larger."
        },
        {
            "Q": "Which is smaller, the value of Hedonic Pricing, Spatial Features, or GIS Integration?",
            "A": "The value of {GIS Integration} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {7} leaf nodes below the global average."
        }
    ],
    "VA": []
}