{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Heatmap Layers in this treemap?",
            "A": "There are {2} child rectangles under the category Heatmap Layers."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Valuation Models}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Crime Statistics}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Valuation Models}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Catchment Areas rectangle in this treemap?",
            "A": "The value of the Catchment Areas rectangle is {35.2}."
        },
        {
            "Q": "What is the value of the Spatial Lag rectangle in this treemap?",
            "A": "The value of the Spatial Lag rectangle is {36.28}."
        },
        {
            "Q": "What is the value of the Amenity Scoring rectangle in this treemap?",
            "A": "The value of the Amenity Scoring rectangle is {43.47}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.57}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Geospatial Regression and Crime Statistics?",
            "A": "The difference between Geospatial Regression and Crime Statistics is {30.71}."
        },
        {
            "Q": "What is the sum of the regions of Moran's I Test and Amenity Scoring?",
            "A": "The sum of Moran's I Test and Amenity Scoring is {53.48}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Heatmap Layers category in the treemap, which rectangular labels have a value exceeded 7.89? Please list the labels and values.",
            "A": "{Hexagonal Binning} has {8.44}"
        },
        {
            "Q": "Under the Heatmap Layers category in the treemap, which rectangular labels have a value below 6.79? Please list the labels and values.",
            "A": "{Kernel Density} has {6.24}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Valuation Models or Hedonic Pricing?",
            "A": "The value of {Valuation Models} is larger."
        },
        {
            "Q": "Which is smaller, the value of Hedonic Pricing, Spatial Features, or Amenity Scoring?",
            "A": "The value of {Amenity Scoring} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {8} leaf nodes below the global average."
        }
    ],
    "VA": []
}