{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Heatmap Layers in this treemap?",
            "A": "There are {2} child rectangles under the category Heatmap Layers."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Valuation Models}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Z-Score Clustering}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Valuation Models}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Hedonic Pricing rectangle in this treemap?",
            "A": "The value of the Hedonic Pricing rectangle is {49.6}."
        },
        {
            "Q": "What is the value of the Weighted Polygons rectangle in this treemap?",
            "A": "The value of the Weighted Polygons rectangle is {26.71}."
        },
        {
            "Q": "What is the value of the Network Buffers rectangle in this treemap?",
            "A": "The value of the Network Buffers rectangle is {6.45}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.03}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Hedonic Pricing and Getis-Ord Gi*?",
            "A": "The difference between Hedonic Pricing and Getis-Ord Gi* is {29.13}."
        },
        {
            "Q": "What is the sum of the regions of School Districts and Crime Statistics?",
            "A": "The sum of School Districts and Crime Statistics is {57.53}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Heatmap Layers category in the treemap, which rectangular labels have a value exceeded 13.80? Please list the labels and values.",
            "A": "{Hexagonal Binning} has {16.24}"
        },
        {
            "Q": "Under the Heatmap Layers category in the treemap, which rectangular labels have a value below 8.93? Please list the labels and values.",
            "A": "{Kernel Density} has {6.50}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Valuation Models, Amenity Scoring, or Hedonic Pricing?",
            "A": "The value of {Valuation Models} is larger."
        },
        {
            "Q": "Which is larger, the value of Hedonic Pricing or Catchment Areas?",
            "A": "The value of {Hedonic Pricing} is larger."
        },
        {
            "Q": "Which is larger, the value of Valuation Models or Amenity Scoring?",
            "A": "The value of {Valuation Models} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {8} leaf nodes below the global average."
        }
    ],
    "VA": []
}