{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category nan in this treemap?",
            "A": "There are {1} child rectangles under the category nan."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Valuation Models}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Heatmap Layers}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Valuation Models}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the POI Analysis rectangle in this treemap?",
            "A": "The value of the POI Analysis rectangle is {51.07}."
        },
        {
            "Q": "What is the value of the Spatial Lag rectangle in this treemap?",
            "A": "The value of the Spatial Lag rectangle is {24.74}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.1}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Moran's I Test and Data Scraping?",
            "A": "The difference between Moran's I Test and Data Scraping is {8.28}."
        },
        {
            "Q": "What is the sum of the regions of Valuation Models and Geospatial Regression?",
            "A": "The sum of Valuation Models and Geospatial Regression is {124.74}."
        }
    ],
    "NF": [
        {
            "Q": "Under the nan category in the treemap, which rectangular labels have a value exceeded 99.99? Please list the labels and values.",
            "A": "{Valuation Models} has {100.00}"
        },
        {
            "Q": "Under the nan category in the treemap, which rectangular labels have a value below 100.01? Please list the labels and values.",
            "A": "{Valuation Models} has {100.00}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Valuation Models, Amenity Scoring, or POI Analysis?",
            "A": "The value of {Valuation Models} is larger."
        },
        {
            "Q": "Which is larger, the value of POI Analysis or Network Buffers?",
            "A": "The value of {POI Analysis} is larger."
        },
        {
            "Q": "Which is smaller, the value of Amenity Scoring, POI Analysis, or Hedonic Pricing?",
            "A": "The value of {Hedonic Pricing} is smaller."
        },
        {
            "Q": "Which is larger, the value of Valuation Models or Amenity Scoring?",
            "A": "The value of {Valuation Models} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {9} leaf nodes below the global average."
        }
    ],
    "VA": []
}