{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category ML Models in this treemap?",
            "A": "There are {2} child rectangles under the category ML Models."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Platform Architecture}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Device Fingerprinting}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Platform Architecture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Recommendation Engines rectangle in this treemap?",
            "A": "The value of the Recommendation Engines rectangle is {52.64}."
        },
        {
            "Q": "What is the value of the Matrix Factorization rectangle in this treemap?",
            "A": "The value of the Matrix Factorization rectangle is {18.54}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {7.98}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Exactly-Once Semantics and Collaborative Filtering?",
            "A": "The difference between Exactly-Once Semantics and Collaborative Filtering is {0.4}."
        },
        {
            "Q": "What is the sum of the regions of Device Fingerprinting and SVD Algorithms?",
            "A": "The sum of Device Fingerprinting and SVD Algorithms is {26.52}."
        }
    ],
    "NF": [
        {
            "Q": "Under the ML Models category in the treemap, which rectangular labels have a value exceeded 16.58? Please list the labels and values.",
            "A": "{Behavior Analysis} has {18.87}"
        },
        {
            "Q": "Under the ML Models category in the treemap, which rectangular labels have a value below 12.00? Please list the labels and values.",
            "A": "{Anomaly Detection} has {9.71}"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Recommendation Engines, Payment Systems, or Real-Time Prediction?",
            "A": "The value of {Real-Time Prediction} is smaller."
        },
        {
            "Q": "Which is larger, the value of Payment Systems or Stream Processing?",
            "A": "The value of {Payment Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture, Recommendation Engines, or Payment Systems?",
            "A": "The value of {Platform Architecture} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {9} leaf nodes below the global average."
        }
    ],
    "VA": []
}