{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category ML Models in this treemap?",
            "A": "There are {2} child rectangles under the category ML Models."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Platform Architecture}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Vaultless Systems}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Platform Architecture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the PCI Compliance rectangle in this treemap?",
            "A": "The value of the PCI Compliance rectangle is {10.12}."
        },
        {
            "Q": "What is the value of the Recommendation Engines rectangle in this treemap?",
            "A": "The value of the Recommendation Engines rectangle is {76.93}."
        },
        {
            "Q": "What is the value of the Collaborative Filtering rectangle in this treemap?",
            "A": "The value of the Collaborative Filtering rectangle is {6.75}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.02}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Isolation Forest and PCI Compliance?",
            "A": "The difference between Isolation Forest and PCI Compliance is {3.68}."
        },
        {
            "Q": "What is the sum of the regions of Payment Systems and Vaultless Systems?",
            "A": "The sum of Payment Systems and Vaultless Systems is {28.09}."
        }
    ],
    "NF": [
        {
            "Q": "Under the ML Models category in the treemap, which rectangular labels have a value exceeded 6.49? Please list the labels and values.",
            "A": "{Behavior Analysis} has {6.51}"
        },
        {
            "Q": "Under the ML Models category in the treemap, which rectangular labels have a value below 6.46? Please list the labels and values.",
            "A": "{Anomaly Detection} has {6.44}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Real-Time Prediction or Kafka Pipelines?",
            "A": "The value of {Real-Time Prediction} is larger."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture or Recommendation Engines?",
            "A": "The value of {Platform Architecture} is larger."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture, Recommendation Engines, or Real-Time Prediction?",
            "A": "The value of {Platform Architecture} is larger."
        },
        {
            "Q": "Which is smaller, the value of Recommendation Engines, Real-Time Prediction, or Stream Processing?",
            "A": "The value of {Stream Processing} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {6} leaf nodes below the global average."
        }
    ],
    "VA": []
}