{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category ML Models in this treemap?",
            "A": "There are {2} child rectangles under the category ML Models."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Platform Architecture}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Isolation Forest}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Platform Architecture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Platform Architecture rectangle in this treemap?",
            "A": "The value of the Platform Architecture rectangle is {100.0}."
        },
        {
            "Q": "What is the value of the SVD Algorithms rectangle in this treemap?",
            "A": "The value of the SVD Algorithms rectangle is {16.27}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {6.11}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of ML Models and SVD Algorithms?",
            "A": "The difference between ML Models and SVD Algorithms is {0.31}."
        },
        {
            "Q": "What is the sum of the regions of PCI Compliance and Fraud Detection?",
            "A": "The sum of PCI Compliance and Fraud Detection is {59.17}."
        }
    ],
    "NF": [
        {
            "Q": "Under the ML Models category in the treemap, which rectangular labels have a value exceeded 8.91? Please list the labels and values.",
            "A": "{Behavior Analysis} has {9.85}"
        },
        {
            "Q": "Under the ML Models category in the treemap, which rectangular labels have a value below 7.04? Please list the labels and values.",
            "A": "{Anomaly Detection} has {6.11}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Platform Architecture or Payment Systems?",
            "A": "The value of {Platform Architecture} is larger."
        },
        {
            "Q": "Which is larger, the value of Gateway APIs or PCI Compliance?",
            "A": "The value of {Gateway APIs} is larger."
        },
        {
            "Q": "Which is smaller, the value of Payment Systems, Gateway APIs, or Tokenization?",
            "A": "The value of {Tokenization} is smaller."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture, Payment Systems, or Gateway APIs?",
            "A": "The value of {Platform Architecture} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {7} leaf nodes below the global average."
        }
    ],
    "VA": []
}