{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category ML Models in this treemap?",
            "A": "There are {2} child rectangles under the category ML Models."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Platform Architecture}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Feature Importance}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Platform Architecture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the SVD Algorithms rectangle in this treemap?",
            "A": "The value of the SVD Algorithms rectangle is {5.91}."
        },
        {
            "Q": "What is the value of the Stream Processing rectangle in this treemap?",
            "A": "The value of the Stream Processing rectangle is {38.23}."
        },
        {
            "Q": "What is the value of the Collaborative Filtering rectangle in this treemap?",
            "A": "The value of the Collaborative Filtering rectangle is {5.91}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.05}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Tree Pruning and Vaultless Systems?",
            "A": "The difference between Tree Pruning and Vaultless Systems is {17.61}."
        },
        {
            "Q": "What is the sum of the regions of Payment Systems and Isolation Forest?",
            "A": "The sum of Payment Systems and Isolation Forest is {66.22}."
        }
    ],
    "NF": [
        {
            "Q": "Under the ML Models category in the treemap, which rectangular labels have a value exceeded 15.60? Please list the labels and values.",
            "A": "{Behavior Analysis} has {17.35}"
        },
        {
            "Q": "Under the ML Models category in the treemap, which rectangular labels have a value below 12.11? Please list the labels and values.",
            "A": "{Anomaly Detection} has {10.36}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Platform Architecture, Payment Systems, or Recommendation Engines?",
            "A": "The value of {Platform Architecture} is larger."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture or Payment Systems?",
            "A": "The value of {Platform Architecture} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {8} leaf nodes below the global average."
        }
    ],
    "VA": []
}