{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category SVD Algorithms in this treemap?",
            "A": "There are {2} child rectangles under the category SVD Algorithms."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Platform Architecture}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {ML Models}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Platform Architecture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Matrix Factorization rectangle in this treemap?",
            "A": "The value of the Matrix Factorization rectangle is {28.38}."
        },
        {
            "Q": "What is the value of the Collaborative Filtering rectangle in this treemap?",
            "A": "The value of the Collaborative Filtering rectangle is {28.38}."
        },
        {
            "Q": "What is the value of the Exactly-Once Semantics rectangle in this treemap?",
            "A": "The value of the Exactly-Once Semantics rectangle is {22.36}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {6.0}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Real-Time Prediction and PCI Compliance?",
            "A": "The difference between Real-Time Prediction and PCI Compliance is {52.18}."
        },
        {
            "Q": "What is the sum of the regions of Parallel Computing and Collaborative Filtering?",
            "A": "The sum of Parallel Computing and Collaborative Filtering is {46.97}."
        }
    ],
    "NF": [
        {
            "Q": "Under the SVD Algorithms category in the treemap, which rectangular labels have a value exceeded 16.39? Please list the labels and values.",
            "A": "{Parallel Computing} has {18.59}"
        },
        {
            "Q": "Under the SVD Algorithms category in the treemap, which rectangular labels have a value below 11.99? Please list the labels and values.",
            "A": "{GPU Acceleration} has {9.79}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Platform Architecture, Recommendation Engines, or Real-Time Prediction?",
            "A": "The value of {Platform Architecture} is larger."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture or Recommendation Engines?",
            "A": "The value of {Platform Architecture} is larger."
        },
        {
            "Q": "Which is smaller, the value of Recommendation Engines, Real-Time Prediction, or Stream Processing?",
            "A": "The value of {Stream Processing} is smaller."
        },
        {
            "Q": "Which is larger, the value of Real-Time Prediction or Kafka Pipelines?",
            "A": "The value of {Real-Time Prediction} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {5} leaf nodes below the global average."
        }
    ],
    "VA": []
}