{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Fertigation Systems in this treemap?",
            "A": "There are {1} child rectangles under the category Fertigation Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Crop Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Laser-Drilled Orifices}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Crop Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Precision Planting rectangle in this treemap?",
            "A": "The value of the Precision Planting rectangle is {80.29}."
        },
        {
            "Q": "What is the value of the Dosing Mechanisms rectangle in this treemap?",
            "A": "The value of the Dosing Mechanisms rectangle is {23.48}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.77}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Emitter Design and Pressure Sensors?",
            "A": "The difference between Emitter Design and Pressure Sensors is {4.1}."
        },
        {
            "Q": "What is the sum of the regions of Row Units and Pressure Compensating?",
            "A": "The sum of Row Units and Pressure Compensating is {69.99}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Fertigation Systems category in the treemap, which rectangular labels have a value exceeded 23.47? Please list the labels and values.",
            "A": "{Dosing Mechanisms} has {23.48}"
        },
        {
            "Q": "Under the Fertigation Systems category in the treemap, which rectangular labels have a value below 23.49? Please list the labels and values.",
            "A": "{Dosing Mechanisms} has {23.48}"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Precision Planting, Seeders, or Row Units?",
            "A": "The value of {Row Units} is smaller."
        },
        {
            "Q": "Which is larger, the value of Crop Systems or Precision Planting?",
            "A": "The value of {Crop Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Seeders or Depth Control?",
            "A": "The value of {Seeders} is larger."
        },
        {
            "Q": "Which is larger, the value of Crop Systems, Precision Planting, or Seeders?",
            "A": "The value of {Crop Systems} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {6} leaf nodes below the global average."
        }
    ],
    "VA": []
}