{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Error Correction in this treemap?",
            "A": "There are {1} child rectangles under the category Error Correction."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Physics Research}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Lattice Structures}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Physics Research}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Coil Designs rectangle in this treemap?",
            "A": "The value of the Coil Designs rectangle is {7.86}."
        },
        {
            "Q": "What is the value of the Voltage Triggers rectangle in this treemap?",
            "A": "The value of the Voltage Triggers rectangle is {8.61}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {87.01}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.81}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of End Plugging and Quench Protection?",
            "A": "The difference between End Plugging and Quench Protection is {5.43}."
        },
        {
            "Q": "What is the sum of the regions of Quantum Computing and Superconducting?",
            "A": "The sum of Quantum Computing and Superconducting is {50.8}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Error Correction category in the treemap, which rectangular labels have a value exceeded 5.80? Please list the labels and values.",
            "A": "{Surface Codes} has {5.81}"
        },
        {
            "Q": "Under the Error Correction category in the treemap, which rectangular labels have a value below 5.82? Please list the labels and values.",
            "A": "{Surface Codes} has {5.81}"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Particle Accelerators, Magnet Systems, or Superconducting?",
            "A": "The value of {Superconducting} is smaller."
        },
        {
            "Q": "Which is larger, the value of Physics Research, Particle Accelerators, or Magnet Systems?",
            "A": "The value of {Physics Research} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {9} leaf nodes below the global average."
        }
    ],
    "VA": []
}