{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Error Correction in this treemap?",
            "A": "There are {1} child rectangles under the category Error Correction."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Physics Research}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {FPGA Modules}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Physics Research}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Laser Control rectangle in this treemap?",
            "A": "The value of the Laser Control rectangle is {13.68}."
        },
        {
            "Q": "What is the value of the Rotating Plasmas rectangle in this treemap?",
            "A": "The value of the Rotating Plasmas rectangle is {29.52}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {68.83}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.24}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of End Plugging and Epoxy Insulation?",
            "A": "The difference between End Plugging and Epoxy Insulation is {30.65}."
        },
        {
            "Q": "What is the sum of the regions of Error Correction and Frequency Stabilization?",
            "A": "The sum of Error Correction and Frequency Stabilization is {23.22}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Error Correction category in the treemap, which rectangular labels have a value exceeded 9.53? Please list the labels and values.",
            "A": "{Surface Codes} has {9.54}"
        },
        {
            "Q": "Under the Error Correction category in the treemap, which rectangular labels have a value below 9.55? Please list the labels and values.",
            "A": "{Surface Codes} has {9.54}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Physics Research, Plasma Physics, or Confinement Methods?",
            "A": "The value of {Physics Research} is larger."
        },
        {
            "Q": "Which is smaller, the value of Plasma Physics, Confinement Methods, or Magnetic Mirror?",
            "A": "The value of {Magnetic Mirror} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {10} leaf nodes below the global average."
        }
    ],
    "VA": []
}