{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Horizontal Partition in this treemap?",
            "A": "There are {1} child rectangles under the category Horizontal Partition."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Platform Architecture}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Virtual Nodes}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Platform Architecture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Interaction Design rectangle in this treemap?",
            "A": "The value of the Interaction Design rectangle is {80.74}."
        },
        {
            "Q": "What is the value of the Notification Systems rectangle in this treemap?",
            "A": "The value of the Notification Systems rectangle is {80.74}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.01}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Virtual Nodes and Data Infrastructure?",
            "A": "The difference between Virtual Nodes and Data Infrastructure is {6.88}."
        },
        {
            "Q": "What is the sum of the regions of In-App Badges and Cloud Integration?",
            "A": "The sum of In-App Badges and Cloud Integration is {62.24}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Horizontal Partition category in the treemap, which rectangular labels have a value exceeded 5.00? Please list the labels and values.",
            "A": "{Consistent Hashing} has {5.01}"
        },
        {
            "Q": "Under the Horizontal Partition category in the treemap, which rectangular labels have a value below 5.02? Please list the labels and values.",
            "A": "{Consistent Hashing} has {5.01}"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of User Interface, Interaction Design, or Notification Systems?",
            "A": "The value of {Notification Systems} is smaller."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture or User Interface?",
            "A": "The value of {Platform Architecture} is larger."
        },
        {
            "Q": "Which is larger, the value of Interaction Design or In-App Badges?",
            "A": "The value of {Interaction Design} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {6} leaf nodes below the global average."
        }
    ],
    "VA": []
}