{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Neural TTS in this treemap?",
            "A": "There are {2} child rectangles under the category Neural TTS."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Platform Architecture}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Notification Systems}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Platform Architecture}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Virtual Nodes rectangle in this treemap?",
            "A": "The value of the Virtual Nodes rectangle is {25.34}."
        },
        {
            "Q": "What is the value of the Consistent Hashing rectangle in this treemap?",
            "A": "The value of the Consistent Hashing rectangle is {25.34}."
        },
        {
            "Q": "What is the value of the Interaction Design rectangle in this treemap?",
            "A": "The value of the Interaction Design rectangle is {9.04}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {9.04}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Accessibility and Delta Encoding?",
            "A": "The difference between Accessibility and Delta Encoding is {34.02}."
        },
        {
            "Q": "What is the sum of the regions of Data Infrastructure and Screen Readers?",
            "A": "The sum of Data Infrastructure and Screen Readers is {90.96}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Neural TTS category in the treemap, which rectangular labels have a value exceeded 28.33? Please list the labels and values.",
            "A": "{Tacotron} has {34.31}"
        },
        {
            "Q": "Under the Neural TTS category in the treemap, which rectangular labels have a value below 16.38? Please list the labels and values.",
            "A": "{WaveNet} has {10.40}"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of User Interface, Data Infrastructure, or Storage Systems?",
            "A": "The value of {Storage Systems} is smaller."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture, User Interface, or Data Infrastructure?",
            "A": "The value of {Platform Architecture} is larger."
        },
        {
            "Q": "Which is larger, the value of Data Infrastructure or Accessibility?",
            "A": "The value of {Data Infrastructure} is larger."
        },
        {
            "Q": "Which is larger, the value of Platform Architecture or User Interface?",
            "A": "The value of {Platform Architecture} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {5} leaf nodes below the global average."
        }
    ],
    "VA": []
}