{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category nan in this treemap?",
            "A": "There are {1} child rectangles under the category nan."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Training Tech}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Motion Capture}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Training Tech}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Motion Capture rectangle in this treemap?",
            "A": "The value of the Motion Capture rectangle is {5.26}."
        },
        {
            "Q": "What is the value of the Nonlinearity Correction rectangle in this treemap?",
            "A": "The value of the Nonlinearity Correction rectangle is {7.33}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.26}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Nonlinearity Correction and Piezoelectric?",
            "A": "The difference between Nonlinearity Correction and Piezoelectric is {10.22}."
        },
        {
            "Q": "What is the sum of the regions of Foot Strike and Force Plates?",
            "A": "The sum of Foot Strike and Force Plates is {22.94}."
        }
    ],
    "NF": [
        {
            "Q": "Under the nan category in the treemap, which rectangular labels have a value exceeded 99.99? Please list the labels and values.",
            "A": "{Training Tech} has {100.00}"
        },
        {
            "Q": "Under the nan category in the treemap, which rectangular labels have a value below 100.01? Please list the labels and values.",
            "A": "{Training Tech} has {100.00}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of EMG Systems or Signal Processing?",
            "A": "The value of {EMG Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Force Analysis, EMG Systems, or Wireless Sensors?",
            "A": "The value of {Wireless Sensors} is smaller."
        },
        {
            "Q": "Which is larger, the value of Training Tech, Force Analysis, or EMG Systems?",
            "A": "The value of {Training Tech} is larger."
        },
        {
            "Q": "Which is larger, the value of Training Tech or Force Analysis?",
            "A": "The value of {Training Tech} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {5} leaf nodes below the global average."
        }
    ],
    "VA": []
}