{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Plantar Pressure in this treemap?",
            "A": "There are {2} child rectangles under the category Plantar Pressure."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Training Tech}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Shear Force Detection}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Training Tech}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Noise Filtering rectangle in this treemap?",
            "A": "The value of the Noise Filtering rectangle is {18.74}."
        },
        {
            "Q": "What is the value of the EMG Systems rectangle in this treemap?",
            "A": "The value of the EMG Systems rectangle is {26.01}."
        },
        {
            "Q": "What is the value of the Signal Processing rectangle in this treemap?",
            "A": "The value of the Signal Processing rectangle is {26.01}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.23}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Training Tech and Shear Force Detection?",
            "A": "The difference between Training Tech and Shear Force Detection is {94.77}."
        },
        {
            "Q": "What is the sum of the regions of Foot Strike and Signal Processing?",
            "A": "The sum of Foot Strike and Signal Processing is {36.61}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Plantar Pressure category in the treemap, which rectangular labels have a value exceeded 5.34? Please list the labels and values.",
            "A": "{Midsole Sensors} has {5.37}"
        },
        {
            "Q": "Under the Plantar Pressure category in the treemap, which rectangular labels have a value below 5.26? Please list the labels and values.",
            "A": "{Shear Force Detection} has {5.23}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Training Tech or Force Analysis?",
            "A": "The value of {Training Tech} is larger."
        },
        {
            "Q": "Which is smaller, the value of Force Analysis, Force Plates, or Piezoelectric?",
            "A": "The value of {Piezoelectric} is smaller."
        },
        {
            "Q": "Which is larger, the value of Training Tech, Force Analysis, or Force Plates?",
            "A": "The value of {Training Tech} is larger."
        },
        {
            "Q": "Which is larger, the value of Force Plates or Calibration?",
            "A": "The value of {Force Plates} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {6} leaf nodes below the global average."
        }
    ],
    "VA": []
}