{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many child rectangles are under the category Fertigation Systems in this treemap?",
            "A": "There are {1} child rectangles under the category Fertigation Systems."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Crop Systems}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Pivot Systems}."
        },
        {
            "Q": "Which top-level category has the highest proportion in this treemap?",
            "A": "The top-level category with the highest proportion is {Crop Systems}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Venturi Injectors rectangle in this treemap?",
            "A": "The value of the Venturi Injectors rectangle is {66.08}."
        },
        {
            "Q": "What is the value of the Anti-Clog Nozzles rectangle in this treemap?",
            "A": "The value of the Anti-Clog Nozzles rectangle is {45.52}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {100.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.21}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Parallel Linkages and Pivot Systems?",
            "A": "The difference between Parallel Linkages and Pivot Systems is {8.45}."
        },
        {
            "Q": "What is the sum of the regions of Silicone Diaphragms and Depth Control?",
            "A": "The sum of Silicone Diaphragms and Depth Control is {28.71}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Fertigation Systems category in the treemap, which rectangular labels have a value exceeded 66.07? Please list the labels and values.",
            "A": "{Dosing Mechanisms} has {66.08}"
        },
        {
            "Q": "Under the Fertigation Systems category in the treemap, which rectangular labels have a value below 66.09? Please list the labels and values.",
            "A": "{Dosing Mechanisms} has {66.08}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Fertigation Systems or Venturi Injectors?",
            "A": "The value of {Fertigation Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Crop Systems or Precision Planting?",
            "A": "The value of {Crop Systems} is larger."
        },
        {
            "Q": "Which is larger, the value of Crop Systems, Precision Planting, or Fertigation Systems?",
            "A": "The value of {Crop Systems} is larger."
        },
        {
            "Q": "Which is smaller, the value of Precision Planting, Fertigation Systems, or Dosing Mechanisms?",
            "A": "The value of {Dosing Mechanisms} is smaller."
        }
    ],
    "MSR": [
        {
            "Q": "How many leaf nodes' value below the global average in the treemap?",
            "A": "There are {5} leaf nodes below the global average."
        }
    ],
    "VA": []
}