{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {19} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Energy Consumption}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Wind}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Industrial rectangle in this treemap?",
            "A": "The value of the Industrial rectangle is {31.79}."
        },
        {
            "Q": "What is the value of the High Voltage Lines rectangle in this treemap?",
            "A": "The value of the High Voltage Lines rectangle is {5.12}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.08}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Thermal Plants and Fossil Fuels?",
            "A": "The difference between Thermal Plants and Fossil Fuels is {1.37}."
        },
        {
            "Q": "What is the sum of the regions of Industrial and High Voltage Lines?",
            "A": "The sum of Industrial and High Voltage Lines is {36.91}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Transmission category in the treemap, which rectangular labels have a value exceeded 5.74? Please list the labels and values.",
            "A": "{Smart Grids} has {5.94}"
        },
        {
            "Q": "Under the Transmission category in the treemap, which rectangular labels have a value below 5.32? Please list the labels and values.",
            "A": "{High Voltage Lines} has {5.12}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Industrial or Generation?",
            "A": "The value of {Industrial} is larger."
        },
        {
            "Q": "Which is smaller, the value of Energy Infrastructure, Industrial, or Energy Sources?",
            "A": "The value of {Energy Sources} is smaller."
        },
        {
            "Q": "Which is larger, the value of Energy Consumption, Energy Infrastructure, or Industrial?",
            "A": "The value of {Energy Consumption} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}