{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {17} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Food Distribution}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Crop Farming}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Export Networks rectangle in this treemap?",
            "A": "The value of the Export Networks rectangle is {9.17}."
        },
        {
            "Q": "What is the value of the Aquaculture rectangle in this treemap?",
            "A": "The value of the Aquaculture rectangle is {9.62}."
        },
        {
            "Q": "What is the value of the Livestock rectangle in this treemap?",
            "A": "The value of the Livestock rectangle is {12.93}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.22}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Ice Cream and Milk Products?",
            "A": "The difference between Ice Cream and Milk Products is {4.79}."
        },
        {
            "Q": "What is the sum of the regions of Food Processing and Packaging?",
            "A": "The sum of Food Processing and Packaging is {43.92}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Food Processing category in the treemap, which rectangular labels have a value exceeded 17.30? Please list the labels and values.",
            "A": "{Dairy Processing} has {17.70}"
        },
        {
            "Q": "Under the Food Processing category in the treemap, which rectangular labels have a value below 16.50? Please list the labels and values.",
            "A": "{Meat Processing} has {16.10}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Food Distribution or Food Processing?",
            "A": "The value of {Food Distribution} is larger."
        },
        {
            "Q": "Which is smaller, the value of Food Processing, Wholesale, or Food Production?",
            "A": "The value of {Food Production} is smaller."
        },
        {
            "Q": "Which is larger, the value of Food Distribution, Food Processing, or Wholesale?",
            "A": "The value of {Food Distribution} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}