{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {15} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Healthcare Policy}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Medical Devices}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Public Health Systems rectangle in this treemap?",
            "A": "The value of the Public Health Systems rectangle is {20.0}."
        },
        {
            "Q": "What is the value of the Health Informatics rectangle in this treemap?",
            "A": "The value of the Health Informatics rectangle is {14.57}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {20.0}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.43}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Government Programs and Health Technologies?",
            "A": "The difference between Government Programs and Health Technologies is {13.54}."
        },
        {
            "Q": "What is the sum of the regions of Medical Devices and Patient Awareness?",
            "A": "The sum of Medical Devices and Patient Awareness is {17.74}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Health Technologies category in the treemap, which rectangular labels have a value exceeded 12.28? Please list the labels and values.",
            "A": "{Health Informatics} has {14.57}"
        },
        {
            "Q": "Under the Health Technologies category in the treemap, which rectangular labels have a value below 7.72? Please list the labels and values.",
            "A": "{Medical Devices} has {5.43}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Healthcare Policy or Health Education?",
            "A": "The value of {Healthcare Policy} is larger."
        },
        {
            "Q": "Which is larger, the value of Health Technologies or Medical Services?",
            "A": "The value of {Health Technologies} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}