{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {19} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Workplace Wellbeing}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Job Posting}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Work-Life Balance rectangle in this treemap?",
            "A": "The value of the Work-Life Balance rectangle is {16.62}."
        },
        {
            "Q": "What is the value of the Online Learning rectangle in this treemap?",
            "A": "The value of the Online Learning rectangle is {8.67}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.12}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Performance Management and Flexible Scheduling?",
            "A": "The difference between Performance Management and Flexible Scheduling is {5.84}."
        },
        {
            "Q": "What is the sum of the regions of Training Programs and Emergency Response?",
            "A": "The sum of Training Programs and Emergency Response is {27.96}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Health & Safety category in the treemap, which rectangular labels have a value exceeded 12.31? Please list the labels and values.",
            "A": "{Ergonomics} has {13.72}"
        },
        {
            "Q": "Under the Health & Safety category in the treemap, which rectangular labels have a value below 9.49? Please list the labels and values.",
            "A": "{Emergency Response} has {8.08}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Workplace Wellbeing, Employee Development, or Employee Lifecycle?",
            "A": "The value of {Workplace Wellbeing} is larger."
        },
        {
            "Q": "Which is smaller, the value of Employee Development, Employee Lifecycle, or Health & Safety?",
            "A": "The value of {Health & Safety} is smaller."
        }
    ],
    "MSR": [],
    "VA": []
}