{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {19} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Workplace Wellbeing}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Job Posting}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Workplace Wellbeing rectangle in this treemap?",
            "A": "The value of the Workplace Wellbeing rectangle is {38.42}."
        },
        {
            "Q": "What is the value of the Ergonomics rectangle in this treemap?",
            "A": "The value of the Ergonomics rectangle is {13.72}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.12}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Training Programs and Health & Safety?",
            "A": "The difference between Training Programs and Health & Safety is {1.93}."
        },
        {
            "Q": "What is the sum of the regions of Candidate Evaluation and Work-Life Balance?",
            "A": "The sum of Candidate Evaluation and Work-Life Balance is {32.26}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Health & Safety category in the treemap, which rectangular labels have a value exceeded 12.31? Please list the labels and values.",
            "A": "{Ergonomics} has {13.72}"
        },
        {
            "Q": "Under the Health & Safety category in the treemap, which rectangular labels have a value below 9.49? Please list the labels and values.",
            "A": "{Emergency Response} has {8.08}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Workplace Wellbeing or Employee Development?",
            "A": "The value of {Workplace Wellbeing} is larger."
        },
        {
            "Q": "Which is larger, the value of Employee Lifecycle or Recruitment?",
            "A": "The value of {Employee Lifecycle} is larger."
        },
        {
            "Q": "Which is larger, the value of Workplace Wellbeing, Employee Development, or Employee Lifecycle?",
            "A": "The value of {Workplace Wellbeing} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}