{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {17} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Customer Engagement}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {E-Wallets}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the C2C Marketplaces rectangle in this treemap?",
            "A": "The value of the C2C Marketplaces rectangle is {9.3}."
        },
        {
            "Q": "What is the value of the B2C Platforms rectangle in this treemap?",
            "A": "The value of the B2C Platforms rectangle is {18.47}."
        },
        {
            "Q": "What is the value of the Warehousing rectangle in this treemap?",
            "A": "The value of the Warehousing rectangle is {9.97}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.74}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of C2C Marketplaces and Marketplace Platforms?",
            "A": "The difference between C2C Marketplaces and Marketplace Platforms is {18.47}."
        },
        {
            "Q": "What is the sum of the regions of E-Wallets and Marketing Strategies?",
            "A": "The sum of E-Wallets and Marketing Strategies is {37.44}."
        }
    ],
    "NF": [
        {
            "Q": "Under the B2C Platforms category in the treemap, which rectangular labels have a value exceeded 9.44? Please list the labels and values.",
            "A": "{Electronics Retailers} has {9.65}"
        },
        {
            "Q": "Under the B2C Platforms category in the treemap, which rectangular labels have a value below 9.03? Please list the labels and values.",
            "A": "{Fashion Retailers} has {8.82}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Marketing Strategies or Email Campaigns?",
            "A": "The value of {Marketing Strategies} is larger."
        },
        {
            "Q": "Which is smaller, the value of Payment & Logistics, Marketing Strategies, or Marketplace Platforms?",
            "A": "The value of {Marketplace Platforms} is smaller."
        },
        {
            "Q": "Which is larger, the value of Customer Engagement or Payment & Logistics?",
            "A": "The value of {Customer Engagement} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}