{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {21} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Applied Sciences}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Brain Function}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Biology rectangle in this treemap?",
            "A": "The value of the Biology rectangle is {18.34}."
        },
        {
            "Q": "What is the value of the Mechanical rectangle in this treemap?",
            "A": "The value of the Mechanical rectangle is {5.25}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.12}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Organic Chemistry and Electrical?",
            "A": "The difference between Organic Chemistry and Electrical is {1.09}."
        },
        {
            "Q": "What is the sum of the regions of Engineering and Algorithms?",
            "A": "The sum of Engineering and Algorithms is {30.87}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Life Sciences category in the treemap, which rectangular labels have a value exceeded 17.62? Please list the labels and values.",
            "A": "{Biology} has {18.34}"
        },
        {
            "Q": "Under the Life Sciences category in the treemap, which rectangular labels have a value below 16.19? Please list the labels and values.",
            "A": "{Neuroscience} has {15.47}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Physical Sciences or Biology?",
            "A": "The value of {Physical Sciences} is larger."
        },
        {
            "Q": "Which is smaller, the value of Life Sciences, Physical Sciences, or Computer Science?",
            "A": "The value of {Computer Science} is smaller."
        }
    ],
    "MSR": [],
    "VA": []
}