{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {21} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Applied Sciences}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Brain Function}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Neural Networks rectangle in this treemap?",
            "A": "The value of the Neural Networks rectangle is {10.34}."
        },
        {
            "Q": "What is the value of the Biology rectangle in this treemap?",
            "A": "The value of the Biology rectangle is {18.34}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.12}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Engineering and Organic Chemistry?",
            "A": "The difference between Engineering and Organic Chemistry is {6.34}."
        },
        {
            "Q": "What is the sum of the regions of Life Sciences and Neural Networks?",
            "A": "The sum of Life Sciences and Neural Networks is {44.15}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Life Sciences category in the treemap, which rectangular labels have a value exceeded 17.62? Please list the labels and values.",
            "A": "{Biology} has {18.34}"
        },
        {
            "Q": "Under the Life Sciences category in the treemap, which rectangular labels have a value below 16.19? Please list the labels and values.",
            "A": "{Neuroscience} has {15.47}"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Life Sciences, Physical Sciences, or Computer Science?",
            "A": "The value of {Computer Science} is smaller."
        },
        {
            "Q": "Which is larger, the value of Applied Sciences or Life Sciences?",
            "A": "The value of {Applied Sciences} is larger."
        },
        {
            "Q": "Which is larger, the value of Applied Sciences, Life Sciences, or Physical Sciences?",
            "A": "The value of {Applied Sciences} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}