{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {19} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Digital Transformation}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Data Governance}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Business Intelligence rectangle in this treemap?",
            "A": "The value of the Business Intelligence rectangle is {10.48}."
        },
        {
            "Q": "What is the value of the Data Strategy rectangle in this treemap?",
            "A": "The value of the Data Strategy rectangle is {16.05}."
        },
        {
            "Q": "What is the value of the Corporate Strategy rectangle in this treemap?",
            "A": "The value of the Corporate Strategy rectangle is {27.77}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.58}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Capital Budgeting and Corporate Strategy?",
            "A": "The difference between Capital Budgeting and Corporate Strategy is {21.17}."
        },
        {
            "Q": "What is the sum of the regions of Innovation Strategy and Growth Models?",
            "A": "The sum of Innovation Strategy and Growth Models is {27.77}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Data Strategy category in the treemap, which rectangular labels have a value exceeded 9.26? Please list the labels and values.",
            "A": "{Business Intelligence} has {10.48}"
        },
        {
            "Q": "Under the Data Strategy category in the treemap, which rectangular labels have a value below 6.80? Please list the labels and values.",
            "A": "{Data Governance} has {5.58}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Digital Transformation or Financial Management?",
            "A": "The value of {Digital Transformation} is larger."
        },
        {
            "Q": "Which is smaller, the value of Financial Management, Corporate Strategy, or Technology Adoption?",
            "A": "The value of {Technology Adoption} is smaller."
        },
        {
            "Q": "Which is larger, the value of Corporate Strategy or Innovation Strategy?",
            "A": "The value of {Corporate Strategy} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}