{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {19} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {User Engagement}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Likes}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Podcasting rectangle in this treemap?",
            "A": "The value of the Podcasting rectangle is {22.8}."
        },
        {
            "Q": "What is the value of the Telegram rectangle in this treemap?",
            "A": "The value of the Telegram rectangle is {9.29}."
        },
        {
            "Q": "What is the value of the YouTube rectangle in this treemap?",
            "A": "The value of the YouTube rectangle is {5.93}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.01}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Social Networks and Likes?",
            "A": "The difference between Social Networks and Likes is {2.2}."
        },
        {
            "Q": "What is the sum of the regions of Messaging Apps and Video Platforms?",
            "A": "The sum of Messaging Apps and Video Platforms is {31.56}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Messaging Apps category in the treemap, which rectangular labels have a value exceeded 10.77? Please list the labels and values.",
            "A": "{WhatsApp} has {11.26}"
        },
        {
            "Q": "Under the Messaging Apps category in the treemap, which rectangular labels have a value below 9.78? Please list the labels and values.",
            "A": "{Telegram} has {9.29}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of User Engagement, Content Creation, or Platforms?",
            "A": "The value of {User Engagement} is larger."
        },
        {
            "Q": "Which is smaller, the value of Content Creation, Platforms, or Sharing and Virality?",
            "A": "The value of {Sharing and Virality} is smaller."
        }
    ],
    "MSR": [],
    "VA": []
}