{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {20} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Sports Media and Tech}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Football}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the Sports Technology rectangle in this treemap?",
            "A": "The value of the Sports Technology rectangle is {15.64}."
        },
        {
            "Q": "What is the value of the Football rectangle in this treemap?",
            "A": "The value of the Football rectangle is {5.08}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.08}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Television Coverage and Yoga and Meditation?",
            "A": "The difference between Television Coverage and Yoga and Meditation is {0.19}."
        },
        {
            "Q": "What is the sum of the regions of Fitness and Wellness and Live Broadcasting?",
            "A": "The sum of Fitness and Wellness and Live Broadcasting is {56.59}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Sports Media and Tech category in the treemap, which rectangular labels have a value exceeded 21.00? Please list the labels and values.",
            "A": "{Live Broadcasting} has {22.78}"
        },
        {
            "Q": "Under the Sports Media and Tech category in the treemap, which rectangular labels have a value below 17.42? Please list the labels and values.",
            "A": "{Sports Technology} has {15.64}"
        }
    ],
    "NC": [
        {
            "Q": "Which is smaller, the value of Fitness and Wellness, Competitive Sports, or Live Broadcasting?",
            "A": "The value of {Live Broadcasting} is smaller."
        },
        {
            "Q": "Which is larger, the value of Sports Media and Tech or Fitness and Wellness?",
            "A": "The value of {Sports Media and Tech} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}