{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {treemap}."
        }
    ],
    "VEC": [
        {
            "Q": "How many rectangles are in this treemap?",
            "A": "There are {21} rectangles."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "Which rectangle has the largest area in this treemap?",
            "A": "The rectangle with the largest area is {Travel Services}."
        },
        {
            "Q": "Which rectangle has the smallest area in this treemap?",
            "A": "The rectangle with the smallest area is {Budget Hotels}."
        }
    ],
    "VE": [
        {
            "Q": "What is the value of the City Landmarks rectangle in this treemap?",
            "A": "The value of the City Landmarks rectangle is {8.18}."
        },
        {
            "Q": "What is the value of the Guided Tours rectangle in this treemap?",
            "A": "The value of the Guided Tours rectangle is {16.74}."
        },
        {
            "Q": "What is the value of the Travel Services rectangle in this treemap?",
            "A": "The value of the Travel Services rectangle is {38.42}."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the maximum value among the partitions in the treemap?",
            "A": "The maximum value is {38.42}."
        },
        {
            "Q": "What is the minimum value among the partitions in the treemap?",
            "A": "The minimum value is {5.01}."
        }
    ],
    "SC": [
        {
            "Q": "What is the difference between the regions of Travel Services and Destination Types?",
            "A": "The difference between Travel Services and Destination Types is {10.65}."
        },
        {
            "Q": "What is the sum of the regions of Cultural Tours and City Landmarks?",
            "A": "The sum of Cultural Tours and City Landmarks is {14.2}."
        }
    ],
    "NF": [
        {
            "Q": "Under the Urban Tourism category in the treemap, which rectangular labels have a value exceeded 8.12? Please list the labels and values.",
            "A": "{City Landmarks} has {8.18}"
        },
        {
            "Q": "Under the Urban Tourism category in the treemap, which rectangular labels have a value below 8.00? Please list the labels and values.",
            "A": "{Shopping Districts} has {7.94}"
        }
    ],
    "NC": [
        {
            "Q": "Which is larger, the value of Destination Types or Transportation?",
            "A": "The value of {Destination Types} is larger."
        },
        {
            "Q": "Which is smaller, the value of Hospitality Services, Destination Types, or Dining Experiences?",
            "A": "The value of {Dining Experiences} is smaller."
        },
        {
            "Q": "Which is larger, the value of Travel Services or Hospitality Services?",
            "A": "The value of {Travel Services} is larger."
        }
    ],
    "MSR": [],
    "VA": []
}