{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {97} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {no correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension School funding in the scatter plot?",
            "A": "The maximum observed value in the School funding dimension is {25000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension School funding in the scatter plot?",
            "A": "The minimum observed value in the School funding dimension is {5000.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension College admission in the scatter plot?",
            "A": "The maximum observed value in the College admission dimension is {100.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension College admission in the scatter plot?",
            "A": "The minimum observed value in the College admission dimension is {0.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the School funding for all points?",
            "A": "The average value of School funding for all points is {15000.00}."
        },
        {
            "Q": "What is the average value of the College admission for all points?",
            "A": "The average value of College admission for all points is {45.23}."
        }
    ],
    "NF": [
        {
            "Q": "What are the College admission values corresponding to the top 3 School funding values in the scatter plot?",
            "A": "{41.54, 25.91, 14.66}."
        },
        {
            "Q": "What are the College admission values corresponding to the bottom 3 School funding values in the scatter plot?",
            "A": "{78.18, 65.95, 55.32}."
        },
        {
            "Q": "What are the School funding values corresponding to the top 3 College admission values in the scatter plot?",
            "A": "{23750.00, 6250.00, 12083.33}."
        },
        {
            "Q": "What are the School funding values corresponding to the bottom 3 College admission values in the scatter plot?",
            "A": "{15000.00, 10625.00, 23541.67}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 17155.01 and 22126.72 and Y coordinates between 69.77 and 88.02?",
            "A": "There are {2} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(5000.00, 78.18) and (25000.00, 41.54)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(8541.67, 36.13) and (8750.00, 37.39)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [7541.67, 31.13, 9750.00, 42.39] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (8541.67, 36.13)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [12228.08, 69.77, 17467.73, 89.66]; Region B: [6026.01, 26.82, 11265.66, 46.70]; Region C: [6033.57, 54.10, 11273.21, 73.98]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}