{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {97} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a positive exponential correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Energy consumption in the scatter plot?",
            "A": "The maximum observed value in the Energy consumption dimension is {1000000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Energy consumption in the scatter plot?",
            "A": "The minimum observed value in the Energy consumption dimension is {1000.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Service cost in the scatter plot?",
            "A": "The maximum observed value in the Service cost dimension is {500.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Service cost in the scatter plot?",
            "A": "The minimum observed value in the Service cost dimension is {50.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Energy consumption for all points?",
            "A": "The average value of Energy consumption for all points is {500500.00}."
        },
        {
            "Q": "What is the average value of the Service cost for all points?",
            "A": "The average value of Service cost for all points is {246.29}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Service cost values corresponding to the top 3 Energy consumption values in the scatter plot?",
            "A": "{465.57, 474.70, 500.00}."
        },
        {
            "Q": "What are the Service cost values corresponding to the bottom 3 Energy consumption values in the scatter plot?",
            "A": "{54.16, 115.01, 60.95}."
        },
        {
            "Q": "What are the Energy consumption values corresponding to the top 3 Service cost values in the scatter plot?",
            "A": "{979187.50, 947968.75, 854312.50}."
        },
        {
            "Q": "What are the Energy consumption values corresponding to the bottom 3 Service cost values in the scatter plot?",
            "A": "{84250.00, 1000.00, 21812.50}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 278665.49 and 519975.16 and Y coordinates between 204.74 and 302.79?",
            "A": "There are {9} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(1000.00, 54.16) and (1000000.00, 465.57)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(427656.25, 214.69) and (438062.50, 214.48)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [377706.25, 191.98, 488012.50, 237.19] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (427656.25, 214.69)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [524016.92, 369.29, 813989.67, 471.82]; Region B: [287873.00, 163.32, 577845.75, 265.85]; Region C: [10127.53, 52.15, 300100.29, 154.67]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}