{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {66} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative u shape correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Grid stability in the scatter plot?",
            "A": "The maximum observed value in the Grid stability dimension is {100.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Grid stability in the scatter plot?",
            "A": "The minimum observed value in the Grid stability dimension is {0.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Customer outage duration in the scatter plot?",
            "A": "The maximum observed value in the Customer outage duration dimension is {24.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Customer outage duration in the scatter plot?",
            "A": "The minimum observed value in the Customer outage duration dimension is {0.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Grid stability for all points?",
            "A": "The average value of Grid stability for all points is {50.00}."
        },
        {
            "Q": "What is the average value of the Customer outage duration for all points?",
            "A": "The average value of Customer outage duration for all points is {15.08}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Customer outage duration values corresponding to the top 3 Grid stability values in the scatter plot?",
            "A": "{0.78, 0.36, 3.99}."
        },
        {
            "Q": "What are the Customer outage duration values corresponding to the bottom 3 Grid stability values in the scatter plot?",
            "A": "{0.00, 2.55, 2.56}."
        },
        {
            "Q": "What are the Grid stability values corresponding to the top 3 Customer outage duration values in the scatter plot?",
            "A": "{38.46, 61.54, 56.92}."
        },
        {
            "Q": "What are the Grid stability values corresponding to the bottom 3 Customer outage duration values in the scatter plot?",
            "A": "{0.00, 98.46, 100.00}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 38.21 and 49.48 and Y coordinates between 2.25 and 7.61?",
            "A": "There are {0} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(0.00, 0.00) and (100.00, 0.78)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(53.85, 22.07) and (55.38, 22.23)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [48.85, 20.87, 60.38, 23.43] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (53.85, 22.07)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [41.00, 18.01, 68.23, 24.00]; Region B: [3.36, 2.81, 30.59, 8.80]; Region C: [61.04, 9.09, 88.27, 15.08]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region A."
        }
    ]
}