{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {59} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative u shape correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Irrigation amount in the scatter plot?",
            "A": "The maximum observed value in the Irrigation amount dimension is {2000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Irrigation amount in the scatter plot?",
            "A": "The minimum observed value in the Irrigation amount dimension is {100.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Food production cost in the scatter plot?",
            "A": "The maximum observed value in the Food production cost dimension is {2000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Food production cost in the scatter plot?",
            "A": "The minimum observed value in the Food production cost dimension is {100.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Irrigation amount for all points?",
            "A": "The average value of Irrigation amount for all points is {1050.00}."
        },
        {
            "Q": "What is the average value of the Food production cost for all points?",
            "A": "The average value of Food production cost for all points is {1298.98}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Food production cost values corresponding to the top 3 Irrigation amount values in the scatter plot?",
            "A": "{141.58, 255.12, 218.76}."
        },
        {
            "Q": "What are the Food production cost values corresponding to the bottom 3 Irrigation amount values in the scatter plot?",
            "A": "{100.00, 143.15, 317.23}."
        },
        {
            "Q": "What are the Irrigation amount values corresponding to the top 3 Food production cost values in the scatter plot?",
            "A": "{951.72, 1017.24, 1181.03}."
        },
        {
            "Q": "What are the Irrigation amount values corresponding to the bottom 3 Food production cost values in the scatter plot?",
            "A": "{100.00, 2000.00, 132.76}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 320.65 and 792.71 and Y coordinates between 253.72 and 601.37?",
            "A": "There are {0} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(100.00, 100.00) and (1181.03, 1982.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(1508.62, 1468.12) and (1541.38, 1464.67)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [1413.62, 1369.67, 1636.38, 1563.12] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (1508.62, 1468.12)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [217.98, 266.92, 629.56, 833.95]; Region B: [1319.21, 1182.88, 1730.79, 1749.91]; Region C: [1327.12, 562.88, 1738.70, 1129.91]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}