{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {41} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {no correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension CO2 emissions in the scatter plot?",
            "A": "The maximum observed value in the CO2 emissions dimension is {100.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension CO2 emissions in the scatter plot?",
            "A": "The minimum observed value in the CO2 emissions dimension is {1.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Species diversity in the scatter plot?",
            "A": "The maximum observed value in the Species diversity dimension is {1000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Species diversity in the scatter plot?",
            "A": "The minimum observed value in the Species diversity dimension is {1.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the CO2 emissions for all points?",
            "A": "The average value of CO2 emissions for all points is {50.50}."
        },
        {
            "Q": "What is the average value of the Species diversity for all points?",
            "A": "The average value of Species diversity for all points is {572.19}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Species diversity values corresponding to the top 3 CO2 emissions values in the scatter plot?",
            "A": "{1000.00, 593.05, 568.51}."
        },
        {
            "Q": "What are the Species diversity values corresponding to the bottom 3 CO2 emissions values in the scatter plot?",
            "A": "{276.89, 1.00, 386.63}."
        },
        {
            "Q": "What are the CO2 emissions values corresponding to the top 3 Species diversity values in the scatter plot?",
            "A": "{100.00, 15.85, 72.77}."
        },
        {
            "Q": "What are the CO2 emissions values corresponding to the bottom 3 Species diversity values in the scatter plot?",
            "A": "{3.48, 65.35, 80.20}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 64.60 and 93.27 and Y coordinates between 581.78 and 822.16?",
            "A": "There are {5} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(3.48, 1.00) and (100.00, 1000.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(20.80, 739.61) and (25.75, 740.32)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [15.85, 689.66, 30.70, 790.27] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (20.80, 739.61)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [71.08, 605.74, 96.86, 857.19]; Region B: [10.38, 614.24, 36.17, 865.69]; Region C: [16.91, 342.52, 42.69, 593.97]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}