{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {40} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a positive exponential correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Rainfall amount in the scatter plot?",
            "A": "The maximum observed value in the Rainfall amount dimension is {2000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Rainfall amount in the scatter plot?",
            "A": "The minimum observed value in the Rainfall amount dimension is {100.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Air quality in the scatter plot?",
            "A": "The maximum observed value in the Air quality dimension is {100.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Air quality in the scatter plot?",
            "A": "The minimum observed value in the Air quality dimension is {0.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Rainfall amount for all points?",
            "A": "The average value of Rainfall amount for all points is {1050.00}."
        },
        {
            "Q": "What is the average value of the Air quality for all points?",
            "A": "The average value of Air quality for all points is {37.82}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Air quality values corresponding to the top 3 Rainfall amount values in the scatter plot?",
            "A": "{100.00, 99.31, 94.02}."
        },
        {
            "Q": "What are the Air quality values corresponding to the bottom 3 Rainfall amount values in the scatter plot?",
            "A": "{0.00, 8.21, 14.81}."
        },
        {
            "Q": "What are the Rainfall amount values corresponding to the top 3 Air quality values in the scatter plot?",
            "A": "{2000.00, 1951.28, 1902.56}."
        },
        {
            "Q": "What are the Rainfall amount values corresponding to the bottom 3 Air quality values in the scatter plot?",
            "A": "{100.00, 246.15, 294.87}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 236.50 and 529.09 and Y coordinates between 63.92 and 75.40?",
            "A": "There are {0} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(100.00, 0.00) and (2000.00, 100.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(441.03, 10.94) and (489.74, 12.08)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [346.03, 5.94, 584.74, 17.08] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (441.03, 10.94)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [1541.95, 49.74, 1931.75, 79.47]; Region B: [1131.80, 26.19, 1521.61, 55.91]; Region C: [270.48, 0.00, 660.29, 29.73]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region C."
        }
    ]
}