{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {92} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative exponential correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Unemployment rate in the scatter plot?",
            "A": "The maximum observed value in the Unemployment rate dimension is {20.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Unemployment rate in the scatter plot?",
            "A": "The minimum observed value in the Unemployment rate dimension is {2.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Business confidence in the scatter plot?",
            "A": "The maximum observed value in the Business confidence dimension is {100.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Business confidence in the scatter plot?",
            "A": "The minimum observed value in the Business confidence dimension is {0.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Unemployment rate for all points?",
            "A": "The average value of Unemployment rate for all points is {11.00}."
        },
        {
            "Q": "What is the average value of the Business confidence for all points?",
            "A": "The average value of Business confidence for all points is {32.82}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Business confidence values corresponding to the top 3 Unemployment rate values in the scatter plot?",
            "A": "{11.91, 26.61, 29.15}."
        },
        {
            "Q": "What are the Business confidence values corresponding to the bottom 3 Unemployment rate values in the scatter plot?",
            "A": "{95.72, 96.92, 100.00}."
        },
        {
            "Q": "What are the Unemployment rate values corresponding to the top 3 Business confidence values in the scatter plot?",
            "A": "{2.40, 2.20, 2.00}."
        },
        {
            "Q": "What are the Unemployment rate values corresponding to the bottom 3 Business confidence values in the scatter plot?",
            "A": "{19.01, 9.52, 10.51}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 2.76 and 8.05 and Y coordinates between 4.74 and 33.96?",
            "A": "There are {4} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(2.40, 100.00) and (19.01, 0.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(14.46, 20.12) and (14.66, 20.15)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [13.56, 15.12, 15.56, 25.15] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (14.46, 20.12)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [2.04, 3.36, 6.99, 24.90]; Region B: [12.08, 9.36, 17.04, 30.91]; Region C: [13.09, 33.22, 18.05, 54.77]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}