{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {76} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative linear correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Inflation rate in the scatter plot?",
            "A": "The maximum observed value in the Inflation rate dimension is {10.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Inflation rate in the scatter plot?",
            "A": "The minimum observed value in the Inflation rate dimension is {-2.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Investment rate in the scatter plot?",
            "A": "The maximum observed value in the Investment rate dimension is {50.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Investment rate in the scatter plot?",
            "A": "The minimum observed value in the Investment rate dimension is {5.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Inflation rate for all points?",
            "A": "The average value of Inflation rate for all points is {4.00}."
        },
        {
            "Q": "What is the average value of the Investment rate for all points?",
            "A": "The average value of Investment rate for all points is {28.13}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Investment rate values corresponding to the top 3 Inflation rate values in the scatter plot?",
            "A": "{9.23, 24.37, 13.63}."
        },
        {
            "Q": "What are the Investment rate values corresponding to the bottom 3 Inflation rate values in the scatter plot?",
            "A": "{42.82, 47.36, 50.00}."
        },
        {
            "Q": "What are the Inflation rate values corresponding to the top 3 Investment rate values in the scatter plot?",
            "A": "{-1.68, -1.84, -1.04}."
        },
        {
            "Q": "What are the Inflation rate values corresponding to the bottom 3 Investment rate values in the scatter plot?",
            "A": "{7.92, 10.00, 9.04}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 3.55 and 6.86 and Y coordinates between 35.53 and 41.88?",
            "A": "There are {1} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(-1.68, 50.00) and (7.92, 5.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(2.96, 32.94) and (3.28, 32.87)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [2.36, 30.62, 3.88, 35.19] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (2.96, 32.94)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [2.17, 9.57, 5.23, 21.43]; Region B: [6.26, 7.40, 9.32, 19.26]; Region C: [1.59, 26.97, 4.65, 38.84]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region C."
        }
    ]
}