{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {45} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative linear correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Blood pressure in the scatter plot?",
            "A": "The maximum observed value in the Blood pressure dimension is {180.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Blood pressure in the scatter plot?",
            "A": "The minimum observed value in the Blood pressure dimension is {80.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Patient satisfaction in the scatter plot?",
            "A": "The maximum observed value in the Patient satisfaction dimension is {5.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Patient satisfaction in the scatter plot?",
            "A": "The minimum observed value in the Patient satisfaction dimension is {1.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Blood pressure for all points?",
            "A": "The average value of Blood pressure for all points is {130.00}."
        },
        {
            "Q": "What is the average value of the Patient satisfaction for all points?",
            "A": "The average value of Patient satisfaction for all points is {2.70}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Patient satisfaction values corresponding to the top 3 Blood pressure values in the scatter plot?",
            "A": "{2.58, 2.30, 2.18}."
        },
        {
            "Q": "What are the Patient satisfaction values corresponding to the bottom 3 Blood pressure values in the scatter plot?",
            "A": "{5.00, 2.13, 1.93}."
        },
        {
            "Q": "What are the Blood pressure values corresponding to the top 3 Patient satisfaction values in the scatter plot?",
            "A": "{80.00, 109.55, 89.09}."
        },
        {
            "Q": "What are the Blood pressure values corresponding to the bottom 3 Patient satisfaction values in the scatter plot?",
            "A": "{152.73, 170.91, 155.00}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 148.24 and 161.15 and Y coordinates between 3.00 and 3.86?",
            "A": "There are {0} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(80.00, 5.00) and (180.00, 2.58)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(95.91, 2.34) and (98.18, 2.41)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [90.91, 2.14, 103.18, 2.61] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (95.91, 2.34)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [86.03, 1.76, 108.06, 2.99]; Region B: [131.52, 2.06, 153.55, 3.29]; Region C: [91.12, 3.03, 113.16, 4.25]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region A."
        }
    ]
}