{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {85} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {no correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Employee training hours in the scatter plot?",
            "A": "The maximum observed value in the Employee training hours dimension is {50.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Employee training hours in the scatter plot?",
            "A": "The minimum observed value in the Employee training hours dimension is {1.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Job satisfaction in the scatter plot?",
            "A": "The maximum observed value in the Job satisfaction dimension is {5.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Job satisfaction in the scatter plot?",
            "A": "The minimum observed value in the Job satisfaction dimension is {1.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Employee training hours for all points?",
            "A": "The average value of Employee training hours for all points is {25.50}."
        },
        {
            "Q": "What is the average value of the Job satisfaction for all points?",
            "A": "The average value of Job satisfaction for all points is {3.13}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Job satisfaction values corresponding to the top 3 Employee training hours values in the scatter plot?",
            "A": "{1.97, 3.46, 2.03}."
        },
        {
            "Q": "What are the Job satisfaction values corresponding to the bottom 3 Employee training hours values in the scatter plot?",
            "A": "{2.03, 4.11, 2.62}."
        },
        {
            "Q": "What are the Employee training hours values corresponding to the top 3 Job satisfaction values in the scatter plot?",
            "A": "{5.08, 2.75, 46.50}."
        },
        {
            "Q": "What are the Employee training hours values corresponding to the bottom 3 Job satisfaction values in the scatter plot?",
            "A": "{36.58, 10.92, 28.42}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 14.75 and 26.68 and Y coordinates between 3.79 and 4.38?",
            "A": "There are {2} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(1.00, 2.03) and (50.00, 1.97)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(13.25, 3.53) and (13.83, 3.60)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [10.80, 3.33, 16.28, 3.80] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (13.25, 3.53)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [7.02, 3.16, 20.06, 3.97]; Region B: [24.21, 3.64, 37.26, 4.45]; Region C: [7.90, 1.32, 20.95, 2.13]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region A."
        }
    ]
}