{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {80} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative exponential correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Team size in the scatter plot?",
            "A": "The maximum observed value in the Team size dimension is {20.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Team size in the scatter plot?",
            "A": "The minimum observed value in the Team size dimension is {2.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Employee retention in the scatter plot?",
            "A": "The maximum observed value in the Employee retention dimension is {95.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Employee retention in the scatter plot?",
            "A": "The minimum observed value in the Employee retention dimension is {50.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Team size for all points?",
            "A": "The average value of Team size for all points is {11.00}."
        },
        {
            "Q": "What is the average value of the Employee retention for all points?",
            "A": "The average value of Employee retention for all points is {62.59}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Employee retention values corresponding to the top 3 Team size values in the scatter plot?",
            "A": "{53.94, 58.97, 53.94}."
        },
        {
            "Q": "What are the Employee retention values corresponding to the bottom 3 Team size values in the scatter plot?",
            "A": "{95.00, 94.22, 88.29}."
        },
        {
            "Q": "What are the Team size values corresponding to the top 3 Employee retention values in the scatter plot?",
            "A": "{2.00, 2.23, 2.46}."
        },
        {
            "Q": "What are the Team size values corresponding to the bottom 3 Employee retention values in the scatter plot?",
            "A": "{18.63, 10.43, 17.95}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 10.42 and 13.57 and Y coordinates between 64.16 and 69.98?",
            "A": "There are {2} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(2.00, 95.00) and (18.63, 50.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(7.47, 59.40) and (7.70, 59.32)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [6.57, 57.07, 8.60, 61.65] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (7.47, 59.40)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [12.51, 50.89, 18.21, 60.82]; Region B: [4.73, 54.40, 10.44, 64.32]; Region C: [10.47, 63.36, 16.17, 73.29]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}