{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {98} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {no correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Website traffic in the scatter plot?",
            "A": "The maximum observed value in the Website traffic dimension is {10000000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Website traffic in the scatter plot?",
            "A": "The minimum observed value in the Website traffic dimension is {1000.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Customer lifetime value in the scatter plot?",
            "A": "The maximum observed value in the Customer lifetime value dimension is {5000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Customer lifetime value in the scatter plot?",
            "A": "The minimum observed value in the Customer lifetime value dimension is {50.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Website traffic for all points?",
            "A": "The average value of Website traffic for all points is {5000500.00}."
        },
        {
            "Q": "What is the average value of the Customer lifetime value for all points?",
            "A": "The average value of Customer lifetime value for all points is {2698.17}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Customer lifetime value values corresponding to the top 3 Website traffic values in the scatter plot?",
            "A": "{3208.92, 2777.09, 2791.83}."
        },
        {
            "Q": "What are the Customer lifetime value values corresponding to the bottom 3 Website traffic values in the scatter plot?",
            "A": "{2096.72, 3445.23, 2138.58}."
        },
        {
            "Q": "What are the Website traffic values corresponding to the top 3 Customer lifetime value values in the scatter plot?",
            "A": "{6495195.88, 4124298.97, 1031824.74}."
        },
        {
            "Q": "What are the Website traffic values corresponding to the bottom 3 Customer lifetime value values in the scatter plot?",
            "A": "{5567453.61, 3093474.23, 2578061.86}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 2958633.89 and 4671023.29 and Y coordinates between 718.64 and 1782.72?",
            "A": "There are {1} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(1000.00, 2096.72) and (10000000.00, 3208.92)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(3608886.60, 2520.23) and (3711969.07, 2558.29)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [3108936.60, 2272.73, 4211919.07, 2805.79] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (3608886.60, 2520.23)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [845564.42, 817.73, 3525270.19, 1762.88]; Region B: [2320574.95, 2066.68, 5000280.72, 3011.84]; Region C: [3383372.02, 3384.04, 6063077.79, 4329.20]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}