{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {95} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative exponential correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Customer acquisition cost in the scatter plot?",
            "A": "The maximum observed value in the Customer acquisition cost dimension is {500.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Customer acquisition cost in the scatter plot?",
            "A": "The minimum observed value in the Customer acquisition cost dimension is {10.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Bounce rate in the scatter plot?",
            "A": "The maximum observed value in the Bounce rate dimension is {80.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Bounce rate in the scatter plot?",
            "A": "The minimum observed value in the Bounce rate dimension is {10.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Customer acquisition cost for all points?",
            "A": "The average value of Customer acquisition cost for all points is {255.00}."
        },
        {
            "Q": "What is the average value of the Bounce rate for all points?",
            "A": "The average value of Bounce rate for all points is {27.86}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Bounce rate values corresponding to the top 3 Customer acquisition cost values in the scatter plot?",
            "A": "{15.88, 20.87, 17.29}."
        },
        {
            "Q": "What are the Bounce rate values corresponding to the bottom 3 Customer acquisition cost values in the scatter plot?",
            "A": "{80.00, 77.38, 64.18}."
        },
        {
            "Q": "What are the Customer acquisition cost values corresponding to the top 3 Bounce rate values in the scatter plot?",
            "A": "{10.00, 15.21, 20.43}."
        },
        {
            "Q": "What are the Customer acquisition cost values corresponding to the bottom 3 Bounce rate values in the scatter plot?",
            "A": "{468.72, 380.11, 296.70}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 436.93 and 490.79 and Y coordinates between 59.49 and 76.27?",
            "A": "There are {0} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(10.00, 80.00) and (500.00, 15.88)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(364.47, 19.87) and (369.68, 19.89)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [339.97, 16.37, 394.18, 23.39] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (364.47, 19.87)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [75.74, 19.08, 198.41, 34.26]; Region B: [21.87, 45.36, 144.54, 60.53]; Region C: [305.74, 12.29, 428.41, 27.47]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region C."
        }
    ]
}