{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {58} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a positive u shape correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Irrigation amount in the scatter plot?",
            "A": "The maximum observed value in the Irrigation amount dimension is {2000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Irrigation amount in the scatter plot?",
            "A": "The minimum observed value in the Irrigation amount dimension is {100.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Livestock health in the scatter plot?",
            "A": "The maximum observed value in the Livestock health dimension is {5.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Livestock health in the scatter plot?",
            "A": "The minimum observed value in the Livestock health dimension is {1.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Irrigation amount for all points?",
            "A": "The average value of Irrigation amount for all points is {1050.00}."
        },
        {
            "Q": "What is the average value of the Livestock health for all points?",
            "A": "The average value of Livestock health for all points is {2.49}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Livestock health values corresponding to the top 3 Irrigation amount values in the scatter plot?",
            "A": "{5.00, 4.74, 4.42}."
        },
        {
            "Q": "What are the Livestock health values corresponding to the bottom 3 Irrigation amount values in the scatter plot?",
            "A": "{4.84, 4.85, 4.19}."
        },
        {
            "Q": "What are the Irrigation amount values corresponding to the top 3 Livestock health values in the scatter plot?",
            "A": "{2000.00, 133.33, 100.00}."
        },
        {
            "Q": "What are the Irrigation amount values corresponding to the bottom 3 Livestock health values in the scatter plot?",
            "A": "{1133.33, 800.00, 933.33}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 1391.80 and 1625.20 and Y coordinates between 2.08 and 3.14?",
            "A": "There are {4} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(100.00, 4.84) and (2000.00, 5.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(1200.00, 1.26) and (1233.33, 1.25)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [1105.00, 1.05, 1328.33, 1.46] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (1200.00, 1.26)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [954.30, 1.00, 1479.03, 1.93]; Region B: [1229.26, 2.39, 1753.99, 3.32]; Region C: [125.15, 2.94, 649.88, 3.88]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region A."
        }
    ]
}