{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {86} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {no correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Store size in the scatter plot?",
            "A": "The maximum observed value in the Store size dimension is {10000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Store size in the scatter plot?",
            "A": "The minimum observed value in the Store size dimension is {100.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Foot traffic in the scatter plot?",
            "A": "The maximum observed value in the Foot traffic dimension is {100000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Foot traffic in the scatter plot?",
            "A": "The minimum observed value in the Foot traffic dimension is {100.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Store size for all points?",
            "A": "The average value of Store size for all points is {5050.00}."
        },
        {
            "Q": "What is the average value of the Foot traffic for all points?",
            "A": "The average value of Foot traffic for all points is {40938.82}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Foot traffic values corresponding to the top 3 Store size values in the scatter plot?",
            "A": "{31738.89, 9813.13, 57230.22}."
        },
        {
            "Q": "What are the Foot traffic values corresponding to the bottom 3 Store size values in the scatter plot?",
            "A": "{68746.04, 58683.71, 39309.27}."
        },
        {
            "Q": "What are the Store size values corresponding to the top 3 Foot traffic values in the scatter plot?",
            "A": "{449.41, 9534.12, 3128.24}."
        },
        {
            "Q": "What are the Store size values corresponding to the bottom 3 Foot traffic values in the scatter plot?",
            "A": "{2895.29, 7903.53, 6971.76}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 3076.20 and 4398.61 and Y coordinates between 32824.07 and 47443.70?",
            "A": "There are {1} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(449.41, 100000.00) and (2895.29, 100.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(9068.24, 65493.03) and (9184.71, 65314.61)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [8573.24, 60319.61, 9679.71, 70488.03] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (9068.24, 65493.03)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [3033.98, 60393.44, 5784.34, 83203.18]; Region B: [4767.26, 9922.90, 7517.62, 32732.64]; Region C: [7249.64, 53998.95, 10000.00, 76808.69]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region C."
        }
    ]
}