{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {77} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a positive exponential correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Household income in the scatter plot?",
            "A": "The maximum observed value in the Household income dimension is {200000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Household income in the scatter plot?",
            "A": "The minimum observed value in the Household income dimension is {20000.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Literacy rate in the scatter plot?",
            "A": "The maximum observed value in the Literacy rate dimension is {100.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Literacy rate in the scatter plot?",
            "A": "The minimum observed value in the Literacy rate dimension is {70.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Household income for all points?",
            "A": "The average value of Household income for all points is {110000.00}."
        },
        {
            "Q": "What is the average value of the Literacy rate for all points?",
            "A": "The average value of Literacy rate for all points is {85.81}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Literacy rate values corresponding to the top 3 Household income values in the scatter plot?",
            "A": "{100.00, 92.87, 94.41}."
        },
        {
            "Q": "What are the Literacy rate values corresponding to the bottom 3 Household income values in the scatter plot?",
            "A": "{77.86, 78.98, 72.60}."
        },
        {
            "Q": "What are the Household income values corresponding to the top 3 Literacy rate values in the scatter plot?",
            "A": "{200000.00, 176315.79, 169210.53}."
        },
        {
            "Q": "What are the Household income values corresponding to the bottom 3 Literacy rate values in the scatter plot?",
            "A": "{27105.26, 24736.84, 48421.05}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 81845.57 and 105804.48 and Y coordinates between 87.60 and 92.44?",
            "A": "There are {3} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(20000.00, 77.86) and (200000.00, 100.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(140789.47, 90.24) and (143157.89, 90.17)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [131789.47, 88.67, 152157.89, 91.74] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (140789.47, 90.24)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [114674.81, 86.88, 169272.55, 93.53]; Region B: [45495.63, 72.80, 100093.37, 79.44]; Region C: [143764.09, 80.01, 198361.82, 86.66]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region A."
        }
    ]
}