{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {90} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative u shape correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Customer reviews count in the scatter plot?",
            "A": "The maximum observed value in the Customer reviews count dimension is {10000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Customer reviews count in the scatter plot?",
            "A": "The minimum observed value in the Customer reviews count dimension is {1.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Sales volume in the scatter plot?",
            "A": "The maximum observed value in the Sales volume dimension is {1000000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Sales volume in the scatter plot?",
            "A": "The minimum observed value in the Sales volume dimension is {100.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Customer reviews count for all points?",
            "A": "The average value of Customer reviews count for all points is {5000.50}."
        },
        {
            "Q": "What is the average value of the Sales volume for all points?",
            "A": "The average value of Sales volume for all points is {611093.92}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Sales volume values corresponding to the top 3 Customer reviews count values in the scatter plot?",
            "A": "{100.00, 126790.81, 137803.66}."
        },
        {
            "Q": "What are the Sales volume values corresponding to the bottom 3 Customer reviews count values in the scatter plot?",
            "A": "{64241.13, 199472.44, 1322.60}."
        },
        {
            "Q": "What are the Customer reviews count values corresponding to the top 3 Sales volume values in the scatter plot?",
            "A": "{5281.37, 6067.81, 3933.19}."
        },
        {
            "Q": "What are the Customer reviews count values corresponding to the bottom 3 Sales volume values in the scatter plot?",
            "A": "{10000.00, 225.70, 1.00}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 5340.19 and 6591.82 and Y coordinates between 837404.19 and 981944.58?",
            "A": "There are {8} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(5281.37, 1000000.00) and (10000.00, 100.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(2809.71, 797132.54) and (4270.24, 797141.85)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [2079.45, 747137.54, 5000.50, 847136.85] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (2809.71, 797132.54)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [597.65, 359577.68, 2786.47, 622799.64]; Region B: [2445.57, 665526.21, 4634.38, 928748.18]; Region C: [7543.13, 578639.34, 9731.95, 841861.31]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}