{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {67} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {no correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Parental education in the scatter plot?",
            "A": "The maximum observed value in the Parental education dimension is {20.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Parental education in the scatter plot?",
            "A": "The minimum observed value in the Parental education dimension is {0.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Test scores in the scatter plot?",
            "A": "The maximum observed value in the Test scores dimension is {1600.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Test scores in the scatter plot?",
            "A": "The minimum observed value in the Test scores dimension is {400.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Parental education for all points?",
            "A": "The average value of Parental education for all points is {10.00}."
        },
        {
            "Q": "What is the average value of the Test scores for all points?",
            "A": "The average value of Test scores for all points is {1031.47}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Test scores values corresponding to the top 3 Parental education values in the scatter plot?",
            "A": "{1566.98, 1497.40, 1322.35}."
        },
        {
            "Q": "What are the Test scores values corresponding to the bottom 3 Parental education values in the scatter plot?",
            "A": "{852.71, 907.93, 1226.44}."
        },
        {
            "Q": "What are the Parental education values corresponding to the top 3 Test scores values in the scatter plot?",
            "A": "{19.09, 20.00, 11.52}."
        },
        {
            "Q": "What are the Parental education values corresponding to the bottom 3 Test scores values in the scatter plot?",
            "A": "{13.94, 15.15, 13.03}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 5.25 and 8.93 and Y coordinates between 1105.95 and 1325.85?",
            "A": "There are {4} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(13.94, 400.00) and (19.09, 1600.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(17.88, 1303.75) and (18.48, 1304.34)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [16.88, 1243.75, 19.48, 1364.34] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (17.88, 1303.75)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [8.83, 532.29, 14.23, 778.56]; Region B: [4.10, 1225.66, 9.49, 1471.93]; Region C: [14.60, 1180.91, 20.00, 1427.18]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region C."
        }
    ]
}