{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {83} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a positive linear correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Nutrition intake in the scatter plot?",
            "A": "The maximum observed value in the Nutrition intake dimension is {5000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Nutrition intake in the scatter plot?",
            "A": "The minimum observed value in the Nutrition intake dimension is {1000.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Performance score in the scatter plot?",
            "A": "The maximum observed value in the Performance score dimension is {100.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Performance score in the scatter plot?",
            "A": "The minimum observed value in the Performance score dimension is {0.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Nutrition intake for all points?",
            "A": "The average value of Nutrition intake for all points is {3000.00}."
        },
        {
            "Q": "What is the average value of the Performance score for all points?",
            "A": "The average value of Performance score for all points is {47.64}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Performance score values corresponding to the top 3 Nutrition intake values in the scatter plot?",
            "A": "{89.38, 100.00, 61.01}."
        },
        {
            "Q": "What are the Performance score values corresponding to the bottom 3 Nutrition intake values in the scatter plot?",
            "A": "{15.20, 23.27, 34.77}."
        },
        {
            "Q": "What are the Nutrition intake values corresponding to the top 3 Performance score values in the scatter plot?",
            "A": "{4951.22, 5000.00, 4024.39}."
        },
        {
            "Q": "What are the Nutrition intake values corresponding to the bottom 3 Performance score values in the scatter plot?",
            "A": "{1146.34, 1439.02, 1000.00}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 3492.40 and 4484.56 and Y coordinates between 2.49 and 30.73?",
            "A": "There are {0} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(1000.00, 15.20) and (5000.00, 89.38)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(2902.44, 46.57) and (2951.22, 46.75)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [2702.44, 41.57, 3151.22, 51.75] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (2902.44, 46.57)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [2441.16, 36.25, 3412.50, 57.07]; Region B: [4010.60, 50.89, 4981.94, 71.71]; Region C: [2725.94, 11.46, 3697.29, 32.28]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region A."
        }
    ]
}