{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {94} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a positive u shape correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Internet speed in the scatter plot?",
            "A": "The maximum observed value in the Internet speed dimension is {1000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Internet speed in the scatter plot?",
            "A": "The minimum observed value in the Internet speed dimension is {10.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension E-commerce sales in the scatter plot?",
            "A": "The maximum observed value in the E-commerce sales dimension is {1000000000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension E-commerce sales in the scatter plot?",
            "A": "The minimum observed value in the E-commerce sales dimension is {10000.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Internet speed for all points?",
            "A": "The average value of Internet speed for all points is {505.00}."
        },
        {
            "Q": "What is the average value of the E-commerce sales for all points?",
            "A": "The average value of E-commerce sales for all points is {397145908.34}."
        }
    ],
    "NF": [
        {
            "Q": "What are the E-commerce sales values corresponding to the top 3 Internet speed values in the scatter plot?",
            "A": "{1000000000.00, 920469178.16, 996161072.98}."
        },
        {
            "Q": "What are the E-commerce sales values corresponding to the bottom 3 Internet speed values in the scatter plot?",
            "A": "{947683239.37, 988592910.12, 905035217.47}."
        },
        {
            "Q": "What are the Internet speed values corresponding to the top 3 E-commerce sales values in the scatter plot?",
            "A": "{1000.00, 978.71, 20.65}."
        },
        {
            "Q": "What are the Internet speed values corresponding to the bottom 3 E-commerce sales values in the scatter plot?",
            "A": "{531.61, 574.19, 457.10}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 697.21 and 847.82 and Y coordinates between 209778345.27 and 350022303.84?",
            "A": "There are {7} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(531.61, 10000.00) and (1000.00, 1000000000.00)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(393.23, 186561423.57) and (627.42, 186517088.79)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [276.14, 136517588.79, 744.51, 236560923.57] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (393.23, 186561423.57)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [709.73, 208993925.21, 932.54, 465519913.53]; Region B: [31.76, 158478797.62, 254.57, 415004785.94]; Region C: [393.23, 58276262.02, 627.42, 314802250.34]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region C."
        }
    ]
}