{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {scatter} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many points are in this scatter plot?",
            "A": "There are {43} points."
        }
    ],
    "SRP": [],
    "VPR": [
        {
            "Q": "What pattern does the correlation in the scatter plot show?",
            "A": "The scatter plot shows {a negative exponential correlation}."
        }
    ],
    "VE": [],
    "EVJ": [
        {
            "Q": "What is the maximum observed value in dimension Traffic volume in the scatter plot?",
            "A": "The maximum observed value in the Traffic volume dimension is {100000.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Traffic volume in the scatter plot?",
            "A": "The minimum observed value in the Traffic volume dimension is {1000.00}."
        },
        {
            "Q": "What is the maximum observed value in dimension Transport efficiency in the scatter plot?",
            "A": "The maximum observed value in the Transport efficiency dimension is {95.00}."
        },
        {
            "Q": "What is the minimum observed value in dimension Transport efficiency in the scatter plot?",
            "A": "The minimum observed value in the Transport efficiency dimension is {50.00}."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Traffic volume for all points?",
            "A": "The average value of Traffic volume for all points is {50500.00}."
        },
        {
            "Q": "What is the average value of the Transport efficiency for all points?",
            "A": "The average value of Transport efficiency for all points is {63.18}."
        }
    ],
    "NF": [
        {
            "Q": "What are the Transport efficiency values corresponding to the top 3 Traffic volume values in the scatter plot?",
            "A": "{53.30, 53.39, 58.36}."
        },
        {
            "Q": "What are the Transport efficiency values corresponding to the bottom 3 Traffic volume values in the scatter plot?",
            "A": "{95.00, 84.48, 91.74}."
        },
        {
            "Q": "What are the Traffic volume values corresponding to the top 3 Transport efficiency values in the scatter plot?",
            "A": "{1000.00, 5714.29, 3357.14}."
        },
        {
            "Q": "What are the Traffic volume values corresponding to the bottom 3 Transport efficiency values in the scatter plot?",
            "A": "{43428.57, 52857.14, 64642.86}."
        }
    ],
    "NC": [],
    "MSR": [
        {
            "Q": "How many points in the scatter plot have X coordinates between 30410.98 and 53550.35 and Y coordinates between 68.86 and 74.60?",
            "A": "There are {1} points."
        },
        {
            "Q": "What are the coordinates of the pair of points that are farthest from each other in terms of Euclidean distance?",
            "A": "The pair of points with the largest Euclidean distance has coordinates {(1000.00, 95.00) and (100000.00, 53.30)}."
        },
        {
            "Q": "What are the coordinates of the pair of points that are closest to each other in terms of Euclidean distance?",
            "A": "The pair of points with the smallest Euclidean distance has coordinates {(97642.86, 53.39) and (100000.00, 53.30)}."
        }
    ],
    "VA": [
        {
            "Q": "To reduce visual occlusion caused by overlapping points in the region [92692.86, 51.05, 104950.00, 55.64] (i.e. bounding coordinates [x1, y1, x2, y2]), list the coordinates of the top 1 points that are recommended for removal.",
            "A": "The coordinates of the top 1 points recommended for removal are: (97642.86, 53.39)."
        },
        {
            "Q": "The scatter plot contains three regions (bounding coordinates [x1, y1, x2, y2]) : Region A: [37929.90, 59.80, 68824.22, 69.67]; Region B: [69105.68, 50.00, 100000.00, 59.87]; Region C: [6976.68, 59.19, 37871.00, 69.06]. Based on point density and clustering tendency, select the most likely region that contains clusters.",
            "A": "The most likely to contain clusters is region B."
        }
    ]
}