{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {15} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Size of the customer base of 10399.74 relative to the bubble with a Size of the customer base of 46253.62 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Size of the customer base of 10399.74 is {below} and to the {left} of the bubble with a Size of the customer base of 46253.62."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Investment amount and ROI?",
            "A": "The highest concentration of bubbles corresponds to approximately {487718.83} $ and {344.98} %."
        }
    ],
    "VE": [
        {
            "Q": "What is the Size of the customer base of the largest bubble?",
            "A": "The Size of the customer base of the largest bubble is {1000000.00} count."
        },
        {
            "Q": "What is the Size of the customer base of the smallest bubble?",
            "A": "The Size of the customer base of the smallest bubble is {100.00} count."
        },
        {
            "Q": "What are the Investment amount and ROI values of the largest bubble?",
            "A": "The Investment amount of the largest bubble is {458356.49} $, and {ROI} is {312.22} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Size of the customer base in the bubble chart?",
            "A": "The global maximum Size of the customer base is {1000000.00} count."
        },
        {
            "Q": "What is the global minimum Size of the customer base in the bubble chart?",
            "A": "The global minimum Size of the customer base is {100.00} count."
        },
        {
            "Q": "What is the maximum observed value in dimension Investment amount in the bubble chart?",
            "A": "The maximum observed value in the Investment amount dimension is {1004923.79} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Investment amount in the bubble chart?",
            "A": "The minimum observed value in the Investment amount dimension is {1000.00} $."
        },
        {
            "Q": "What is the maximum observed value in dimension ROI in the bubble chart?",
            "A": "The maximum observed value in the ROI dimension is {479.30} %."
        },
        {
            "Q": "What is the minimum observed value in dimension ROI in the bubble chart?",
            "A": "The minimum observed value in the ROI dimension is {39.60} %."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Size of the customer base for all bubbles?",
            "A": "The average value of the Size of the customer base for all bubbles is {200158.79} count."
        },
        {
            "Q": "What is the average value of the Investment amount for all bubbles?",
            "A": "The average value of Investment amount for all bubbles is {480383.37} $."
        },
        {
            "Q": "What is the average value of the ROI for all bubbles?",
            "A": "The average value of ROI for all bubbles is {267.44} %."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Size of the customer base values in the bubble chart?",
            "A": "{1000000.00, 749680.63, 645118.21} count."
        },
        {
            "Q": "What are the bottom 3 Size of the customer base values in the bubble chart?",
            "A": "{100.00, 7396.71, 9769.65} count."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Size of the customer base value, the bubble with a Investment amount of 847100.3 $ and a ROI of 202.3 %, or the bubble with a Investment amount of 1004923.8 $ and a ROI of 280.2 %?",
            "A": "The bubble with a Investment amount of {847100.3} and a ROI of {202.3} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Size of the customer base value of the bubble with the largest ROI value?",
            "A": "The Size of the customer base value of the bubble with the largest ROI is {9769.65}."
        },
        {
            "Q": "What is the Size of the customer base value of the bubble with the largest Investment amount value?",
            "A": "The Size of the customer base value of the bubble with the largest Investment amount is {100.00}."
        },
        {
            "Q": "Classify bubbles with a ROI-coordinate greater than 243 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Size of the customer base for the high value group and the low value group?",
            "A": "The difference between the total Size of the customer base of the high-value and low-value groups is {24085.86}."
        }
    ],
    "VA": []
}