{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {11} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Number of students in class of 15.35 relative to the bubble with a Number of students in class of 5.00 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Number of students in class of 15.35 is {above} and to the {right} of the bubble with a Number of students in class of 5.00."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Study hours and Academic performance?",
            "A": "The highest concentration of bubbles corresponds to approximately {8.64} hours/week and {98.99} score."
        }
    ],
    "VE": [
        {
            "Q": "What is the Number of students in class of the largest bubble?",
            "A": "The Number of students in class of the largest bubble is {50.00} students."
        },
        {
            "Q": "What is the Number of students in class of the smallest bubble?",
            "A": "The Number of students in class of the smallest bubble is {5.00} students."
        },
        {
            "Q": "What are the Study hours and Academic performance values of the largest bubble?",
            "A": "The Study hours of the largest bubble is {9.28} hours/week, and {Academic performance} is {101.38} score."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number of students in class in the bubble chart?",
            "A": "The global maximum Number of students in class is {50.00} students."
        },
        {
            "Q": "What is the global minimum Number of students in class in the bubble chart?",
            "A": "The global minimum Number of students in class is {5.00} students."
        },
        {
            "Q": "What is the maximum observed value in dimension Study hours in the bubble chart?",
            "A": "The maximum observed value in the Study hours dimension is {34.90} hours/week."
        },
        {
            "Q": "What is the minimum observed value in dimension Study hours in the bubble chart?",
            "A": "The minimum observed value in the Study hours dimension is {8.15} hours/week."
        },
        {
            "Q": "What is the maximum observed value in dimension Academic performance in the bubble chart?",
            "A": "The maximum observed value in the Academic performance dimension is {102.62} score."
        },
        {
            "Q": "What is the minimum observed value in dimension Academic performance in the bubble chart?",
            "A": "The minimum observed value in the Academic performance dimension is {20.10} score."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Number of students in class for all bubbles?",
            "A": "The average value of the Number of students in class for all bubbles is {23.97} students."
        },
        {
            "Q": "What is the average value of the Study hours for all bubbles?",
            "A": "The average value of Study hours for all bubbles is {17.87} hours/week."
        },
        {
            "Q": "What is the average value of the Academic performance for all bubbles?",
            "A": "The average value of Academic performance for all bubbles is {74.52} score."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Number of students in class values in the bubble chart?",
            "A": "{50.00, 45.58, 33.60} students."
        },
        {
            "Q": "What are the bottom 3 Number of students in class values in the bubble chart?",
            "A": "{5.00, 8.59, 11.73} students."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Number of students in class value, the bubble with a Study hours of 14.2 hours/week and a Academic performance of 102.6 score, or the bubble with a Study hours of 17.6 hours/week and a Academic performance of 73.1 score?",
            "A": "The bubble with a Study hours of {14.2} and a Academic performance of {102.6} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Number of students in class value of the bubble with the largest Academic performance value?",
            "A": "The Number of students in class value of the bubble with the largest Academic performance is {19.45}."
        },
        {
            "Q": "What is the Number of students in class value of the bubble with the largest Study hours value?",
            "A": "The Number of students in class value of the bubble with the largest Study hours is {11.73}."
        },
        {
            "Q": "Classify bubbles with a Academic performance-coordinate greater than 47 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Number of students in class for the high value group and the low value group?",
            "A": "The difference between the total Number of students in class of the high-value and low-value groups is {224.68}."
        }
    ],
    "VA": []
}