{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {14} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Average energy consumption of 7086.16 relative to the bubble with a Average energy consumption of 5624.55 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Average energy consumption of 7086.16 is {above} and to the {left} of the bubble with a Average energy consumption of 5624.55."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Infrastructure age and Reliability rate?",
            "A": "The highest concentration of bubbles corresponds to approximately {17.77} years and {93.48} %."
        }
    ],
    "VE": [
        {
            "Q": "What is the Average energy consumption of the largest bubble?",
            "A": "The Average energy consumption of the largest bubble is {10000.00} kWh/month."
        },
        {
            "Q": "What is the Average energy consumption of the smallest bubble?",
            "A": "The Average energy consumption of the smallest bubble is {100.00} kWh/month."
        },
        {
            "Q": "What are the Infrastructure age and Reliability rate values of the largest bubble?",
            "A": "The Infrastructure age of the largest bubble is {39.29} years, and {Reliability rate} is {97.81} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Average energy consumption in the bubble chart?",
            "A": "The global maximum Average energy consumption is {10000.00} kWh/month."
        },
        {
            "Q": "What is the global minimum Average energy consumption in the bubble chart?",
            "A": "The global minimum Average energy consumption is {100.00} kWh/month."
        },
        {
            "Q": "What is the maximum observed value in dimension Infrastructure age in the bubble chart?",
            "A": "The maximum observed value in the Infrastructure age dimension is {45.44} years."
        },
        {
            "Q": "What is the minimum observed value in dimension Infrastructure age in the bubble chart?",
            "A": "The minimum observed value in the Infrastructure age dimension is {4.82} years."
        },
        {
            "Q": "What is the maximum observed value in dimension Reliability rate in the bubble chart?",
            "A": "The maximum observed value in the Reliability rate dimension is {99.95} %."
        },
        {
            "Q": "What is the minimum observed value in dimension Reliability rate in the bubble chart?",
            "A": "The minimum observed value in the Reliability rate dimension is {90.23} %."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Average energy consumption for all bubbles?",
            "A": "The average value of the Average energy consumption for all bubbles is {5151.31} kWh/month."
        },
        {
            "Q": "What is the average value of the Infrastructure age for all bubbles?",
            "A": "The average value of Infrastructure age for all bubbles is {24.39} years."
        },
        {
            "Q": "What is the average value of the Reliability rate for all bubbles?",
            "A": "The average value of Reliability rate for all bubbles is {95.44} %."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Average energy consumption values in the bubble chart?",
            "A": "{10000.00, 9354.18, 9026.26} kWh/month."
        },
        {
            "Q": "What are the bottom 3 Average energy consumption values in the bubble chart?",
            "A": "{100.00, 1826.66, 1852.56} kWh/month."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Average energy consumption value, the bubble with a Infrastructure age of 13.8 years and a Reliability rate of 99.0 %, or the bubble with a Infrastructure age of 17.8 years and a Reliability rate of 93.5 %?",
            "A": "The bubble with a Infrastructure age of {17.8} and a Reliability rate of {93.5} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Average energy consumption value of the bubble with the largest Reliability rate value?",
            "A": "The Average energy consumption value of the bubble with the largest Reliability rate is {3793.87}."
        },
        {
            "Q": "What is the Average energy consumption value of the bubble with the largest Infrastructure age value?",
            "A": "The Average energy consumption value of the bubble with the largest Infrastructure age is {1826.66}."
        },
        {
            "Q": "Classify bubbles with a Reliability rate-coordinate greater than 99 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Average energy consumption for the high value group and the low value group?",
            "A": "The difference between the total Average energy consumption of the high-value and low-value groups is {50358.31}."
        }
    ],
    "VA": []
}