{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {12} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Total number of utility customers of 718782.59 relative to the bubble with a Total number of utility customers of 31133.36 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Total number of utility customers of 718782.59 is {below} and to the {left} of the bubble with a Total number of utility customers of 31133.36."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Production capacity and Efficiency score?",
            "A": "The highest concentration of bubbles corresponds to approximately {676812.79} MW and {86.55} %."
        }
    ],
    "VE": [
        {
            "Q": "What is the Total number of utility customers of the largest bubble?",
            "A": "The Total number of utility customers of the largest bubble is {1000000.00} count."
        },
        {
            "Q": "What is the Total number of utility customers of the smallest bubble?",
            "A": "The Total number of utility customers of the smallest bubble is {1000.00} count."
        },
        {
            "Q": "What are the Production capacity and Efficiency score values of the largest bubble?",
            "A": "The Production capacity of the largest bubble is {607227.41} MW, and {Efficiency score} is {90.03} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Total number of utility customers in the bubble chart?",
            "A": "The global maximum Total number of utility customers is {1000000.00} count."
        },
        {
            "Q": "What is the global minimum Total number of utility customers in the bubble chart?",
            "A": "The global minimum Total number of utility customers is {1000.00} count."
        },
        {
            "Q": "What is the maximum observed value in dimension Production capacity in the bubble chart?",
            "A": "The maximum observed value in the Production capacity dimension is {995865.42} MW."
        },
        {
            "Q": "What is the minimum observed value in dimension Production capacity in the bubble chart?",
            "A": "The minimum observed value in the Production capacity dimension is {33801.59} MW."
        },
        {
            "Q": "What is the maximum observed value in dimension Efficiency score in the bubble chart?",
            "A": "The maximum observed value in the Efficiency score dimension is {94.59} %."
        },
        {
            "Q": "What is the minimum observed value in dimension Efficiency score in the bubble chart?",
            "A": "The minimum observed value in the Efficiency score dimension is {75.30} %."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Total number of utility customers for all bubbles?",
            "A": "The average value of the Total number of utility customers for all bubbles is {461891.33} count."
        },
        {
            "Q": "What is the average value of the Production capacity for all bubbles?",
            "A": "The average value of Production capacity for all bubbles is {591508.35} MW."
        },
        {
            "Q": "What is the average value of the Efficiency score for all bubbles?",
            "A": "The average value of Efficiency score for all bubbles is {85.91} %."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Total number of utility customers values in the bubble chart?",
            "A": "{1000000.00, 956610.71, 721010.81} count."
        },
        {
            "Q": "What are the bottom 3 Total number of utility customers values in the bubble chart?",
            "A": "{1000.00, 31133.36, 216561.61} count."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Total number of utility customers value, the bubble with a Production capacity of 551911.6 MW and a Efficiency score of 92.3 %, or the bubble with a Production capacity of 940631.9 MW and a Efficiency score of 94.6 %?",
            "A": "The bubble with a Production capacity of {940631.9} and a Efficiency score of {94.6} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Total number of utility customers value of the bubble with the largest Efficiency score value?",
            "A": "The Total number of utility customers value of the bubble with the largest Efficiency score is {410214.29}."
        },
        {
            "Q": "What is the Total number of utility customers value of the bubble with the largest Production capacity value?",
            "A": "The Total number of utility customers value of the bubble with the largest Production capacity is {281070.72}."
        },
        {
            "Q": "Classify bubbles with a Efficiency score-coordinate greater than 79 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Total number of utility customers for the high value group and the low value group?",
            "A": "The difference between the total Total number of utility customers of the high-value and low-value groups is {4980554.55}."
        }
    ],
    "VA": []
}