{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {13} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Total volume produced of 17500.00 relative to the bubble with a Total volume produced of 100000.00 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Total volume produced of 17500.00 is {above} and to the {left} of the bubble with a Total volume produced of 100000.00."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Fertilizer use and Profit per acre?",
            "A": "The highest concentration of bubbles corresponds to approximately {71.47} kg/acre and {307.89} $."
        }
    ],
    "VE": [
        {
            "Q": "What is the Total volume produced of the largest bubble?",
            "A": "The Total volume produced of the largest bubble is {100000.00} units/season."
        },
        {
            "Q": "What is the Total volume produced of the smallest bubble?",
            "A": "The Total volume produced of the smallest bubble is {1000.00} units/season."
        },
        {
            "Q": "What are the Fertilizer use and Profit per acre values of the largest bubble?",
            "A": "The Fertilizer use of the largest bubble is {97.45} kg/acre, and {Profit per acre} is {445.57} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Total volume produced in the bubble chart?",
            "A": "The global maximum Total volume produced is {100000.00} units/season."
        },
        {
            "Q": "What is the global minimum Total volume produced in the bubble chart?",
            "A": "The global minimum Total volume produced is {1000.00} units/season."
        },
        {
            "Q": "What is the maximum observed value in dimension Fertilizer use in the bubble chart?",
            "A": "The maximum observed value in the Fertilizer use dimension is {97.45} kg/acre."
        },
        {
            "Q": "What is the minimum observed value in dimension Fertilizer use in the bubble chart?",
            "A": "The minimum observed value in the Fertilizer use dimension is {10.00} kg/acre."
        },
        {
            "Q": "What is the maximum observed value in dimension Profit per acre in the bubble chart?",
            "A": "The maximum observed value in the Profit per acre dimension is {929.49} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Profit per acre in the bubble chart?",
            "A": "The minimum observed value in the Profit per acre dimension is {253.99} $."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Total volume produced for all bubbles?",
            "A": "The average value of the Total volume produced for all bubbles is {50500.00} units/season."
        },
        {
            "Q": "What is the average value of the Fertilizer use for all bubbles?",
            "A": "The average value of Fertilizer use for all bubbles is {58.39} kg/acre."
        },
        {
            "Q": "What is the average value of the Profit per acre for all bubbles?",
            "A": "The average value of Profit per acre for all bubbles is {502.70} $."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Total volume produced values in the bubble chart?",
            "A": "{100000.00, 91750.00, 83500.00} units/season."
        },
        {
            "Q": "What are the bottom 3 Total volume produced values in the bubble chart?",
            "A": "{1000.00, 9250.00, 17500.00} units/season."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Total volume produced value, the bubble with a Fertilizer use of 89.5 kg/acre and a Profit per acre of 929.5 $, or the bubble with a Fertilizer use of 71.6 kg/acre and a Profit per acre of 488.0 $?",
            "A": "The bubble with a Fertilizer use of {71.6} and a Profit per acre of {488.0} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Total volume produced value of the bubble with the largest Profit per acre value?",
            "A": "The Total volume produced value of the bubble with the largest Profit per acre is {50500.00}."
        },
        {
            "Q": "What is the Total volume produced value of the bubble with the largest Fertilizer use value?",
            "A": "The Total volume produced value of the bubble with the largest Fertilizer use is {100000.00}."
        },
        {
            "Q": "Classify bubbles with a Profit per acre-coordinate greater than 380 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Total volume produced for the high value group and the low value group?",
            "A": "The difference between the total Total volume produced of the high-value and low-value groups is {285500.00}."
        }
    ],
    "VA": []
}