{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {14} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Number of restaurant locations of 74.36 relative to the bubble with a Number of restaurant locations of 8.99 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Number of restaurant locations of 74.36 is {below} and to the {right} of the bubble with a Number of restaurant locations of 8.99."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Menu price and Sales volume?",
            "A": "The highest concentration of bubbles corresponds to approximately {26.94} $ and {2957.38} units/day."
        }
    ],
    "VE": [
        {
            "Q": "What is the Number of restaurant locations of the largest bubble?",
            "A": "The Number of restaurant locations of the largest bubble is {500.00} count."
        },
        {
            "Q": "What is the Number of restaurant locations of the smallest bubble?",
            "A": "The Number of restaurant locations of the smallest bubble is {1.00} count."
        },
        {
            "Q": "What are the Menu price and Sales volume values of the largest bubble?",
            "A": "The Menu price of the largest bubble is {32.92} $, and {Sales volume} is {5956.00} units/day."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number of restaurant locations in the bubble chart?",
            "A": "The global maximum Number of restaurant locations is {500.00} count."
        },
        {
            "Q": "What is the global minimum Number of restaurant locations in the bubble chart?",
            "A": "The global minimum Number of restaurant locations is {1.00} count."
        },
        {
            "Q": "What is the maximum observed value in dimension Menu price in the bubble chart?",
            "A": "The maximum observed value in the Menu price dimension is {48.66} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Menu price in the bubble chart?",
            "A": "The minimum observed value in the Menu price dimension is {8.89} $."
        },
        {
            "Q": "What is the maximum observed value in dimension Sales volume in the bubble chart?",
            "A": "The maximum observed value in the Sales volume dimension is {9245.01} units/day."
        },
        {
            "Q": "What is the minimum observed value in dimension Sales volume in the bubble chart?",
            "A": "The minimum observed value in the Sales volume dimension is {1330.93} units/day."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Number of restaurant locations for all bubbles?",
            "A": "The average value of the Number of restaurant locations for all bubbles is {105.58} count."
        },
        {
            "Q": "What is the average value of the Menu price for all bubbles?",
            "A": "The average value of Menu price for all bubbles is {32.63} $."
        },
        {
            "Q": "What is the average value of the Sales volume for all bubbles?",
            "A": "The average value of Sales volume for all bubbles is {4685.34} units/day."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Number of restaurant locations values in the bubble chart?",
            "A": "{500.00, 365.52, 130.79} count."
        },
        {
            "Q": "What are the bottom 3 Number of restaurant locations values in the bubble chart?",
            "A": "{1.00, 7.26, 7.60} count."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Number of restaurant locations value, the bubble with a Menu price of 27.8 $ and a Sales volume of 1539.5 units/day, or the bubble with a Menu price of 24.6 $ and a Sales volume of 9245.0 units/day?",
            "A": "The bubble with a Menu price of {24.6} and a Sales volume of {9245.0} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Number of restaurant locations value of the bubble with the largest Sales volume value?",
            "A": "The Number of restaurant locations value of the bubble with the largest Sales volume is {8.99}."
        },
        {
            "Q": "What is the Number of restaurant locations value of the bubble with the largest Menu price value?",
            "A": "The Number of restaurant locations value of the bubble with the largest Menu price is {365.52}."
        },
        {
            "Q": "Classify bubbles with a Sales volume-coordinate greater than 6204 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Number of restaurant locations for the high value group and the low value group?",
            "A": "The difference between the total Number of restaurant locations of the high-value and low-value groups is {515.07}."
        }
    ],
    "VA": []
}