{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {13} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Number of hospital stays of 30.00 relative to the bubble with a Number of hospital stays of 7.64 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Number of hospital stays of 30.00 is {above} and to the {right} of the bubble with a Number of hospital stays of 7.64."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Medical costs and Recovery rate?",
            "A": "The highest concentration of bubbles corresponds to approximately {91215.79} $ and {61.55} %."
        }
    ],
    "VE": [
        {
            "Q": "What is the Number of hospital stays of the largest bubble?",
            "A": "The Number of hospital stays of the largest bubble is {30.00} days/year."
        },
        {
            "Q": "What is the Number of hospital stays of the smallest bubble?",
            "A": "The Number of hospital stays of the smallest bubble is {0.10} days/year."
        },
        {
            "Q": "What are the Medical costs and Recovery rate values of the largest bubble?",
            "A": "The Medical costs of the largest bubble is {95221.27} $, and {Recovery rate} is {70.35} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number of hospital stays in the bubble chart?",
            "A": "The global maximum Number of hospital stays is {30.00} days/year."
        },
        {
            "Q": "What is the global minimum Number of hospital stays in the bubble chart?",
            "A": "The global minimum Number of hospital stays is {0.10} days/year."
        },
        {
            "Q": "What is the maximum observed value in dimension Medical costs in the bubble chart?",
            "A": "The maximum observed value in the Medical costs dimension is {96835.87} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Medical costs in the bubble chart?",
            "A": "The minimum observed value in the Medical costs dimension is {10964.42} $."
        },
        {
            "Q": "What is the maximum observed value in dimension Recovery rate in the bubble chart?",
            "A": "The maximum observed value in the Recovery rate dimension is {100.43} %."
        },
        {
            "Q": "What is the minimum observed value in dimension Recovery rate in the bubble chart?",
            "A": "The minimum observed value in the Recovery rate dimension is {57.61} %."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Number of hospital stays for all bubbles?",
            "A": "The average value of the Number of hospital stays for all bubbles is {9.84} days/year."
        },
        {
            "Q": "What is the average value of the Medical costs for all bubbles?",
            "A": "The average value of Medical costs for all bubbles is {58710.34} $."
        },
        {
            "Q": "What is the average value of the Recovery rate for all bubbles?",
            "A": "The average value of Recovery rate for all bubbles is {80.13} %."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Number of hospital stays values in the bubble chart?",
            "A": "{30.00, 25.57, 22.88} days/year."
        },
        {
            "Q": "What are the bottom 3 Number of hospital stays values in the bubble chart?",
            "A": "{0.10, 2.81, 3.13} days/year."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Number of hospital stays value, the bubble with a Medical costs of 93582.5 $ and a Recovery rate of 57.6 %, or the bubble with a Medical costs of 44040.8 $ and a Recovery rate of 76.9 %?",
            "A": "The bubble with a Medical costs of {44040.8} and a Recovery rate of {76.9} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Number of hospital stays value of the bubble with the largest Recovery rate value?",
            "A": "The Number of hospital stays value of the bubble with the largest Recovery rate is {4.49}."
        },
        {
            "Q": "What is the Number of hospital stays value of the bubble with the largest Medical costs value?",
            "A": "The Number of hospital stays value of the bubble with the largest Medical costs is {22.88}."
        },
        {
            "Q": "Classify bubbles with a Recovery rate-coordinate greater than 66 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Number of hospital stays for the high value group and the low value group?",
            "A": "The difference between the total Number of hospital stays of the high-value and low-value groups is {10.08}."
        }
    ],
    "VA": []
}