{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {10} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Size of the team of 28.63 relative to the bubble with a Size of the team of 50.00 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Size of the team of 28.63 is {above} and to the {left} of the bubble with a Size of the team of 50.00."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Years of experience and Salary?",
            "A": "The highest concentration of bubbles corresponds to approximately {20.13} years and {157674.75} $."
        }
    ],
    "VE": [
        {
            "Q": "What is the Size of the team of the largest bubble?",
            "A": "The Size of the team of the largest bubble is {50.00} count."
        },
        {
            "Q": "What is the Size of the team of the smallest bubble?",
            "A": "The Size of the team of the smallest bubble is {2.00} count."
        },
        {
            "Q": "What are the Years of experience and Salary values of the largest bubble?",
            "A": "The Years of experience of the largest bubble is {27.43} years, and {Salary} is {115667.40} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Size of the team in the bubble chart?",
            "A": "The global maximum Size of the team is {50.00} count."
        },
        {
            "Q": "What is the global minimum Size of the team in the bubble chart?",
            "A": "The global minimum Size of the team is {2.00} count."
        },
        {
            "Q": "What is the maximum observed value in dimension Years of experience in the bubble chart?",
            "A": "The maximum observed value in the Years of experience dimension is {27.43} years."
        },
        {
            "Q": "What is the minimum observed value in dimension Years of experience in the bubble chart?",
            "A": "The minimum observed value in the Years of experience dimension is {4.32} years."
        },
        {
            "Q": "What is the maximum observed value in dimension Salary in the bubble chart?",
            "A": "The maximum observed value in the Salary dimension is {190511.22} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Salary in the bubble chart?",
            "A": "The minimum observed value in the Salary dimension is {40128.01} $."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Size of the team for all bubbles?",
            "A": "The average value of the Size of the team for all bubbles is {25.12} count."
        },
        {
            "Q": "What is the average value of the Years of experience for all bubbles?",
            "A": "The average value of Years of experience for all bubbles is {13.50} years."
        },
        {
            "Q": "What is the average value of the Salary for all bubbles?",
            "A": "The average value of Salary for all bubbles is {121854.26} $."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Size of the team values in the bubble chart?",
            "A": "{50.00, 42.60, 30.54} count."
        },
        {
            "Q": "What are the bottom 3 Size of the team values in the bubble chart?",
            "A": "{2.00, 10.28, 14.70} count."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Size of the team value, the bubble with a Years of experience of 11.0 years and a Salary of 187042.2 $, or the bubble with a Years of experience of 27.4 years and a Salary of 115667.4 $?",
            "A": "The bubble with a Years of experience of {27.4} and a Salary of {115667.4} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Size of the team value of the bubble with the largest Salary value?",
            "A": "The Size of the team value of the bubble with the largest Salary is {28.79}."
        },
        {
            "Q": "What is the Size of the team value of the bubble with the largest Years of experience value?",
            "A": "The Size of the team value of the bubble with the largest Years of experience is {50.00}."
        },
        {
            "Q": "Classify bubbles with a Salary-coordinate greater than 60717 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Size of the team for the high value group and the low value group?",
            "A": "The difference between the total Size of the team of the high-value and low-value groups is {201.44}."
        }
    ],
    "VA": []
}