{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {12} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Number of employees of 10000.00 relative to the bubble with a Number of employees of 3928.44 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Number of employees of 10000.00 is {above} and to the {right} of the bubble with a Number of employees of 3928.44."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Training hours and Productivity index?",
            "A": "The highest concentration of bubbles corresponds to approximately {78.96} hours/year and {80.05} index."
        }
    ],
    "VE": [
        {
            "Q": "What is the Number of employees of the largest bubble?",
            "A": "The Number of employees of the largest bubble is {10000.00} count."
        },
        {
            "Q": "What is the Number of employees of the smallest bubble?",
            "A": "The Number of employees of the smallest bubble is {10.00} count."
        },
        {
            "Q": "What are the Training hours and Productivity index values of the largest bubble?",
            "A": "The Training hours of the largest bubble is {74.62} hours/year, and {Productivity index} is {103.38} index."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number of employees in the bubble chart?",
            "A": "The global maximum Number of employees is {10000.00} count."
        },
        {
            "Q": "What is the global minimum Number of employees in the bubble chart?",
            "A": "The global minimum Number of employees is {10.00} count."
        },
        {
            "Q": "What is the maximum observed value in dimension Training hours in the bubble chart?",
            "A": "The maximum observed value in the Training hours dimension is {91.61} hours/year."
        },
        {
            "Q": "What is the minimum observed value in dimension Training hours in the bubble chart?",
            "A": "The minimum observed value in the Training hours dimension is {7.81} hours/year."
        },
        {
            "Q": "What is the maximum observed value in dimension Productivity index in the bubble chart?",
            "A": "The maximum observed value in the Productivity index dimension is {155.00} index."
        },
        {
            "Q": "What is the minimum observed value in dimension Productivity index in the bubble chart?",
            "A": "The minimum observed value in the Productivity index dimension is {60.33} index."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Number of employees for all bubbles?",
            "A": "The average value of the Number of employees for all bubbles is {4882.47} count."
        },
        {
            "Q": "What is the average value of the Training hours for all bubbles?",
            "A": "The average value of Training hours for all bubbles is {53.02} hours/year."
        },
        {
            "Q": "What is the average value of the Productivity index for all bubbles?",
            "A": "The average value of Productivity index for all bubbles is {95.98} index."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Number of employees values in the bubble chart?",
            "A": "{10000.00, 8837.16, 7922.80} count."
        },
        {
            "Q": "What are the bottom 3 Number of employees values in the bubble chart?",
            "A": "{10.00, 735.39, 1904.11} count."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Number of employees value, the bubble with a Training hours of 79.0 hours/year and a Productivity index of 80.0 index, or the bubble with a Training hours of 83.2 hours/year and a Productivity index of 68.6 index?",
            "A": "The bubble with a Training hours of {79.0} and a Productivity index of {80.0} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Number of employees value of the bubble with the largest Productivity index value?",
            "A": "The Number of employees value of the bubble with the largest Productivity index is {8837.16}."
        },
        {
            "Q": "What is the Number of employees value of the bubble with the largest Training hours value?",
            "A": "The Number of employees value of the bubble with the largest Training hours is {10.00}."
        },
        {
            "Q": "Classify bubbles with a Productivity index-coordinate greater than 128 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Number of employees for the high value group and the low value group?",
            "A": "The difference between the total Number of employees of the high-value and low-value groups is {27907.34}."
        }
    ],
    "VA": []
}