{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {15} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Total project budget of 218359.87 relative to the bubble with a Total project budget of 2026109.81 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Total project budget of 218359.87 is {above} and to the {right} of the bubble with a Total project budget of 2026109.81."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Innovation score and Commercial success value?",
            "A": "The highest concentration of bubbles corresponds to approximately {2.43} score and {54368716.37} $."
        }
    ],
    "VE": [
        {
            "Q": "What is the Total project budget of the largest bubble?",
            "A": "The Total project budget of the largest bubble is {5000000.00} $."
        },
        {
            "Q": "What is the Total project budget of the smallest bubble?",
            "A": "The Total project budget of the smallest bubble is {50000.00} $."
        },
        {
            "Q": "What are the Innovation score and Commercial success value values of the largest bubble?",
            "A": "The Innovation score of the largest bubble is {8.89} score, and {Commercial success value} is {6584735.06} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Total project budget in the bubble chart?",
            "A": "The global maximum Total project budget is {5000000.00} $."
        },
        {
            "Q": "What is the global minimum Total project budget in the bubble chart?",
            "A": "The global minimum Total project budget is {50000.00} $."
        },
        {
            "Q": "What is the maximum observed value in dimension Innovation score in the bubble chart?",
            "A": "The maximum observed value in the Innovation score dimension is {9.54} score."
        },
        {
            "Q": "What is the minimum observed value in dimension Innovation score in the bubble chart?",
            "A": "The minimum observed value in the Innovation score dimension is {1.00} score."
        },
        {
            "Q": "What is the maximum observed value in dimension Commercial success value in the bubble chart?",
            "A": "The maximum observed value in the Commercial success value dimension is {89168409.54} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Commercial success value in the bubble chart?",
            "A": "The minimum observed value in the Commercial success value dimension is {10000.00} $."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Total project budget for all bubbles?",
            "A": "The average value of the Total project budget for all bubbles is {2220421.55} $."
        },
        {
            "Q": "What is the average value of the Innovation score for all bubbles?",
            "A": "The average value of Innovation score for all bubbles is {5.07} score."
        },
        {
            "Q": "What is the average value of the Commercial success value for all bubbles?",
            "A": "The average value of Commercial success value for all bubbles is {40599606.40} $."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Total project budget values in the bubble chart?",
            "A": "{5000000.00, 4700210.40, 4022505.84} $."
        },
        {
            "Q": "What are the bottom 3 Total project budget values in the bubble chart?",
            "A": "{50000.00, 218359.87, 543250.91} $."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Total project budget value, the bubble with a Innovation score of 3.1 score and a Commercial success value of 56186912.1 $, or the bubble with a Innovation score of 2.4 score and a Commercial success value of 54368716.4 $?",
            "A": "The bubble with a Innovation score of {2.4} and a Commercial success value of {54368716.4} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Total project budget value of the bubble with the largest Commercial success value value?",
            "A": "The Total project budget value of the bubble with the largest Commercial success value is {3867083.80}."
        },
        {
            "Q": "What is the Total project budget value of the bubble with the largest Innovation score value?",
            "A": "The Total project budget value of the bubble with the largest Innovation score is {2378034.16}."
        },
        {
            "Q": "Classify bubbles with a Commercial success value-coordinate greater than 14866684 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Total project budget for the high value group and the low value group?",
            "A": "The difference between the total Total project budget of the high-value and low-value groups is {16659096.33}."
        }
    ],
    "VA": []
}