{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {14} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Number of viewers of 2315384.62 relative to the bubble with a Number of viewers of 8463076.92 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Number of viewers of 2315384.62 is {above} and to the {left} of the bubble with a Number of viewers of 8463076.92."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Sponsorship amount and Revenue?",
            "A": "The highest concentration of bubbles corresponds to approximately {7498266.63} $ and {482453025.56} $."
        }
    ],
    "VE": [
        {
            "Q": "What is the Number of viewers of the largest bubble?",
            "A": "The Number of viewers of the largest bubble is {10000000.00} count."
        },
        {
            "Q": "What is the Number of viewers of the smallest bubble?",
            "A": "The Number of viewers of the smallest bubble is {10000.00} count."
        },
        {
            "Q": "What are the Sponsorship amount and Revenue values of the largest bubble?",
            "A": "The Sponsorship amount of the largest bubble is {2118480.49} $, and {Revenue} is {664432516.70} $."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Number of viewers in the bubble chart?",
            "A": "The global maximum Number of viewers is {10000000.00} count."
        },
        {
            "Q": "What is the global minimum Number of viewers in the bubble chart?",
            "A": "The global minimum Number of viewers is {10000.00} count."
        },
        {
            "Q": "What is the maximum observed value in dimension Sponsorship amount in the bubble chart?",
            "A": "The maximum observed value in the Sponsorship amount dimension is {10077214.58} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Sponsorship amount in the bubble chart?",
            "A": "The minimum observed value in the Sponsorship amount dimension is {1292913.55} $."
        },
        {
            "Q": "What is the maximum observed value in dimension Revenue in the bubble chart?",
            "A": "The maximum observed value in the Revenue dimension is {1049950000.00} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Revenue in the bubble chart?",
            "A": "The minimum observed value in the Revenue dimension is {40827195.12} $."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Number of viewers for all bubbles?",
            "A": "The average value of the Number of viewers for all bubbles is {5005000.00} count."
        },
        {
            "Q": "What is the average value of the Sponsorship amount for all bubbles?",
            "A": "The average value of Sponsorship amount for all bubbles is {5553698.30} $."
        },
        {
            "Q": "What is the average value of the Revenue for all bubbles?",
            "A": "The average value of Revenue for all bubbles is {488410928.11} $."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Number of viewers values in the bubble chart?",
            "A": "{10000000.00, 9231538.46, 8463076.92} count."
        },
        {
            "Q": "What are the bottom 3 Number of viewers values in the bubble chart?",
            "A": "{10000.00, 778461.54, 1546923.08} count."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Number of viewers value, the bubble with a Sponsorship amount of 8784478.8 $ and a Revenue of 481618597.2 $, or the bubble with a Sponsorship amount of 1434399.2 $ and a Revenue of 361405577.8 $?",
            "A": "The bubble with a Sponsorship amount of {8784478.8} and a Revenue of {481618597.2} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Number of viewers value of the bubble with the largest Revenue value?",
            "A": "The Number of viewers value of the bubble with the largest Revenue is {3083846.15}."
        },
        {
            "Q": "What is the Number of viewers value of the bubble with the largest Sponsorship amount value?",
            "A": "The Number of viewers value of the bubble with the largest Sponsorship amount is {6926153.85}."
        },
        {
            "Q": "Classify bubbles with a Revenue-coordinate greater than 678875931 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Number of viewers for the high value group and the low value group?",
            "A": "The difference between the total Number of viewers of the high-value and low-value groups is {45419230.78}."
        }
    ],
    "VA": []
}