{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {13} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Total number of employees of 2617.59 relative to the bubble with a Total number of employees of 2032.17 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Total number of employees of 2617.59 is {above} and to the {right} of the bubble with a Total number of employees of 2032.17."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Company revenue and Profit margin?",
            "A": "The highest concentration of bubbles corresponds to approximately {791769287.86} $ and {56.09} %."
        }
    ],
    "VE": [
        {
            "Q": "What is the Total number of employees of the largest bubble?",
            "A": "The Total number of employees of the largest bubble is {10000.00} count."
        },
        {
            "Q": "What is the Total number of employees of the smallest bubble?",
            "A": "The Total number of employees of the smallest bubble is {10.00} count."
        },
        {
            "Q": "What are the Company revenue and Profit margin values of the largest bubble?",
            "A": "The Company revenue of the largest bubble is {869364870.90} $, and {Profit margin} is {42.84} %."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Total number of employees in the bubble chart?",
            "A": "The global maximum Total number of employees is {10000.00} count."
        },
        {
            "Q": "What is the global minimum Total number of employees in the bubble chart?",
            "A": "The global minimum Total number of employees is {10.00} count."
        },
        {
            "Q": "What is the maximum observed value in dimension Company revenue in the bubble chart?",
            "A": "The maximum observed value in the Company revenue dimension is {1004753867.31} $."
        },
        {
            "Q": "What is the minimum observed value in dimension Company revenue in the bubble chart?",
            "A": "The minimum observed value in the Company revenue dimension is {399840186.22} $."
        },
        {
            "Q": "What is the maximum observed value in dimension Profit margin in the bubble chart?",
            "A": "The maximum observed value in the Profit margin dimension is {57.49} %."
        },
        {
            "Q": "What is the minimum observed value in dimension Profit margin in the bubble chart?",
            "A": "The minimum observed value in the Profit margin dimension is {23.33} %."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Total number of employees for all bubbles?",
            "A": "The average value of the Total number of employees for all bubbles is {3591.65} count."
        },
        {
            "Q": "What is the average value of the Company revenue for all bubbles?",
            "A": "The average value of Company revenue for all bubbles is {699590117.48} $."
        },
        {
            "Q": "What is the average value of the Profit margin for all bubbles?",
            "A": "The average value of Profit margin for all bubbles is {41.69} %."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Total number of employees values in the bubble chart?",
            "A": "{10000.00, 6613.09, 5484.55} count."
        },
        {
            "Q": "What are the bottom 3 Total number of employees values in the bubble chart?",
            "A": "{10.00, 528.84, 845.43} count."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Total number of employees value, the bubble with a Company revenue of 809377141.0 $ and a Profit margin of 55.2 %, or the bubble with a Company revenue of 1004497492.3 $ and a Profit margin of 28.0 %?",
            "A": "The bubble with a Company revenue of {809377141.0} and a Profit margin of {55.2} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Total number of employees value of the bubble with the largest Profit margin value?",
            "A": "The Total number of employees value of the bubble with the largest Profit margin is {845.43}."
        },
        {
            "Q": "What is the Total number of employees value of the bubble with the largest Company revenue value?",
            "A": "The Total number of employees value of the bubble with the largest Company revenue is {845.43}."
        },
        {
            "Q": "Classify bubbles with a Profit margin-coordinate greater than 36 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Total number of employees for the high value group and the low value group?",
            "A": "The difference between the total Total number of employees of the high-value and low-value groups is {21789.41}."
        }
    ],
    "VA": []
}