{
    "CTR": [
        {
            "Q": "What type of chart is this?",
            "A": "This chart is a {bubble} chart."
        }
    ],
    "VEC": [
        {
            "Q": "How many bubbles are in this bubble chart?",
            "A": "There are {10} bubbles."
        }
    ],
    "SRP": [
        {
            "Q": "What is the relative position of the bubble with a Daily online booking volume of 265.70 relative to the bubble with a Daily online booking volume of 104.57 in terms of vertical (above/below) and horizontal (left/right) directions?",
            "A": "The bubble with a Daily online booking volume of 265.70 is {below} and to the {left} of the bubble with a Daily online booking volume of 104.57."
        }
    ],
    "VPR": [
        {
            "Q": "Where is the highest concentration of bubbles located in terms of Tourist reviews and Customer satisfaction?",
            "A": "The highest concentration of bubbles corresponds to approximately {2.21} rating and {3.09} rating."
        }
    ],
    "VE": [
        {
            "Q": "What is the Daily online booking volume of the largest bubble?",
            "A": "The Daily online booking volume of the largest bubble is {1000.00} count/day."
        },
        {
            "Q": "What is the Daily online booking volume of the smallest bubble?",
            "A": "The Daily online booking volume of the smallest bubble is {0.10} count/day."
        },
        {
            "Q": "What are the Tourist reviews and Customer satisfaction values of the largest bubble?",
            "A": "The Tourist reviews of the largest bubble is {2.46} rating, and {Customer satisfaction} is {1.69} rating."
        }
    ],
    "EVJ": [
        {
            "Q": "What is the global maximum Daily online booking volume in the bubble chart?",
            "A": "The global maximum Daily online booking volume is {1000.00} count/day."
        },
        {
            "Q": "What is the global minimum Daily online booking volume in the bubble chart?",
            "A": "The global minimum Daily online booking volume is {0.10} count/day."
        },
        {
            "Q": "What is the maximum observed value in dimension Tourist reviews in the bubble chart?",
            "A": "The maximum observed value in the Tourist reviews dimension is {4.54} rating."
        },
        {
            "Q": "What is the minimum observed value in dimension Tourist reviews in the bubble chart?",
            "A": "The minimum observed value in the Tourist reviews dimension is {1.00} rating."
        },
        {
            "Q": "What is the maximum observed value in dimension Customer satisfaction in the bubble chart?",
            "A": "The maximum observed value in the Customer satisfaction dimension is {4.66} rating."
        },
        {
            "Q": "What is the minimum observed value in dimension Customer satisfaction in the bubble chart?",
            "A": "The minimum observed value in the Customer satisfaction dimension is {1.10} rating."
        }
    ],
    "SC": [
        {
            "Q": "What is the average value of the Daily online booking volume for all bubbles?",
            "A": "The average value of the Daily online booking volume for all bubbles is {378.42} count/day."
        },
        {
            "Q": "What is the average value of the Tourist reviews for all bubbles?",
            "A": "The average value of Tourist reviews for all bubbles is {3.01} rating."
        },
        {
            "Q": "What is the average value of the Customer satisfaction for all bubbles?",
            "A": "The average value of Customer satisfaction for all bubbles is {2.89} rating."
        }
    ],
    "NF": [
        {
            "Q": "What are the top 3 Daily online booking volume values in the bubble chart?",
            "A": "{1000.00, 976.73, 643.11} count/day."
        },
        {
            "Q": "What are the bottom 3 Daily online booking volume values in the bubble chart?",
            "A": "{0.10, 53.98, 104.57} count/day."
        }
    ],
    "NC": [
        {
            "Q": "Which has a larger Daily online booking volume value, the bubble with a Tourist reviews of 4.4 rating and a Customer satisfaction of 4.7 rating, or the bubble with a Tourist reviews of 2.2 rating and a Customer satisfaction of 3.1 rating?",
            "A": "The bubble with a Tourist reviews of {4.4} and a Customer satisfaction of {4.7} is larger."
        }
    ],
    "MSR": [
        {
            "Q": "What is the Daily online booking volume value of the bubble with the largest Customer satisfaction value?",
            "A": "The Daily online booking volume value of the bubble with the largest Customer satisfaction is {643.11}."
        },
        {
            "Q": "What is the Daily online booking volume value of the bubble with the largest Tourist reviews value?",
            "A": "The Daily online booking volume value of the bubble with the largest Tourist reviews is {104.57}."
        },
        {
            "Q": "Classify bubbles with a Customer satisfaction-coordinate greater than 4 as 'high value group' and the rest as 'low value group'. What is the difference between the sum of Daily online booking volume for the high value group and the low value group?",
            "A": "The difference between the total Daily online booking volume of the high-value and low-value groups is {1483.07}."
        }
    ],
    "VA": []
}